{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "shyness",
            "id": 367
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "secret identity",
            "id": 1308
         },
         {
            "name": "radio",
            "id": 2135
         },
         {
            "name": "step daughter",
            "id": 4618
         },
         {
            "name": "music",
            "id": 6027
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "family secret",
            "id": 6625
         },
         {
            "name": "step father",
            "id": 6669
         },
         {
            "name": "rivalry",
            "id": 9823
         },
         {
            "name": "prom",
            "id": 10266
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "principal",
            "id": 12974
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "girl",
            "id": 14659
         },
         {
            "name": "popularity",
            "id": 15402
         },
         {
            "name": "music band",
            "id": 41591
         },
         {
            "name": "first love",
            "id": 157303
         },
         {
            "name": "theater",
            "id": 163110
         },
         {
            "name": "prom queen",
            "id": 166229
         },
         {
            "name": "boyband",
            "id": 180543
         },
         {
            "name": "dj",
            "id": 186117
         },
         {
            "name": "rebel hero",
            "id": 187022
         },
         {
            "name": "spartacus",
            "id": 192935
         },
         {
            "name": "extreme rules",
            "id": 202196
         },
         {
            "name": "radio dj",
            "id": 208930
         },
         {
            "name": "drama class",
            "id": 224548
         }
      ],
      "imdb_id": "tt2008633",
      "video": false,
      "title": "Radio Rebel",
      "recommendations": [
         40205,
         65218,
         81440,
         84105,
         114955,
         60405,
         19458,
         81250,
         44244,
         35558,
         26736,
         50479,
         49350,
         60803,
         278774,
         61717,
         245473,
         13655,
         177888,
         18126
      ],
      "backdrop_path": "/gFYx0L17dZgmvsvSbwQ0PWtf3BO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tara",
               "gender": 1,
               "credit_id": "52fe4a109251416c910c1f23",
               "name": "Debby Ryan",
               "profile_path": "/bGLpPeIyYd4HN3QLusrK8l0ZVnZ.jpg",
               "id": 123846,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Audrey",
               "gender": 1,
               "credit_id": "52fe4a109251416c910c1f27",
               "name": "Sarena Parmar",
               "profile_path": "/slF7JfPmkwWOda3gJMmfazovKvL.jpg",
               "id": 478070,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gavin",
               "gender": 2,
               "credit_id": "52fe4a109251416c910c1f2b",
               "name": "Adam DiMarco",
               "profile_path": "/mBsj4hdMSMDwKOzYcJR3yEAShgW.jpg",
               "id": 936932,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Gabe",
               "gender": 2,
               "credit_id": "52fe4a109251416c910c1f4d",
               "name": "Atticus Mitchell",
               "profile_path": "/hbZ0MoE695UElVmZCAgFguIEWZ1.jpg",
               "id": 237756,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Carnation Girl",
               "gender": 1,
               "credit_id": "53fc9fcd0e0a267a6f00ad5f",
               "name": "Siobhan Williams",
               "profile_path": "/xw6j5Ivvb4WBTvEg2aKVzzRK4sj.jpg",
               "id": 1121961,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a109251416c910c1f31",
               "name": "Peter Howitt",
               "profile_path": "/cwgHjbx5LitEns32kmdmj1diREi.jpg",
               "id": 7791,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a109251416c910c1f37",
               "name": "Peter Howitt",
               "profile_path": "/cwgHjbx5LitEns32kmdmj1diREi.jpg",
               "id": 7791,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a109251416c910c1f3d",
               "name": "Daniel joseph",
               "profile_path": null,
               "id": 938771,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a109251416c910c1f43",
               "name": "Erik Patterson",
               "profile_path": null,
               "id": 112368,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4a109251416c910c1f49",
               "name": "Jessica Scott",
               "profile_path": null,
               "id": 112369,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 5.432432,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 89185,
      "vote_count": 258,
      "budget": 0,
      "overview": "High school senior Tara is so painfully shy that she dreads speaking to anyone in the hallways or getting called on in class. But in the privacy of her bedroom with her iPod in hand, she rocks out -- doing mock broadcasts for Miami's hottest FM radio station, which happens to be owned by her stepfather. When a slot opens up at The SLAM, Tara surprises herself by blossoming behind the mike into confident, \"Radio Rebel\" -- and to everyone's shock, she's a hit!",
      "similar": [
         10947,
         19458,
         376660,
         11887,
         55721,
         10625,
         862,
         585,
         2108,
         40807,
         858,
         112160,
         449176,
         9880,
         74018,
         17130,
         888,
         308369,
         5176,
         1584
      ],
      "original_title": "Radio Rebel",
      "runtime": 90,
      "poster_path": "/xMDnQAGrjdy4k20n9CZGHKFm7XA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Disney Channel",
            "id": 3213,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Two 4 The Money Media",
            "id": 14987,
            "origin_country": ""
         }
      ],
      "release_date": "2012-02-17",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Can the girl who never speaks... Become the voice of a generation?",
      "adult": false,
      "homepage": "http://tv.disney.go.com/disneychannel/originalmovies/radiorebel/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Howitt"],
      "runtime": 85,
      "synopsis": "High school student Tara (Debby Ryan) is so painfully shy that she dreads speaking to anyone in the hallways or getting called on in class. But in the privacy of her bedroom she does pod casts and rocks out as an anonymous radio host with her listeners. When her stepfather finds she is \"Radio Rebel\" he hires her on Seattle's best FM radio station, SLAM FM. Tara surprises herself by blossoming behind the mike into confident, \"Radio Rebel\" -- and to everyone's shock, she's a hit! Gavin, Tara's secret crush, raves about the mysterious DJ's awesome taste in music. The whole school ends up hating her when Principal Morano cancels prom and demands \"Radio Rebel\" to reveal her identity to be punished. \"Radio Rebel\" changes everybody's minds by calling on a \"morp\", (prom spelled backwards) so everybody can express themselves the way they truly are! \"Radio Rebel\" is nominated as morp queen and wins! To prevent Principal Morano from expelling Tara the whole school stands up for her by chanting \"I'm Radio Rebel!!!\".",
      "writers": [
         "Danielle Joseph",
         "Erik Patterson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2008633/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5OTE4NTM4MV5BMl5BanBnXkFtZTcwOTExNzMzNw@@._V1_SY317_CR16,0,214,317_AL_.jpg",
      "actors": ["Stars: Debby Ryan, Sarena Parmar, Adam DiMarco | See full cast and crew »"],
      "reviews": [
         "Radio Rebel was a poor remake of Christian Slater's Pump Up the Volume, though definitely more in line with Disney movies. PUTV was much darker and edgier. There were unintended consequences for Christian Slater's character that left you wondering whether or not he had done the right thing. In real life, there are two sides to rebellions. The rebel is not always in the right and often hurts innocent people. But Radio Rebel is classic Disney - good for the kids with the \"happy ever after ending\". I know my daughter likes Debby Ryan and loves those happy endings, but when she is older I will introduce her to movies that better reflect the real world with those less happy but not entirely bad endings.",
         "Disney's recent movies/shows haven't done the channel justice at all. Their shows have just been cheap rip-offs of other networks shows and this movie is a good example of that. If you want to watch a good show with almost the exact same plot watch The N's (now Teennick) \"Radio Free Roscoe\" or take a trip back to the 90s by watching the original movie to try this idea, \"Pump Up The Volume\". Even though I knew I'd most likely hate this movie, I still gave it a chance and watched it with an open mind. It had good messages for young kids and it wasn't completely terrible but I still didn't like it. Cheesy endings, Disney fluff, and the fact that it copies off one of my favorite movies, makes this movie awful. Sorry Disney fans but this gets a 2/10.",
         "This movie stunk. You can know the ending just by watching the beginning. It's that cheesy. Apparently I have to write ten lines. Well let's just say that the main character is basically like Demi Lovato in Camp Rock or whatever. And the other guy who she likes is just like any other Disney guy. This is basically like Geekfabulous or w/e. The girl hides her identity, has a guy she likes, guy likes her fake identity, guy has girlfriend who is \"popular\" and makes him do stuff, identity is found out, guy ends up with girl, girl being nice lets the girlfriend be prom queen or w/e. This is the most predictable movie in the history of life. I showered during the middle of it and I already knew all that s*** happened.",
         "So, I don't know why everyone is hating on this movie. To all of you that says this is a remake of PUTV, it's still worth watching because this is more modernized. In fact, it's better for the kids of this century to watch because they'll actually understand it and relate to it. So don't be hating! The storyline, characters, actors and the message is great. In fact, the messages (note the plural) are inspiring. All kids should watch this! Radio Rebel is definitely one of the better Disney films out there and it's worth a watch. I think I said this a million times already, but WORTH A LOOK AT! I personally loved it.",
         "I wouldn't normally take the time to see a movie like this but I am a couple of weeks into my recuperation for foot surgery and came across this one on Netflix streaming movies. It stars Disney actress Debby Ryan, who really was a teenager during filming as Tara, and we also get to know her as Radio Rebel. Tara is very shy, sits at the back of class, rarely participates without being forced to. But she starts a web-based radio show, where she talks about topics of interest to fellow teens, and plays appropriate music. This movie is about her influence on the students and their quest to figure out who Radio Rebel is. The annual school prom gets involved, as the principal says she will cancel prom if Radio Rebel doesn't reveal her identity. The young cast has the usual, popular but snotty girl, polite and talented buy shy boy. And an assortment of every kind of typical high schooler. This is a clean movie that would be of most interest to the younger crowd, perhaps even mostly the preteen crowd.",
         "I'm not going to deny, when I saw this film announced, first thought \"sounds interesting\", but then I read \"Disney\" at the bottom and I started regretting my first feelings and wondering if I suffered from mental insanity. But no, I'm still here, not locked in a safe room or anything. Let's start with basics. Lesson one, children, grasping the standard Disney plot - unpopular girl with big dreams, a nemesis/Queen Bee who ALSO loves that same big dream and tries to make unpopular girl's life miserable in order to get it, a \"hot\" guy is thrown in between the process, the guy notices Unpopular Girl but then is dragged away by Queen Bee, a failed-attempt at character development and BAM! ...there's a dance, Queen Bee becomes Queen Fail and Unpopular Girl gets the guy. While \"Radio Rebel\" DOES somewhat follow the basic scheme, it at least reaches a level of awesomeness. Don't get me wrong, I see the resemblance (or was it \"copying of\"?) \"Pump Up the Volume\", but what made it worthy of seeing was the fact that it adapted to what today's teens understood, lived, and would enjoy seeing. Debby Ryan (portraying main character, Tara) is a rising star that a lot of teens know and look up to - so her portraying a shy high schooler with issues of her own (the cute guy she's too afraid to talk to, the Queen Bee trying to bring her down, not being that close with her new stepfather, and have I mentioned the extreme shyness that could be mistaken for monastic silence?). It's what us average teens know and breathe. So while there's nothing sparkly in the scheme, it speaks to today's teens and that's what we like. Not to mention, there were a few giggles here and there. More to the \"like\" list. So what am I saying? I'm saying that this film is different from the usual \"same story, same boring\" pattern that Disney movies tend to follow...while it was strongly based from \"Pump Up the Volume\", it still had strong elements that make me want to watch it again, particularly the lessons that shy high schooler Tara teaches us - to just be ourselves...to embrace it and not just hide it away in the dark (or in Tara's case, a recording studio), to go out into the sunlight, scream, and let our uniqueness shine in the daylight.",
         "Radio Rebel is about the cliché shy girl that doesn't have many friends, with of course. The predictable twist. She's a beloved anonymous DJ, looked up to by all her school peeps. But they don't know its her. Obviously. It has all the characters and persona's to make the ultimate cringe-worthy teen movie, the mean girl, the crush, the outspoken and slightly over-enthusiastic best friend and most of all: cringe- worthy acting and bad plot. There was, yes some touching and heart-spoken parts of this movie. But nearly every single teen movie has something about \"empowering yourself\" and \"not letting anyone bring you down\". Its pretty obvious that this movie tried hard, maybe even too hard. And no doubt Debby Ryan is a good actress, because she wouldn't be where she is now without some good acting chops. But this movie does not make her shine, quite frankly. It does the opposite. I'm sorry to say it myself but I can only be brutally honest in a review, not sugarcoat everything and make you think this movie is good. Because, its not. It's quite cliché, predictable and badly acted. Sorry Debby.",
         "Hey this is a Disney movie so what else could one expect except cuteness, teenage angst, and an all is well that ends well finish? That is the ending everyone expects and gets. Debby Ryan actually does a nice acting job in this movie. She has to go from a shy, self effacing girl in public to an over the top, outspoken radio personality when she is on the air. The fact that she is so disrespected in public and so well liked when she is on the air actually shows the duplicity of the human nature, make fun of those you don't understand and admiring the people that do what you approve of. I am guessing that the writers did not write as deep I commented on buy hopefully I am wrong, after all it is a Disney movie.",
         "I thought this movie was pretty good. Even though i don't like Disney movies. i thought this one was good. I know that most people aren't gonna agree with this but hey every body has different opinions right? Anyways I just wanted to say that this movie was great even though there was one fault. the ending was obviously very similar to other movies. I mean why do English movies nowadays always have to end with prom. It gets kind of boring. I mean the story was different but the ending was like boring... cause i've already seen it so many times in so many movies that it seemed kind of repeated. Other than that i had no issues and please no hate cause like i said every body has different opinions.",
         "This movie is so bad. It is so bad, it is just so bad, I can't stand watching it it is so bad. I don't like the plot or derby ryan and the film doesn't make sense. Magic isn't real, so this movie is not real and it is not really good either it has no point and is just built to be another dumb Disney film, kids and parents go watch something else becus this is just going to make u wanna change the channel, everyone should watch the classic high school musical and not sixteen wishes. Sixteen wishes makes me not wanna watch TV. It is so bad. Go watch a something else becus this one is a very bad film and I don't not like it and I don't think u will like this film also as we'll, sooooooooooooooooooooooooooooooooo bad, dotnt watch it, it is bad u will not like it, it has no plot. It is sooooooooooooooooooooooo boring too."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Two 4 The Money Media",
         "Goldenring Productions",
         "Morp Services"
      ],
      "summaries": ["High schooler Tara, a girl so painfully shy that she can't even write a single letter on the board in front of a class, has an awesome secret - she is \"Radio Rebel\". When Tara puts on that headset in her room and does her daily podcast, she becomes a confident, outspoken, inspiring, anonymous voice on the airwaves. When her stepfather, the owner/producer guy at SLAM radio, finds out that Tara is Radio Rebel, Tara gets to move from her bedroom to a sound studio to do live shows for SLAM. Everything is the perfect amount of chaos until Principal Moreno, whose only goal in life seems to be to destroy others, cancels Prom and all the students blame Rebel."],
      "budget": 0
   },
   "movielensId": 101258,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-02-17",
      "dvdReleaseDate": null,
      "directors": ["Peter Howitt"],
      "runtime": 90,
      "movieId": 101258,
      "title": "Radio Rebel",
      "mpaa": "",
      "actors": [
         "Debby Ryan",
         "Sarena Parmar",
         "Adam DiMarco",
         "Atticus Mitchell",
         "Siobhan Williams"
      ],
      "imdbMovieId": "2008633",
      "originalTitle": "Radio Rebel",
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "TV Movie"
      ],
      "youtubeTrailerIds": ["Lc91iQ1Ivjo"],
      "plotSummary": "High school senior Tara is so painfully shy that she dreads speaking to anyone in the hallways or getting called on in class. But in the privacy of her bedroom with her iPod in hand, she rocks out -- doing mock broadcasts for Miami's hottest FM radio station, which happens to be owned by her stepfather. When a slot opens up at The SLAM, Tara surprises herself by blossoming behind the mike into confident, \"Radio Rebel\" -- and to everyone's shock, she's a hit!",
      "tmdbMovieId": 89185,
      "avgRating": 3.08537,
      "releaseYear": "2012",
      "numRatings": 41,
      "posterPath": "/xMDnQAGrjdy4k20n9CZGHKFm7XA.jpg"
   }
}