{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "superhero",
            "id": 9715
         },
         {
            "name": "based on comic",
            "id": 9717
         },
         {
            "name": "hostile takeover",
            "id": 171783
         },
         {
            "name": "norse mythology",
            "id": 179101
         },
         {
            "name": "aftercreditsstinger",
            "id": 179430
         },
         {
            "name": "duringcreditsstinger",
            "id": 179431
         },
         {
            "name": "marvel cinematic universe",
            "id": 180547
         },
         {
            "name": "asgard",
            "id": 209818
         },
         {
            "name": "thor",
            "id": 239926
         },
         {
            "name": "mythological place",
            "id": 240071
         }
      ],
      "imdb_id": "tt1981115",
      "video": false,
      "title": "Thor: The Dark World",
      "recommendations": [
         10195,
         100402,
         99861,
         127585,
         102382,
         1771,
         10138,
         68721,
         76170,
         57158,
         1724,
         49521,
         102899,
         91314,
         559,
         36658,
         49538,
         124905,
         1726,
         44912
      ],
      "backdrop_path": "/3FweBee0xZoY77uO1bhUOlQorNH.jpg",
      "revenue": 644571402,
      "reviews": [
         {
            "author": "Per Gunnar Jonsson",
            "id": "5337c1079251417d9e00220d",
            "content": "There have been plenty of movies based on classical cartoon superheroes that have been poorly implemented and with a lousy story. Luckily this one is not one of those. This was really a very enjoyable movie and I liked this movie a lot better than the first Thor movie which I felt was mostly silly.\r\n\r\nThis one has a story which was rather okay and held somewhat together. You have to remember that this is a comic book hero and the story is on that level of course. The special effects and the scenery is really nice as well. The views of Asgard is cool, almost breathtaking.\r\n\r\nAnthony Hopkins was excellent as Odin or Oden has he is called in Sweden, my country of birth. Tom Hiddleston is also very good in his role although I have to say that I really do not like his role but then he is supposed to be one of the bad guys so… Chris Hemsworth is good enough in his role but I would say that he is really the weakest ones in terms of acting.\r\n\r\nThe movie is liberally sprinkled with jokes as well and, thankfully, most of them are not too bad. Although a bit silly I have to say that I did laugh when Thor politely hung Mjölnir on the clothes rack in the apartment with Darcy and Dr. Selvig.\r\n\r\nOn the whole I enjoyed this movie tremendously.",
            "url": "https://www.themoviedb.org/review/5337c1079251417d9e00220d"
         },
         {
            "author": "Andres Gomez",
            "id": "545fe448c3a36853580095f9",
            "content": "More of the same. Predecible non elaborated script and with a total lack of sense of humor.\r\n\r\nThe FX are, again, OK, but the feeling of swords, axes, armors and helmets is of cheap plastic.",
            "url": "https://www.themoviedb.org/review/545fe448c3a36853580095f9"
         },
         {
            "author": "DoryDarko",
            "id": "58ac553492514158c0015059",
            "content": "Watching Thor: The Dark World tonight, I got the feeling that Hollywood might have finally figured it out. In theory, a sequel should always surpass its predecessor, although as we all know, many have tried and famously failed. But a new trend seems to finally be breaking through. X2 was better than X-Men. Spider-Man 2 was better than the first. And now that I've seen it, I can tell you Thor: The Dark World… is better than Thor. (And the fact that these are all Marvel productions, that's food for anther discussion.)\r\n\r\nI thoroughly enjoyed Thor, directed by Kenneth Branagh, when I only saw it for the first time just this spring. In fact, I watched it again the same week. Which is saying enough to imply that my hopes were high for the sequel. So I was really looking forward to tonight and I was not disappointed.\r\n\r\nThor 2 was helmed by a different director, Alan Taylor, which typically always spells trouble in my book when they change the director, but I take my hat off to him. What I admire is that he managed to capture the tone that Branagh set in the first film flawlessly – even perfected it in a way. He brings to the table a duality which almost never works successfully in any film, but here, does so perfectly: Taylor made Thor 2 notably darker, yet at the same time more humorous. I take my hat off to the writers as well – they put in a ton of great jokes, all at the exactly right moment. Had this been done even a fraction less tactfully, the film would have sunk like a bag of bricks, like so many others have. I found myself (and the audience) laughing my butt off one moment, and feeling very serious and engaged with the on-screen emotions the next. Even when it happened abruptly, it still never felt inappropriate. Now that's good entertainment. Two thumbs up.\r\n\r\nThe actors all wear their roles like a custom-made suit. It's obvious that Chris Hemsworth has really grown into his character, third time around. This guy IS Thor, hands down. The same goes for all the other actors, they were all perfectly comfortable in their roles and respective environments. The one that intrigued me most, however, was Loki – personified absolutely magnificently by Tom Hiddleston. Much like Hemsworth, it seems he was born to play this role. He captures all the slyness, all the arrogance and all the torment of a man almost unable to bear the weight of his own ego in a single flicker in his eyes. And then that grin… Perfection. The way Hiddleston plays Loki is strangely captivating. You know he's totally wicked and cannot be trusted, yet at the same time you can't help but really like him – you might even end up rooting for this guy, and I'm not sure many other actors would have managed this.\r\n\r\nAll the special effects were as good as one should expect them to be these days. I have nothing much to say there, except that it was all terrifically eye-pleasing, and Asgard looked even more beautiful than before. It was all convincing and very well done. \r\n\r\nStill, I have not completely explained why T:TDW is better than the first. Actually, I might not fully be able to. It's mostly a feeling. As much as I was entertained the first time, I was even more entertained now. It was more action-packed, more exciting, darker and it just had a great deal more adrenaline. \r\n\r\nThe only thing that I think was weaker in this film, was the character of Jane Foster. Her character was just less interesting, kind of blank. I actually don't remember much of her at all, except that she slapped Thor a couple of times and she had all this creepy stuff coming out of her… Also she was somewhat of a damsel-in-distress most of the time with the look of a scared kitten on her face, and that's not exactly how we like to see our ladies nowadays. It's so common to see women being perfectly independent now, that it's a little weird to see a grown woman with \"three degrees in physics\" (as Darcy so poignantly points out) scared and shivering like a little girl. Most of the time, Natalie Portman just didn't carry her scenes very strongly, and that's strange coming from such a fine actress. So maybe one of the actors was actually a little out of place after all, thinking about it. \r\n\r\nHaving said that, that's pretty much my only complaint. Every other element in this film was very solid, the story was very good and they absolutely nailed the pacing. Those two hours went by in the blink of a eye. \r\n\r\nThor: The Dark World is wonderfully entertaining and a definite must-see for every Marvel fan. In fact – at the risk of enraging the Marvel Gods – this might just be pretty stiff competition to X-Men… Watch out Wolverine, I think I have a new favorite superhero.\r\n_(November 2013)_",
            "url": "https://www.themoviedb.org/review/58ac553492514158c0015059"
         },
         {
            "author": "Gimly",
            "id": "59f29eab925141229f0042fc",
            "content": "**A long format review from 2013**\r\n\r\nDespite a virtually non-existent (comparatively) promotional campaign for Marvel’s latest effort, Thor: The Dark World has crushed its competition box-office-wise. Though receiving less critical acclaim than Captain Phillips or Gravity, it did clean up in the finance department.\r\n\r\nI’ve made no secret of the fact that in the MCU, my favourite Avenger is Thor, so a new film was always going to be an easy ticket from me. And I can’t work out if that bias is making me more critical of the film because I care so much, or less because I’m just happy it got made? I’ll try to be as above board as possible.\r\n\r\nThor 2 is a spectacle, make no mistake. It has the appropriate mix of explosions, attractive people, monsters, humour, fighting, mesmerising visuals, sweet symbolism and heart-wrenching sorrow that can be expected from a decent super hero film. But beyond that, it doesn’t really have much.\r\n\r\nI know it sounds like it has a lot, and it honestly does, but I just couldn’t help feeling in a quite a number of moments that the thing felt hurried. Maybe if there wasn’t such a mad rush to get a Thor sequel out by the end of 2013, they could have spent a little more time fleshing out and filling in the script (not that it’s a short movie, I mean the pre-production feels rushed) and better utilising director Alan Taylor (Game of Thrones, Rome, Carnivale). There was a hint of the generic, amongst this otherwise splendid film.\r\n\r\n73%\r\n\r\n-Gimly",
            "url": "https://www.themoviedb.org/review/59f29eab925141229f0042fc"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Thor",
               "gender": 2,
               "credit_id": "52fe4932c3a368484e11f66f",
               "name": "Chris Hemsworth",
               "profile_path": "/lrhth7yK9p3vy6p7AabDUM1THKl.jpg",
               "id": 74568,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jane Foster",
               "gender": 1,
               "credit_id": "52fe4932c3a368484e11f673",
               "name": "Natalie Portman",
               "profile_path": "/rtLTG4yrEcROXhTBGXMrbyiUEC5.jpg",
               "id": 524,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Loki",
               "gender": 2,
               "credit_id": "52fe4932c3a368484e11f677",
               "name": "Tom Hiddleston",
               "profile_path": "/qB1lHPFBPIzw6I7EvsciZ5wyUNS.jpg",
               "id": 91606,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Odin",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6a5",
               "name": "Anthony Hopkins",
               "profile_path": "/btweZvSRBiE6jaMME93BSXeTQN6.jpg",
               "id": 4173,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Erik Selvig",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f689",
               "name": "Stellan Skarsgård",
               "profile_path": "/zSCU2agleLtJEvzj98jEesVhBxa.jpg",
               "id": 1640,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Heimdall",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f681",
               "name": "Idris Elba",
               "profile_path": "/d9NkfCwczP0TjgrjpF94jF67SK8.jpg",
               "id": 17605,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Malekith",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f691",
               "name": "Christopher Eccleston",
               "profile_path": "/9zI0Ed8aGxLPdTQeV0He9Rl0eSX.jpg",
               "id": 2040,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Algrim / Kurse",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f695",
               "name": "Adewale Akinnuoye-Agbaje",
               "profile_path": "/lnFcwjgNDNRzQ8yC1HPDIBRBwBh.jpg",
               "id": 31164,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Darcy Lewis",
               "gender": 1,
               "credit_id": "52fe4933c3a368484e11f699",
               "name": "Kat Dennings",
               "profile_path": "/axPn5eI5mlZtlZJWrvYRq1hCcUh.jpg",
               "id": 52852,
               "order": 8
            },
            {
               "cast_id": 42,
               "character": "Volstagg",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f713",
               "name": "Ray Stevenson",
               "profile_path": "/bcd9uqwfCVYsu7rduZnPVYUkyfU.jpg",
               "id": 56614,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Fandral",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f68d",
               "name": "Zachary Levi",
               "profile_path": "/ezGnRBi5zn9S6WFxuVxFfZdRH3e.jpg",
               "id": 69899,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Hogun",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f69d",
               "name": "Tadanobu Asano",
               "profile_path": "/zlZsST8s1Apm6D6bCyYeWrCKZCy.jpg",
               "id": 13275,
               "order": 11
            },
            {
               "cast_id": 9,
               "character": "Sif",
               "gender": 1,
               "credit_id": "52fe4933c3a368484e11f685",
               "name": "Jaimie Alexander",
               "profile_path": "/vPXy9FBK272nqrJDlQX9zU57vmj.jpg",
               "id": 59817,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Frigga",
               "gender": 1,
               "credit_id": "52fe4933c3a368484e11f6a1",
               "name": "Rene Russo",
               "profile_path": "/aaPzuXRHdyxamPMXqu70okPaqvB.jpg",
               "id": 14343,
               "order": 13
            },
            {
               "cast_id": 27,
               "character": "Richard",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6db",
               "name": "Chris O'Dowd",
               "profile_path": "/xhfgliN8DInDVBliPq7JDeKNCvz.jpg",
               "id": 40477,
               "order": 14
            },
            {
               "cast_id": 43,
               "character": "Eir",
               "gender": 1,
               "credit_id": "52fe4933c3a368484e11f717",
               "name": "Alice Krige",
               "profile_path": "/kUuVEsfZNxXdlK2JQdTEGcfkoY3.jpg",
               "id": 2506,
               "order": 15
            },
            {
               "cast_id": 92,
               "character": "Jane Foster stand-in",
               "gender": 1,
               "credit_id": "59f94fb1c3a3682d6a00a8fa",
               "name": "Elsa Pataky",
               "profile_path": "/c1km2kqasJT9GTISMbBZpp3jbuR.jpg",
               "id": 73269,
               "order": 16
            },
            {
               "cast_id": 35,
               "character": "The Collector (uncredited)",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6f7",
               "name": "Benicio del Toro",
               "profile_path": "/5TlC56RMfTeeBxhI6myQe4SDEEo.jpg",
               "id": 1121,
               "order": 17
            },
            {
               "cast_id": 34,
               "character": "Carina (uncredited)",
               "gender": 1,
               "credit_id": "52fe4933c3a368484e11f6f3",
               "name": "Ophelia Lovibond",
               "profile_path": "/wewyxidwQYHZxemnZdlYL7lQdOs.jpg",
               "id": 82639,
               "order": 18
            },
            {
               "cast_id": 44,
               "character": "Ian Boothby",
               "gender": 0,
               "credit_id": "52fe4933c3a368484e11f71b",
               "name": "Jonathan Howard",
               "profile_path": "/tQHHmna3gp74flis6MxsnYXsbgm.jpg",
               "id": 1270111,
               "order": 19
            },
            {
               "cast_id": 29,
               "character": "Bor (uncredited)",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6df",
               "name": "Tony Curran",
               "profile_path": "/IhqoydPOiP53AI6NeHTVwDcHTz.jpg",
               "id": 2220,
               "order": 20
            },
            {
               "cast_id": 18,
               "character": "Tyr",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6a9",
               "name": "Clive Russell",
               "profile_path": "/3dkiAdWPMPiPRqwi5MVBFOSD9Xo.jpg",
               "id": 19901,
               "order": 21
            },
            {
               "cast_id": 31,
               "character": "Einherjar Lieutenant",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6e7",
               "name": "Richard Brake",
               "profile_path": "/4cmswB0RoDLWrGywP3ZQ7LxU3Bd.jpg",
               "id": 3901,
               "order": 22
            },
            {
               "cast_id": 33,
               "character": "Loki as Captain America (uncredited)",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6ef",
               "name": "Chris Evans",
               "profile_path": "/8CgFKCZJVwZxa1F88n8drEux0vT.jpg",
               "id": 16828,
               "order": 23
            },
            {
               "cast_id": 19,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6ad",
               "name": "Stan Lee",
               "profile_path": "/dTr2gJPL7jELKVkcjtoNx80uVKR.jpg",
               "id": 7624,
               "order": 24
            },
            {
               "cast_id": 55,
               "character": "John",
               "gender": 0,
               "credit_id": "5885413f9251410457024065",
               "name": "Ramone Morgan",
               "profile_path": null,
               "id": 1381866,
               "order": 25
            },
            {
               "cast_id": 56,
               "character": "Navid",
               "gender": 0,
               "credit_id": "58854156c3a3680643026b90",
               "name": "Obada Alassadi",
               "profile_path": null,
               "id": 1743768,
               "order": 26
            },
            {
               "cast_id": 57,
               "character": "Maddie",
               "gender": 0,
               "credit_id": "588541669251413edb022692",
               "name": "Imaan Chentouf",
               "profile_path": null,
               "id": 1743769,
               "order": 27
            },
            {
               "cast_id": 58,
               "character": "Volstagg's Wife",
               "gender": 0,
               "credit_id": "5885419cc3a3684ec602330a",
               "name": "Claire Brown",
               "profile_path": null,
               "id": 1743770,
               "order": 28
            },
            {
               "cast_id": 59,
               "character": "Volstagg's Child #1",
               "gender": 0,
               "credit_id": "588542109251413edb02273a",
               "name": "Henry Calcutt",
               "profile_path": null,
               "id": 1743771,
               "order": 29
            },
            {
               "cast_id": 60,
               "character": "Volstagg's Child #2",
               "gender": 0,
               "credit_id": "58854233925141045b0250b6",
               "name": "Ava Caton",
               "profile_path": null,
               "id": 1743772,
               "order": 30
            },
            {
               "cast_id": 61,
               "character": "Volstagg's Child #3",
               "gender": 0,
               "credit_id": "58854241c3a3684f3a01fc89",
               "name": "Abbie McCann",
               "profile_path": null,
               "id": 1743773,
               "order": 31
            },
            {
               "cast_id": 62,
               "character": "Desk Officer",
               "gender": 2,
               "credit_id": "588542bec3a368063c02455d",
               "name": "Thomas Arnold",
               "profile_path": "/5sRg7Cl4keWD8ol08i0jOrT4k8w.jpg",
               "id": 1132749,
               "order": 32
            },
            {
               "cast_id": 63,
               "character": "Stonehenge TV News Reporter",
               "gender": 0,
               "credit_id": "588542dec3a3680643026d22",
               "name": "Sam Swainsbury",
               "profile_path": null,
               "id": 1269487,
               "order": 33
            },
            {
               "cast_id": 64,
               "character": "Sad Child",
               "gender": 0,
               "credit_id": "588543179251413edb022819",
               "name": "Connor Donaghey",
               "profile_path": null,
               "id": 1743774,
               "order": 34
            },
            {
               "cast_id": 65,
               "character": "Student",
               "gender": 0,
               "credit_id": "5885433b925141045d025768",
               "name": "Royce Pierreson",
               "profile_path": "/fbXFTgCjXAnMgClQaPTfjgKy54v.jpg",
               "id": 1266313,
               "order": 35
            },
            {
               "cast_id": 66,
               "character": "Woman on Platform",
               "gender": 0,
               "credit_id": "5885435c925141045d02578d",
               "name": "Annabel Norbury",
               "profile_path": null,
               "id": 1743775,
               "order": 36
            },
            {
               "cast_id": 67,
               "character": "Wench #1",
               "gender": 0,
               "credit_id": "5885437f9251410454025d4a",
               "name": "Sophie Cosson",
               "profile_path": null,
               "id": 1743776,
               "order": 37
            },
            {
               "cast_id": 68,
               "character": "Police Officer #1",
               "gender": 2,
               "credit_id": "588543dfc3a368064a0219a8",
               "name": "Justin Edwards",
               "profile_path": "/3RKWxwIQ3OYfmlUcTpyRxQHm9M0.jpg",
               "id": 206724,
               "order": 38
            },
            {
               "cast_id": 69,
               "character": "Police Officer #2",
               "gender": 2,
               "credit_id": "588543f69251410460026c6f",
               "name": "Gruffudd Glyn",
               "profile_path": "/p7vTiX2TKxS3ovAsZo2b1WfFBQD.jpg",
               "id": 1414711,
               "order": 39
            },
            {
               "cast_id": 70,
               "character": "Himself",
               "gender": 0,
               "credit_id": "588544acc3a3680643026ea7",
               "name": "Steve Scott",
               "profile_path": null,
               "id": 1743778,
               "order": 40
            },
            {
               "cast_id": 71,
               "character": "Einherjar Guard",
               "gender": 0,
               "credit_id": "588544cd925141045d0258e7",
               "name": "Brett Tucker",
               "profile_path": "/3POV4S1qr6tNdNBmlmZs7RyLNTR.jpg",
               "id": 1224188,
               "order": 41
            },
            {
               "cast_id": 30,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "52fe4933c3a368484e11f6e3",
               "name": "Talulah Riley",
               "profile_path": "/cmA8krd4hpPC9kWSF9wpSx6ffMt.jpg",
               "id": 66441,
               "order": 42
            },
            {
               "cast_id": 32,
               "character": "Asylum Patient",
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6eb",
               "name": "Richard Wharton",
               "profile_path": "/hklENMg9f6pAbTHafbbOZpUbZUN.jpg",
               "id": 87115,
               "order": 43
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4932c3a368484e11f67d",
               "name": "Alan Taylor",
               "profile_path": "/f8hPlHuaRw1py22wp2qqNRfVDMw.jpg",
               "id": 47005,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6b3",
               "name": "Don Payne",
               "profile_path": null,
               "id": 20401,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6bf",
               "name": "Christopher Markus",
               "profile_path": "/tyeKi52yruPdxOkEMKhBKCnkp5V.jpg",
               "id": 5551,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6c5",
               "name": "Stephen McFeely",
               "profile_path": "/fa8DAGpANcBTTXO4bbNMrCFufmV.jpg",
               "id": 5552,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6cb",
               "name": "Kramer Morgenthau",
               "profile_path": null,
               "id": 50140,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6d1",
               "name": "Kevin Feige",
               "profile_path": "/AewbqQQT0FbcE358rcbopZ3zgDV.jpg",
               "id": 10850,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6d7",
               "name": "Stan Lee",
               "profile_path": "/dTr2gJPL7jELKVkcjtoNx80uVKR.jpg",
               "id": 7624,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f6fd",
               "name": "Brian Tyler",
               "profile_path": "/22QWiNJj03amY6GT1QPUs7dbdcB.jpg",
               "id": 6041,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f703",
               "name": "Malcolm Jamieson",
               "profile_path": null,
               "id": 59728,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4933c3a368484e11f70f",
               "name": "Louis D'Esposito",
               "profile_path": "/pNvtXPy8kil9WWFtySahnNbvc3R.jpg",
               "id": 57027,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "530b25a79251411111004db1",
               "name": "Sarah Finn",
               "profile_path": null,
               "id": 7232,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "530b25cd925141111a00496f",
               "name": "Priscilla John",
               "profile_path": null,
               "id": 3311,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "530b25e892514168dc000c62",
               "name": "Wendy Partridge",
               "profile_path": null,
               "id": 3962,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "53ec75440e0a2605e900116a",
               "name": "Christopher Yost",
               "profile_path": "/6v1wkHdEAuwD8M8i0yWa3LYvoxS.jpg",
               "id": 109542,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5518ccd3c3a3681f84001b95",
               "name": "Jane Wu",
               "profile_path": "/Ypw5qKAimytqBFYfwSA5mbSHyD.jpg",
               "id": 1447326,
               "department": "Writing",
               "job": "Storyboard"
            },
            {
               "gender": 0,
               "credit_id": "55340809c3a3680bdc000508",
               "name": "Brian N. Bentley",
               "profile_path": null,
               "id": 1456696,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 0,
               "credit_id": "553b299fc3a3683e55002da0",
               "name": "James Baker",
               "profile_path": null,
               "id": 1457930,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 2,
               "credit_id": "553c2ab09251413f5a00683e",
               "name": "Chris O'Connell",
               "profile_path": null,
               "id": 1412756,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "554fb2ebc3a3687f630024a7",
               "name": "Erik Classen",
               "profile_path": null,
               "id": 1447542,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 2,
               "credit_id": "55655073c3a3683c0f000c31",
               "name": "Damion Poitier",
               "profile_path": "/zBoq4SAauhVmbHSyWZXYXvA36Ky.jpg",
               "id": 150194,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 1,
               "credit_id": "5946f3ae9251413ff402ff97",
               "name": "Sian Milne",
               "profile_path": "/j09vpyyFHkb48MUhtb5yiH12MII.jpg",
               "id": 1835498,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 0,
               "credit_id": "59a464c792514139b4001e95",
               "name": "Victoria Alonso",
               "profile_path": "/xF7Qe1tqgk9KtY8kThKHBWhMqxc.jpg",
               "id": 113674,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "59a46503c3a3680b12001fcf",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59a4651a9251413955001e73",
               "name": "Jamie Christopher",
               "profile_path": null,
               "id": 1512798,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "59a46548c3a3680b040020db",
               "name": "Alan Fine",
               "profile_path": "/7Ntt3WWg25ivLT8Os3LeZW1WxIC.jpg",
               "id": 113672,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "59a46558c3a3680ad5001d09",
               "name": "Nigel Gostelow",
               "profile_path": null,
               "id": 8415,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "59a4656692514139b4001f39",
               "name": "David J. Grant",
               "profile_path": "/5JngWUEQfNkAURQgrWNiLyqNn8n.jpg",
               "id": 1533708,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "59a465759251413949001ff0",
               "name": "Craig Kyle",
               "profile_path": null,
               "id": 87173,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "59a4658fc3a3680b1200205b",
               "name": "Ivan Lam",
               "profile_path": null,
               "id": 1877783,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "59a465d8c3a3680b04002170",
               "name": "Julian Ashby",
               "profile_path": null,
               "id": 9818,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59a465edc3a3680ac7002104",
               "name": "Thomas Brown",
               "profile_path": null,
               "id": 1326451,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59a465fb9251413955001f44",
               "name": "Ray Chan",
               "profile_path": null,
               "id": 1104780,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 0,
               "credit_id": "59a4660a9251413955001f52",
               "name": "Jordan Crockett",
               "profile_path": null,
               "id": 1326458,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59a46622c3a3680ab5001e60",
               "name": "Adriaan Engelbrecht",
               "profile_path": null,
               "id": 1878481,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59a4665c92514139a7002132",
               "name": "Matthew Robinson",
               "profile_path": null,
               "id": 1388855,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59a46667c3a3680ab5001e92",
               "name": "Mike Stallion",
               "profile_path": null,
               "id": 983309,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59a4668f92514139a700215a",
               "name": "Hayley Easton Street",
               "profile_path": null,
               "id": 1428907,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59a4669a925141398b00216a",
               "name": "Mark Swain",
               "profile_path": null,
               "id": 1326460,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59a466ce925141395000214d",
               "name": "John Bush",
               "profile_path": null,
               "id": 66552,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "59a46818c3a3680b120022f9",
               "name": "Robert Rodat",
               "profile_path": null,
               "id": 12832,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5a13dd83925141365b00286e",
               "name": "Wayne Dalglish",
               "profile_path": "/qPD5xOssHAEis6u7XgMj0X7pdOX.jpg",
               "id": 1226495,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 2,
               "credit_id": "5a13dd9092514136510026c1",
               "name": "Wayne Dalglish",
               "profile_path": "/qPD5xOssHAEis6u7XgMj0X7pdOX.jpg",
               "id": 1226495,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "5aa54cd6925141278d021f43",
               "name": "Rick Newsome",
               "profile_path": null,
               "id": 1996002,
               "department": "Art",
               "job": "Storyboard Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 71.212879,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 76338,
      "vote_count": 6527,
      "budget": 170000000,
      "overview": "Thor fights to restore order across the cosmos… but an ancient race led by the vengeful Malekith returns to plunge the universe back into darkness. Faced with an enemy that even Odin and Asgard cannot withstand, Thor must embark on his most perilous and personal journey yet, one that will reunite him with Jane Foster and force him to sacrifice everything to save us all.",
      "similar": [
         1452,
         155,
         1924,
         141052,
         272,
         99861,
         8536,
         9531,
         379291,
         13640,
         414,
         364,
         268,
         1724,
         49026,
         415,
         10195,
         24428,
         49521,
         209112
      ],
      "original_title": "Thor: The Dark World",
      "runtime": 112,
      "poster_path": "/bnX5PqAdQZRXSw3aX3DutDcdso5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/hUzeosd33nzE5MCNsZxCGEKTXaQ.png",
         "name": "Marvel Studios",
         "id": 420,
         "origin_country": "US"
      }],
      "release_date": "2013-10-29",
      "vote_average": 6.7,
      "belongs_to_collection": {
         "backdrop_path": "/3KL8UNKFWgIKXzLHjwY0uwgjzYl.jpg",
         "name": "Thor Collection",
         "id": 131296,
         "poster_path": "/yw7gr7DhHHVTLlO8Se8uH17TDMA.jpg"
      },
      "tagline": "Delve into the darkness",
      "adult": false,
      "homepage": "http://marvel.com/thor",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alan Taylor"],
      "runtime": 112,
      "synopsis": "Eons ago, Bor, the father of Odin, clashes with the Dark Elf Malekith, who seeks to destroy the universe using a weapon known as the Aether. After conquering Malekith's forces, including enhanced warriors called the Kursed, on their home world of Svartalfheim, Bor safeguards the Aether within a stone column. Unbeknownst to him, Malekith, his lieutenant Algrim, and a handful of Dark Elves escape into suspended animation. In present-day Asgard, Loki stands imprisoned for his war crimes on Earth. Meanwhile, Thor, alongside warriors Fandral, Volstagg and Sif repel marauders on Vanaheim, home of their comrade Hogun; it is the final battle in a war to pacify the Nine Realms following the reconstruction of Bifröst, the \"Rainbow Bridge\" between realms, which had been destroyed two years earlier. In London, astrophysicist Dr. Jane Foster's intern, Darcy Lewis, now with her own intern, Ian, takes Jane to an abandoned factory where objects have begun to disobey the laws of physics and disappear into thin air. Separating from the group, Jane is teleported to another world, where she is infected by the Aether. The Asgardians learn that the Convergence, a rare alignment of the Nine Realms, is imminent; as the event approaches, portals linking the worlds appear at random. Heimdall alerts Thor of Jane's recent disappearance, leading Thor to search for her. When she inadvertently releases an unearthly force while being arrested by the police for trespassing on private property, he takes her to Asgard. However, the Asgardian healers say they do not know how to treat her. Odin, recognizing the Aether, warns Jane's infection will kill her given enough time, and that the Aether's return heralds a catastrophic prophecy. Malekith, awakened by the Aether's release, turns Algrim into a Kursed and attacks Asgard. During the battle, Malekith and Algrim search for Jane, knowing she contains the Aether. When they fail to capture her, they escape, but not before killing Thor's mother Frigga in a swordfight. Despite Odin's orders not to leave Asgard, Thor reluctantly teams up with Loki, who knows of a secret portal to Malekith's world, where they will use Jane to lure and confront Malekith, away from Asgard. In return, Thor promises Loki that he can have his revenge on Malekith for killing their mother. With Volstagg and Sif stalling Asgardian soldiers and Fandral assisting their escape, Thor and Loki commandeer a Dark Elf spaceship and escape to Svartalfheim with Jane. On Svartalfheim, Loki tricks Malekith into drawing the Aether out of Jane. However, Thor's attempt to destroy the substance fails, and the Aether-empowered Malekith leaves with his ship as Loki appears to be fatally wounded while protecting Thor from Algrim. Thor, cradling Loki in his arms, promises to tell their father of his sacrifice. Following Loki's apparent death, Thor and Jane discover another portal in a nearby cave and reunite with Jane's mentor Dr. Erik Selvig, Darcy and Ian in London. There, they learn that Malekith plans to unleash the Aether to destroy the universe, and that he will do this in Greenwich, the center of the Convergence. Thor battles Malekith, but a portal separates them, leaving Malekith unopposed. Thor comes back in time to help his mortal comrades use their scientific equipment to transport Malekith to Svartalfheim, where he is killed before he can destroy the universe. Thor returns to Asgard, where he declines Odin's offer to take the throne and tells Odin of Loki's sacrifice. As he leaves, Odin's form transforms to that of a grinning Loki. In a mid-credits scene, Volstagg and Sif visit the Collector and entrust the Aether to his care, commenting that, with the Tesseract already in Asgard, having two Infinity Stones so close together would be dangerous. As they leave, the Collector remarks, \"One down, five to go.\" (Foreshadowing the Guardians of the Galaxy movie.) In a post-credits scene, Jane and Thor reunite on Earth, while somewhere in London a frost monster from Jotunheim, accidentally transported to Earth during the final battle, continues to run amok.",
      "writers": [
         "Christopher Yost",
         "Christopher Markus"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1981115/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyNzAwOTUxOF5BMl5BanBnXkFtZTcwMTE0OTc5OQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Chris Hemsworth, Natalie Portman, Tom Hiddleston | See full cast and crew »"],
      "reviews": [
         "The acting was solid. The production value was superb. Everything else was really poor. The back story and character motivations are laughably sparse. Most of the characters are completely one-dimensional, with the possible exception of Loki. The plot is the most boring and typical of all action plots - some \"bad dudes who happen to be really ugly\" decide to \"destroy the world for no reason other than being evil\" and \"only our hero can save us all\", etc. Moreover, it was lazy writing - whenever an absolute miracle needed to happen, it conveniently did, every time. Of course this is a mindless blockbuster Marvel movie so we shouldn't expect much. But the thing is that these kinds of films CAN be made with a reasonable plot, pacing, and character development. The writers were obviously just going through the motions to cash in on the surefire moneymaker sequel, and from a business perspective it is hard to fault them. But it says a lot about the sad state of Hollywood in 2013 that this film currently has a 7.7 on IMDb.",
         "Go ahead and find this review not useful. But listen to me. I love Marvel films. The Original Spider-man Trilogy was amazing and The Avengers was awesome. But when I saw Iron Man 3 I was bored out of my mind and I felt it was not good. So I lowered my expectations for this movie and hoped it would be better right? Because from what I learned, the lower the expectations, the better the movie. Big Mistake. Thor The Dark World is all over the map with scenes of badly choreographed action scenes to bad comedy to laughable acting. I really wanted to like this film because I liked the original Thor. It was really good and it was directed by Kenneth B. who is the man who made The best adaptation of Hamlet Ever. But the movie suffers from production troubles to a bad script. The Film begins with this super magic thing called the Ether... I think which causes destruction. They find it and this one guy says \"Lets Destroy it.\" but this other guy says \"ITS TOO POWERFUL! We must put it in a place where it is easily touchable!\" I knew this was going to be a bad film because the beginning suffers from cliché after cliché. Thor returns to Earth because Jane gets the Ether in her and they must heal her. The Dark Elves who are the bad guys for the film attack Thor's planet and the main baddie tries to line up the main 9 planets and cause darkness everywhere. Thor gets Loki from Prison and they go stop the evil baddie. The script and direction are extremely weak. The script sucks because the dialogue is horrendous. The acting is hilarious from Anthony Hopkins as Odin as he overacts a lot in this movie. The action scenes are poorly choreographed and make no sense. Also, Heroes should have weaknesses. Thor nearly throughout the whole Has none. Why should we care if they are unstoppable without any weaknesses, that takes away the credibility of the character. Also, this teleporting plot line makes no sense. They go nearly everywhere in this movie. In the final fight scene fall everywhere going back from place to place. They never explain why these teleports are randomly put all over the map but it really annoys me. The jokes... oh my god. They are so unfunny. Who cares if the Professor guy's pants are not on? Bad comedy has to be understood and this movie doesn't understand comedy. The character of Darcy is obnoxious. She was alright in the first but she always has to say HOLY SH*T 500 times a scene. The special effects are alright but its not always about the effects. One effect actually hurt my eyes and I didn't know if it was the 3D or if my eyes just hurt. There are very few good things about this movie. The guy who plays Loki is one of the only redeeming qualities of this movie and he is very convincing. The Stan Lee Cameo is also great and funny like always. There is a awesome twist I wont spoil. But that's about it. This movie is just super loud in its bad action scenes are poor acting and ear bleeding sound effects. Thor The Dark World is the worst movie of the year without a doubt. I was disappointed severely. Marvel can be much better then this and I hope Captain America The Winter Soldier does a better job at being a better superhero movie. 25/100 D",
         "The plot barely exists for this film. Generic evil people try to take over universe, Thor stops them, the end. Which might have been alright but there was very little action in this mindless action film. What little fighting we got was poorly orchestrated and repetitive. The dialogue is wooden and adds nothing. The characters with the exception of Loki have no depth and only exist as an assortment of clichés. Hiddleston makes for a great Loki but that is literally the only good or interesting thing in the entire film. Thor continues to be the worst Marvel movie franchise and Hemsworth is possibly the worst actor to ever star in multiple major movies.",
         "Let me start by saying that I don't hate superhero films. I like them very much when they are done well. I hate laziness in films and superficiality. The problem is that pretty much every superhero film made is very lazy and most of them are entirely superficial. Marvel's initial idea of an Avengers universe was inspired from a marketing stand point but I am beginning to question whether or not it has been a failure from a creative stand point. 'Thor the Dark World' is a terrible movie. It does absolutely nothing to add to the mythos of the character or this Marvel universe. The only reason it exists is to draw up excitement for the next Avengers film. There are no stakes to this film and there are a lot of places to direct blame. The acting aside from Tom Hiddleston is next to unwatchable. The thing is that this is a very talented cast we are working with here. Anthony Hopkins and Natalie Portman have both won Academy Awards. Stellan Skarsgard is one of the most fascinating character actors in Hollywood. I like Hemsworth a lot too and thought he was great in the first 'Thor' film. But none of them invest anything in the material. Hopkins looks bored and emotes nothing in his delivery. Portman's performance is terrible too and in the process of it being terrible it makes a terrible script look even worse. Jane Foster is a horrible character here. She is by far the stupidest damsel in distress portrayed in comic books recently. Portman is too lazy to give her any sort of character. She punctuates every cheap joke and many of them are just about how ditsy the character is. This kind of writing and performance make me almost agree that comic books offer a flawed and stereotypical depiction of women. Stellan Skarsgard, an actor I think has great depth, is played as a complete fool here. I hated every time he appeared on screen and I am a Stellan Skarsgard fan. I don't place the blame all on him but yeah everyone here did something very wrong in bringing these stupidly conceived characters to life. In actuality though they are not the biggest problem with the film. The problem is that there is no threat to anything or anyone. The villain here is so completely forgettable and has a plan for evil so half assed that they movie really had no chance of working. This is the ultimate example of a conflict for the sake of having a conflict. If actor Christopher Eccleston is not rewarded a Razzie for his portrayal here than that award show has lost all credibility. Villains even poorly written ones with no motivation like this Maleketh should at least offer the actor the chance to try to ham it up with the tropes of goofy villainy. Eccleston doesn't do that. He has a boring calm delivery that evokes no response but laughter. And since Eccleston's performance is such an overwhelming failure I was drawn to how stupid his make-up looked too. I wish I could give this a bomb rating, I really do. To be honest though Tom Hiddleston is too damn good in the Loki role to say the film is completely without merit. They don't do anything new with his character here but he's so entertaining and in every Marvel film he adds new layers and nuances to a very interesting character. A whole movie could have been made about this stage of Loki's life and it would have been so much more entertaining and compelling than this load of work. Hiddleston portrays Loki as unchained with no loyalty to anyone. This is the first film where we see him as a trickster and Hiddleston delivers suffice to say. The problem is he isn't really in the film long enough. Jane Foster, Darcy, and Dr Selvig all get more screen time than Loki. Here's my brilliant business proposition to Marvel. Don't make any movies but Avengers films. Give your golden boy Joss Whedon the four hundred or so million you spent on 'Iron Man 3' and 'Thor the Dark World' and see what he does with it. In watching 'Iron Man 3' and this film it is clear that is where the mindset and passion are. I hope the Marvel cinematic universe can be saved but I have to say that their track record is looking really bad right now. Kevin Feige and Disney should look back at Favareu's first 'Iron Man' film. It was gutsy and took risks and there was no guarantee of immediate endless sequels.",
         "Once again I am re-reviewing this film after viewing it a few more times. Despite its flaws, the film has grown on me immensely. I loved the first Thor, but hated the Avengers. This was a mixed bag but had enough good things to still turn out great. I'll again get straight to the point: The Good: Algrim/Kurse was brutal and superb. He was the most memorable villain in the film. Asgard looked even better. More of the streets and buildings were revealed. Thor got a lot more action scenes in this one compared to the first. Jane was alright. Zachary Levi was a good recast for Fandral. Thor and Loki are at their best here. Loki and Frigga have some heartwarming scenes that further add to Loki's humanity and the anger he feels when she is tragically killed by Kurse. Frigga's death is a very powerful scene because it adds to the drama. Every character feels her death and it is that grief that motivates them to fight back. It added drama to the story and it made it more satisfying to see Loki and Thor team up because at this point, there is powerful emotional drama and great brotherly character development between Thor and Loki that we hadn't seen before in the previous films. They both undergo character transformations after Frigga's death. Loki has a great \"redemption\" moment and I was very relieved when he turned up alive later on as I suspected he would. Thor starts thinking like a king and acting like one which was a great step forward for the character. The brothers have some \"bro moments\" in the film. The Dark Elves were good during the invasion of Asgard because they were menacing and down right creepy with their soulless masks and ruthless fighting style. The middle fight with Thor and Loki fighting Kurse was epic as well as the best fight in the film. Loki killing Kurse and saving Thor was my personal highlight. Loki turning into Captain America to mock him was a great surprise. The Collector obtaining one of the infinity stones for Thanos in the first post credits scene was a brilliant tease for next year's Guardians of the Galaxy and the upcoming Avengers 3. Loki gaining the throne at the end and mysteriously getting rid of Odin was an excellent cliffhanger. The visuals and CGI of the different worlds were also brilliant and the humor between Thor and Loki during the escape scene was witty and entertaining. Heimdall also had his moment to shine. The Bad: Malekith was wasted. Aside from a brief introduction told by Odin at the beginning about who he is and what his plan is, there isn't any other character development for Malekith and he really suffers because of this. He doesn't interact with enough characters only Thor and he never goes into any detail about WHY he is doing what he is doing. It makes sense that he wants to save his world but the film doesn't delve into that. Malekith just goes around destroying things until he gets the Aether. The film doesn't open up his character enough to give him a personality. He comes across as one dimensional. In Avengers, Loki interacted with all the characters and explained his plan and his reasons behind it which was why he was memorable. The problem was he surrendered for no reason after acquiring everything he needed to open the portal in the Germany scene, which made no sense and he was made stupid so that the heroes could stop him at the end. Here its the complete opposite problem. Malekith has a plan that makes sense and how he was carrying out his plan made sense but he doesn't interact with any of the heroes except Thor and he doesn't get developed enough to be a memorable villain with an interesting personality like Loki in Thor and partially in The Avengers. Algrim/Kurse was slightly more developed than Malekith was, it was that bad. Certain characters like Lady Sif and the Warriors three that were promised larger roles instead were minor. The final battle was disappointing. It felt rushed and again Sif, the Warriors three and Loki are not present when they should have been to make the fight more memorable. The Dark Elves fates are not shown, only Malekith is shown dying and his death is so anti climatic its laughable. Kurse got a good death but it happened too early. He should've died in the final battle instead, it would've allowed him more screen time than he had as he was easily the most interesting opponent, due to his strength he made the middle fight tense and his absence at the end is greatly noticed. The Earth scenes are so boring in this one. In the first one they were great because Thor was learning to be a better man. But here, there is no reason for them. The characters of Darcy and Selvig were written well in Thor and the Avengers (Selvig only). But here, they are utter crap and are there purely for comedy, especially Darcy she is so pointless and unfunny. In general like Avengers and Ironman 3, there was way too much cheesy forced humor that killed some of the tension and the drama during the climax. I like humor if its dry, witty and natural but this was brain dead and appalling. The second post credits scene was a letdown. I was expecting something like The Collector giving the infinity stone to Thanos instead of simply Thor reuniting with Jane on Earth. Overall, Thor The Dark World despite a few flaws, is a great sequel to Thor and got Phase two back on track after the appalling Ironman 3. A worthy edition to the franchise with the best bits being the Thor/Loki/Frigga/Kurse emotional drama. 6/10.",
         "Thor: The Dark World left me wondering why for all its popularity and box office hype the superhero genre so regularly fails to ignite the faintest trace of excitement and imagination in its narrative and storytelling. This sequel, following Kenneth Branagh's reasonably funny 2011 film, was written by no less than five writers, who between them have only mustered another dull, achingly generic story about saving the world. Aside from less than a handful of funny self-referencing points, this is a hugely disappointing by the numbers blockbuster that under services its embarrassingly rich cast and offers its enormous fanbase too little that is challenging, inspired or even surprising. What's confusing about the deliberate complacency in the script is that it's entirely unnecessary. There is no financial risk to comic book adaptations anymore to justify this kind of dumbing down. Earlier this year, Iron Man 3 became one of the top five highest grossing films of all time. While Christopher Nolan's Batman films have achieved financial success without succumbing to simplified narrative lines. Some even complained The Dark Knight Rises had too many story threads. How many filmmakers today would crawl over broken glass for a cast featuring Chris Hemsworth, Natalie Portman, Anthony Hopkins, Idris Elba, Tom Hiddleston, Chris O'Dowd and Stellan Skarsgard? With such talent it's not unreasonable then to ask for more than obligatory special effects and indistinguishable villains, who are included only to prop up pseudo- scientific plot points. Little effort has been exhausted into humanising these characters. Thor (Hemsworth) is a blank slate who swings his hammer and growls at people. It makes Chris Hemsworth look like a boring actor when we've seen how charismatic he can be, like he was in Rush, with the right material and director. There are fewer fish out of water jokes that I enjoyed in the first film. Natalie Portman, normally a delightful, charming actress, is embarrassed here as Thor's girlfriend, playing a character devoid of plausible emotional responses and desires. Her first reaction after being warped from London to Asgard is to say \"Hi!\" and \"Let's do that again!\" Never mind that her skin is now infected with the Aether, a weapon of mass destruction from an ancient group called the Dark Elves (who speak perfect English no less). She's more impressed that Thor told his dad about her! The Dark Elves are led by Malekith (Christopher Eccleston), who wants to use the Aether to destroy the world. Comic book films rise and fall on the quality of their villains. The Dark World has two, both of whom are substandard. The Dark Elves, branding swords and laser weapons, aren't very interesting. Though Thor's brother Loki (Hiddleston) sometimes brings comic relief to the film's dry, seriousness (I did enjoy one clever shape shifting moment) he still doesn't possess the physicality of Tom Hardy's Bane to be a truly menacing physical threat. Locked up in a cell for nearly half the film, there's not a lot for Loki to do. What should also be a haunting surprise at the end of the film is badly telegraphed. When Thor and Loki inevitably team up, the brothers take a few more punches than you might expect, but still recover very quickly, even after a severed hand. Marvel is a subsidiary company belonging to Disney so this is largely bloodless action. This is the first comic book feature film by Alan Taylor, who replaced Patty Jenkins under controversial circumstances. Taylor has worked on television shows like Game of Thrones, and he brings little distinction to the action and the way the story is told. The camera isn't particularly mobile and significant plot lines like the Aether are lazily signposted through the film's prologue. He opts to intercut Thor's main story with a subplot involving Jane's scientist friends back on Earth, including an overly excitable Kat Dennings, who are discovering the alignments of Asgard's nine realms, if that matters. Sometimes they lighten the mood but they're still cornball stereotypes (the wacky sidekick, the crazy scientist and the dorky intern) that don't instill any visible subtext to the plot. The two narrative threads collide with Taylor's most elaborate set piece, as Thor fights simultaneously between universes, a battle that is undone by Thor's own indestructibility. Over the closing credits are shots of the film's concept art, which could be totally interchangeable with most of the plotting. It's time that comic book fans started to demand more from these films before the entire genre evaporates into a disposable, commercialised heap like it does here.",
         "I am not sure where to begin.... Maybe I was a bit lost because I never saw the first \"Thor\"...and I am not familiar with the character and what he is all about... But regardless...this movie was rambling and disjointed. All the characters were so superficial and one dimensional that I did not care in the least what happened to any of them. Apparently the entire universe was at risk, and this film managed to make that prospect completely boring and leave the viewer 100% indifferent about the outcome. Impressive. There were a few attempts at humor thrown into the movie. They were all childish...they failed...and in fact were so \"unfunny\" they made me cringe. About Thor. How interesting is a character who is apparently entirely omnipotent....? Near as I can tell, he can neither be hurt nor killed....and can travel the universe at more than the speed of light. Yawn. I have enjoyed Natalie Portman in many films...but even she could not contribute anything useful to this turd. Having said all this...as of this writing this movie has a 7.6 IMDb rating. I don't get it... I felt I had to post an honest review to counter that nonsense.",
         "Let me start off by saying I had fairly high expectations for this film, not only being a fan of the first film but of Thor as a comic book characters. To be nice, these expectations were not met. To be realistic, this is easily the worst of the Marvel movies. This is my first review so sorry if I jump around a lot with what I say. Let's begin with the characters. Thor was.. okay. He said nor did anything noteworthy really. He didn't grow that much as a character, and simply felt boring. Natalie Portman was horribly boring to watch, and in some scenes her character was written as an idiot. That seems to be a common problem with the movie. Jane Foster? An idiot. Eric Selvig, an originally intelligent character that had some serious, good talks with Thor? Running around naked because the Tesseract made him go insane... or something. It wasn't very clear. Speaking of, if he went insane because of the Tesseract, why was Hawkeye completely okay after a bonk on the head? Darcy? The most annoying girl on the planet. She was meant for comedy but came of as GRATING to listen to and watch. Odin was a douche who didn't know how to rule properly. Malekith was just... boring. The makers had so much to work with, considering in the comics what a clever sorcerer he is, as well as a deranged homicidal madman. In this movie his motivations are unclear and his only character trait was he likes to frown at things with his puffy looking face. Character wise the only saving graces were Idris Elba as Heimdall and Tom Hiddleston as Loki, which did not matter much considering how little they were in the movie. Which is strange because Loki is in the trailer so much, but has MAYBE 20 minutes of screen time. The special effects in this movie were just ugly. Every monster looked fake and many of the scenes looked like they were pulled out of a last gen video game. the set design was okay, but not once did I feel immersed. Everything felt like a flimsy set. It was just an ugly movie to look at. The plot was just all over the place, with cuts to different scenes happening frequently. Many scenes were completely useless could have been cut altogether. Literally the only good scene was when Loki and Thor trick Malekith. Also, considering it was never explained how Loki was able to survive a stab wound, switch places with a guard, then switch places with Odin becoming the new leader of Asgard, the ending makes absolutely no sense whatsoever. The dialogue was just... horrendous. There were multiple points where myself and the people I've seen the movie with just laughed at the ridiculousness of what was being said. Speaking of, the movie was farrrrrr too funny. Don't get me wrong, I like comedic relief in these Marvel movies, it works for the established universe but GOD they literally play every scene for comedy it seems. Even the final world ending battle with Malekith was played for comedy. For Christ's sake, THOR RODE TO THE BATTLE IN A SUBWAY CAR. There's a gag where him and Malekith are sliding on the side of a building with office people looking outside blankly, completely meant for comedy.. IN THE FINAL, WORLD ENDING BATTLE. Avengers, Thor, Iron Man 1,2 Captain America, all these movies had the common sense to put the comedy in scenes where it was necessary. Hell, even Iron Man 3, the most comedic movie behind this one had the common sense to say \"This is the final battle. Let's make this badass\". Another problem with the final battle itself is that it has no 'WOW' moments. There's no real climax, everything is just bleh. OH and Malekith is squished by his spaceship. That's something. Oh and why the hell do Asgardians and Dark Elves have so many technological based things?! They have star ships, turrets, laser cannons, ray guns, etc. There's nothing here that feels like magic, which is what Thor should be about. And the Aether. The main point of the movie. The weapon to spread darkness throughout the universe essentially ushering an era of rule under Malekith. I couldn't tell you a damn thing about this thing other that it spread... darkness. whatever that means. The concepts that this movie is trying to give are incredibly under explained. Where did the Aether come from? Not explained. How did Jane end up actually finding it? Not sure. What's the Convergence? It's when the 9 realms line up so Malekith can... spread... darkness?.. How powerful is it? I have no idea. Apparently universe shattering, but Thor doesn't have much trouble fighting an Aether powered Malekith. It's actually kind of sad how easily he was dispatched. There is little fun to be had in this movie. It's just stupid. I didn't care about a single character besides Loki, who was actually somewhat developed and easily stole the show when he was on screen. This movie is absolute garbage and has ruined Thor cinematically for me. I truly hope Captain America: The Winter Soldier and Guardians of the Galaxy are good or I truly worry for the Avenegers 2. Please save your money. Don't see this movie. Don't tell the studios that this Transformers 2 level garbage is okay to put out, that these characters are okay to ruin. In the end, I give this movie a 2 out of 10, because Idris Elba was good, Loki was fantastic, and it had a single scene in the movie where it gave me a glimmer of hope that it would be redeemed. I'm sure I have far more to address but I'm trying really hard to forget this film and reread the latest Thor comic epic, Gorr the God Butcher. If you want to see some good Thor, read that rather than watching this. Please.",
         "Well they got the \"dark\" part right. Does it distress anyone at all that somewhere deep in the bowels of Hollywood there are people who make many times what you make for coming up with the idea that watching a lot of banging and clanging in an alternate universe that -- at its best -- resembles Central Park at midnight is .... entertainment? If it does not, it should. The problem with sequels like this -- aside from the fact that they are actually produced in the first place -- is that they serve no useful purpose other than making the original in the franchise look better than it was. I promise you, IN THE NAME OF ODIN AND ALL THE 9 WORLDS, that half way through this exercise in controlled depression, you will long for Thor 1. (With its really clever opening -- essentially the story of a Boy and his Hammer, having been separated therefrom, and finally reunited). Tom Hiddleston steals all his scenes, in some places he is more interesting huddled in a corner reading a book than all the CGI flashbangs and associated pyrotechnics combined. Sir Anthony -- a man seemingly untroubled by how poorly this phase of his career pales in comparison to his prior work -- is lost behind his eyepatch and almost unrecognizable. Portman has never had better H&M (hair and makeup) and in the chatgroups there are fanboys prattling on about watching this with the sound off. A final factoid: In the 60s, in the days when Marvel was only comics, Thor was never top gun, it was the artwork (flaming yellow hair) and the pleasant predictability of the stories and the arcane language that carried the brand. So far, Marvel has yet to really translate this into film.",
         "Following on from the events of the Avengers movie, Thor is back in Asgard, delivering Loki, who is damned to spend an eternity in the Asgardian dungeons. Jane is in London, still pining for the titular character, as she hasn't seen him for two years, but still holding out for him. But there is a new threat from the dark elves. They seek an elixir type essence that will cause darkness amongst the nine realms. Jane however has found a portal into one of the realms, and gets infected by the essence. Because the dark elves can trace this source, Thor rescues her and takes her back to Asgard, much to Odins dismay. But the elves plan an attack on Asgard, and after many lives are lost, Thor realises that only one person can help him, and he's damned for the rest of his life.... The first movie was wonderful. Not only was it exciting and refreshing, but it was one of the funniest Marvel movies released yet. This however takes a huge step back, and really taints phase two of the Marvel releases. Hemsworth is as good as ever, as is Hiddleston, but apart from Portman, it appears that the rest of the cast have been sidelined, so Thor and Loki can carry on their war of nerves. It's also very convoluted, narrative is lost as there is so much going on, and by the end of it all, you wondered what on earth went on, an also what happened to a few of the characters, there are plot holes aplenty. The humour what was wonderful in the first movie, feels really forced in this, and instead of causing unexpected laughter, had me rolling my eyes as to how silly it felt. Dennings is a thorn in the movies side, she is a parody of her character from the first, and ruins every scene she is in. The best joke in the film, which was in the trailer, steals from Raiders of the Lost Ark anyway. Visuals are bland and boring, and Asgard feels like something from The Phantom Menace, combined with Flash Gordon, and the rest of the realms could have come from any Lord Of The Rings movie. Its a shame, because Marvel know they have a winning formula, but here it feels like they are just in it for the money, and all the cool references and a brilliant cameo, cannot save such a disappointment. Many will call it Thor-some and other play on word praises. But for me, and I really hate saying this because Hemsworth is really good, it's pretty Thor-ful."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Fantasy"
      ],
      "productionCompanies": ["Marvel Studios"],
      "summaries": [
         "Thousands of years ago, a race of beings known as Dark Elves tried to send the universe into darkness by using a weapon known as the Aether. Warriors from Asgard stop them but their leader Malekith escapes to wait for another opportunity. The warriors find the Aether and since it cannot be destroyed, they try to hide it. In the present day, Jane Foster awaits the return of Thor although it has been two years since they last saw once another. In the meantime, Thor has been trying to bring peace to the nine realms. Jane discovers an anomaly similar to the one that brought Thor to Earth. She goes to investigate, finds a wormhole, and is sucked into it. Back on Asgard, Thor wishes to return to Earth but his father, Odin refuses to let him. Thor learns from Heimdall, who can see into all of the realms, that Jane disappeared. Thor then returns to Earth just as Jane reappears. However, when some policemen try to arrest her, an unknown energy repulses them. Thor then brings Jane to Asgard to find out what happened to her. When the energy is released again, they discover that when Jane disappeared, she crossed paths with the Aether and it entered her. Malekith, upon sensing that the time to strike is now, seeks out the Aether. He attacks Asgard and Thor's mother Frigga is killed protecting Jane. Odin wants to keep Jane on Asgard so that Malekith will come. Thor disagrees with his plan, so with his cohorts, he decides to take Jane away. He enlists the aid of his brother, Loki. Unfortunately, Loki's motivations remain unknown.",
         "There are nine realms of Asgard and once every 5,000 years they align. Earth happens to be one of these realms. These realms create portals between the worlds during the alignment which is called \"Convergence\". On Earth, in London, Jane Foster believes she and her crew have discovered one such portal. Foster, while investigating the phenomenon, is transported to another realm and comes in contact with a substance called Aether. Upon coming into contact with the substance, it draws Thor from Asgard back to Earth. Thor takes Jane to Asgard to be cured from the Aether. Unfortunately in doing so it draws more than just Jane to that world. Another being called Malekith wants to use the Aether to destroy Asgard. Devising a plan with his brother - the war criminal Loki, Thor heads to \"The Dark World\" to destroy the Aether and save Asgard. But can Loki be trusted?",
         "Odin recalls when his father Bor and the warriors from Asgard vanquished the evil Dark Elves and their leader Malekith that wanted to send the universe into the darkness during the convergence of nine realms unleashing the powerful weapon Aether. Mallekith escapes and Bor hides the Aether in-between two stone columns. In the present days, on Earth, the scientist Jane Foster that is waiting for the return of Thor, investigates a gravity phenomenon in an abandoned factory with her assistant and her intern. She finds the column where the Aether is hidden and the substance possesses her. In Asgard, Heimdall reports to Thor that Jane has disappeared. Thor returns to Earth and finds Jane; but when he sees that he has a strange energy protecting her, he brings Jane to Asgard to be healed. However, Malekith also awakes and goes to Asgard to retrieve the Aether. After a bloody battle, Frigga is murdered by Malekith and Thor proposes treason to his warriors friends of Asgard and teams up with Loki to seek revenge for the murder of their mother and to vanquish Malekith before he destroys Asgard with his Dark Elves.",
         "When Dr Jane Foster gets cursed with a powerful object, Thor must protect it before an army and its ruthless leader try to get their hands on it to take over the remains of Earth."
      ],
      "budget": 170000000
   },
   "movielensId": 106072,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-10-29",
      "dvdReleaseDate": "2014-02-25",
      "directors": ["Alan Taylor"],
      "runtime": 112,
      "movieId": 106072,
      "title": "Thor: The Dark World",
      "mpaa": "PG-13",
      "actors": [
         "Chris Hemsworth",
         "Natalie Portman",
         "Tom Hiddleston",
         "Anthony Hopkins",
         "Stellan Skarsgård",
         "Idris Elba",
         "Christopher Eccleston",
         "Adewale Akinnuoye-Agbaje",
         "Kat Dennings",
         "Ray Stevenson",
         "Zachary Levi",
         "Tadanobu Asano",
         "Jaimie Alexander",
         "Rene Russo",
         "Chris O'Dowd",
         "Alice Krige",
         "Elsa Pataky",
         "Benicio del Toro",
         "Ophelia Lovibond",
         "Jonathan Howard",
         "Tony Curran",
         "Clive Russell",
         "Richard Brake",
         "Chris Evans",
         "Stan Lee",
         "Ramone Morgan",
         "Obada Alassadi",
         "Imaan Chentouf",
         "Claire Brown",
         "Henry Calcutt",
         "Ava Caton",
         "Abbie McCann",
         "Thomas Arnold",
         "Sam Swainsbury",
         "Connor Donaghey",
         "Royce Pierreson",
         "Annabel Norbury",
         "Sophie Cosson",
         "Justin Edwards",
         "Gruffudd Glyn",
         "Steve Scott",
         "Brett Tucker",
         "Talulah Riley",
         "Richard Wharton"
      ],
      "imdbMovieId": "1981115",
      "originalTitle": "Thor: The Dark World",
      "genres": [
         "Action",
         "Adventure",
         "Fantasy"
      ],
      "youtubeTrailerIds": [
         "npvJ9FTgZbM",
         "7p7rocHEecE",
         "I_tOrWWRivM"
      ],
      "plotSummary": "Thor fights to restore order across the cosmos… but an ancient race led by the vengeful Malekith returns to plunge the universe back into darkness. Faced with an enemy that even Odin and Asgard cannot withstand, Thor must embark on his most perilous and personal journey yet, one that will reunite him with Jane Foster and force him to sacrifice everything to save us all.",
      "tmdbMovieId": 76338,
      "avgRating": 3.37385,
      "releaseYear": "2013",
      "numRatings": 4574,
      "posterPath": "/bnX5PqAdQZRXSw3aX3DutDcdso5.jpg"
   }
}