{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "clown",
            "id": 3199
         },
         {
            "name": "skeleton",
            "id": 4062
         },
         {
            "name": "sadism",
            "id": 4426
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "tavern",
            "id": 11705
         },
         {
            "name": "pirate",
            "id": 12988
         },
         {
            "name": "sailor",
            "id": 41599
         },
         {
            "name": "tomb",
            "id": 156081
         }
      ],
      "imdb_id": "tt0070013",
      "video": false,
      "title": "The Demoniacs",
      "recommendations": [
         30567,
         35718,
         29129,
         22480,
         28802,
         36835,
         29562,
         39931,
         42676,
         39342,
         29565,
         91487,
         31624,
         29128
      ],
      "backdrop_path": "/lBWP6vsBLL2n263qbqvYoGnyl6I.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "MoHA",
         "id": "55e789e8c3a3682c7600029b",
         "content": "Jean Rollin’s name may be synonymous with vampires however anyone with a knowledge of Rollin’s entire body of work knows the man was far from a one trick pony. Rollin had a signature directorial style that was not only almost instantly identifiable but he had the ability to bring that style to basically any subgenre within the realm of horror and the fantastic and make it work. Not too many filmmakers would even think of approaching a zombie film the way Rollin approached The Grapes of Death (1978) or The Living Dead Girl (1982). While obviously influenced by early Cronenberg, Night of the Hunted (1980) is an emotional piece of surrealist sci-fi that is quintessentially Rollin in execution, and even a film like The Escapees (1981) which on the surface may seem a bit atypical at first glance has Rollin’s fingerprints all over it. By 1974 Rollin had essentially found and perfected his style with films like Shiver of the Vampires (1970) and Requiem for a Vampire (1971) under his belt so it was interesting (albeit in true maverick fashion) that he decided to try something different after those films which resulted in the minimal masterpiece The Iron Rose (1973), and Rollin’s return to the horror genre following two erotic films, 1974’s The Demoniacs, one of the oddest and most original revenge films from the 70’s was again something different yet unmistakably Rollin.\r\n\r\nAfter looting the contents of a crashed ship which they purposefully lured into rocks, a gang of pirates or “wreckers” brutally rape and leave for dead the two young girls who were the only survivors of the wreck. Wracked by the nervousness of having their crime discovered and with the Captain seeing visions of the girls, the gang set out to find the girls and finish them off for good however they escape again, finding they way to some ruins on the edge of the village where the girls encounter the guardians who inform them of a powerful demonic entity imprisoned in the ruins. The girls release the demon who in turn rewards them with the powers needed for one night to exact their vengeance on the pirates.   \r\n\r\nTechnically, The Demoniacs (Les démoniaques) could be seen as a rape/revenge film however with this being a Rollin film it is unlike any other rape/revenge film to come before or after it. What could have been a fairly straightforward tale of revenge becomes something else entirely with Rollin throwing in various random ingredients including superstition, cursed villages, guardian clowns and prostitutes with second sights. Not much back story is given regarding the demon jailed in the ruins or just how or why the village is cursed so the film probably won’t make much sense to those not familiar with Rollin from a narrative perspective, however it doesn’t need to as like all Rollin films, subconsciously it all resonates with no explanation needed. Obviously given the subject matter it doesn’t take much to make the two girls (one of Rollin’s most recognizable motifs) who’s names are never revealed easy to sympathize with and root for, and the two actresses portraying the protagonists both have incredible screen presence, especially Lieva Lone in sadly her only known film role. The same can be said of the pirates with John Rico as the lunatic Capitan and Joëlle Coeur who easily steals the show as the Tina, the one female in the group who is perhaps the most sadistic out of the four who really goes for it during the films gut punch of a finale, defiantly one of Rollin’s most stinging climaxes which is only made more so by the morose piano music courtesy of Pierre Raph.\r\n\r\nInteresting to point out that actress Mireille Dargent who plays the clown in the ruins also played the graveyard clown in The Iron Rose. Other Rollin regulars are also featured in the film, most notably Louise Dhour as the all knowing prostitute conveniently named Louise and Paul Bisciglia in the role of one of the pirates should be a familiar face to Rollin fans as well. Another interesting fact regarding the film was the 1st AD was Miletic Zivomir, the actor playing the demon and was apparently quite useless in the role of 1st AD, so writer and friend of Rollin’s Jean-Pierre Bouyxou who was originally to be just an extra in the film basically took over 1st AD duties. Its also worth noting that the film was Rollin’s first to have decent budget and the money did come in handy giving the film a much “larger” or “grand” feeling. Still, even with the budget it still didn’t prevent the production of the film from being prosecuted by Murphy’s Law as detailed by Tim Lucas in the liner notes to Redemption’s remastered DVD. Even still, the finished product is one of the most unique entries in Rollin’s already unique body of work and a film that Rollin fans who’ve yet to see the film would benefit from checking out as it’s a prime example of Rollin’s unmistakable style as well as his versatility.",
         "url": "https://www.themoviedb.org/review/55e789e8c3a3682c7600029b"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tina",
               "gender": 0,
               "credit_id": "52fe45cbc3a368484e06f277",
               "name": "Joëlle Coeur",
               "profile_path": null,
               "id": 104220,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Captain",
               "gender": 2,
               "credit_id": "52fe45cbc3a368484e06f27b",
               "name": "John Rico",
               "profile_path": null,
               "id": 28613,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bosco",
               "gender": 0,
               "credit_id": "52fe45cbc3a368484e06f27f",
               "name": "Willy Braque",
               "profile_path": null,
               "id": 44412,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe45cbc3a368484e06f283",
               "name": "Paul Bisciglia",
               "profile_path": "/9qljC7F1Ydo6l6J4cHV8w2aiUu0.jpg",
               "id": 24303,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Demoniac #1",
               "gender": 0,
               "credit_id": "52fe45cbc3a368484e06f287",
               "name": "Lieva Lone",
               "profile_path": null,
               "id": 104221,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Demoniac #2",
               "gender": 0,
               "credit_id": "52fe45cbc3a368484e06f28b",
               "name": "Patricia Hermenier",
               "profile_path": null,
               "id": 104222,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Louise",
               "gender": 0,
               "credit_id": "52fe45cbc3a368484e06f28f",
               "name": "Louise Dhour",
               "profile_path": null,
               "id": 102949,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Exorcist",
               "gender": 0,
               "credit_id": "52fe45cbc3a368484e06f293",
               "name": "Ben Zimet",
               "profile_path": null,
               "id": 104223,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Clown",
               "gender": 0,
               "credit_id": "52fe45cbc3a368484e06f297",
               "name": "Mireille Dargent",
               "profile_path": null,
               "id": 102947,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Devil",
               "gender": 0,
               "credit_id": "52fe45cbc3a368484e06f29b",
               "name": "Miletic Zivomir",
               "profile_path": null,
               "id": 104224,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Girl in Tavern",
               "gender": 1,
               "credit_id": "52fe45cbc3a368484e06f29f",
               "name": "Monica Swinn",
               "profile_path": "/iCHkmY62477nvQ5USZ7CkZgpVOB.jpg",
               "id": 101699,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Girl in Tavern",
               "gender": 0,
               "credit_id": "52fe45cbc3a368484e06f2a3",
               "name": "Anna Watican",
               "profile_path": null,
               "id": 102046,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Sailor in Tavern",
               "gender": 0,
               "credit_id": "52fe45cbc3a368484e06f2a7",
               "name": "Jean-Pierre Bouyxou",
               "profile_path": null,
               "id": 102047,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Sailor in Tavern",
               "gender": 0,
               "credit_id": "52fe45cbc3a368484e06f2ab",
               "name": "Jio Berk",
               "profile_path": null,
               "id": 104225,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45cbc3a368484e06f273",
               "name": "Jean Rollin",
               "profile_path": "/odV8f23LdkRqYzxKMWBEEMddYZ.jpg",
               "id": 88820,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5534dde09251416f8800226c",
               "name": "Jean Rollin",
               "profile_path": "/odV8f23LdkRqYzxKMWBEEMddYZ.jpg",
               "id": 88820,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5534ddee9251417ae3004ffb",
               "name": "Pierre Quérut",
               "profile_path": null,
               "id": 1379024,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5534de0392514140b5005394",
               "name": "Lionel Wallmann",
               "profile_path": null,
               "id": 1454788,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5534de0fc3a3682226007583",
               "name": "Pierre Raph",
               "profile_path": null,
               "id": 1377457,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5534de1ec3a3680bdc001ce7",
               "name": "Jean-Jacques Renon",
               "profile_path": null,
               "id": 1456940,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5534de2a92514140b5005399",
               "name": "Michel Patient",
               "profile_path": null,
               "id": 1169694,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5534de37c3a368523e003344",
               "name": "Jio Berk",
               "profile_path": null,
               "id": 104225,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 3.979244,
      "production_countries": [
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 29130,
      "vote_count": 10,
      "budget": 0,
      "overview": "A gang of pirates rape the two sole survivors of a ship wreck. The violated girls are rescued by the strange inhabitants of a supposedly haunted island, where they are granted supernatural powers to strike revenge against the pirates.",
      "similar": [
         39988,
         357096,
         73861,
         10781,
         1696,
         10285,
         238636,
         588,
         12619,
         281957,
         74997,
         133805,
         6312,
         67087,
         3134,
         979,
         281,
         156022,
         395834,
         948
      ],
      "original_title": "Les Démoniaques",
      "runtime": 100,
      "poster_path": "/ao21xXCPRfZfoBJ4XHPO79knph7.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Nordia Films",
            "id": 9126,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Général Films",
            "id": 42156,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films ABC",
            "id": 9384,
            "origin_country": ""
         }
      ],
      "release_date": "1974-12-05",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jean Rollin"],
      "runtime": 77,
      "synopsis": null,
      "writers": ["Jean Rollin"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0070013/",
      "coverLink": null,
      "actors": [
         "Joëlle Coeur",
         "John Rico",
         "Willy Braque"
      ],
      "reviews": [
         "If you are here for the rape, you have wasted your time. The scenes are a joke. Even worse, the supposed killing of the two girls (Lieva Lone, Patricia Hermenier). The acting was atrocious. Now, if you want to see Joëlle Coeur (Fly Me the French Way, Seven Women for Satan) fully naked, and engaging in sex with John Rico, that's a whole other story. The Captain (Rico) hardly has time to enjoy the aftereffects when he is visited by apparitions of the two girls. Maybe it was just the booze. The girls do eventually reappear only to escape and find an old castle guarded by, believe it or not, a clown. Not a court jester, but a clown. Strange. They go through the transformation to become demoniacs, and, I am glad to say, sex is part of the transformation. Yes, there is the usual mumble jumble ritual, but there is also orgasm. Don't expect a lot of gore in this film. It really doesn't make sense in a lot of scenes. You'll see what I mean. I think Rollin may have been trying to make an art film instead of a horror film. It is a shame that Lieva Lone and Patricia Hermenier did not stick around to do more films, but another chance to watch Joëlle Coeur is always worth the time.",
         "I have a problem with Jean Rollin films. Despite all the stylish surrealism, great French locations and nudity I still find his films incredibly boring. I do appreciate Rollin's persistence of vision throughout his string of poetic sex/horror exploitation films through the 70s (clowns, castles, twins, beaches) but my mind begins to wander during his films and this is no exception. The plot follows a dream logic known only to the director with too much time spent watching these sailors fight, rape or just sit in a bar. The one female in the sailor gang really does inject some gusto into the her part though.",
         "Bizarre but i liked it, it was well made with some impressive directing from Jean Rollin especially the shot near the Ruins. The photography was superb and the set pieces were awesome!. The ending was creative and the o loved the locations!. The actors really didn't have to do all that much. The story was very interesting if a bit confusing at times, and we get TONS and TONS of nudity!. But the 2 main females just stand there and stare! and don't say anything. There is a bit of gore here but not all that much. we get a beer mug full of blood , a couple stabbings , and a wicked sequence involving glass (i won't spoil it for you. The acting is okay but they really didn't have to do all that much. Patricia Hermeneir and Lieva Lone are both hot but all they had to do was stare and act scared. John Rico does fine as the captain and did what he had to do well. Willy Braque does okay here as Bosco but didn't have to do that much. Paul Bisciglia is the comic relief here and Joelle Coeur is beautiful but didn't have to do much except act crazy and take her clothes off. Overall well worth looking for if you can find it was on digital cable a channel called the Scream Channel (a bunch of others were too. *** out of 5",
         "Hell, it's even worse than Rollin's later film TWO ORPHAN VAMPIRES (1997), and that's pretty bad. The only redeeming thing about this film is looking at luscious Joelle Coeur's naked body. She did a few other unremarkable films in the 1970s and then promptly disappeared. Coeur couldn't act worth a damm, but she sure was great to look at. Anyway, two blond-haired girls are shipwrecked on shore and are raped and murdered by the scavengers who lured their ship up on the rocks with lights. There's just a lot of rolling around on the ground and it didn't look very violent to me. Their spirits make a pact with the devil(?) who doesn't even look like a devil in some old church ruin near the shore. There's also a mime or woman in a clown suit who serves no purpose at all. The story is flaccid and hackneyed, the acting is awful (the worst I've ever seen for a French film), and the sets are too bright. There's nothing scary or interesting going on at all except for Tina (Joelle Coeur) taking off her clothes and prancing around nude all the time. Oh yes, she has a soft-core sex scene with the lead scavenger captain (John Rico) who looks old enough to be her father. It has all the feel of a bad Jess Franco film. Terrible. 1 out of 10",
         "Dear oh dear. It might be easy to take cheap swipes at M. Rollin, but this looks likes such an amateurish effort. Terrible acting, contrived and sloppy action, meandering plot, cheap props. I hate to twist the knife, but it certainly breathes new life into the expression \"Z-grade\". The video blurb looked so promising - two girls raped by wreckers, take refuge in an abandoned abbey where they make a pact with the Devil to seek revenge. But Jean Rollin seems determined to disappoint. Way too much time is spent on watching people walking long distances, or labouring blindingly obvious plot developments (the psychic brothel madam excels at this!) There is not nearly enough skin to compensate for having to sit through this, though some spiritied sex scenes do capture the attention. The biggest draw of the film for me was the female member of the wrecker gang (character Tina). I wish I knew who the actress was. Gorgeous, spirited, and great without clothes! Shame she can't act, but I may excuse her. I have a soft spot for beautiful girls who get sexually aroused by wicked deeds. Bizarre points include the Devil's two attendants - a female clown, and a Rasputin look-a-like. And never did so much plaster statuary give its life for a movie! In summary, only rent this video for the gorgeous female wrecker, fast forward through the rest.",
         "Les Demoniaques, or Demoniacs as it is largely known under in English speaking country's, starts on a beach where a gang of four people, one known as the Captain (John Rico), his right hand man LeBosco (Willy Braque), Paul (Paul Bisciglia) & an attractive but deadly woman named Tina (Joelle Coeur) wave lanterns to attract ships which then get wrecked on the rocks & sink at which point they steal anything of any value, these gangs are known as 'wreckers'. This particular night things go well & they recover some loot, suddenly they see two young women (Lieva Lone & Patricia Hermenier) stagger ashore, obviously survivors from the shipwreck. LeBosco & Paul rape, beat & generally abuse them while the Captain & Tina have sex together. The gang leave the women for dead & wander off into the night, the Captain ends up at the local tavern where he begins to have spooky visions of the two women while the landlady (who happens to be psychic) Madame Louise (Louise Dhour) becomes suspicious. The two women manage to make it to the apparently cursed ruins of a Church where the devil resides in a crypt protected by a guy with a long beard & a woman dressed as a clown (Mireille Dargent), they release the devil who gives them the power to extract a terrible revenge on the gang of wreckers... This French Belgium co-production was written & directed by Jean Rollin who made quite a few of these arty surreal horror sex films of which I have not seen many, however I thought Les Demoniaques was an OK film if not exactly brilliant. The script tries to tell a decent story about supernatural revenge & it does a fair job at entertaining. The film moves along at a fair pace & never becomes too boring although the character development leaves a lot to be desired, no one in Les Demoniaques has any sort of personality beyond whether they are meant to be good or bad. The two shipwrecked women are good & are violated innocents while the wreckers are uniformly evil who never stop drinking, fighting & having sex. There is no depth or subtly here I'm afraid but then Rollin isn't renowned for his writing abilities is he? No, Rollin is far more interested in the visual side of a film which is not a good thing. Lots of things don't make any sort of sense as he tries to mix horror, art, exploitation, sex & supernatural elements with uneven results, I was also expecting a big 'pay-off' for the wreckers at the end which unfortunately never materialised, that alone made sitting through the thing rather unsatisfying. Director Rollin lays on the visual style with Les Demoniaques being a very textured film, I love the old wooden boats, the inside decor of the tavern, the stone work of the Church, the bright almost cartoonish costumes & the dangerous looking jagged rocks of the beach. Personally I think the arty surreal shots in Les Dominaques aren't that distracting, although the scenes in the Church with the clown, crypt keeper & some guy locked in a room who looks more gay than devil like are bizarre to say the least & destroys any credibility that the powerful & graphic opening establishes. There is far more nudity in Les Demoniaques than violence, in fact apart from some fights & a bit of blood there isn't much graphic horror here while the nudity & sex is plentiful including a couple of very graphic & exploitative sexual assaults which do nothing for me personally. You should also be aware that Les Demoniaques was filmed in French & I don't think an English language version exists so the sparse dialogue is subtitled throughout. Les Demoniaques must have been a really low budget affair, there are barely any actors in it, it has about three locations, no special effects to speak of & as a whole it could be described as minimalist. However the locations Rollin chooses are appropriate, from the Gothic Church ruins to a beach full of stranded shipwrecked boats. Obviously the photography is by far the most impressive aspect of the production although I suppose it's generally well made throughout. The acting is pretty poor from all involved especially the two shipwrecked women who are mute for the majority of the film yet still manage to be awful & irritating, oh & that Tina is a nice looking bird with or without clothes... Les Demoniaques is an OK Euro horror sex film from Rollin, if your a fan of his style of film-making then you'll probably love this, if not then you'll probably hate it. But what about me? Well, I'm stuck somewhere between the two, not my favourite film by any stretch of the imagination but I found enough here to entertain on a basic level. My advice would be to think carefully before you give it a go.",
         "This is not one Jean Rollin's greatest works, but it does have one shinning light, Joelle Coeur, the gorgeous female wrecker. Like all of Rollin's films (that I have seen) this one is full of all his artistic visions, but for some reason the film still seems slower in it's pace and is a little more difficult to get into. Like all Rollin's film it's worth watching, but in this instance, only for the gorgeous Joelle Coeur.",
         "A group of shipwrecked sailors brutally rape two young woman and the woman re-emerge after making a pact with the devil to get their revenge. More of the same from Jean Rollin. The music is improved here, but the plot makes practically no sense. Some people have tried to defend the film by saying it should be seen as an \"art\" film. Rollin does indeed have a unique view of art. If you want to see more of the same nude women and pointless sex scenes, this is for you... but as far as plots go, this is not one of Rollin's stronger films. But it does have a clown... so, I guess that might be good?",
         "After being raped and left for dead, a pair of women suddenly starts to invade the lives of the pirate gang that originally killed them after finding themselves imbued with supernatural powers and set out to take revenge on the gang for what happened to them using those powers. This one wasn't all that bad of an art-house-style horror film. As is to be expected given the film's style, a lot of the film's positives reside on the showcasing of it's frequent and oftentimes excessive nudity. From the very beginning, featuring the beach rape of the girls as they're tormented by the gang features plenty of such titillating fare as the girls are captured, stripped, raped and disposed of while the fact that a vast majority of the revenge scenes are handled with the idea of the girls seducing the group one-by-one and then killed them off, give this one a lot of such material throughout the film. Moreover, there are all the inserts of nameless prostitutes and village girls getting fondled and played with alongside the finale of the female leader pleasuring herself to the girls being raped once again in incredibly wild, vivid fashion brings that up a lot as well, and with the general atmosphere found here really gives this one a pretty sleazy feel. As well, the fact that there's plenty of rather interesting choices throughout here because of this showcase gives this a kind of artistic sensibility that comes across far more dynamic than expected. Since the opening shots of the groups' rape and attack of the girls is done almost entirely devoid of dialogue makes for a rather startling and striking opening lasting nearly fifteen minutes before anyone really speaks a word, and the entirety of scenes that go by filled with silence or a more artistic representation really makes this one feel like a much more ambitious film than just straightforward exploitation like the way it's presented here. Even the action scenes, from the all-girls brawl on he ship to the escape from the underground jail are handled more like an art-house film than a traditional horror film and really manage to showcase extraordinary skills here. While these here all manage to make for an enjoyable time throughout here, the film does offer up a huge nagging issue that derails it somewhat slightly in that it never really goes for the horror at times. Not just due to the film's art-house look and feel, but the films' reliance on poetic atmosphere and the group going insane from their belief in what's going on makes this rather shock-less for nearly all of it's run-time despite the general plot line supporting such a potential outcome. The softcore groping and sex scenes don't help matters, but because the revenge finally comes in the last third of the film it rarely feels like much of genre effort and really stands out as the major drawback to this one. Rated Unrated/NC-17: Continuous Full Nudity, strong sex scenes, Language, Mild Violence and several rape scenes.",
         "The first scene on the beach with the young girls rape and attack is very good and the next one in the bar with them appearing as ghosts too... Unfortunately the movie doesn't go on like that all the time. There are good and bad moments but the scenes of nudity with Joelle Coeur are erotically very good. The story of the demon in the ruins doesn't appear very clear, nor does the clown's and the ruin's keeper destinies... But all in all there is a good atmosphere even if some scenes are a bit too long and some of them are great, like the one where the religious statues fall one after each other on the ground. Jean Rollin knows how to mix sex and horror, as well as many other authors of that 70's era. A good moment but that movie could have been better again...",
         "Four pirates(..labeled \"wreckers\" for they draw ships with light crashing into the shore to pillage them)ruthlessly rape and assault two blond young women as they walk to shore, appearing from the darkness in nothing but gowns. Soon the Captain(John Rico), already insane, is haunted by ghostly apparitions of those two girls they left for dead on the shore. Yet, somehow, the girls survive fending off yet another proposed attack by the pirates, making their way to the \"haunted ruins\" which holds a demonic presence, imprisoned by two guardians who can give them the power they seek in weakness needed for revenge. I really enjoyed this one, even if I was often left with my jaw open wondering what the hell was going on. I couldn't help but snicker when the twins make to the haunted ruins and are greeted by the female clown. Many would probably throw their hands up at that, but I couldn't help but love such an audacious move by Rollin to throw a modern image inside a film representing pirates. I loved the brothel pub hybrid with patrons fondling the gals as our clairvoyant Madam plays the piano when she isn't foretelling doom. I like how over-the-top the pirates are, even Tina(..let me stop for a moment and gain my composure)who Rollin films in nearly every scene naked, delighting in her devilish ways. Take, for instance, the Captain who lifts his mug to drink with beer spilling out all over himself, or Bosco(Willy Braque), always morose until he begins to trash the fisherman's bar and brothel.The film is Joelle Coeur for me. There's one image I'll always have to summon every now and then. Rollin's camera eyeballs a naked Coeur with her arms stretched to the heavens after their conquest and corruption of the innocence of two girls who had just lost everything. The camera slowly pulls away as she stands, enjoying every minute of the atrocities committed. How Coeur can't help herself as her men ravage their bodies, tearing their already shredded gowns, in a state of ecstasy. She craves this type of cruel activity, embellishes the evil they partake in. The wrecking is child's play compared to the rape and destruction of innocence. I liked how Rollin gets his skeleton and bat in the film, by using them as \"decoration\" in the brothel-pub. Oh, and I loved that winged creature statue in the brothel-pub as well(..I believe Rollin shoots one of the girl's apparitions next to it when they haunt the Captain).The ruins left me in a state of bliss, particularly how Rollin shoots the female clown guiding the girls to the \"crypt-watcher\"(..he looks like a Russian czar, or something)down those massive steps. And, when the girls remove their shirts making their way to the prisoner's cell to release him.. One of my favorite techniques established by Rollin is how he follows his female beauties, either naked or clothed under a gown or shirt(..just long enough to cover their crotch), holding a candle to guide themselves, as they make their way to a specific destination.I also liked how the final sequence ends with water engulfing the main characters. Oh, and my favorite scene, besides the bedroom sequence where the Captain is fondling a bird he'd later rip into as Coeur slowly gets naked, is a certain character's death as a piano plays on it's own.",
         "This film was garbage. plain and simple. It did not have the gore to make up for its weak story line. It did not have enough sex to make up for its lack of gore. There was not enough nudity to shock in place of gore and sex....YIKES! I guess I am twice as bitter, because i bought this DVD sight unseen. It does not even have any camp value. The closest thing i can compare it to is an ABBA video gone horribly awry.",
         "Demoniacs, The (1974) ** 1/2 (out of 4) Four crooks (three men, one woman) work as \"wreckers\" as they lure ships to the shore only to make them crash on the rocks so that they can loot them. The latest ship had two beautiful women (Lieva Lone, Patricia Hermenier) wash up on shore so they're raped and eventually killed. The two women then sell their souls to the devil so that they can come back and kill those responsible for their fate. This French-made horror tale isn't the best that director Jean Rollin has to offer but there are enough interesting moments to make it worth viewing to fans of his. Those unfamiliar with the director will probably want to start elsewhere because while this has some good stuff in it, at the same time you can't help but be disappointed that it's not better. The biggest problem with the film is that the 95-minute running time seems a lot longer and there are way too many scenes where nothing happens except people just walking around doing nothing. There's no point of them walking around as it adds nothing to the story so it would have been best had the director just edited these out. I'm not sure if he was under pressure to release a film at a certain length but his slow style certainly doesn't help here. Another problem with the film is that it never really seems to know what it wants to be. Is it a ghost story? Is it more concerned about the sex and nudity? When the Devil does show up and make his deal nothing really plays out as you'd expect. There's even a bizarre clown thrown in for some reason. Perhaps Rollin just thought clowns were scary? The best thing going in the film are some of the performances by the beautiful ladies. I thought both Lone and Hermenier were very good playing the roles of the dead girls. The film certainly doesn't ask too much out of them except, for a time, to be scared and at other times being \"death\" like and they do this just fine. The real scene-stealer is Joelle Coeur as the beautiful but deadly female wrecker. She's certainly very fun in the role and her beautiful body really doesn't hurt either. Fans of Jess Franco will want to be on the lookout for Monica Swinn but I was unable to spot her. Being a Rollin film one can expect all sorts of nudity and we also get some mild gore but nothing strong enough to keep horror fans interested. The low-budget seems a lot smaller than most of Rollin's work and one can't help but wish a little more was done with the story.",
         "An allegory of some sort. The film revolves around \"wreckers,\" bandits who beached boats and raided the spoils. We are introduced to a captain, his sadistic girlfriend, a drunk, and the Other Guy. While out raiding crashes one night, out of the ocean emerges two beautiful blonds. The pirates rape the girls. The next day, the captain has visions of the girls. Still alive, they wander into haunted ruins, guarded by a woman in clown make-up and Rasputin. They make a deal with a man locked in a prison under the hill, who might be the devil. He deep-dogs them both and grants them the powers they need for revenge. \"The Demoniacs\" doesn't have much in way of pacing. We lull slowly from one location to the next. The bandits try to kill the girls, without much success. A cross-dresser plays ominous songs on a piano. It drags until we get to the ruins. The moss covered chapels and rotting churches are gorgeous and make a memorable setting. The clown woman is bizarre, especially her first appearance perched on a rock. A man drinks out of a giant bottle before tripping and slicing his neck on the glass. Dead bodies sink into mud as the tide rolls in. The bow of a ship, an animal skull placed there, disappears slowly under the waves. As you'd expect, female nudity abounds and Rollin frequently frames the nubile bodies in a greater tableau, such as a stark naked babe standing on a bed in a ruined room, chastising the cowering men. Once empowered by the devil, you'd think the movie would become a rampage of revenge. Not quite. The girl's abilities come with a few strings attached. In the last ten minutes, the movie descends into almost pure allegory, as the mute girls (Did I mention they're mute?) are set upon by their attackers. Nature intercedes each time, cutting down the villains. Our protagonists are raped again, their much touted innocence further sullied. I think that's what the movie is getting at, something about the death of innocence. I'm not sure. There's some camp. The sadistic woman tries to corner the girls in an abandoned church. They use their powers to make statues fall around her. That's got to feed into the film's theme, statues of Mary and saints shattering. The mute girls hilariously direct the statues by waving their arms stiffly. Despite being a period piece, everyone is dressed in pastels and spandex. There's a lot of stereotypically French stripy shirts. The Devil looks like a swarthy seventies lover. A 1800s pirate in bright red stretchy pants is pretty comical. The girls' tan lines betray the setting. \"The Demoniacs\" is Rollin at his most linear but also his most pretentious. Eventually, it stops making any sense on even an interpretive level. Despite the numerous rapes, the movie never looses its softcore sheen. I suspect the filmmaker was aroused by the images. I'll be returning to the director's vampire movies next where I suspect his talents are better suited.",
         "This is without a doubt one of the worst movies i have ever seen. It is even worse than the 70's Hindu movies where eagles carried babies and women are always blind and all people turn out to be brothers!! at least some of these Hindu movies had decent stories. Here it is even worse. People siting all around in a bar having sex and the only thing to change that is to fight with one another, a guy kills a girl without noticing, and when a friend gets mad at him for that he kills him too!! then swims about 30 meters like a pro and slips off a shipwreck 1 meter high and drowns without even hitting a rock or banging his head against anything !! and what's with the clowns, the cheap looking actor playing the wizard or whatever he is, the tide that is rising and the change in water level is very visible!! and the water rose about 10 meters!!. I watched that movie when i was surfing some french channels over the sat and stumbled across it, believe it or not, i was attracted to see the movie as i never thought i could see something that bad!!",
         "I caught this movie tonight on the late Horror channel - and I was transfixed by it's dreadfulness! I simply haven't seen anything as bad - and I've seen some howlers in my time. The only redeeming feature was the occasional beautiful landscape and the moody ruins. Apart from them - and the comedy factor - nothing. The story is - well - there isn't one. The acting - acting? - is totally beyond comprehension. The cast seemed to have no idea of what the words they were speaking meant. It's not a total loss - it's really laughable. If there are a few of you wanting a late night hoot - watch it! In future I will avoid any film by Jean Rollin like a toothache."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Général Films",
         "Les Films ABC",
         "Nordia Films"
      ],
      "summaries": [
         "Le Capitaine, le Bosco and two other sailors are dangerous ship wreckers. This time, they have done even worse mischief than usual, for not content to have lured a ship into coastal rocks and plundered it, they have also brutally raped and left for dead the two girls who have survived the wreck. But helped by a mysterious clown, by an exorcist on the beach and by... Satan himself, the two virgins turned she-devils will ruthlessly exact their terrible vengeance.",
         "A gang of pirates rape the two sole survivors of a ship wreck. The violated girls are rescued by the strange inhabitants of a supposedly haunted island, where they are granted supernatural powers to strike revenge against the pirates."
      ],
      "budget": 0
   },
   "movielensId": 107246,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1974-12-05",
      "dvdReleaseDate": null,
      "directors": ["Jean Rollin"],
      "runtime": 100,
      "movieId": 107246,
      "title": "The Demoniacs",
      "mpaa": "",
      "actors": [
         "Joëlle Coeur",
         "John Rico",
         "Willy Braque",
         "Paul Bisciglia",
         "Lieva Lone",
         "Patricia Hermenier",
         "Louise Dhour",
         "Ben Zimet",
         "Mireille Dargent",
         "Miletic Zivomir",
         "Monica Swinn",
         "Anna Watican",
         "Jean-Pierre Bouyxou",
         "Jio Berk"
      ],
      "imdbMovieId": "0070013",
      "originalTitle": "Les Démoniaques",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["x49uU682ayE"],
      "plotSummary": "A gang of pirates rape the two sole survivors of a ship wreck. The violated girls are rescued by the strange inhabitants of a supposedly haunted island, where they are granted supernatural powers to strike revenge against the pirates.",
      "tmdbMovieId": 29130,
      "avgRating": 3.16667,
      "releaseYear": "1974",
      "numRatings": 3,
      "posterPath": "/ao21xXCPRfZfoBJ4XHPO79knph7.jpg"
   }
}