{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "artificial intelligence",
            "id": 310
         },
         {
            "name": "nasa",
            "id": 1432
         },
         {
            "name": "expedition",
            "id": 1963
         },
         {
            "name": "future",
            "id": 2964
         },
         {
            "name": "wormhole",
            "id": 3417
         },
         {
            "name": "space travel",
            "id": 3801
         },
         {
            "name": "famine",
            "id": 4337
         },
         {
            "name": "black hole",
            "id": 4380
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "race against time",
            "id": 4776
         },
         {
            "name": "quantum mechanics",
            "id": 8056
         },
         {
            "name": "spaceship",
            "id": 9831
         },
         {
            "name": "space",
            "id": 9882
         },
         {
            "name": "rescue",
            "id": 10084
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "farmhouse",
            "id": 13127
         },
         {
            "name": "robot",
            "id": 14544
         },
         {
            "name": "astronaut",
            "id": 14626
         },
         {
            "name": "scientist",
            "id": 14760
         },
         {
            "name": "single father",
            "id": 33479
         },
         {
            "name": "farmer",
            "id": 154846
         },
         {
            "name": "space station",
            "id": 156039
         },
         {
            "name": "imax",
            "id": 156395
         },
         {
            "name": "father daughter relationship",
            "id": 240303
         }
      ],
      "imdb_id": "tt0816692",
      "video": false,
      "title": "Interstellar",
      "recommendations": [
         137113,
         49047,
         286217,
         194662,
         264660,
         210577,
         242582,
         205596,
         106646,
         244786,
         122917,
         1124,
         228150,
         77,
         120467,
         124905,
         190859,
         127585,
         240832,
         152532
      ],
      "backdrop_path": "/xu9zaAevzQ5nnrsXN6JcahLnG4i.jpg",
      "revenue": 675120017,
      "reviews": [
         {
            "author": "Reno",
            "id": "5463856c0e0a267815002598",
            "content": "Well, one off from two of this year's most expected movies alongside 'The Battle of Five Armies'. Like all the Chris Nolan fans, I was equally excited to see the movie on the opening day opening show. But I slightly disappointed that it was not a digital 3D film. I agree, this science-fiction was more dramatized than usual space travel stories does with an adventure-thriller. Almost a 3 hour long stretch movie did not waste much time to take us to the core of the story. Get prepared for this extremely rare voyage into the space with a logical explanation for everything you see on the screen. Well done research for the most matured and intelligent writing. All the credit must go to Nolan brothers. A good sign from Jonathan Nolan, who can make big in the entertainment industry in a future like his brother.\r\n\r\nAs we know many had liked 'Inception', to me that was a simple multi-layered action movie, that's all. But the same stuffs that used in this film makes sense. In fact, you have to have a little knowledge over how the universe works, so then it will be easy to catch the scene and situations while watching the movie. Totally like a documentary style concept, but with the additional stuffs like characters and its emotions add flavor that gives a movie look. An educational movie, though it also can work for those who wants just entertainment. Only the slow movie pace would test their patience.\r\n\r\nIt all begins like Shyamalan's 'Signs' movie with a family living surrounded by corn field. Then switches to 'The Astronaut Farmer' and going through 'Gravity', finally meets the 'Inception'. It was just a reference to call the movie setting that brings constant change for every half an hour. Like the opening scene and the end scene had over a 100 years difference.\r\n\r\nAs I earlier said it was the story of a family alongside the future of humankind and decoding universal mysteries through travelling in space and time. This movie would a reasonable for those who thought '2001: A Space Odyssey' is a boring piece, Cleverly written cinematic piece especially for science geeks. I don't know how perfect the movie to the actual present astrophysics, but will justify for the common people's capacity of understanding with an encourageable amount of commercial elements in it to entertain as well.\r\n\r\nThe first three quarters of the movie was well made. It puts me in a unblinkable position like a story was narrated by Brian Cox in a television series. Like I said, lots of astrophysics involved in it, but strangely human emotions were also exhibited equally that I never expected one from Nolan film. It was not an ordinary sentiment, but was strong enough to make a man cry for happy and sad situations in the movie. I liked science and emotion coming together. In fact, it saved the movie, otherwise it would have been a science documentary straight from NASA production through Nolan direction.\r\n\r\nThere are many surprise elements in the movie and of course there is a twist at the end. We can call it a series of twists like the layers. Compared to last quarter of the movie to the rest, it completely detaches which opens broadly to the different directions. And that happens so fast rushing towards the other end. Which give an impression of the movie 'Inception'. In a perfect way to say the first 75% was 'The Tree of Life' and the remains are 'Inception'.\r\n\r\n‘‘This world's a treasure,\r\nbut it's been telling us to leave for a while now.’’\r\n\r\nAll the actors were so good. Matthew McConaughey steals the show as he dominates the majority of the screen space in the story presentation. There's no ruling out the fine performance executions from Anne Hathaway and the young star from the Twilight movie, Mackenzie Foy. The remaining cast was having less scope which were like the guest appearances that was widened a little broader, but was perfectly fitted for the story. Especially Matt Damon's was the crucial one.\r\n\r\nRemember the movie 'Contact', a lovely movie, which was ruined by its fictional ending. Something like that happened in this film as well. The story was initiated with a realistic approach with actual scientific contents as per the present understanding about the universe. But the end was let me down with the layered contents that kind of impossible to agree with it. As a cinematic theme it worked, yeah, a good solution for this wonderfully written story. We know that the time can't run backwards, so that's the trouble.\r\n\r\nAnyway, this movie defines in a new way, I mean scientifically the existence of ghost. It was not a horror movie, but I liked supernatural force that merged with this science fiction theme. That explains and gives vast ideas to expand our physics beyond something and somewhere yet to reach. Hats off to the director, because he was not thinking of making money here. His idea was to implement what the humans are understood so far about the cosmos. And he very nicely transformed those into the silver screen with the blend of human emotions. In my opinion, this will replace '2001: A Space Odyssey' for sometime till another one make this way.\r\n\r\nI could have not asked a better space travel drama than this, especially when I heard Nolan doing a science-fiction I believed he gonna rock it. He was so true to the science and the human feelings in this film. If you had seen enough movies before like this one, you can recall your memories like the Tom Hanks parts from 'Cloud Atlas'. But still independently stands strong and falls in a never seen before category.\r\n\r\n‘‘Maybe we've spent too long\r\ntrying to figure all this out with theory.’’\r\n\r\nThe end scene leaves a hint of a possible sequel. I would be happy if that happen in a near future, but definitely that would be a completely different cinema as per how this one ended. I know his fans want that to happen and so am I.\r\n\r\nThe visuals were not that great, but simply very good. To see those in digital 3D would have given us a different experience, sadly Nolan was not in favor of that technology. Hoping this movie would get as many as the Oscars nod. Especially not getting into the best motion picture shortlist would be a shame. Like I said I'm no one fan, I just love watching everyone's every movie. I would have went to see it again if it was converted into digital 3D, since I'm modern tech geek when it comes to the films.\r\n\r\nIt will become a talk of the week, perhaps month all over the world, so don't leave behind when your friends talk about it. What I gonna say is it is a must see asap if you are a movie fanatic like me otherwise Nolan movies does not need anyone's recommendation because his movies usually sell itself like the hot samosa.",
            "url": "https://www.themoviedb.org/review/5463856c0e0a267815002598"
         },
         {
            "author": "decovision",
            "id": "55f43b7dc3a3686d03003292",
            "content": "People seem to think that if you enjoy a Christopher Nolan movie, you are a fanboy and the film couldn't really be that good. That is not true. He has never made a bad movie, Insomnia is probably his worst and it is still an excellent movie. \r\nInterstellar is up there in his top 3, with The Dark Knight being number 1 and Inception in number 2. I don't think he will ever make a better movie than The Dark Knight, it is without a doubt a masterpiece of cinema in my opinion. It can be enjoyed on so many levels.\r\nI remember seeing Interstellar in the movie theater and being on the edge of my seat the whole time. It was breathtaking but the end left me confused so i walked out disappointed. \r\nSince then i have watched it many times but it only took a second viewing to realize what a great ending it is and here is why. How many people discuss the end, was the wormhole open or closed for him to make it to Brand, what happens next, is there a sequel. I discuss this with people who hate the movie and the debate will still last a good 30 minutes if not more without getting heated. It is a wonderful story told through the eyes of a genius film maker who deserves more than he receives, an oscar would be nice start.\r\nI read hat his next movie is to be released in July 2017, I can't wait to find out everything about it like i have since he began.\r\nIf you're unsure about Christopher Nolan, watch his career from the beginning starting with Doodlebug.",
            "url": "https://www.themoviedb.org/review/55f43b7dc3a3686d03003292"
         },
         {
            "author": "Andres Gomez",
            "id": "5634aee792514129fe009d2c",
            "content": "Another grandiloquent movie from Christoper Nolan.\r\n\r\nThe cast is good, and McConaughey performs a role made for himself. The photography is very nice but the movie commits all the same mistakes than previous Nolan's movies. I think mistakes but it may be that they are the points Nolan fans enjoy the most ...\r\n\r\n* The story makes you believe it is a realy deeply thought plot but, in the end, it has so basic mistakes and stupidities that make it nonsensical.\r\n* There is a general ambience of every moment being epic; deep, solemn and smart dialogues but, at some point our highly trained engineer and pilot behaves really stupidly.\r\n* To keep the mentioned constant feeling of being in an epic moment, Nolan uses a thumping and insistent soundtrack. As it is not a moment, but a 3h movie, it is really tiresome.\r\n\r\nAll in all, the movie is OK but you can only think this is a great movie if you are a real Nolan fan.",
            "url": "https://www.themoviedb.org/review/5634aee792514129fe009d2c"
         },
         {
            "author": "Asadullah Khan",
            "id": "5807dc6dc3a3680f2d00319f",
            "content": "\"Man kind was born on earth, it was never meant to die here.\"\r\n\r\nIT has been two days since I watched it and I still can't get it out of my head. I can safely say that it has been a long LONG time since a movie had this much effect on me after watching it. And the only thing I can think of now is to somehow Re-Watch it again.\r\n\r\nThis movie was surprisingly different from Christopher Nolan's recent works because they had been great cinematic entertainment pieces catered to a wider audience with a blockbuster approach, this certainly didn't felt like that and hence the polarizing response it got. It is an ambitious project that is not meant to merely entertain, walk into it knowing that. I'll say this though, If it works for you, you'll be in heaven.\r\n\r\nThe premise of the movie is that Earth is no longer capable of supporting humans on it, we must find a new home to avoid extinction. This scenario is told from a very personal perspective and not from a Global scale like some sort of apocalyptic catastrophe disaster film. At the core of the movie is the Father-Daughter relationship. The movie takes its sweet time to develop it too.\r\n\r\nMathew McConaughey, not surprisingly, gives an amazing performance as the main lead. He really carries the film, some scenes were very emotional due to his great performance. The rest of the cast does a great job as well, especially the Daughter played by Meckenzie Foy. The One character that I never expected to be great was the robot TARS. He also acted as the source of the humor in the movie, well executed, timely and grounded.\r\n\r\nInterstellar tackles a lot of themes, Survival, Humankind, Love, Time etc, out of which 'Time' had the biggest impact on me. With relativity being a big part in the film, the whole sequence about it just struck me very deeply and I found new respect for Time. I'm actually at a loss of words to describe it. Also, there is a lot science in it so it can be confusing for many and in Nolan's tradition, it also has twists and mind numbing ending, where the more you think about it, the more numbing it gets.\r\n\r\nThe visuals of this movie are breathtaking. Great cinematography and CGI. The depiction of wormholes and blackholes and other space entities were the best I have ever seen. They just suck you into the movie. Along with that, you get to listen to one of Hans Zimmer's best scores. The score not only felt personal, going perfectly with the movie, but also different from his recent works. There were times where combination of epic photography and soundtrack made the scenes timeless, like I was completely sucked into it and didn't had a clue about my surroundings. I didn't want those scenes to end.\r\n\r\nAlas, the movie was not perfect. My biggest gripe with it is that the pacing and editing was off at times. Some scenes dragged on while others were cut far shorter. The beautiful views of space could have definitely benefited from a few seconds longer onscreen time. Also, I wished there was more space exploration in it.\r\n\r\nWith all the remakes, rehashes, reboots and sequels we are getting in these times, it is great to see original gems like these. This movie is definitely one of this year's best, one of Nolan's best work and one of the best movie I have seen in recent years.\r\n\r\n9.5/10",
            "url": "https://www.themoviedb.org/review/5807dc6dc3a3680f2d00319f"
         },
         {
            "author": "shaunfrombklyn",
            "id": "58a46707c3a3686cc200458c",
            "content": "This was my most anticipated film of 2014, and I was not disappointed. \r\n\r\nThe story was slightly difficult to follow on the first watch, but that was to be expected in a film dealing with complicated fields such as astrophysics and time dilation. Many didn't find its overall message - that love is the most powerful force in the universe which transcends space and time - to be very appealing, but I thought it was an interesting take on special relativity and how two people can be bound by a common feeling, even when they're in different parts of the universe at different times. I also thought the acting was believable, for the most part, and I didn't think anyone was miscast. I enjoyed the surprise appearance from a certain famous actor about halfway through.\r\n\r\nBut what really blew me away were the visuals and the soundtrack. I believe it was Quentin Tarantino who once said movies and music go hand in hand; that a moving image complimented by the right piece of music can create art. Well, the visuals in this film, which took my breath away, and the score, which perfectly captured the 'feel' of the cosmos and all its wonder, proved him right. I think this was Hans Zimmer's best work yet, and although I'm not Christopher Nolan's biggest fan, I will continue to follow his work if he can pull off more movies like this. \r\n\r\nMy only regret was not seeing this film in IMAX.\r\n\r\n10/10",
            "url": "https://www.themoviedb.org/review/58a46707c3a3686cc200458c"
         },
         {
            "author": "Per Gunnar Jonsson",
            "id": "5a3beb430e0a264cbc23212a",
            "content": "That this movie, at the time of writing this, holds an 8.8 rating at IMDb is simply beyond my understanding. Needless to say I did not really like this movie. The story is not very good, the science is ludicrous and the visuals not all that impressive. Maybe the latter would be better in a big theater (I watched this on my home cinema system which has a relatively large screen by European standards) but I am not really sure about that either.\r\n\r\nBe warned that the rest of this review might contain a spoiler or two.\r\n\r\nThe movie starts of with the usual “I told you so” wet dream of the green fanatics on a dying Earth so it is off to a depressing start right away. That is an overused concept today as far as I am concerned. Then they pour it on with a school official claiming that he Apollo missions and moon landings never happened. What the f…? If they wanted to depress the audience right from the start they succeeded, at least with this audience.\r\n\r\nThe story proceeds with our heroes finding these gravity waves in the sand and by a huge stretch of imagination decrypts them to mean coordinates which leads them to the secret NASA base. Once there Cooper is told that he is their best choice of pilot for a “save the human race” mission through a wormhole. Yeah, right! This guy was former NASA. His whereabouts could hardly been unknown to them. If he was their best choice why would they entrust a mission to save the human race to someone else until he stumbled onto their door? Typical Hollywood nonsense!\r\n\r\nThe movie is full of this kind of rubbish. Romilly wastes 23 years of his life doing pretty much nothing except deciding not to go into the sleep capsule. The supposedly highly trained and vetted professor that they do find turns out to be a psychopath as well as and idiot almost blowing up the ship when trying to proceed with a docking that all the systems tells him have not succeeded. Then they proceed to dock with the main ship and stop its spin as well as bring it out of orbit around a planet with the shuttles engines. That is one hell of a powerful shuttle not to mention the strength of the docking mechanism! This just goes on. When someone is not doing something illogical or stupid (or both) they sit around talking, philosophizing and dragging the movie forward at snails pace. 169 minutes is way too much for this movie.\r\n\r\nThe movie ends up in one big time travel mess (okay they do not travel in time, just sends messages through time but still…) during a bunch of psychedelic scenes while traveling through the back hole. Science? Not so much. And what about this totally ludicrous massively illogical and inefficient robot design?\r\n\r\nThe one good thing I can say about this movie is that the performance of most of the actors, especially Matthew McConaughey, are quite good. For the rest, not my cup of tea.",
            "url": "https://www.themoviedb.org/review/5a3beb430e0a264cbc23212a"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Joseph Cooper",
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e47cb",
               "name": "Matthew McConaughey",
               "profile_path": "/jdRmHrG0TWXGhs4tO6TJNSoL25T.jpg",
               "id": 10297,
               "order": 0
            },
            {
               "cast_id": 17,
               "character": "Murph Cooper",
               "gender": 1,
               "credit_id": "52fe4bbf9251416c910e47f1",
               "name": "Jessica Chastain",
               "profile_path": "/nkFrkn5NZVGWb4b2X0yIcXezhyt.jpg",
               "id": 83002,
               "order": 1
            },
            {
               "cast_id": 169,
               "character": "Dr. Amelia Brand",
               "gender": 1,
               "credit_id": "57fe146fc3a368504a00261e",
               "name": "Anne Hathaway",
               "profile_path": "/xENM3XJAtdpolwELYDy9iaCtU4m.jpg",
               "id": 1813,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Professor John Brand",
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e47f5",
               "name": "Michael Caine",
               "profile_path": "/vvj0JMSFpOajXCE46Hy4dyqSP2U.jpg",
               "id": 3895,
               "order": 3
            },
            {
               "cast_id": 21,
               "character": "Tom Cooper",
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e4805",
               "name": "Casey Affleck",
               "profile_path": "/kPNMpiZHsAzeQar4DiNsrekwHBU.jpg",
               "id": 1893,
               "order": 4
            },
            {
               "cast_id": 24,
               "character": "Young Murph Cooper",
               "gender": 1,
               "credit_id": "52fe4bbf9251416c910e4811",
               "name": "Mackenzie Foy",
               "profile_path": "/u6Dt9C6VwWt4kRTGEcr3p2shxgt.jpg",
               "id": 851784,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Young Tom Cooper",
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e480d",
               "name": "Timothée Chalamet",
               "profile_path": "/gz5kyVsUzOratQmGHdDg3AnxP9h.jpg",
               "id": 1190668,
               "order": 6
            },
            {
               "cast_id": 26,
               "character": "TARS (voice)",
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e4819",
               "name": "Bill Irwin",
               "profile_path": "/zjvhlCC1LA5JUwfScQTwS1xLciP.jpg",
               "id": 58549,
               "order": 7
            },
            {
               "cast_id": 31,
               "character": "Dr. Mann",
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e482d",
               "name": "Matt Damon",
               "profile_path": "/elSlNgV8xVifsbHpFsqrPGxJToZ.jpg",
               "id": 1892,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Old Murph Cooper",
               "gender": 1,
               "credit_id": "52fe4bbf9251416c910e4809",
               "name": "Ellen Burstyn",
               "profile_path": "/kxWFljG3JjJMbOMCLm0SkrPQjhf.jpg",
               "id": 9560,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Donald",
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e4815",
               "name": "John Lithgow",
               "profile_path": "/uquz3dZ0fs0lAK57lCXwxaslVkb.jpg",
               "id": 12074,
               "order": 10
            },
            {
               "cast_id": 28,
               "character": "Dr. Doyle",
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e4821",
               "name": "Wes Bentley",
               "profile_path": "/fbHHalL9CS52zvJp015G31vwX23.jpg",
               "id": 8210,
               "order": 11
            },
            {
               "cast_id": 27,
               "character": "Getty",
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e481d",
               "name": "Topher Grace",
               "profile_path": "/nM4H9Uqn2V4shWCxxnDqT6ZaJOu.jpg",
               "id": 17052,
               "order": 12
            },
            {
               "cast_id": 29,
               "character": "Principal",
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e4825",
               "name": "David Oyelowo",
               "profile_path": "/uhFLGQqNmhLgcqgITkoGoHy9FTl.jpg",
               "id": 35013,
               "order": 13
            },
            {
               "cast_id": 30,
               "character": "Dr. Romilly",
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e4829",
               "name": "David Gyasi",
               "profile_path": "/jkqSPSGNaWZuGLDBUrL9grAXLkM.jpg",
               "id": 55411,
               "order": 14
            },
            {
               "cast_id": 37,
               "character": "NASA Board Member",
               "gender": 2,
               "credit_id": "54259750c3a3680876005f94",
               "name": "William Devane",
               "profile_path": "/SYI4fML7EmZDghuieWf6SpiyRF.jpg",
               "id": 21416,
               "order": 15
            },
            {
               "cast_id": 38,
               "character": "CASE (voice)",
               "gender": 2,
               "credit_id": "545db7ab0e0a261fb6005d65",
               "name": "Josh Stewart",
               "profile_path": "/x9ZQibxASPwVWGeQn4Y5dcU2ZJG.jpg",
               "id": 40039,
               "order": 16
            },
            {
               "cast_id": 39,
               "character": "Ms. Kelly",
               "gender": 1,
               "credit_id": "545db7d70e0a261fb6005d6f",
               "name": "Collette Wolfe",
               "profile_path": "/aSD4h5379b2eEw3bLou9ByLimmq.jpg",
               "id": 86624,
               "order": 17
            },
            {
               "cast_id": 40,
               "character": "Lois Cooper",
               "gender": 1,
               "credit_id": "545db7f5c3a3686cbb000db6",
               "name": "Leah Cairns",
               "profile_path": "/Asuotouxe6Se3stoMP7vrLE1EaD.jpg",
               "id": 32202,
               "order": 18
            },
            {
               "cast_id": 141,
               "character": "Crew Chief",
               "gender": 2,
               "credit_id": "55191d18c3a3684b6b002414",
               "name": "Russ Fega",
               "profile_path": "/7JFQueMbXqGIz16wKBlok7WfNNz.jpg",
               "id": 535,
               "order": 19
            },
            {
               "cast_id": 142,
               "character": "Nurse Practitioner",
               "gender": 0,
               "credit_id": "55191d5b9251416f0000706f",
               "name": "Lena Georgas",
               "profile_path": "/a16eFCpLMJ6n2RoOPej372XzWX.jpg",
               "id": 171901,
               "order": 20
            },
            {
               "cast_id": 143,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "55191d8bc3a3682aa8000cb4",
               "name": "Jeff Hephner",
               "profile_path": "/bNnvbOCBS0LZAqdT1cW2UcrnRw2.jpg",
               "id": 212689,
               "order": 21
            },
            {
               "cast_id": 144,
               "character": "Administrator",
               "gender": 2,
               "credit_id": "55191db092514115000044c3",
               "name": "Elyes Gabel",
               "profile_path": "/tNAexPOefzEJEpnOVBWs34BNLsh.jpg",
               "id": 78050,
               "order": 22
            },
            {
               "cast_id": 145,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "55191dd7c3a3684bd80022dc",
               "name": "Brooke Smith",
               "profile_path": "/fiR32HbDUWCZuRjdlknQMIyIsrw.jpg",
               "id": 31649,
               "order": 23
            },
            {
               "cast_id": 146,
               "character": "Coop",
               "gender": 2,
               "credit_id": "55287dde92514111d600086d",
               "name": "Liam Dickinson",
               "profile_path": "/ih6hto8rsKZg71Qk4vniU8Xj8cj.jpg",
               "id": 1452481,
               "order": 24
            },
            {
               "cast_id": 147,
               "character": "Boots",
               "gender": 2,
               "credit_id": "55ea8067c3a3682c62008d3d",
               "name": "Francis X. McCarthy",
               "profile_path": "/kJe5FQXtccOzAzhO9RZaPKhWht2.jpg",
               "id": 100650,
               "order": 25
            },
            {
               "cast_id": 148,
               "character": "Smith",
               "gender": 2,
               "credit_id": "55ea8068c3a3682c5d009739",
               "name": "Andrew Borba",
               "profile_path": "/knHlGxYCOO3tqFTiSoYWusjzdm1.jpg",
               "id": 167720,
               "order": 26
            },
            {
               "cast_id": 149,
               "character": "Girl on Truck",
               "gender": 1,
               "credit_id": "55ea80689251413e3a008ab7",
               "name": "Flora Nolan",
               "profile_path": "/f4NdIEvsknD6fMH9GGN2yRciwpN.jpg",
               "id": 1505363,
               "order": 27
            },
            {
               "cast_id": 150,
               "character": "NASA Employee (uncredited)",
               "gender": 2,
               "credit_id": "56b63be09251413ca1002d04",
               "name": "William Patrick Brown",
               "profile_path": "/7ap8ZBoGn20W6DwFKRUdzycMBTa.jpg",
               "id": 1452865,
               "order": 28
            },
            {
               "cast_id": 151,
               "character": "NASA Scientist (uncredited)",
               "gender": 1,
               "credit_id": "56b63c06c3a36806f100962f",
               "name": "Cici Leah Campbell",
               "profile_path": "/eV5g6RZ5OVVg2kEYkYu8MndanD6.jpg",
               "id": 1503849,
               "order": 29
            },
            {
               "cast_id": 152,
               "character": "Scientist (uncredited)",
               "gender": 2,
               "credit_id": "56b63c949251414a3a004185",
               "name": "Kristian Van der Heyden",
               "profile_path": "/m3p1V8rit1kcab2arukZRPoddiM.jpg",
               "id": 1573547,
               "order": 30
            },
            {
               "cast_id": 153,
               "character": "NASA Inspector (uncredited)",
               "gender": 2,
               "credit_id": "56b63ce792514112b9008b59",
               "name": "Mark Casimir Dyniewicz",
               "profile_path": "/k50HeN23G34LixmL3sHGTyJU93p.jpg",
               "id": 97447,
               "order": 31
            },
            {
               "cast_id": 154,
               "character": "Astronaut (uncredited)",
               "gender": 2,
               "credit_id": "56b63d5d9251413ca1002d32",
               "name": "Joseph Oliveira",
               "profile_path": "/nFJX5qWKlHyew7AHKUFE3EQnMO5.jpg",
               "id": 1360008,
               "order": 32
            },
            {
               "cast_id": 170,
               "character": "Popcorn Seller (uncredited)",
               "gender": 2,
               "credit_id": "580e5fc09251416e0a002b6d",
               "name": "Ryan Irving",
               "profile_path": "/2GoGL9jsg6bfmhfGfChkqDuRe1N.jpg",
               "id": 1699056,
               "order": 33
            },
            {
               "cast_id": 171,
               "character": "Construction Boss (uncredited)",
               "gender": 2,
               "credit_id": "580e5fe3c3a3683867000507",
               "name": "Alexander Michael Helisek",
               "profile_path": "/gR6ykV3iQVZlA3KnuOk5hmFKDi7.jpg",
               "id": 1663832,
               "order": 34
            },
            {
               "cast_id": 172,
               "character": "NASA Scientist (uncredited)",
               "gender": 2,
               "credit_id": "580e5ff5c3a36859aa002f2e",
               "name": "Benjamin Hardy",
               "profile_path": "/o08lN3cGLguomAozF1uuDQTIl7r.jpg",
               "id": 1699057,
               "order": 35
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "54cba75b925141678e014d1a",
               "name": "Kendelle Elliott",
               "profile_path": null,
               "id": 1328137,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "54cba770c3a3680924010431",
               "name": "Eggert Ketilsson",
               "profile_path": null,
               "id": 991724,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "54cba799925141678e014d20",
               "name": "David F. Klassen",
               "profile_path": null,
               "id": 14349,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "54cba7acc3a36854a9003043",
               "name": "Gary Kosko",
               "profile_path": null,
               "id": 21718,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "54cba7c392514157cc01098b",
               "name": "Josh Lusby",
               "profile_path": null,
               "id": 1334782,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "54cba7d4925141678c014f6b",
               "name": "Eric Sundahl",
               "profile_path": null,
               "id": 988882,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5319bc1a92514177b4002655",
               "name": "Lee Smith",
               "profile_path": "/5XNVKGYwQraa4LYk0pjRhvdC3c1.jpg",
               "id": 3904,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e47c1",
               "name": "Christopher Nolan",
               "profile_path": "/7OGmfDF4VHLLgbjxuEwTj3ga0uQ.jpg",
               "id": 525,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4bbf9251416c910e47e7",
               "name": "Lynda Obst",
               "profile_path": null,
               "id": 2162,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e47ed",
               "name": "Christopher Nolan",
               "profile_path": "/7OGmfDF4VHLLgbjxuEwTj3ga0uQ.jpg",
               "id": 525,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e47fb",
               "name": "Hoyte van Hoytema",
               "profile_path": "/dT5fWu3M9qJQlE5rItpSGUUOMC0.jpg",
               "id": 74401,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bbf9251416c910e4801",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5505e4cb92514179fb000a9a",
               "name": "Jonathan Nolan",
               "profile_path": "/rYBQ8M3hDDY0eThVIvWHmrf4i0Y.jpg",
               "id": 527,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5505e4dac3a36862e900346c",
               "name": "Christopher Nolan",
               "profile_path": "/7OGmfDF4VHLLgbjxuEwTj3ga0uQ.jpg",
               "id": 525,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5319bc2f92514177bf0025ac",
               "name": "Nathan Crowley",
               "profile_path": "/lI5Q6oEf1nj3AAHuTltwpckQW3n.jpg",
               "id": 15327,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "5319bc4792514177c200259d",
               "name": "Mary Zophres",
               "profile_path": null,
               "id": 7418,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "5319bc8592514177c20025a7",
               "name": "Emma Thomas",
               "profile_path": "/f12TsNlAEomPdwxueS7ImMoJtsP.jpg",
               "id": 556,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5319bc9892514177b7002639",
               "name": "John Papsidera",
               "profile_path": "/quM89TMS6BncoIh4NdlWugXVhuF.jpg",
               "id": 561,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "54cba805c3a36874b70162ec",
               "name": "Gary Fettis",
               "profile_path": null,
               "id": 65711,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "54cba8239251416789014aa2",
               "name": "Patricia DeHaney",
               "profile_path": null,
               "id": 1417399,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "54cba838c3a368044800f36f",
               "name": "Jose Zamora",
               "profile_path": null,
               "id": 1420642,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "54cba84e92514157cc01098f",
               "name": "Luisa Abel",
               "profile_path": null,
               "id": 1322015,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "54cba865925141635e00cd96",
               "name": "Jay Wejebe",
               "profile_path": null,
               "id": 1412185,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "54cba898c3a3687a6501048f",
               "name": "Casey Grant",
               "profile_path": null,
               "id": 18926,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "54cba8c3c3a3687a65010494",
               "name": "Michelle Brattson",
               "profile_path": null,
               "id": 1400007,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "54cba8e6925141678e014d32",
               "name": "Jenne Lee",
               "profile_path": null,
               "id": 1395430,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "54cba9529251416789014ab6",
               "name": "Lynda Foote",
               "profile_path": null,
               "id": 1329113,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "54cba97dc3a368044800f38c",
               "name": "Heather Moore",
               "profile_path": null,
               "id": 1420643,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "54cbacbfc3a36879df0108df",
               "name": "P. Scott Sakamoto",
               "profile_path": null,
               "id": 1357066,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "54cbacf2925141635e00cdf5",
               "name": "Hans Bjerno",
               "profile_path": "/tzeE3ATzHWyEQH32GYeGuSgr1xz.jpg",
               "id": 1399071,
               "department": "Camera",
               "job": "Helicopter Camera"
            },
            {
               "gender": 1,
               "credit_id": "54cbad19c3a36874b701635b",
               "name": "Melinda Sue Gordon",
               "profile_path": null,
               "id": 1324652,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "54cbad3fc3a36879df0108eb",
               "name": "Dane Bjerno",
               "profile_path": null,
               "id": 1417834,
               "department": "Camera",
               "job": "Camera Technician"
            },
            {
               "gender": 0,
               "credit_id": "5505e47ac3a3686b75000a29",
               "name": "Jordan Goldberg",
               "profile_path": null,
               "id": 113913,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5505e487c3a368262e003054",
               "name": "Jake Myers",
               "profile_path": null,
               "id": 29608,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5505e495c3a36862dd0030ef",
               "name": "Kip Thorne",
               "profile_path": null,
               "id": 1157625,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5505e4a292514179fb000a96",
               "name": "Thomas Tull",
               "profile_path": "/5UG4FK7rsmhzJDYxpU28acqfxtu.jpg",
               "id": 54211,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "55190d6e92514115000041a6",
               "name": "Joel Tobman",
               "profile_path": null,
               "id": 1447570,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "55190d8bc3a3682aa80009ca",
               "name": "Lauren Abiouness",
               "profile_path": null,
               "id": 1424897,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "55190dc09251416f0a007037",
               "name": "Travis Witkowski",
               "profile_path": null,
               "id": 1447571,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "55190e0dc3a36862ef00714f",
               "name": "Craig Henderson",
               "profile_path": null,
               "id": 1421695,
               "department": "Art",
               "job": "Construction Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "55190e50c3a3681f84002908",
               "name": "Brian Walker",
               "profile_path": null,
               "id": 1424898,
               "department": "Art",
               "job": "Construction Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "55190ec6c3a3684bd8002005",
               "name": "Nathan Davey",
               "profile_path": null,
               "id": 1447574,
               "department": "Art",
               "job": "Greensman"
            },
            {
               "gender": 0,
               "credit_id": "55190edbc3a3681f84002926",
               "name": "Steven Hanks",
               "profile_path": null,
               "id": 1447575,
               "department": "Art",
               "job": "Greensman"
            },
            {
               "gender": 0,
               "credit_id": "55190f13c3a36862ef007197",
               "name": "Christopher Morente",
               "profile_path": null,
               "id": 1415611,
               "department": "Art",
               "job": "Greensman"
            },
            {
               "gender": 0,
               "credit_id": "55190f2d9251416f0a00709b",
               "name": "Darryl Stogre",
               "profile_path": null,
               "id": 1447578,
               "department": "Art",
               "job": "Greensman"
            },
            {
               "gender": 0,
               "credit_id": "55190f519251412c1e00596a",
               "name": "Mark Weissenfluh",
               "profile_path": null,
               "id": 1447582,
               "department": "Art",
               "job": "Leadman"
            },
            {
               "gender": 0,
               "credit_id": "55190f8b9251415aab001e5c",
               "name": "Ritchie Kremer",
               "profile_path": null,
               "id": 1447583,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 0,
               "credit_id": "55190fe2c3a3685cfa005191",
               "name": "Ernie Avila",
               "profile_path": null,
               "id": 1399290,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "55190ff99251416f00006e37",
               "name": "Andrew Birdzell",
               "profile_path": null,
               "id": 1399291,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "55191016925141731c0028b8",
               "name": "Martha Johnston",
               "profile_path": null,
               "id": 1392896,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 1,
               "credit_id": "5519102b9251415918001c8a",
               "name": "Noelle King",
               "profile_path": null,
               "id": 1360094,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "5519104bc3a3685cfa0051ac",
               "name": "Paul Sonski",
               "profile_path": null,
               "id": 81731,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 2,
               "credit_id": "551910609251412c1e0059a9",
               "name": "Eric Sundahl",
               "profile_path": null,
               "id": 988882,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "551910749251411500004260",
               "name": "Sally Thornton",
               "profile_path": null,
               "id": 21796,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 2,
               "credit_id": "5519108bc3a3685cfa0051b8",
               "name": "Robert Woodruff",
               "profile_path": null,
               "id": 14762,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "551910f5c3a3684b6b0021c7",
               "name": "Dan Engle",
               "profile_path": null,
               "id": 1400019,
               "department": "Art",
               "job": "Sculptor"
            },
            {
               "gender": 2,
               "credit_id": "5519110fc3a3681f840029a7",
               "name": "Todd Rex",
               "profile_path": "/9BPCH9uMQ6tsewxVHJXEOHcimop.jpg",
               "id": 98681,
               "department": "Art",
               "job": "Sculptor"
            },
            {
               "gender": 0,
               "credit_id": "551911289251415918001ccb",
               "name": "Cuitlahuac Morales Velazquez",
               "profile_path": null,
               "id": 1355530,
               "department": "Art",
               "job": "Sculptor"
            },
            {
               "gender": 2,
               "credit_id": "551911799251412b6d005415",
               "name": "R.J. Kizer",
               "profile_path": null,
               "id": 52193,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 0,
               "credit_id": "551911e59251415918001cf4",
               "name": "Alyson Dee Moore",
               "profile_path": null,
               "id": 1397823,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 2,
               "credit_id": "551911fc9251416f00006ea1",
               "name": "John Roesch",
               "profile_path": null,
               "id": 1116937,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "55191222c3a36862ef007237",
               "name": "Hugo Weng",
               "profile_path": null,
               "id": 1050930,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 2,
               "credit_id": "5519123cc3a3681f84002a00",
               "name": "R.J. Kizer",
               "profile_path": null,
               "id": 52193,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "551912809251412c1e005a22",
               "name": "Ken J. Johnson",
               "profile_path": null,
               "id": 1378231,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "551912a5c3a3681f84002a12",
               "name": "Michael W. Mitchell",
               "profile_path": null,
               "id": 1377222,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "551912c9c3a36862ef007255",
               "name": "Jeff Sawyer",
               "profile_path": null,
               "id": 1417516,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "5519131d9251412b6d005463",
               "name": "Gregg Landaker",
               "profile_path": null,
               "id": 1341781,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "551913c39251415aab001f37",
               "name": "Gary Rizzo",
               "profile_path": null,
               "id": 138618,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "551913fbc3a3681f84002a57",
               "name": "Andrew Bock",
               "profile_path": null,
               "id": 1447601,
               "department": "Sound",
               "job": "First Assistant Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "55191411c3a3685cfa005280",
               "name": "Linda Yeaney",
               "profile_path": null,
               "id": 1447602,
               "department": "Sound",
               "job": "First Assistant Sound Editor"
            },
            {
               "gender": 2,
               "credit_id": "5519142d9251412c1e005a72",
               "name": "Richard King",
               "profile_path": null,
               "id": 1341403,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "551914859251416f00006f22",
               "name": "Scott R. Fisher",
               "profile_path": null,
               "id": 1357062,
               "department": "Crew",
               "job": "Special Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5519149fc3a3684b6b002297",
               "name": "James Paradis",
               "profile_path": null,
               "id": 1378699,
               "department": "Crew",
               "job": "Special Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "551915099251411500004345",
               "name": "Dan Neal",
               "profile_path": null,
               "id": 1447603,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "55191540c3a3681f84002a94",
               "name": "Eugénie von Tunzelmann",
               "profile_path": null,
               "id": 1447604,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5519157f9251412b6d0054c2",
               "name": "Fabio Zangla",
               "profile_path": null,
               "id": 1447605,
               "department": "Crew",
               "job": "Sequence Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "551915dcc3a3682aa8000b6c",
               "name": "Seth Dubieniec",
               "profile_path": null,
               "id": 1447609,
               "department": "Crew",
               "job": "Sequence Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5519160f9251415aab001f92",
               "name": "Evan Clover",
               "profile_path": null,
               "id": 1447610,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "55191623c3a3685cfa0052e8",
               "name": "Trystan James",
               "profile_path": null,
               "id": 1447611,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "5519164b9251411500004384",
               "name": "Andrew McEvoy",
               "profile_path": null,
               "id": 1417836,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "5519167ec3a3684bd8002190",
               "name": "Tom Barrett",
               "profile_path": null,
               "id": 1447612,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "551916aac3a36862f9007448",
               "name": "Lai Lok Chau",
               "profile_path": null,
               "id": 1447613,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "551916cbc3a3681f84002ad2",
               "name": "Dorian Knapp",
               "profile_path": null,
               "id": 1447614,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "5519170fc3a3681f84002ae2",
               "name": "Gábor Kiss",
               "profile_path": null,
               "id": 1447615,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "551917a192514115000043b7",
               "name": "Crystal Hadcroft",
               "profile_path": null,
               "id": 1447617,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "551917dfc3a36862ef00733b",
               "name": "Steve Miller",
               "profile_path": null,
               "id": 1417823,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "551918069251412b6d00551b",
               "name": "Ann Podlozny",
               "profile_path": null,
               "id": 1413116,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5519187ac3a3681f84002b12",
               "name": "Graeme Puttock",
               "profile_path": null,
               "id": 1447621,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "551918c0925141731c002a50",
               "name": "Jenny Basen",
               "profile_path": null,
               "id": 1447622,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "551918fb92514115000043e1",
               "name": "Harrison Goldstein",
               "profile_path": null,
               "id": 1447624,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5519193fc3a36862f90074a1",
               "name": "Andrew Lockley",
               "profile_path": null,
               "id": 1417828,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "551919b09251415aab002014",
               "name": "George Cottle",
               "profile_path": null,
               "id": 1081074,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "55191a12c3a36862f6006cef",
               "name": "Harold Skinner",
               "profile_path": null,
               "id": 1447626,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "55191a339251415aab002021",
               "name": "Martin Keough",
               "profile_path": null,
               "id": 1447627,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "55191a5dc3a36862f6006cfc",
               "name": "Sean Oxenbury",
               "profile_path": null,
               "id": 1431089,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "55191ae5c3a3684b6b002384",
               "name": "Mark Avery",
               "profile_path": null,
               "id": 1447628,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "55191afdc3a3684bd8002242",
               "name": "Leigh Bell",
               "profile_path": null,
               "id": 1447632,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "55191b1ac3a3682aa8000c36",
               "name": "Tom Cummins",
               "profile_path": null,
               "id": 1428227,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "55191b309251415aab00205d",
               "name": "Sahar Halabi",
               "profile_path": null,
               "id": 1402494,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "55191b4d925141731c002ab7",
               "name": "Kelly Porter",
               "profile_path": null,
               "id": 1447633,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "55191b78c3a3684b6b0023ac",
               "name": "Eric A. Lewy",
               "profile_path": null,
               "id": 1417840,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "55191ba39251416f0000700e",
               "name": "Alex Gibson",
               "profile_path": null,
               "id": 1403490,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "55191bc29251412b6d0055b9",
               "name": "Ryan Rubin",
               "profile_path": null,
               "id": 1417841,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "55191bde9251416f0000701e",
               "name": "Denny Caira",
               "profile_path": null,
               "id": 1357070,
               "department": "Crew",
               "job": "Transportation Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "55191bff9251412b6d0055c5",
               "name": "Bruce L. Brownstein",
               "profile_path": null,
               "id": 1447636,
               "department": "Production",
               "job": "Location Manager"
            },
            {
               "gender": 0,
               "credit_id": "55191c23c3a36862ef007413",
               "name": "Mandi Dillin",
               "profile_path": null,
               "id": 1345627,
               "department": "Production",
               "job": "Location Manager"
            },
            {
               "gender": 0,
               "credit_id": "55191c839251412c1e005bed",
               "name": "Rick Lipton",
               "profile_path": null,
               "id": 1442173,
               "department": "Crew",
               "job": "Dialect Coach"
            },
            {
               "gender": 0,
               "credit_id": "56b7820fc3a3684816007221",
               "name": "Mark Scoon",
               "profile_path": null,
               "id": 1564997,
               "department": "Production",
               "job": "Executive In Charge Of Production"
            },
            {
               "gender": 1,
               "credit_id": "56b782cf9251416615007154",
               "name": "Deanna Brigidi",
               "profile_path": null,
               "id": 989750,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "56bd046c9251417353000b2f",
               "name": "Frank Reina",
               "profile_path": null,
               "id": 1576050,
               "department": "Crew",
               "job": "Production Office Assistant"
            },
            {
               "gender": 0,
               "credit_id": "56d4e8d1c3a3681e4a0151f6",
               "name": "Donald Likovich",
               "profile_path": null,
               "id": 1440853,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "56d871f2c3a3681e4a01edad",
               "name": "Dixie Webster",
               "profile_path": null,
               "id": 1463954,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "56f81a4c9251412fdd003166",
               "name": "Paul Healy",
               "profile_path": null,
               "id": 1426735,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "570bd2f5c3a36802a9000277",
               "name": "Dean Wolcott",
               "profile_path": null,
               "id": 969743,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 2,
               "credit_id": "572cd0a5c3a3680ff900052e",
               "name": "Andrew Kinney",
               "profile_path": null,
               "id": 1616082,
               "department": "Sound",
               "job": "Orchestrator"
            },
            {
               "gender": 0,
               "credit_id": "572f6ce19251413c2700139c",
               "name": "Frank Macchia",
               "profile_path": null,
               "id": 1463824,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "575310969251411f5a0000e6",
               "name": "Bruce Fowler",
               "profile_path": null,
               "id": 932186,
               "department": "Sound",
               "job": "Orchestrator"
            },
            {
               "gender": 0,
               "credit_id": "5766ccabc3a36863cc000701",
               "name": "David E. Hall",
               "profile_path": null,
               "id": 1571601,
               "department": "Crew",
               "job": "Post Production Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "579bf956c3a36855d20025b4",
               "name": "Mato",
               "profile_path": null,
               "id": 1428834,
               "department": "Editing",
               "job": "Color Timer"
            },
            {
               "gender": 0,
               "credit_id": "579cff4f9251411217002c8a",
               "name": "Kevin Kaska",
               "profile_path": "/azlSu8Sz9QGeK3xgQS9p3ZvR9q9.jpg",
               "id": 68016,
               "department": "Sound",
               "job": "Orchestrator"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 44.035635,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 157336,
      "vote_count": 13634,
      "budget": 165000000,
      "overview": "Interstellar chronicles the adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
      "similar": [
         126889,
         348,
         2048,
         568,
         605,
         19,
         17431,
         19959,
         19995,
         76341,
         262543,
         75612,
         330459,
         101299,
         811,
         274870,
         19761,
         15493,
         8078,
         2666
      ],
      "original_title": "Interstellar",
      "runtime": 169,
      "poster_path": "/nBNZadXqJSdt05SHLqgT0HuC5Gm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": "/5UQsZrfbfG2dYJbx8DxfoTr2Bvu.png",
            "name": "Legendary Pictures",
            "id": 923,
            "origin_country": "US"
         },
         {
            "logo_path": "/3tvBqYsBhxWeHlu62SIJ1el93O7.png",
            "name": "Syncopy",
            "id": 9996,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Lynda Obst Productions",
            "id": 13769,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2014-11-05",
      "vote_average": 8.1,
      "belongs_to_collection": null,
      "tagline": "Mankind was born on Earth. It was never meant to die here.",
      "adult": false,
      "homepage": "http://www.interstellarmovie.net/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Christopher Nolan"],
      "runtime": 169,
      "synopsis": "A group of elderly people that look like children from The Great Depression of the 1930's are giving interviews about having lived in a climate of crop blight and constant dust. The first one seen is the daughter of the main character as an 80-something woman stating her father was a farmer, but did not start out that way. It is an unspecified part of the Midwest, presumably eastern Colorado around the year 2065. More than half the world's population has been decimated from famine and America reduced to being a struggling agrarian society. Living in large cities has become almost useless. Technology has come to a standstill for the past 40 or so years, with automobiles no longer produced and a computer laptop is a luxury item. There is no military or war anymore. Space travel is no longer funded by the government and the people of Earth are forced to stay and be good stewards to the now dying land. We are introduced to a farmer and widower named Joe Cooper (Matthew McConaughey). He is a college-educated 'good old boy' and former NASA test pilot that had to give up his occupation to settle for near abysmal conditions in a run down farmhouse presumably owned by his father in law farming for a living and living predominately off corn and corn products. Cooper's family consists of his 60-something father-in-law, Donald (John Lithgow), his 15-year-old son Tom (Timothée Chalamet), and 10-year-old daughter Murph (Mackenzie Foy). Donald was born at the end of the 20th century and fondly recalls times when technology was constantly changing and a down-to-Earth man that takes care of the household duties and gets along well with Cooper with the two of them sitting on the porch drinking beer in the evening and philosophizing about the condition of the world and how things should be. His son Tom is a boy of average intelligence already being ruled out to be a farmer by the school administration, since a college education is now something only a very small percentage those will enjoy the privilege of. His daughter Murph is a feisty and highly intelligent preteen girl whom Cooper is very close to and shares his affinity with space and science. She believes her room is haunted by a ghost because books keep falling off her shelves and a lunar ship model was just knocked off. The Cooper family lives a pretty simple life and have a rare treat of attending a game of a supposedly major league baseball team at a local ball field similar to what the little league play on. His father in law is unimpressed at the amateurishness of the players and having only popcorn for refreshments and no hot dogs. An approaching dust cloud interrupts the game and ends it prematurely. The Cooper family goes back to the farmhouse and Murph's bedroom did not have the window closed and the dust settled into perfect lines. Somehow, Cooper thinks the lines, which appear to be binary code, are coordinates for a place he feels the need to find and uses a map. He spends the next day driving to the Rockies and his daughter sneaks into the truck to come with him. Soon after arriving at his final destination, Cooper is apprehended and shocked into unconsciousness by a strange looking robot called TARS. It turns out he is in the best-kept secret in the world, a bunker, and meets his old boss from NASA, an Englishman named Dr. John Brand (Michael Caine), plus his beautiful young daughter, Amelia Brand (Anne Hathaway). Nobody is convinced that Cooper just stumbled into the place by accident and Dr. Brand believes a force brought Cooper there. The compound Cooper found is actually the remnants of NASA, inhabiting the facility in secret and no longer funded by the government because of the scarcity of resources. There is a space mission leaving soon to go through a wormhole of unknown origin near Saturn that will take them to three potentially habitable planets, all of them orbiting a supermassive black hole named Gargantua. Ten years earlier, 12 astronauts were sent out through the wormhole, but only three activated the thumbs up beacon, all of whom are at three planets orbiting the black hole. At the moment, NASA has nobody to pilot the spacecraft and at the last minute want Cooper to go, despite his family responsibilities. The bunker itself is actually a centrifuge, which is projected to become something else later on. The mission has two plans: Plan A is to make the centrifuge a space station to get the people of Earth off to safety and plan B is to colonize the most habitable of the three planets along with a bunch of frozen embryos to repopulate the species. Dr. Brand assures Cooper the Earth is dying and humanity doesn't have much longer and that he needs to pilot the craft and explore, lest his family and the rest of the world all die soon. Cooper is very reluctant, because he's barely left Earth's atmosphere, but Brand reminds Cooper the twelve astronauts sent on the mission never even left the simulators beforehand. The next day, Cooper and Murph return back to the farmhouse, his daughter extremely upset with him for choosing the mission. Donald assures Cooper he's doing the right thing, but needs to set things right with Murph. Cooper does his best to comfort a sobbing Murph like any good father would do and promises to come back to her and that they might even be the same age, giving her a wristwatch to compare time. Murph refuses his assurance and that her bookshelf is communicating with her in Morse Code to \"stay\". Despite her pleas, Cooper won't back down and one more book falls down before he leaves, but Cooper disregards it. The space shuttlecraft is rocketing away from Earth at high speed with Cooper, Amelia Brand, Dr. Doyle (Wes Bentley), Dr. Nikolai \"Rom\" Romilly (David Gyasi), and the TARS robot on board. Doyle and Romilly are two scientists that were in the conference room at NASA during the meeting with Cooper. When the spacecraft leaves the atmosphere, everything goes quiet all of a sudden, except the inside. The ring shaped Endurance is up ahead and they dock with it, which has all their needs for space travel. The Endurance is leaving Earth and they bid farewell to a spinning Earth and have to look forward to the lonely, claustrophobic, and potentially dangerous reality of space and put themselves in a plastic-covered water bed called cryosleep for the two-year journey to Saturn. Two years later, Cooper is now out of cryosleep and reviewing video messages. His son Tom tells him he's doing okay and Donald says 'hi' and tells Cooper that Murph still refuses to talk to him. The Endurance crew are orbiting Saturn and come upon the wormhole, which resembles a plasma globe and will provide a channel for the crew to reach the three planets in the next galaxy. . The crew take off for the rough ride, (a la 2001 infinity) and come to their first mission, Miller's Planet. During the time through the wormhole, Amelia reaches out and feels she touched someone's hand. They decide to head first to Miller's planet, intending to stop there only briefly as its close proximity to Gargantua causes severe gravitational time dilation; each hour spent on the surface will cost seven Earth years. Cooper, Amelia, Doyle, and the other robot called CASE decide to risk themselves and intend to be in and out of there in just minutes to survey. All they find is shallow water and wreckage of Miller's ship, who apparently died and arrived just an hour or two earlier, even though she sent the thumbs up beacon on Earth 10 years before. The crew think there are mountains in the distance that turn out to be tsunami waves. Brand becomes trapped under the Miller wreckage and has to be rescued and carried back by CASE, Doyle is drowned, and the ship is flooded and won't be able to make it out for another hour, costing them years. Cooper is frustrated at Brand, but forgives her mistake. After the engines are mostly emptied of water, Cooper fires them up and just manages to escape the next tidal wave and fly off the surface. Cooper and Brand make it back to the Endurance to find an aged and gray Romilly in a robe -- 23 Earth years have passed and Romilly has spent most of the time waiting with a couple of stretches in cryosleep. It is now about the year 2090 on Earth. They are all beyond crushed, but Brand is relieved to know her father is still alive and well. However, Cooper breaks down looking at 23 years of recorded videos and sees before his very eyes his 18-year-old son Tom showing a picture of what he believes is the right girl for him. In next the video, Tom (now played by Casey Affleck) introduces to Cooper to his grandson Jessie. In the next video, a 40-ish Tom reveals that Donald died a week ago and is buried next to Jessie and that he believes Cooper to be missing or dead. Then afterwards an apparent live recording comes from Murph (now played by Jessica Chastain). After 25 years of silence, a still stubborn and saddened Murph tells off her father for not fulfilling the possibility of being back because she is now 35 years of age, which is the same age he was when he left Earth. It's like a knife has been plunged into his heart and he feels he has betrayed her badly and has no way to communicate back with her. On Earth, Murph stops recording the video. It is revealed she is now working at and living in the NASA bunker herself for Dr. John Brand, who is now around 90 and in a wheelchair. Brand is still trying to solve the gravity equation to get Plan A rolling and is reassuring Murph that the crew of the Endurance are receiving their recorded messages, but the crew can't transmit out. Now that the Endurance crew have recovered emotionally, they are debating whether to visit Mann's Planet or Edmond's Planet, because they have just enough fuel to visit one planet, then head back to Earth. Brand wants to visit Edmond's Planet out of emotion because she was in love with him at one time, but Cooper wants to visit Mann's because he's still transmitting his beacon. On Earth, Murph is back at the old Cooper homestead with her brother Tom, a farmer and having torched a third of his crop because of blight, which is getting worse, but he now has his old neighbor's crop to tend to, since he has moved away or died. Pretty soon, the farm may have nothing. She has dinner of corn soufflé and corn-on-the-cob with Tom, his wife Lois (Leah Cairns), and son Coop. She discovers Coop has a bad cough. They want her to stay the night, but she refuses because of bad memories from her childhood. Murph is pretty aware that the nitrogen levels in the air are taking their toll more and more each day. A day or two later, Murph is back at the NASA bunker to find Dr. Brand is dying. He now confesses to her that Plan A is not possible and lied to her, never having been able to completely solve the gravity equation to get people off Earth. She feels that her father knew all about Brand's scheme and that he was trying to escape and leave her and everyone else to die. Dr Brand dies. Murph sends a video message to Amelia informing her of her father's passing and begging for the truth that the whole thing was a sham. The Endurance crew make it to Mann's Planet a few months later; the planet is perpetually cold, covered with glaciers, and has a poisonous atmosphere filled with ice clouds. Dr. Mann, who has been in cryosleep for over 35 years, is awakened by Cooper and has a breakdown and relieved he is rescued. He tells the story of the frigid, but beautiful world he lives in, indicating it has 80% of Earth's gravity and a lower part is livable, possibly even a source of fresh water. Brand sees the video Murph sent about her father dying and Plan A being a sham. She is absolutely shocked and had no idea, but Mann reassures her the equation was solved and deemed impossible before he ever went on the mission. The only way to ever get data would be to get inside a black hole, which is impossible. Back on Earth, Murph and her boyfriend, Dr. Getty (Topher Grace), another NASA physicist, are driving in her Jeep through the bleak plains surveying the endless clouds of black smoke and families with their decrepit 80-90 year old vehicles on the road with their belongings in tow, much like Midwestern farmers in the 1930's escaping to go west to find a better life. She knows the equation is solvable as long as it comes from a black hole and that Dr. Brand only gave part of it. Somewhere in her subconscious, she has a gut feeling that the coordinates of dust on the floor of her bedroom long ago gave her a hint, along the books being pushed off the shelf, and with the Morse code message for Cooper to \"stay\". She has a feeling this \"ghost\" is a being that has tried to comfort her and help save humanity. She knows it's not the end and that humanity is running out of time. Simultaneously, Mann is showing Cooper the icy and forbidding world. Murph is back at the Cooper homestead with Dr. Getty examining Tom's son for his lungs. Dr. Mann pulls off Cooper's voice beacon and pushes Cooper off the cliff and Murph's brother Tom is outraged by Dr. Getty's comment that they can't stay and will die, hitting him in the face. Mann reveals to Cooper that the planet is uninhabitable and that he sent the signal so he could take Cooper's spaceship to return to Earth. Murph confronts Tom that her father never meant to save them, but escape and leave it up to her and Tom outright refuses and tells her to leave, believing it's his duty to take care of the farm to fulfill his promise for his father. Mann is trying to kill Cooper by breaking his helmet's visor, allowing the ammonia-rich air to suffocate Cooper. Cooper manages to reach his voice beacon that was taken off of his helmet by Mann to call out for Brand to rescue him. Murph and Dr. Getty are driving back to NASA, but in a fit of rage, she pulls over and pours gasoline over corn crops and sets them on fire, in order to distract Tom and get back to the farmhouse. Cooper has been rescued by Brand. Mann's living quarters on the planet has exploded and Romilly killed. TARS comes out of the rubble to be rescued by Cooper and Brand and they leave the planet. On Earth, Tom's family is now out of the house and Murph is now in her old bedroom trying to make sense of the past. Cooper and Brand are leaving the planet, but Mann is also in another shuttle trying to do so and refuses to listen to their pleas to not attempt to dock with the Endurance. Murph is in her bedroom examining her old belongings to find out what the \"ghost\" might be telling her. Dr. Mann has steadfastly refused to listen to the warnings from Cooper and Brand not to dock with the Endurance, but he continues his efforts. He's manually maneuvered the ship into docking position, but ignores the computer's warnings of \"imperfect lock\" and we see the docking pincers attempting to grab but failing to lock in. In mid-sentence the coupling release and the violent expulsion of air into space carries him with it, and resulting collision causes an explosion. The Endurance is now out of control and Cooper tells Brand that he is going to dock with it, even though it is now in a rapid rotation. Though the centrifugal g-forces from the spin are enormous, Cooper is able to dock. However, they are unable to get back to Earth and have to go to Edmond's Planet to even hope to survive, because of the life support being destroyed. They have to slingshot around the black hole Gargantua in order to make it to Edmond's Planet and on manual controls. During the harrowing orbit around Gargantua, Cooper and TARS detach their respective shuttles and get sucked into the black hole, sacrificing themselves to collect data on the singularity, and propel Amelia and CASE faster by reducing the ship's mass. Cooper separates from Brand in his Ranger, without her previous knowledge, with Brand on her way to Edmond's Planet. He realizes the cost of orbiting the black hole due to the gravitational time dilation will be 51 Earth years (actually 64, a minor error of estimation on their part), but takes the chance. Brand is outraged with Cooper and now left alone with CASE. As Cooper's shuttle falls into the black hole, gravitational forces begin to rip it apart. Cooper is descending towards the center of the black hole with pellets that look like sleet hitting his Ranger spaceship. The computer of his ship tells him to eject himself and without reluctance, he does it. Cooper descends in the black hole towards a grid full of cubbyholes thinking he's dead and finds himself in some sort of afterlife and unaware of what sort of surroundings he's in which resembles a tesseract. He hits an object along with a bunch of others that look like books stacked and knocks one down, revealing ten-year-old Murph reacting at an object falling from her bookshelf back at the farmhouse. He knocked down the lunar lander model shown at the beginning of the movie. He's screaming out for Murph, but she walks away with it and doesn't hear him. Then he sees Murph in another part of the grid pleading for her father not to leave. Cooper watches this begging himself not to go and to stay using Morse Code by knocking the books off the shelf. Cooper breaks down realizing that he should have listened and not gone on the mission. Then there is adult Murph at the bedroom while the fire is still burning and she realizes all along that her father himself was the ghost communicating with her feeling comforted and reassured. Now it's all making sense to her and she's no longer angry with him and has hope. But she's still trying to find out what her father is trying to signal to her recalling the events of the dust storm coordinates and the books falling off. TARS gets Cooper out of his grief-stricken state that he survived and tells Cooper that some fifth dimensional beings sent him there to communicate with Murph and that his love for his daughter sent him there to help her. Cooper is delighted to see TARS is there with him. Cooper realizes that the mission was not a mistake and that he will get done what he needs to. Murph has been the chosen one to save humanity, but Cooper is the one chosen to help engineer it. He sends the coordinates to himself at the farmhouse to NASA, then the data from the black hole through TARS via Morse Code to a wristwatch he gave Murph before he left, which is the gravity equation. Preteen Murph put the watch back on the shelf making it possible for Cooper to add the black hole equation to it. Adult Murph picks up the old wristwatch out of a box of her old keepsakes seeing the second hand with the Morse Code realizing it's the key. Dr. Getty is pleading with Murph to get out and for them to leave because the fire is out. Murph leaves the farmhouse with the watch in her hand, an angry Tom has arrived back, but she tells him about the watch, embraces him assuring her father was the ghost all along and will save them. Tom is befuddled by it all, but accepts her hug. Murph is back at the NASA bunker completing the equation with the wristwatch, writes it all down, and throws the papers off the deck of the centrifuge under construction that the equation is solved. She kisses Dr. Getty in a fit of happiness. So what's going to happen soon might save most of remaining humanity. Back in the black hole, the fifth dimension is now closing up, with Cooper convinced it all worked and Cooper is comforted that future beings constructed it to make all this happen and tells TARS everything is okay. He comes across the Endurance when it passed through the wormhole and touches Brand's hand, then knocked unconscious into the orbit of Saturn with a couple of beaming lights approaching him. Cooper wakes up to find himself in a hospital bed. A very clean room with background noise of a baseball bat cracking a ball and birds chirping. A doctor tells him to take it easy jokingly telling him he is now 124 years old, but he still looks the same. The doctor tells Cooper he's very lucky to be alive because space rangers found him with only minutes left in his oxygen. Cooper looks outside the window of his room with kids playing baseball with a batter hitting a ball into the sky, which turns out to be the skylight of an upside down house with kids cheering at the window being broken. Cooper is told he's on Cooper Station orbiting Saturn and thinks the station is named after him, but it was named after his daughter Murph. She's still living and on another space station and will be there to visit him in a couple of weeks despite her age and health. Cooper is delighted that Plan A did indeed work out and that the gravity equation was solved. The very centrifuge that was the NASA bunker is now a space station to sustain human life. Cooper is now released from his hospital room by a tour guide and shown the station, an O'Neill cylinder with a old world rural American environment and has artificial sunlight beaming from one side, which was the same place the rocket took off from 89 years ago. They pass by a group of sleek ranger ships that are more efficient than what he used and he takes a great interest in them. He is led to a museum exhibit, which is his old farmhouse, only much cleaner and restored. There are videos all over the place of elderly people telling of the dust bowl they lived in, whom you saw at the beginning of the movie, one of which is his daughter. He finds a shorted out TARS in the farmhouse the rangers recovered and immediately repairs him. Cooper is sitting on the front porch that \"night\" with TARS drinking beer like he and Donald used to do, but very dissatisfied at the artificial surroundings and pretending to be home. He's more interested at the spaceships than anything else and still yearning to explore the unknown. Cooper is about to go to the hospital room where Murph (now played by Ellen Burstyn) is living out the final days of her life -- she'd insisted on being brought to the station to say goodbye to her father. A nurse tells Cooper that her family is in there and that she's spent the last two years in cryosleep. He wasn't aware she had a family and carefully opens the door with over a dozen people from small children to middle age surrounding her bed. His grandchildren, great-grandchildren, and great-great grandchildren and their spouses are there, yet he pays no mind to them and they are puzzled by his appearance. His main interest is seeing his daughter. Murph breaks down in delight at the sight of him and he takes her hand without any reluctance or awkwardness even though he's still a young man of 35 and she's 99-years-old and near death. He assures her he was the ghost that communicated to her in her room and she already knew for years even though nobody believed her. He tells her he's now here to be there for her, but in her still feisty and stubborn ways, she doesn't want him to see her die and her kids are there for her and she forgave him and made peace with his disappearance decades ago. Cooper slowly leaves her room to see her one last time and she's surrounded by her beloved family and his descendants he knows nothing about. Knowing the space station is not where he belongs, he takes Murph's advice to go seek out Brand, who has landed on Edmond's Planet to start colonization. It's a desolate place, but the air is breathable and can sustain life, so it's the best humanity can do outside the space stations. Edmonds died long ago and is buried by CASE, but she continues to set up camp and puts herself in cryosleep. Cooper steals one of the new generation ranger ships he's been obsessed with and goes with TARS through the wormhole to find her and beat the rangers at their mission. *2065 seems to best fit the possible time frame this movie is set at the beginning, since the Donald character laments about the constant invention of gadgets and six billion people on Earth when he was a kid, which would easily fit the early 2010's and he's in his 60's. Also, a wormhole was discovered 48 years prior, making it about 2017, a little leeway from the time this movie was released. Also, blight would take at least a decade or two to have serious problems and a spaceship structure like The Endurance would take a good 30-40 years to construct. And vehicles from the early 2000's can last that long, given the proper resources and if you have no other choices to keep them running. Cuba is a great example, as half the vehicles in that country in the 2010's are still from the 1950's.",
      "writers": [
         "Jonathan Nolan",
         "Christopher Nolan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0816692/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIxNTU4MzY4MF5BMl5BanBnXkFtZTgwMzM4ODI3MjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Matthew McConaughey, Anne Hathaway, Jessica Chastain | See full cast and crew »"],
      "reviews": [
         "I have been a cinema lover for years, read a lot of reviews on IMDb and everywhere, and never found the right movie to write my first review. I always thought I would wait for THE movie. And this is IT! When I first heard that Nolan was preparing a sci-fi movie, I felt like a kid again, waiting for his Christmas gift under the tree. I knew it would become a classic. And I'm sure it will. First of all, it is incredibly beautiful to watch. Honestly, it was so beautiful that I felt like I was sucked into the movie. The way Nolan decided to show some scenes really remind me of 2001 A Space Odyssey (actually many things will probably remind you of this movie). We can feel the talent of Christopher Nolan, just by looking at the way it is filmed. The techniques he used contribute to create that visual environment in a believable way. The sound environment is just mesmerizing. It is a very important part of the movie, because some scenes take place in space, and Noland just found the right way to use sound. The soundtrack (made by the great Hans Zimmer) is breathtaking, epic, amazing, unreal. I could find a lot more adjectives to qualify it, but you have to hear it to understand how epic they are. These two important parts (image and sound) create a stunning atmosphere. You will forget you are in a movie theater, and you will be lost in space, sucked into the adventures of this new Space Odyssey, begging for more. It is a truly unique experience. I can say that I have never felt something like that in a movie theater (at least not for the past ten years). Then, of course, the cast. First of all, Matthew McConaughey. I discovered this actor in Tropic Thunder, but he didn't really convince me, though he was quite funny. Then I saw Dallas Buyers Club. Since that movie, I love him. In this movie... Well, he is the movie. I exaggerate a bit, since there are other great actors (some even unexpected with a special guest) who play extremely well. But he is just what was needed to feel the human part of the story (which is very important in Interstellar). He is capable of making us feel so many different emotions all along the story, as a father, as a human. Anne Hathaway was very convincing, all together the actors managed to create some harmony, which makes the human interactions credible. Caine, Chastaing and Affleck are a perfect choice. And then there is... The special guest, I will call him \"X\". His role, which could be seen as a minor role, is actually much more important than that. He proves, once again, that he is a great actor. Watch and see. And finally, the scenario/story. I won't spoil anything here; I'll just try to convince you how great it is. Nolan is known to revolutionize everything when he tries a new genre in cinema. Well, once again he did it. With The Dark Knight he revolutionized the superhero genre. With Interstellar he's revolutionizing the sci-fi genre in cinema. From what I heard, he worked with a physicist (in gravitational physics and astrophysics) to help him with that movie. And we can feel and see it. During the fifties, Asimov laid the foundations of modern science fiction. Lucas and Kubrick did the same in cinema. Today, Nolan is laying the new foundations of the genre in cinema, proving that cinema is still at the beginning of what can be done (brace yourselves my friends, we have not seen anything yet). Why? Well, simply because we only know a few things about space, some things can't be proved for the moment, so we can use theory, and make the best of it. That is exactly what Nolan did. He used theories that exist today, and made a movie about mankind, about pioneers, about humanity, about us. Because, in spite of all the sci-fi aspect, it is a story about humanity. McConaughey, Hathaway, and mainly \"X\", will managed to convince you about that. My rating for this movie can only be a 10, because in itself, it is a beginning for a new kind of cinema. It IS a classic. Those who say \"we can't compare this movie to 2001 Space Odyssey, nor can we compare Nolan to Kubrick\" are wrong. We can, and we should. Talented people don't live only in the past, some genius live today, among us. And Nolan is one of them. Many say that he is overrated. I truly don't think so. Only time will answer that. This is the sci-fi movie of the decade, and probably the best movie Nolan ever made. Just go for it, without a second thought.",
         "The film begins by establishing at his own rhythm its ambitions: men overexploited land resources, which is why the only goal they have left is to survive. This life is not enough for Cooper, brilliantly played by McConaughey who gave body and soul to this character. But all of this wouldn't hold without the total control of Christopher Nolan, based on the languishing soundtrack by Hans Zimmer, the luminous and impenetrable photography of Hoyte Van Hoytema, and the sincerity of Nolan's directing. He manages to film the characters and to find the right cut at the right time, always in harmony with Hans Zimmer's soundtrack, to give the film an aspiring and inspiring dimension that went missing for many many years. Thus we are transported into the same cockpit that Cooper, we feel the same remorse that he can already feel, we feel the same gravity, and we feel the same fear of the unknown melted with the force of his will. All of this is brilliantly illustrated in a very simple directing choice, which from my point of view is the decisive impetus of the film: to directly jump from when Cooper leaves in his truck, leaving his family behind him, to Endurance taking off. This simple editing decision allows Nolan to give an original movement to his film, and the musical crescendo makes us physically feel the sentimental break between two parts of the film. You don't necessarily have to understand it immediately : The film will raise questions in you, such as : what is it to be a human being, is there some physical limitations to our humanity, how far could we be willing to go to determine knowledge, is there other dimensions that we can not access to, and above all: what is the nature of this intact and immutable bond that unites us to others wherever we are in the universe ? Is this bond only intelligible, or is it also tangible ? All these questions resonate in harmony in Nolan's Interstellar. Interstellar is itself a crescendo, increasing sensitivity and creativity. I use the term deliberately because it goes crescendo with the soundtrack by Hans Zimmer, which is one of the most beautiful music ever scored for a sci-fi movie. We are witnessing a perfect musical arrangement, a total symbiosis, a bit like the music of Gravity which had understood very well how to match the image and the rhythm of a sequence to its own musicality. Zimmer's crescendos are giving a new powerful breath to every new scene, whether it is in visually powerful & intense moments or in more intimate moments; it intrudes into our momentary feelings and sensations, and manages to extend them, sometimes almost to choking, before resting on the balance of the film frame along with our mind spell-bounded. I have seen all the talent of the director that I knew he was outside the norm, but whom I did not know his capacity to reinvent itself. Because this is it: Interstellar is not an action movie, not really a blockbuster, and it goes not entirely but mostly again the expectations of common people. It's much more than that. This is much more than just a sci-fi movie. It is unlike any of his previous films. Some hoped to see Interstellar as Christopher Nolan's best film, and they were disappointed that this was not the case. And indeed, THIS IS NOT THE BEST FILM of Christopher Nolan. Because in a way, IT IS HIS FIRST FILM. I'm not saying that Interstellar is not as good as his other films, it goes beyond all of them. But to me Interstellar is the first film of a new stage in Nolan's filmography ; it is a masterpiece as it the beginning of a work ahead. Interstellar is the proof that Nolan has finally managed, despite all the expectations that were placed on him after the success of The Dark Knight, to move away from his own reputation to create a personal work, original, humble, sincere and deeply, meticulously, measured. Now, in this third act of the film, it all comes to life with unparalleled strength. Nolan poses and answers questions that raise others. But he focuses his attention on the great mystery of love, that emotional bond that can unite men and sometimes separate them. But Nolan is the only one that can successfully speak of love from a being to another in a film that mainly takes place in a another galaxy. From my point of view, only Solaris by Steven Soderbergh (2002), unfortunately neglected by the audience, was able to accomplish that. Interstellar is based on a premise which is the following : from terrestrial dust to the depths of space and time, we can never be separated from who we are as individuals and as a species, as we always leave a part of ourselves \"behind\" us. In other words, I could say that this is a human story, and even if we go as far as we want to, if we travel through the universe believing that we can be detached of the one we are fond of, we will only get closer to them. Because the separation, and thus the distance and time, can only ultimately reinforce the relationship between the people who really love each other. Because it is going to the end of the world, when we reach the end of ourselves, that we reach the singularity of the \"black hole beyond the horizon\" * : it is our humanity. No, I wasn't been able to find any bad flaws in the film. Not one, and I'm still looking. After all, Interstellar is like gravity, \"all it takes is a little push ! \" *you'll have to see the movie to figure that one out. Félix Tardieu, November 1st, 2014",
         "(This is both a review of the film, and an assertion of Christopher Nolan's filmmaking style) There have been many reviewers and critics alike that have high praise for the film (the visual effects, the acting, the music), but say how it's not Christopher Nolan's best directed film. This is where i personally would have to disagree. Before i get into it, though, i'll talk about Interstellar a bit. Interstellar is truly a sci-fi epic like no other. To compare said film to '2001: A Space Odyssey' isn't just a disservice, but unnecessary. The films are almost nothing alike, simply sharing small plot elements. Also, Stanley Kubrick's vision of Arthur C. Clarke's sci-fi epic wasn't to ponder the philosophical questions that accompanied the story, but to make art, and art is was, and is. With Interstellar, Mr. Nolan set out to make his most personal and emotional film to date about love and time (time being a recurring theme throughout all of Nolan's films). But it's so much more than that too. There are no words to express the epic journey Nolan takes us on in the film, but needless to say, it's tear-jerking and emotional throughout. The acting is top-notch, especially McConaughey, who gives (I would say) his most emotional performance yet. But the actor who stole the show in a few scenes (one in particular, when they're on an alien planet) was David Gyasi as Romilly, one of the astronauts aboard the Endurance, their spacecraft. The musical score from Hans Zimmer is, without a doubt, his best and most influential work to date, helping drive the film's bold and breath-taking vision (the church organ helped significantly). The visual effects are easily the best to date as well, and of the year. To see a black hole created through visual effects in such a way, with pages theoretical equations provided by Kip Thorne (theoretical physicist, of whom's work inspired the film's genesis); what you see in the film is the most realistic depiction of a black hole, and even offered new insight to accretion discs surrounding the anomalies. But even everything else, from the alien planets to the Endurance, the visuals always look real. Then, there's the writing. I would definitely have to say this has some of the best dialogue i've ever heard in a sci-fi movie, and the script continually pours or oozes emotion, keeping the audience tethered to the film. Now, about Mr. Nolan. Don't just look at Nolan, but look at his films. Some say Inception would be his masterpiece, while others would say it's The Dark Knight, or Memento. But honestly, every single film Christopher Nolan has directed is a masterpiece not of its genre, but of Nolan. Following is his quiet masterpiece, not the film that put Mr. Nolan on the map as a phenomenal director, but one people visited or revisited after becoming accustomed to Nolan, after seeing Memento, what could be called his breakout masterpiece. Then, right after, he directed the remake of the Norwegian thriller, Insomnia. This, too, could be considered a masterpiece, even if a remake. Then, we were given his take on the Batman universe, starting with Batman Begins, the origin masterpiece. Then, there's The Prestige, adapted from the novel of the same name, which can be called his dark masterpiece. The Dark Knight, his bold masterpiece; Inception, his complex masterpiece, and The Dark Knight Rises, his flawed masterpiece. Now, we have Interstellar, his emotional or personal masterpiece. This is just my looking at Nolan and his films, but whatever your thoughts are, you can't deny Interstellar is one hell of a journey. He certainly is one of the best filmmakers of our time, and of all time. I can't wait to see what he does next, but i'm not sure it will be as emotionally powerful as Interstellar.",
         "I was extremely lucky to get the chance to see this film upon its first day release, before entering the cinema, my expectations were already high, after all, this was a film from the cinematic genius who brought us the likes of 'Inception' and 'The Dark Knight', to summarise the following review in a single sentence: I left the cinema in extreme awe from the visual masterpiece I had just viewed. A film that explores the psychological and emotional state of a man whose life revolves around his family, 'Interstellar' is a thrilling and thought-provoking film that boasts an intellectual story masterfully written by the Nolan brothers. Whilst there seems to have been influence from films like '2001: A Space Odyssey' and 'Apollo 13', 'Interstellar' is unique in its own way. Whilst the subject may be hard to comprehend at times, it can't be denied how visually monumental and thoughtful Christopher Nolan's epic science fiction masterpiece is, and can easily be named the best film of this year and possibly one of the greatest science fiction films to have ever graced the screen. A sheer brilliant feat of cinema.",
         "'Interstellar' was incredible. The visuals, the score, the acting, were all amazing. The plot is definitely one of the most original I've seen in a while. Most of the critic reviews have said that some bits are a little too unbelievable, but I have to disagree. Yes, there were some parts that were definitely in the \"fi\" part of sci-fi. But the thing is, 'Interstellar' deals with concepts that we know very little about. We have no idea what the 4th or 5th dimension is like, or what it would be like to go through a wormhole or a black hole. I don't think it's fair to call something unbelievable, when we have absolutely no idea what WOULD be believable in those circumstances. Either way, excellent writing from the Nolan brothers. The visuals were outstanding, and will no doubt be nominated for an Oscar. The performances were excellent, though nothing Oscar worthy, as is the case with most of Nolan's films ('The Dark Knight' being the obvious exception). Hans Zimmer's score was amazing and blended perfectly with the film. All in all, 'Interstellar' is an excellent movie, which I personally think is Nolan's most beautiful film to date.",
         "Love is the one thing that transcends time and space... New creation of Christopher Nolan's genius, whose name is now known to everyone. His films are waiting with a special look, because it offers something that every day, unfortunately, less and less can be found in the world of mass cinema - an interesting spectacle, filled with meaning, ideas and emotions. At this time, Christopher decided to send us not to the world of dreams, and even not on the dark streets of Gotham City. No, now he send us to the journey to, and perhaps beyond the boundaries of the possible and impossible, through the curvature of space and time, in other worlds. And you won't forget this trip, this can be assured. I was madly waiting for Interstellar's release. And then, finally, I was able to see this Beauty - at the premiere in my coutry on October, 29. It was incredibly exciting. It was a delight. It was unforgettable. It was gorgeous. Nolan once again amazes the viewer's imagination by his painting. Journey to the brink of infinity, the line where humanity has never set, acts as either the first-born purpose and a background of emotional history about the father and the daughter. A loving father who mankind need to help, but that he should leave his children, and a loving daughter who doesn't want to let her dad in the infinity darkness. Starting from the very first frame and ending with the closing credits, a new picture of Nolan will absorb you completely, forcing stare at the screen during the whole action, because it's all so exciting and interesting that escape becomes physically impossible. No, this three hours won't fly quickly for you. You'll feel every emotion, every event, every character. You will not look how the main characters travel through the universe, because the movie experience in this film is so excellent that you will be on board of \"Endurance\" starship and travel between the worlds with the main characters by yourself. The emotional core of this story is the relationship of Matthew McConaughey's character and his daughter - Mackenzie Foy' and Jessica Chastain' character. And the acting work of these three artists in \"Interstellar\" impress the most. McConaughey was acting really great, and this is one of the most emotional, if not the most emotional role of his life. All the drama and tragedy of the relationship of father and daughter in this film will not leave anyone indifferent. Anne Hathaway, Wes Bentley, Michael Caine, Casey Affleck, Ellen Burstyn and other actors also coped with their roles and presented the film's supporting characters very realistic. I would particularly like to note a small but important in this story role of Matt Damon, a character who has received quite memorable. If we talk about the characters, it should be noted also two robots that accompanied our heroes in this difficult journey. One of them adds a touch of humor in the film, which mitigates constantly depressing, dramatic, and sometimes really dark atmosphere. The script of the film is very well combined the history of space exploration and the relationship between Cooper and Murph. The story is complex and complicated, is based on real scientific theories by Kip Thorne, and indeed contains a reference to the \"Space Odyssey\" and other sci-fi pictures. This story about true love, about loyalty, forgiveness, fraud, hard decisions, and much more. And it is designed so that leaves a lot of room for the imagination of the viewer. It's also possible to notice some structure allusion to another Nolan's work - Inception. The story and visuals are combined just perfectly in Interstellar. Hans Zimmer's score, written by him on the basis of only one letter from Nolan, hold the key: \"Once we become parents, we can't help but look at ourselves through the eyes of our children\", deserves a special praise. On this basis, Hans managed to write just incredible soundtrack that perfectly harmonizes with the history and the visual side of the picture. And this work of the composer is really different from the previous ones. It is executed in a different style from another subject in its base. Very impressive work, which will be pleasantly listened again and separate from the film itself. Visual range of the picture is incredibly beautiful and circuses. The \"Endurance\" itself, new worlds, insanely beautiful and mysterious space, wormholes, black holes, and travel through them, folds of time and space are arranged so that is simply breathtaking. I would like to thank all those who contributed to the creation of a visual of this film. It must be seen. That mastery with which this is done, not just words. In the visual pattern also has some references to the Kubrick's \"Odyssey\", and they are pleasing to the eye. Many thanks to Christopher Nolan for having given us such an incredible movie, which once again proved to us that the cinema is Nolan's life. \"Interstellar\" is a film that wins the hearts of the audience not only with its sci-fi splendor, but also an emotional story that lies at its very heart. This film is not only about the discoveries, space exploration and the final frontier of mankind, but also about the relationship of father and daughter, who were in a difficult situation in life when one has to leave the other in the name of a goal that can not be underestimated. So, with what Nolan's genius unfolds before us this action is beyond praise. Combining the story, filled with not only real science fiction, but the true human values ​​and emotions, outstanding and very emotional performances, breathtaking visuals, epic and dramatic soundtrack, Christopher Nolan breathed the life into this film by his directing to create something truly masterpiece again. \"Do Not Go Gentle Into That Good Night... Rage, Rage Against The Dying Of The Light.\"",
         "This was one turkey of a SCI FI. This is my report. Near the beginning of the movie a family gets a flat tire in the dust-bowl corn fields of any mid-western alternate reality. The dad is played by Mud and in his alternate world he hangs a 90 and does like SEVENTY through the corn without the slightest bump, all the while deftly hacking his laptop to commandeer a nearby drone. After stealing the drone, Mud decides that he must leave his kids to prove to their uppity teacher that NASA really did go to the Moon. He is chosen by Alfred to blast off with Catwoman in a reasonably 20th century 3-stage rocket that will eventually dock with an incredibly advanced 22nd century space station/rocket-ship. After leaving Earth, they need no longer adhere to primitive Earth technology. Now they can do anything that already ever happened on Star Trek, including Cryo-Sleep. When they wake up feeling refreshed they head for a cool wormhole that Stanley and Alfred told them about. They are hoping to find a new planet for all the okies to go to, at least that's Plan A. There is a Plan B but it's sub PC and is not going to work for Mud who is all about hurrying on up back to Earth so he can save everyone. Gotta say more here about Mud's robot chum as he is remarkable with a fingerprint smeared body consisting of multiple swinging HVAC ducts that can navigate through zero gravity, run across boulder fields, and even walk on water, not to mention rescue damsels while carrying on charming banter with a voice socially engineered to be annoying. After they go through the wormhole they go to a waterworld where the laws of physics need not apply. Each hour they spend is equal to 17 years on Earth. Where's Einstein when you need him? The whole planet is covered with 3 feet of water which is fortunate since Catwoman can't swim. Back on Earth, the dispossessed are aging rapidly with their old-school monster trucks and other quaint artifacts of 20th century dust-bowl Arkansas. Mud's kids get growed up and environmentally challenged, but it's really about how Mud abandoned them. Eventually Mud and Catwoman go to a really crappy planet that seems even worse than dust-bowl earth, yet they feel hopeful that they might move their famblys there, perhaps down under the frozen ammonia glaciers. They find a sinister guy who looks like Matt Damon's dad who gets all evil and blows stuff up. Mud decides that he's gonna take the tin man and fly into the near-bye black hole that is just 14 billion light years away. Mudbot knows in his crazy-brilliant, hillbilly-sage way, that if he just makes a B-line through the B-hole he is going to pop the cherry. With Hans Zimmer in the house Mud trips his way through the five-dimensional space. After an abbreviated acid trip (Thanks Kubrick, thanks Trumbull) Mud skips the room with the old man and starts floating around in an empty library. He peers through the stacks at his past-life capers while pondering the tangled twists which makes him feel real sad and then he feels real mad and yells at his little daughter who can't even hear him. If only he could communicate using just his sheer acting.... Meanwhile, Mud's grown-up daughter on Earth also feels sad and mad and she tells her brother to Argo F himself for not joining her in her cave. She doesn't like the air quality either so she torches her bro's corn crop. Harsh. Then she starts moping around in the old family library, the very same one that Mud is trapped behind the stacks in, except Muds library is made by humans from the future. At least that's what the robot said. Suddenly while pondering a wristwatch big daughter has an epiphany and realizes that all you really need is� �. wait for it�. Gravity! Lots of good opportunities to cry here, what with Mud screaming at the little and big version of his daughter and having epiphanies right and left. Something (no idea what) clicks and Mud tells the robot to get binary and convert the 'quantum data' into Morse code so that he can power-emote it to the wristwatch that daughter is trippin on. Wait, did she just hallucinate? or did the little minute hand start jiggling around? It did do a jiggly wiggly and the jiggles are obviously coded gravity-signal wiggles coming through the black-hole bookshelf world from her crazy hick-savant dad. Well that about wraps it up. Needless to say,... big daughter trans-codes the Quantum Jiggles into FORTRAN code and saves the world or at least makes it a lot less dusty and so that people get to go to Hawaii again. Years later the big daughter becomes really ancient daughter and cryo-naps in the hope of seeing Mud again. Darned if some of the freshly quantum jiggled peoples don't figure out how to make space rockets again and they even find Mud just in time so that he can come back and be ignored by everybody he saved. Apparently the robot ran off with catwoman so ancient daughter wakes up and figures it is just so much easier to go to Saturn with her tube and her hospital Bed. A bunch of other family members go with her just for convenience sake and they all gather around her bed. When Mud comes in they decide to walk out en masse without even glancing at Mud even though he is their great gran-pappy and saved the world and discovered quantum gravity love. More sweet, sweet tears as dad and daughter commiserate. After an appropriate interval daughter wisely tells daddy to go and enjoy his youth, steal a spaceship, and try and win catwoman back from the swinging robot.",
         "Just watched Interstellar in imax 70mm. Science Fiction fans can read on, everyone else can skip. Movie is a visual masterpiece. Like his earlier movies, Christopher Nolan once again proved, how big a movie can be! There were some shots,which made audience go crazy..Some scenes were as epic as 2001: A Space Odyssey. Do not go into the theatre expecting an action packed cerebral thriller. This one is not for action fans. At times, movie go highly sentimental( Matthew McConaughey does what he is best in and supposed to). I recommend this movie to all the Sci-Fi fans out there, make sure you go in group of sci-fi nuts!! Do not go with the hype..Go, sit back and enjoy. Just like Inception, this movie will be known as great after few months(I know people who said Inception was a crap when it released, and after few months rating it 10/10 in IMDb :D). I don't wanna spoil anything(If you want PM me). Also, make sure you go to the best theatre close to you. (If you loved Donnie Darko, 2001: A Space Odyssey, this is the one for you, Get ready to get mind blown!!) Interstellar Movie is EPIC in all sense!!",
         "It is beyond me how people can claim the movie to be 'brainy', 'intelligent', 'well written'... With all the things I read about the movie prior to seeing it makes it the biggest disappointment I've experienced from cinema in years. I give 1 star to bring balance to the current rating, in reality this movie is of course not that bad. The whole idea behind the plot is that McConaughey ended up in this blackhole where 5 dimensions were compressed into 3 dimensions and stuff, and where he was able to manipulate gravity by sending his daughter the message which was imperative for saving humanity. So what in fact happened is through this ridiculously improbable chain of events McConaughey ended up inside this blackhole. All this was apparently the result of a bigger plan all along. Was there really no easier way for (future humans/aliens) to transmit this data, and if they built this time-space warping machine inside the blackhole - means they had access to the data all along? And also means they chose McConaughey daughter on purpose? So I don't understand, what was this purpose? Could they not have connected their portal to professor's office a long time ago, or go for one of the ten billion more rational alternatives? On a side note: is it not funny how McConaughey ignored the message NOT TO GO from the same 'ghost' yet followed the rest of the directions? While in the end of the movie he idiotically repeats his feeble attempt. Had he added 'it's you dad' or any other sensible hint he would have saved his daughter years of suffering (and maybe a lifetime for himself when he realises this). And I don't even want to get into how ridiculous it is that he transmitted data by moving the hands on the watch, which was unaffected after being picked up, meaning it was hardly gravitational manipulation was it? What was the point of trying to be scientific and trying to explain it in this way then. If he could do that, he ought to have found a better solution that did not require his daughter 25 years to figure out. And anyway, they saved humanity by building this massive station named after his daughter (by that time they knew what he went through and they still named it after her?). Why couldn't they have done the same thing on Earth? Just build the same goddamn station on Earth without needing to harvest their gravitational energy bullsh*t, bam, humanity saved in the same way. Grand ideas don't make great movies if you can't deliver them properly... It is atrocity to compare this to Kubrick's masterpiece...",
         "The universe is full of fascinating facts. It's mind-bending to contemplate, for example, the awesome size of our galaxy. Light travels 186,000 miles per second and yet it takes 100,000 years for a single beam of light to cross the entire Milky Way Galaxy. And our galaxy, to quote Carl Sagan, is only one among billions and billions. The vastness of space truly is stunning. But thanks to a \"worm hole\" the folks in Interstellar leave the Milky Way in a cosmic snap of the fingers. And yet, having just achieved this most amazing of all feats, our heroes are pretty much bored to tears. Instead, everybody is more concerned with some father/daughter relationship that wasn't developed in the first place. Look, if you're going to make a movie that purports to explore the fascinating mysteries of the universe, then do it! Have some wonderment in the story. Dazzle me not only with visuals, but with amazement at the astonishing scope of our universe. And why not produce a script that obeys the laws of astrophysics, or at least some theories thereof? This movie takes something that would dwarf the Apollo lunar missions and turns it into some ridiculous \"Plan A/Plan B\" tediousness. I suggest instead watching \"Through the Wormhole\" with Morgan Freeman or re- watching \"2001: A Space Odyssey.\" Heck, even \"Contact\" with Jodie Foster is far more entertaining and imaginative than Interstellar. And yet. . .9.2 stars! I'm not saying 10-star reviews on this site are phony; after all, major film critics also are raving about Interstellar. Unfortunately, I find most professional film critics about as credible as the physics in this movie. Frankly, Interstellar is a boring movie! And if that puts me in the vast minority of reviewers, fine, I can live with that. Because I have minimum standards when I pay $11 for admission and $8.50 for large popcorn. Stay home and read a good book instead, or just gaze out at the night sky and reflect on our amazing universe."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Warner Bros.",
         "Legendary Pictures"
      ],
      "summaries": [
         "In the near future, Earth has been devastated by drought and famine, causing a scarcity in food and extreme changes in climate. When humanity is facing extinction, a mysterious rip in the space-time continuum is discovered, giving mankind the opportunity to widen its lifespan. A group of explorers must travel beyond our solar system in search of a planet that can sustain life. The crew of the Endurance are required to think bigger and go further than any human in history as they embark on an interstellar voyage into the unknown. Coop, the pilot of the Endurance, must decide between seeing his children again and the future of the human race.",
         "An ex-engineer becoming an astronaut who leads the interstellar journey through a wormhole to finding a new home for the human race and rescue the Lazarus crew who left and survived in a new discovered galaxy with the Endurance spaceship crew.",
         "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life.",
         "In the near future around the American Midwest, Cooper an ex-science engineer and pilot, is tied to his farming land with his daughter Murph and son Tom. As devastating sandstorms ravage earths crops, the people of Earth realize their life here is coming to an end as food begins to run out. Eventually stumbling upon a NASA base near Cooper's home, he is asked to go on a daring mission with a few other scientists into a wormhole because of Cooper's scientific intellect and ability to pilot aircraft unlike the other crew members. In order to find a new home while Earth decays, Cooper must decide to either stay, or risk never seeing his children again in order to save the human race by finding another habitable planet.",
         "A team of explorers must find the human race a new home after earth is struck with worldwide food shortages and corn is the most valuable food. Utilizing a mysterious wormhole they explore strange new worlds and could find a home to save the human race.",
         "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival."
      ],
      "budget": 165000000
   },
   "movielensId": 109487,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-11-05",
      "dvdReleaseDate": null,
      "directors": ["Christopher Nolan"],
      "runtime": 169,
      "movieId": 109487,
      "title": "Interstellar",
      "mpaa": "PG-13",
      "actors": [
         "Matthew McConaughey",
         "Jessica Chastain",
         "Anne Hathaway",
         "Michael Caine",
         "Casey Affleck",
         "Mackenzie Foy",
         "Timothée Chalamet",
         "Bill Irwin",
         "Matt Damon",
         "Ellen Burstyn",
         "John Lithgow",
         "Wes Bentley",
         "Topher Grace",
         "David Oyelowo",
         "David Gyasi",
         "William Devane",
         "Josh Stewart",
         "Collette Wolfe",
         "Leah Cairns",
         "Russ Fega",
         "Lena Georgas",
         "Jeff Hephner",
         "Elyes Gabel",
         "Brooke Smith",
         "Liam Dickinson",
         "Francis X. McCarthy",
         "Andrew Borba",
         "Flora Nolan",
         "William Patrick Brown",
         "Cici Leah Campbell",
         "Kristian Van der Heyden",
         "Mark Casimir Dyniewicz",
         "Joseph Oliveira",
         "Ryan Irving",
         "Alexander Michael Helisek",
         "Benjamin Hardy"
      ],
      "imdbMovieId": "0816692",
      "originalTitle": "Interstellar",
      "genres": [
         "Adventure",
         "Drama",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "ePbKGoIGAXY",
         "2LqzF5WauAw",
         "nyc6RJEEe0U",
         "zSWdZVtXT7E",
         "KlyknsTJk0w",
         "0vxOhd4qlnA",
         "827FNDpQWrQ",
         "LY19rHKAaAg",
         "Rt2LHkSwdPQ"
      ],
      "plotSummary": "Interstellar chronicles the adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
      "tmdbMovieId": 157336,
      "avgRating": 4.0899,
      "releaseYear": "2014",
      "numRatings": 21419,
      "posterPath": "/nBNZadXqJSdt05SHLqgT0HuC5Gm.jpg"
   }
}