{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "1970s",
            "id": 1228
         },
         {
            "name": "mutant",
            "id": 1852
         },
         {
            "name": "time travel",
            "id": 4379
         },
         {
            "name": "based on comic",
            "id": 9717
         },
         {
            "name": "superhuman",
            "id": 10761
         },
         {
            "name": "storm",
            "id": 14527
         },
         {
            "name": "beast",
            "id": 161271
         },
         {
            "name": "aftercreditsstinger",
            "id": 179430
         },
         {
            "name": "changing the past or future",
            "id": 206736
         }
      ],
      "imdb_id": "tt1877832",
      "video": false,
      "title": "X-Men: Days of Future Past",
      "recommendations": [
         100402,
         102382,
         76338,
         49538,
         76170,
         36658,
         137113,
         91314,
         36668,
         124905,
         246655,
         99861,
         2080,
         57158,
         119450,
         36657,
         118340,
         98566,
         122917,
         97020
      ],
      "backdrop_path": "/5LBcSLHAtEIIgvNkA2dPmYH5wR7.jpg",
      "revenue": 747862775,
      "reviews": [
         {
            "author": "JayDeeMac",
            "id": "53821f910e0a2624cb00a4ab",
            "content": "**Year of release** 2014 **Directed by** Bryan Singer **Written by** Simon Kinberg **Starring** Hugh Jackman James McAvoy Michael Fassbender Jennifer Lawrence Peter Dinklage Ellen Page\r\n\r\n**X-Men: Days of Future Past** (rating: 4 ++)\r\n\r\n**Plot** - In a dystopian future of 2023 where mutant-kind has been all but wiped out by powerful robots known as Sentinels the last surviving mutants launch one final attempt to save their species from extinction. Hiding out in a monastery in China, Kitty Pryde (Page) sends Wolverine's (Jackman) consciousness back in time to 1973. His task is to prevent Mystique (Lawrence) from murdering the Sentinels' creator Bolivar Trask (Dinklage). His murder made him a martyr and ensured that his destructive creation went into production. In addition, Mystique is captured in the process and her DNA used to engineer even more powerful machines. By stopping the murder the hope is that they will change the future and save their species. Seeking out the young Charles Xavier (McAvoy) Wolverine is despondent to find that he is not the man he will come to know decades later. With Xavier a broken man, Wolverine's first challenge is to help him find his old strength. The next challenge isn't one that sits all that well with Xavier; they must break Magneto (Fassbender) out of a prison cell beneath the Pentagon. To do so they enlist the aid of Quicksilver (Evan Peters), a mutant with superhuman speed. With Magneto and Xavier once again standing side-by-side they head to Paris to attempt to stop Trask's murder at Mystique's hands, but will they make it in time?\r\n\r\nIn a fitting move considering the storyline of this film allow me to go back in time to the year 2000 where I can still remember going to see the first X-Men film in August of that year. Hard as it may be to believe, the big superhero film was not the guaranteed box office success they are nowadays. Following the disastrous reception that met 1997's Batman & Robin the superhero genre was on life support, and another big failure could have seen the plug pulled. Thankfully for all us fanboys out there the film proved to be both a critical and commercial success, kicking off a surge in comic book films which has seen them come to dominate the box-office. Well somehow 14 years have passed since then (and I can't quite believe that :eek:) and we now have the 7th film in the X-Men franchise. Now since the solid start of X-Men the series hasn't exactly been the most reliable in terms of quality and has been rather overshadowed by the Batman's, Spider-Man's, Iron Man's and Avengers' of this world. In truth you could probably split the previous 6 films evenly into 'the good' and 'the not so good'; though to be fair to The Wolverine which I'd put in the latter category it's pretty decent. Well as the 7th film in the series this was always set to break the tie and the good news is that it has swung the pendulum very much towards the positive side of things. \r\n\r\nThat said however I didn't find that I was quite as high on the film as many other people seem to be. As seems to be the case for just about every other superhero film these days, the release of DoFP has seen many people instantly jump on the bandwagon of proclaiming this the best superhero film ever. While I certainly wouldn't go that far this is an extremely entertaining entry into the X-Men franchise, and one that continues the upswing of First Class. The film does open in absolutely thrilling fashion and ends quite strongly as well. In between these wonderful bursts of action though I just found that the film had a tendency to fall into a lull on a couple of occasions. With its complicated story the film has to spend a lot of time trying to keep things clear for the audience, which sadly results in the situation and the stakes being reiterated time and time again. It just threatens to get bogged down by becoming overly talky, derailing the momentum and in general I didn't feel it was as well paced as Captain America: The Winter Soldier for example. An additional action sequence or two I don't think would have gone amiss. I also feel that it perhaps lacked the colour, energy and sense of fun of X-Men: First Class. Some of that comes from the fact that I didn't feel DoFP embraced its period setting to the degree that First Class did which on more than one occasion felt like a Sean Connery Bond film. A few snazzy outfits and some brief touches upon the Vietnam War aside I don't think it really exploited the 70s era to the fullest. And I think the Vietnam sequence was actually amongst the film's weaker moments; an unnecessary detour which could easily have been left on cutting room floor.  \r\n\r\nAs I mentioned, the opening sequence of DoFP is a terrific way to kick the film off; in fact I think its got to be one of the best opening gambits of any superhero film. The film instantly drops us right into the middle of a Sentinel attack upon the X-Men in the future; making for an absolutely thrilling opening. It's a wonderfully creative sequence that features  some genius choreography as the hitherto unknown Blink (played by Fan Bingbing), with her ability to create teleportation portals, emerges as one of the most visually dazzling mutants we've seen so far throughout the series. It's a terrific set-piece that the film arguably never matches for the next two hours, at least in terms of action and excitement; there is a sequence however that is fantastically entertaining which we'll get to later. The big finale then aims to be and mostly achieves feeling like a suitably epic affair that encapsulates Sentinels, the White House and the RFK sports stadium. At the same time the film is also jumping back and forth between this and the future where the Sentinels have once again launched an assault upon the X-Men. The only problem, and one that is in complete contrast to other superhero films such as Man of Steel, is that I didn't feel its concluding battle was quite long enough. The two competing sequences feel like they are slightly lacking in action and drama, and are over too soon.\r\n\r\n**Film Trivia Snippets** - In reference to the X-Men member Kitty Pryde, and her importance to this particular film, DoFP was shot under the working title of “Hello Kitty.” /// Days of Future Past is based on a storyline of the same name that appeared across two issues of Uncanny X-Men in 1981, and was written by Chris Claremont. It is now the fourth film to be based on a story penned by legendary X-Men writer Claremont. X2 was adapted from 'God Loves, Man Kills'; X-Men: The Last Stand was based on his 'Dark Phoenix Saga'; and The Wolverine was based on his comic of the same name. In the comic the future world was set in the year 2013, the same year in which filming for the movie version began. /// The bullet wounds that appear on Wolverine's chest on his arrival to the 1970s is in the form of the Big Dipper. This is an homage to the 1980s anime series, Fist of the North Star, whose protagonist Kenshiro has the same scar pattern on his chest. /// Prior to making the film, Bryan Singer had a two-hour discussion with James Cameron abut how to make a time-travel concept feasible and workable within the film. Thanks to Cameron's experience as the director of The Terminator and Terminator 2 the two discussed concepts including alternate universes and string theory (a field of quantum physics that define multiple universes). /// It's quite clear just by looking at the credits that this is one hell of a cast that's been assembled. If you're looking for more proof however then how about this; the four main female X-Men in the principal cast (Halle Berry, Jennifer Lawrence, Ellen Page and Anna Paquin) are all Academy Award nominess, while the six principle male cast members (Hugh Jackman, Michael Fassbender, James McAvoy, Ian McKellen, Patrick Stewart and Peter Dinklage) are all Golden Globe nominees.\r\n\r\nWith such a prestigious cast at Bryan Singer's disposal it's no surprise to find that performances across the board are generally of a high standard. Though the sizeable cast means that not everyone gets an equal chance to shine; Halle Berry's involvement for example is little more than a cameo. In fact I'm struggling to think if she even had a single line throughout the whole film or if all she did was make it rain a little bit. And the whole future ensemble are almost completely sidelined, meaning that the established regulars are given little to do other than spout some exposition, while the various new additions (Bishop, Blink, Warpath, Sunspot etc) are given absolutely no introduction whatsoever so we have little reason to care about them or mourn their demise. In fact for the majority of them I'm not even sure there names are known until we get to the closing credits. The lack of exposure given to the future timeline was certainly a disappointment. As a result it's in the past where the most noteable performances come from with solid efforts coming from Lawrence, Fassbender, Jackman etc. However the one individual who is able to stand out from the crowd for me would have to be James McAvoy who I thought was just excellent as the young Charles Xavier. The fact that he is given the strongest characterisation and the most to work with certainly helps. We initially find him as this supremely broken individual who is in great pain both physically and emotionally, but with help from Wolverine he is able to find his way back onto his path. \t\t\r\n\r\nThe two most notable additions to the X-Men world this time out were Evan Peters' Quicksilver and Peter Dinklage's Bolivar Trask. And as it turns out the end result for both was completely flipped from what many were predicting beforehand. The promo images for Quicksilver had fanboys already sharpening their knives before the film had even hit cinemas, ready to tear into him with the kind of fervour reserved for Batsuit nipples and Ben Affleck. And yes I have to say that his appearance still comes across as rather bizarre and stupid, kind of like Julian Assange as styled by Lady Gaga. As a character however he kind of kicks ass, his introduction arguably being the coolest addition to the franchise since Alan Cumming's Nightcrawler back in X2. And just like Nightcrawler had with his incursion into the White House, Quicksilver is given the spotlight all to himself at one point to really make a name for himself. This time it's a break-out from the Pentagon where his incredible speed comes into its own with a terrifically fun and inventive set-piece that allows him to steal the film from his more illustrious co-stars before sadly disappearing shortly afterwards. The way he is just written out is rather disappointing and feels like it's only been done to help free up space for everyone else. It does however leave the audience wanting more, so it's good news that he's going to be starring in X-Men: Apocalypse. My only concern about the character is whether they've actually made him too powerful. They show his abilities as being so strong that you imagine he could destroy any mutants, even the likes of Magneto and Xavier, before they even had the chance to respond.\r\n\r\nThe real disappointment amongst the cast is Dinklage's Trask. Now Dinklage is a great actor, no doubt about that, and I think he personally does good work here. It's just that the character he is lumbered with here I felt was a little bit dull to be honest (particularly for the film's supposed 'big bad'), giving him very little to really sink his teeth into. That also creates one of the film's few main flaws in my eyes; the lack of a strong villain. Trask kind of takes the place of Senator Kelly from the first X-Men film, but that film also had Magneto and his Brotherhood of Mutants as villains. While the future X-Men do face off against the considerable threat of the Sentinels they are a fairly blank entity devoid of an actual character or personality that can interact with the X-Men. Which is not to say they are not effective foils for our mutant heroes, you just get the feeling that there should be big bad in charge of deploying and controlling those machines. In terms of design the Sentinels may disappoint and likely anger the real X-Men fanboys out there, baring little resemblance to their comic book counterparts. In fact they aren't a million miles away from The Destroyer as seen in the first Thor film. However I don't think there's any denying that they most certainly do make an impact; in fact they are rather chilling, unsettling creations. The fact that the X-Men suffer some very violent, nasty deaths certainly heightens that feeling.\t\r\n\r\n**Film Trivia Snippets** - Bryan Singer talked about \"changing history\" in an interview with Empire Magazine(May 2014). The director stated \"I don't want people to panic about us erasing the movies. I believe in multiverses,\" explaining the possibility of certain events as they would be part of the history of alternate universes. /// In the \"Days of Future Past\" comic it was Shadowcat (Kitty Pryde) who went back in time; in the film it's Wolverine. According to writer Simon Kinberg, Kitty was intended to be the time-traveller but it didn't work out: \"Kitty in the era of young Magneto and Xavier, would have been negative 20 years old. The reflex response to that was a character who doesn't age. Wolverine is the only character who would look the same in 1973 as he does in the future.\" Thus, Wolverine was picked for being an ageless immortal character who would bridge past and future. /// To create the sensation of Quicksilver's incredible speed ability Bryan Singer filmed his scenes in a special format of 3600 frames per second. This means that Quicksilver will be moving 150 times faster than normal. /// Josh Helman was originally going to be cast as a young Cain Marko/Juggernaut. But Juggernaut was written out of the film, and Helman was offered the role of a young William Styker. /// Bryan Singer based Bolivar Trask on Adolg Hitler; “As Hitler used the Jews as a scapegoat to bond the darker parts of Europe, he's doing the same thing with mutants. But he wasn't a six foot, perfect blond Aryan - he was a short, funny looking fellow!” \t\t\r\n\r\nNow considering the fairly dense and complicated storyline that encompasses two timelines and what feels like dozens of characters I think that the film's writer, Simon Kinberg, actually does a fairly commendable job of keeping everything in some kind of balance and managing to just about ensure that it all makes some kind of sense. And considering the twisted mess of continuity that he has had to deal with it would perhaps be unfair to poke holes at it. But hey these are films for comic book fanboys, what do you expect but for us to nitpick! :D The film is still unable to address a few niggling questions, perhaps because that continuity mess makes it almost impossible to actually do so. However questions still linger such as how exactly is Charles Xavier still alive after being killed off in X-Men: The Last Stand? What's the deal with Wolverine's claws and their constant shifting back and forth between adamantium and bone? Still no explanation as to why Xavier and Mystique didn't appear to know each other in the original trilogy, but were so incredibly close according to these films etc. The script has to spend so much time just trying to establish the story that there is little chance to focus on the actual characters at its heart. As someone who loved the Magneto-Xavier relationship and interaction in First Class that's a shame. And it feels like there is barely a single line of dialogue in the whole film that isn't exposition\t\r\n\r\nThe script also fails to address a few new issues, just completely glossing over them perhaps in the hopes that we just won't notice. For example when and how exactly did Ellen Page's Kitty Pryde get the ability to send people's consciousness through time? And perhaps it's just me but the whole plot point (and it's a very important one) about Mystique's blood being so vital in the development of the Sentinels seems rather vague and questionable in its logic. If they were going to go down that route I feel Rogue would have been a somewhat more logical choice given that her ability is to replicate the powers of other mutants, not just change her physical appearance. It kind of came across as them just trying to shoehorn Mystique into being as important as possible to the film, largely inspired you suspect by the meteoric rise of Jennifer Lawrence since First Class. In fact with Hugh Jackman getting on in years, and his days as Wolverine coming to an end, the search is on to perhaps try and find the new face of the franchise. With Channing Tatum set to take on the character of Gambit he seems like a decent bet to take over that mantle. However with Days of Future Past they certainly seem to be positioning Jennifer Lawrence as another possibility to take on the role if she were to extend her current deal. I doubt anyone would ever have predicted Mystique being pushed to the fore in such fashion. Oh and just as another little nit-pick; was I the only one who thought the make-up job for Mystique looked rather s*itty this time out? I think it looks a lot more fake now than it ever did even 14 years ago.\t\t\t\r\n\r\nJust a few more thoughts to wrap up. After the fresh start that was First Class, bringing Wolverine back and once again making him a central figure feels like a little bit of a step back. While he's only had two official solo films this almost films like the 6th Wolverine-focused film we've now had in the series. And if you're going to bring him back I think you should at least use him correctly. His strongest feature for me is as a brutal, kick-ass warrior, but DoFP actually gives him surprisingly little opportunity to unsheathe those iconic claws of his, placing him more in the role of a diplomat trying to keep the peace between Magneto and Xavier. The fact that the film kills so many of the mutants introduced in First Class offscreen I found quite disappointing. And the use of Blink's portals aside I didn't think the film quite captured the same team dynamic that was present in First Class, with several of the team going off on solo missions or taking their enemies out all by themselves. And now a couple of other little things that I liked. While we get to see very little of it the wasteland that the Earth has become in the future dystopia is a very effective and stirring touch, and one that evokes the future war as seen in the Terminator films. Oh and one little touch that I really loved was the film recreating newreel footage of the decade to match actual footage from the era. It comes off looking like the Zapruder JFK film. \r\n\r\nAmongst fans of superhero films, 2008 is seen as a bit of a holy grail for the genre; the release of both The Dark Knight and Iron Man, two of the most acclaimed and loved entries so far, gaining it that reputation. 2014 has so far seen the release of two great efforts (The Winter Soldier and Days of Future Past); if Guardians of the Galaxy lives up to the promise of its trailers then we could have a new contender for that title of comic book movie's holy grail year. \r\n\r\n**Conclusion** - I know I've been pointing out a lot of flaws with the film in this review (perhaps as a response to all the gushing over it) but the truth is I did still find it to be an extremely entertaining addition to the X-Men series. As a result of some of those flaws however I'm not quite as high on it as many other people seem to be. For the moment I would have it in 2nd place amongst 2014's superhero flicks behind the excellent Captain America: The Winter Soldier, and after one viewing it would slot into 3rd place amongst the X-Men films.\t\r\n\r\nOne thing I should definitely add however is my condition when watching it. As I have been for a great deal of time recently I wasn't feeling particularly great when I went to watch it; feeling rather run-down and a bit yuck. So that perhaps hindered my enjoyment slightly,meaning there's a chance that score could rise on a repeat viewing.\t\t\t\r\n\r\n\r\n\r\n**Bonus Film Trivia** -  Patrick Stewart and Ian McKellen were performing in a touring production of \"Waiting for Godot\" when Bryan Singer approached the actors about reprising their respective roles as Professor X and Magneto. According to McKellen, both men were utterly shocked as they thought they'd passed their roles on to James McAvoy and Michael Fassbender, and would never play the characters again. Both Stewart and McKellen were delighted to return to two of their most popular roles, and to work with the younger actors playing the same characters as well. /// When Matthew Vaughn was going to direct, he was going to make the film a direct sequel to X-Men First Class and have it set in the 1970s. Early ideas included an opening with the Kennedy assassination being caused by Magneto, and mutant encounters set in the Civil rights movement/the Vietnam War. When Singer took over, he integrated these concepts into a viral marketing campaign to set up the action of the film. In this alternate history, Magneto is arrested and imprisoned for the assassination of Kennedy, but maintains his innocence. The \"Bent Bullet\" Theory (a reference to the real life \"Magic Bullet\" Theory criticized by conspiracy theorists) holds that the Warren Commission determined that Magneto manipulated Lee Harvey Osawld's bullets to kill the President in retribution for the murder of the mutants Azazel and Tempest by the CIA. Conspiracy theorists, based on Magneto's testimony, insist however that Magneto had tried to prevent the murder of Kennedy, and that the true shooter was not Oswald, but Mystique in disguise who, with the help of Emma Frost framed Magneto, and manipulated Jack Ruby into later murdering Oswald. The theory also posits that Mystique offered to double as Kennedy in an attempt to grab power, all of which backfired horribly, leading to anti-mutant hostilities.",
            "url": "https://www.themoviedb.org/review/53821f910e0a2624cb00a4ab"
         },
         {
            "author": "Andres Gomez",
            "id": "53f11deac3a3685aed0030f2",
            "content": "Not as good as the previous X-Men movies but it has a pass... Jennifer Lawrence doesn't even get close to Rebecca Romijn. Also, Michael Fassbender and James McAvoy are really far from their senior characters performed by Ian McKellen and Patrick Stewart but the rest of original cast from first 2000's movie are great, as always.",
            "url": "https://www.themoviedb.org/review/53f11deac3a3685aed0030f2"
         },
         {
            "author": "Per Gunnar Jonsson",
            "id": "543a3207c3a368198900215d",
            "content": "This is a good and very enjoyable movie which, to me, was a bit surprising since I generally find that time travel is akin to sticking your foot in some messy and smelly stuff. It almost always screws up the movie in some way or another. This one was not without its faults but it did survive becoming too screwed up by it.\r\n\r\nThe opening scenes are indeed somewhat impressive throwing the viewer directly into an apocalyptic future where mutants as well as human are rounded up by sentinels. I could not help but think about Terminator during these scenes. Maybe not very original from a general point of view but the dark and gloomy opening was not the opening scenes I would have expected from an X-Men movie.\r\n\r\nThen we, unfortunately, dive straight into some time travel when they send Wolverine back to 1973. This is of course a opportunity to make yet another twist of the mutant scare, mutants hunt, a good mutant is a dead mutant etc. story that we have seen in so many movies now. The main adversary changes but the general story idea stays the same and the arguments for hunting down the mutants are as silly as ever. Quite frankly, I find that angle a wee bit overdone and boring by now.\r\n\r\nLuckily the story is fairly well implemented. The scene were Wolverine wakes up and disposes of the three thugs are rather funny. Pretty standard stuff but pretty funny nevertheless. The part where they retrieve Magneto is quite nice and the scene down in the Pentagon where the guards and everything else is “frozen” while Maximoff calmly walks around and rearranges things is outright hilarious.\r\n\r\nI quite disliked the cheap twist where Magneto just decided to go amok and screw things up just when they were about to retrieve Mystique though. They could have spent some time coming up with a better way to twist the story at that time. The idiotic stuff with Wolverine getting a fit at the same time was just adding to my annoyance with that scene. This part is the main reason I will not give this movie a top score.\r\n\r\nApart from this scene the movie is a very well done superhero movie with lots of nice special effects. Sure it is also rather predictable but most people, including myself, do watch these movies mostly for the effects after all. As long as the plot is not downright stupid it get to pass.\r\n\r\nTime travel. Okay, I have to harp a bit about time travel. I do not like it in movies because there are too many things that just does not add up. In this movie it is not too bad and most of the time the actual time travel aspect is kept out of the action. Wolverine goes back in time, does his stuff with a lot of action, and saves the day. Sure the dialog often comes back to the “I’m from the future” aspect but not much more. One thing annoys the hell out me though. Wolverine affects a lot of events while he is back there but not a single things seems to change in the future until one single event passes at the end of the movie. Then everything changes and it is happy ending. That is the kind of nonsense that time travel in movies ends up with.\r\n\r\nBottom line is that this is a very enjoyable movie. Without the rubbish plot twist in the middle it would have gotten 9 or 10 stars.",
            "url": "https://www.themoviedb.org/review/543a3207c3a368198900215d"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Logan / Wolverine",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e172013",
               "name": "Hugh Jackman",
               "profile_path": "/dFbNlPpiEPupTAlNVNh5vrxBU1h.jpg",
               "id": 6968,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Charles Xavier / Professor X (Young)",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e171fff",
               "name": "James McAvoy",
               "profile_path": "/u4rQqXCUSyNs9Mbpi3bynFcRlHZ.jpg",
               "id": 5530,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Erik Lehnsherr / Magneto (Young)",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e172003",
               "name": "Michael Fassbender",
               "profile_path": "/ohGJPTlou8TuZ8VOz5m9kChWgts.jpg",
               "id": 17288,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Raven Darkholme / Mystique",
               "gender": 1,
               "credit_id": "52fe4affc3a368484e17200b",
               "name": "Jennifer Lawrence",
               "profile_path": "/hLzgl1dS8O2IAn1PIwHYhxR0Lkm.jpg",
               "id": 72129,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Ororo Munroe / Storm",
               "gender": 1,
               "credit_id": "52fe4affc3a368484e172027",
               "name": "Halle Berry",
               "profile_path": "/w7HRZh4UhimZO2F6GywkYhjgAX3.jpg",
               "id": 4587,
               "order": 4
            },
            {
               "cast_id": 42,
               "character": "Marie D'Ancanto / Rogue",
               "gender": 1,
               "credit_id": "5383be87c3a36805950093d6",
               "name": "Anna Paquin",
               "profile_path": "/5Q4vZK2PqHkreQLmbPspIgrSLUP.jpg",
               "id": 10690,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Katherine \"Kitty\" Pryde / Shadowcat",
               "gender": 1,
               "credit_id": "52fe4affc3a368484e17201b",
               "name": "Ellen Page",
               "profile_path": "/paexwBfmlVyzva7q4XgcBdqowmL.jpg",
               "id": 27578,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Bolivar Trask",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e172023",
               "name": "Peter Dinklage",
               "profile_path": "/xuB7b4GbARu4HN6gq5zMqjGbkwF.jpg",
               "id": 22970,
               "order": 7
            },
            {
               "cast_id": 6,
               "character": "Erik Lehnsherr / Magneto (Old)",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e172007",
               "name": "Ian McKellen",
               "profile_path": "/coWjgMEYJjk2OrNddlXCBm8EIr3.jpg",
               "id": 1327,
               "order": 8
            },
            {
               "cast_id": 3,
               "character": "Charles Xavier / Professor X (Old)",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e171ffb",
               "name": "Patrick Stewart",
               "profile_path": "/wEy5qSDT5jT3ZASc2hbwi59voPL.jpg",
               "id": 2387,
               "order": 9
            },
            {
               "cast_id": 8,
               "character": "Hank McCoy / Beast",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e17200f",
               "name": "Nicholas Hoult",
               "profile_path": "/27NbnWKzco1CCDHtR2AVVab8Dli.jpg",
               "id": 3292,
               "order": 10
            },
            {
               "cast_id": 44,
               "character": "Hank McCoy / Beast (older)",
               "gender": 2,
               "credit_id": "5383bef6c3a36805950093da",
               "name": "Kelsey Grammer",
               "profile_path": "/8h3ThicYhj6fEMSMtSdzFXrUyx2.jpg",
               "id": 7090,
               "order": 11
            },
            {
               "cast_id": 12,
               "character": "Bobby Drake / Iceman",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e17201f",
               "name": "Shawn Ashmore",
               "profile_path": "/n4XaAblagtaawSVArpGZ4BzrmKt.jpg",
               "id": 11023,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Lucas Bishop",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e172047",
               "name": "Omar Sy",
               "profile_path": "/o34IwFPlOvE00yJA2E4nvp5RQB7.jpg",
               "id": 78423,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Peter Maximoff / Quicksilver",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e17204b",
               "name": "Evan Peters",
               "profile_path": "/2a1XA1ynmbZZj2nauwsc03OzRB.jpg",
               "id": 55089,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "William Stryker",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e172053",
               "name": "Josh Helman",
               "profile_path": "/rmj2HHc1uNESTlHk50qnCHK11jD.jpg",
               "id": 1056053,
               "order": 15
            },
            {
               "cast_id": 17,
               "character": "Piotr Rasputin / Colossus",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e172033",
               "name": "Daniel Cudmore",
               "profile_path": "/bNVyweJ6lq78vaWpYcYMjnGFrZc.jpg",
               "id": 84222,
               "order": 16
            },
            {
               "cast_id": 16,
               "character": "Clarice Ferguson / Blink",
               "gender": 1,
               "credit_id": "52fe4affc3a368484e17202f",
               "name": "Fan Bingbing",
               "profile_path": "/rO6kT0EJuXRKUKEyKN9O6LyG71A.jpg",
               "id": 64439,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Roberto da Costa / Sunspot",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e172043",
               "name": "Adan Canto",
               "profile_path": "/eJzvFyuwGm1oFhCX5wFMiIHN4hG.jpg",
               "id": 1010189,
               "order": 18
            },
            {
               "cast_id": 15,
               "character": "James Proudstar / Warpath",
               "gender": 0,
               "credit_id": "52fe4affc3a368484e17202b",
               "name": "Booboo Stewart",
               "profile_path": "/7KUJfkXzKSbvpPfqe75kfbnNzFL.jpg",
               "id": 121868,
               "order": 19
            },
            {
               "cast_id": 40,
               "character": "Jean Grey / Phoenix",
               "gender": 1,
               "credit_id": "5383be67c3a368059e00945f",
               "name": "Famke Janssen",
               "profile_path": "/9wHWq6Mnfpn8L1diMxjr26ReZWl.jpg",
               "id": 10696,
               "order": 20
            },
            {
               "cast_id": 41,
               "character": "Scott Summers / Cyclops",
               "gender": 2,
               "credit_id": "5383be76c3a36805a8008df2",
               "name": "James Marsden",
               "profile_path": "/htBil0Vayd09haeUVoKEPxuantT.jpg",
               "id": 11006,
               "order": 21
            },
            {
               "cast_id": 24,
               "character": "Alex Summers / Havok",
               "gender": 2,
               "credit_id": "52fe4affc3a368484e17204f",
               "name": "Lucas Till",
               "profile_path": "/77RZnZzKgP3VlCHvpBfEIUg1b3.jpg",
               "id": 429,
               "order": 22
            },
            {
               "cast_id": 38,
               "character": "Mortimer Toynbee / Toad",
               "gender": 0,
               "credit_id": "52fe4affc3a368484e17209f",
               "name": "Evan Jonigkeit",
               "profile_path": "/xEJfsVre2vLbJ4jY1XeX1bOmJLY.jpg",
               "id": 1284084,
               "order": 23
            },
            {
               "cast_id": 131,
               "character": "Congresman Davis",
               "gender": 2,
               "credit_id": "57f8684b925141287a000d0a",
               "name": "Len Wein",
               "profile_path": "/oAWdcW7JdLT0MSKSOPDXymqt76G.jpg",
               "id": 173658,
               "order": 24
            },
            {
               "cast_id": 130,
               "character": "Congressman Parker",
               "gender": 0,
               "credit_id": "57f867c492514128e1000c6b",
               "name": "Chris Claremont",
               "profile_path": "/oZ1EqKxnw16o4XIGnLhcTfRnyge.jpg",
               "id": 934847,
               "order": 25
            },
            {
               "cast_id": 114,
               "character": "Senator Brickman",
               "gender": 2,
               "credit_id": "55b5944dc3a368648e0142c9",
               "name": "Michael Lerner",
               "profile_path": "/7VlkzO1z5wh96UCXpPZ0rUFx8aN.jpg",
               "id": 4250,
               "order": 26
            },
            {
               "cast_id": 127,
               "character": "Ink",
               "gender": 0,
               "credit_id": "57f8650f92514128e1000adc",
               "name": "Gregg Lowe",
               "profile_path": null,
               "id": 1322030,
               "order": 27
            },
            {
               "cast_id": 43,
               "character": "President Richard Nixon",
               "gender": 2,
               "credit_id": "5383becac3a36805a8008df6",
               "name": "Mark Camacho",
               "profile_path": "/2zQRAqWeFQOMzD3NBzNSI6QqMdf.jpg",
               "id": 7013,
               "order": 28
            },
            {
               "cast_id": 161,
               "character": "Man with a movie camera",
               "gender": 2,
               "credit_id": "58787306c3a3683ee20044b6",
               "name": "Bryan Singer",
               "profile_path": "/to8mWJabPoWkphkbYKoutCVSj06.jpg",
               "id": 9032,
               "order": 29
            },
            {
               "cast_id": 162,
               "character": "En Sabah Nur",
               "gender": 0,
               "credit_id": "58787318925141785c00438c",
               "name": "Brendan Pedder",
               "profile_path": null,
               "id": 1738056,
               "order": 30
            },
            {
               "cast_id": 123,
               "character": "Groundskeeper",
               "gender": 2,
               "credit_id": "57ca15c99251412799000cdd",
               "name": "Harry Standjofski",
               "profile_path": "/3KSews93pWYHqtcSVWwOBIX7Eg0.jpg",
               "id": 1240748,
               "order": 31
            },
            {
               "cast_id": 124,
               "character": "Pinstripe Mafioso",
               "gender": 2,
               "credit_id": "57f8631dc3a36831780008a5",
               "name": "Mike Dopud",
               "profile_path": "/2AWev6Jib3VJ3p2FPTxm7Erx81o.jpg",
               "id": 64674,
               "order": 32
            },
            {
               "cast_id": 125,
               "character": "Col. Sanders",
               "gender": 2,
               "credit_id": "57f863efc3a3682e7c000bf4",
               "name": "Andreas Apergis",
               "profile_path": "/yK6qWJ9KgEeJsGGK3Fu6ldR3HkD.jpg",
               "id": 102852,
               "order": 33
            },
            {
               "cast_id": 126,
               "character": "Vietnam MP Guard",
               "gender": 0,
               "credit_id": "57f86460c3a3683160000ac8",
               "name": "Robert Montcalm",
               "profile_path": null,
               "id": 1691154,
               "order": 34
            },
            {
               "cast_id": 128,
               "character": "Mutant Soldier",
               "gender": 2,
               "credit_id": "57f86594c3a3683160000ba3",
               "name": "Jaa Smith-Johnson",
               "profile_path": "/lhXEmPGu0YJoOtcYPTbFVzQsMOj.jpg",
               "id": 1519259,
               "order": 35
            },
            {
               "cast_id": 129,
               "character": "Quarantine Doctor",
               "gender": 0,
               "credit_id": "57f8660e9251412839000d85",
               "name": "Alex Ivanovici",
               "profile_path": "/hCJlQXLMhT9gd6dkmOivS8IAOpw.jpg",
               "id": 96594,
               "order": 36
            },
            {
               "cast_id": 132,
               "character": "Congressman McCarter",
               "gender": 0,
               "credit_id": "57f8688d9251412525000ed3",
               "name": "François Paquette",
               "profile_path": null,
               "id": 1674956,
               "order": 37
            },
            {
               "cast_id": 133,
               "character": "Trask Secretary",
               "gender": 1,
               "credit_id": "57f868e3c3a3682e7c000f3f",
               "name": "Zabryna Guevara",
               "profile_path": "/n2BnG5lNW5Bxj4c27L4DcUb9HM8.jpg",
               "id": 171955,
               "order": 38
            },
            {
               "cast_id": 134,
               "character": "Ms. Maximoff",
               "gender": 0,
               "credit_id": "57f8694792514125280010e9",
               "name": "Zehra Leverman",
               "profile_path": "/vj23toAMc5JIpd3B5xS8I1KZQIG.jpg",
               "id": 929943,
               "order": 39
            },
            {
               "cast_id": 135,
               "character": "Pentagon Tour Guide",
               "gender": 0,
               "credit_id": "57f869ad925141252800110d",
               "name": "Angela Galuppo",
               "profile_path": "/bvX2yrwllRfz5g5JyiAnGmFXfqO.jpg",
               "id": 147892,
               "order": 40
            },
            {
               "cast_id": 136,
               "character": "Surveillance Guard",
               "gender": 0,
               "credit_id": "57f86a71c3a36830cf000cea",
               "name": "Victor Cornfoot",
               "profile_path": "/A8ssN48AMCFhcAkHo6bJDIjPaNa.jpg",
               "id": 1207366,
               "order": 41
            },
            {
               "cast_id": 137,
               "character": "Surveillance Guard",
               "gender": 2,
               "credit_id": "57f86ad19251412525000fd3",
               "name": "Brent Skagford",
               "profile_path": "/nbxfbTZYzAXSFsqOxvZr6owKzYA.jpg",
               "id": 522169,
               "order": 42
            },
            {
               "cast_id": 138,
               "character": "Pentagon Cook",
               "gender": 2,
               "credit_id": "57f86b0892514128d5000e56",
               "name": "Kyle Gatehouse",
               "profile_path": "/gq9YQYtPEWuHMKZUHjNHQfoWsb2.jpg",
               "id": 131335,
               "order": 43
            },
            {
               "cast_id": 139,
               "character": "Pentagon Elevator Guard",
               "gender": 0,
               "credit_id": "57f86b7292514128d5000e97",
               "name": "Taris Tyler",
               "profile_path": "/sYxf1R0vK8wKKnRuwXtIoaVZhvT.jpg",
               "id": 1320015,
               "order": 44
            },
            {
               "cast_id": 140,
               "character": "Armed Kitchen Guard",
               "gender": 0,
               "credit_id": "57f86bcbc3a3682cc80010a6",
               "name": "Darryl Scheelar",
               "profile_path": "/9Xj3ttxF1MM0RHsKc7qIs0cQMXR.jpg",
               "id": 139622,
               "order": 45
            },
            {
               "cast_id": 141,
               "character": "General Nhuan",
               "gender": 2,
               "credit_id": "57f86c1992514128d5000ee2",
               "name": "Thai-Hoa Le",
               "profile_path": "/1NPB5ACDnfFWf9FkzUlUpqhFQO4.jpg",
               "id": 1300745,
               "order": 46
            },
            {
               "cast_id": 142,
               "character": "Vietnamese Captain",
               "gender": 2,
               "credit_id": "57f86ce6c3a368311a000dc3",
               "name": "Johnny Tran",
               "profile_path": "/pU3btqFlwWLyNJkhAmu8Wrwb9E1.jpg",
               "id": 1671572,
               "order": 47
            },
            {
               "cast_id": 143,
               "character": "General Petrov",
               "gender": 0,
               "credit_id": "57f86dfe9251412528001355",
               "name": "Gregory Hlady",
               "profile_path": "/nflwPaKuyIR6LMCqSH8G1FMxSlj.jpg",
               "id": 141741,
               "order": 48
            },
            {
               "cast_id": 144,
               "character": "Peace Summit Reporter",
               "gender": 0,
               "credit_id": "57f87603c3a3682cc8001615",
               "name": "Julian Casey",
               "profile_path": "/2XNBwtsBAtSnoYDnkGe0C1qShlm.jpg",
               "id": 29461,
               "order": 49
            },
            {
               "cast_id": 145,
               "character": "Nixon Aide",
               "gender": 2,
               "credit_id": "57f87694c3a3682cc8001660",
               "name": "Robert Crooks",
               "profile_path": null,
               "id": 60906,
               "order": 50
            },
            {
               "cast_id": 146,
               "character": "Secretary of Defense",
               "gender": 2,
               "credit_id": "57f87730c3a36831600014f5",
               "name": "Matt Cooke",
               "profile_path": null,
               "id": 44237,
               "order": 51
            },
            {
               "cast_id": 147,
               "character": "US Army General",
               "gender": 2,
               "credit_id": "57f877d2925141252500168d",
               "name": "Tim Post",
               "profile_path": "/Qyiny8LqWHbzd8XUUalDc8MRlk.jpg",
               "id": 7009,
               "order": 52
            },
            {
               "cast_id": 148,
               "character": "Desk Anchor",
               "gender": 0,
               "credit_id": "57f87836c3a36830cf00136b",
               "name": "Jason Deline",
               "profile_path": "/hTy3xPznESHbGWwcxTAifHqf7KW.jpg",
               "id": 198540,
               "order": 53
            },
            {
               "cast_id": 149,
               "character": "French Emergency Nurse",
               "gender": 1,
               "credit_id": "57f8789c925141287a00150a",
               "name": "Karine Vanasse",
               "profile_path": "/wtPV2gDpa7HTlPBUf3jIVBoVBjb.jpg",
               "id": 81418,
               "order": 54
            },
            {
               "cast_id": 150,
               "character": "French TV Reporter",
               "gender": 2,
               "credit_id": "57f87b99c3a36830cf001510",
               "name": "Pierre LeBlanc",
               "profile_path": null,
               "id": 1691173,
               "order": 55
            },
            {
               "cast_id": 151,
               "character": "Female Traveler",
               "gender": 0,
               "credit_id": "57f87c2992514125250018d5",
               "name": "Jude Beny",
               "profile_path": "/aWBlu1ZOLotrsWschHVUUBhe6j6.jpg",
               "id": 198751,
               "order": 56
            },
            {
               "cast_id": 152,
               "character": "Blue Suit Traveler",
               "gender": 0,
               "credit_id": "57f87c9fc3a3682cc8001939",
               "name": "Arthur Holden",
               "profile_path": "/y0aCeMJKAzVJO3pydEiVCV2Ca4k.jpg",
               "id": 115596,
               "order": 57
            },
            {
               "cast_id": 153,
               "character": "Airport Backpacker",
               "gender": 2,
               "credit_id": "57f87d9b92514128e10016d6",
               "name": "Sean Curley",
               "profile_path": null,
               "id": 56418,
               "order": 58
            },
            {
               "cast_id": 154,
               "character": "Flight Attendant",
               "gender": 0,
               "credit_id": "57f87de29251412447001a46",
               "name": "Susanna Fournier",
               "profile_path": "/zfA2K2cW0wrmBh1vJQT9DCLQT17.jpg",
               "id": 1251615,
               "order": 59
            },
            {
               "cast_id": 155,
               "character": "White House Reporter",
               "gender": 2,
               "credit_id": "57f87e2c925141287a0017ac",
               "name": "Andrew Peplowski",
               "profile_path": "/qmRMvNqUWteEXtf1uB1BAxTiHz8.jpg",
               "id": 1684713,
               "order": 60
            },
            {
               "cast_id": 156,
               "character": "White House Ticket Man",
               "gender": 2,
               "credit_id": "57f87edcc3a368319e0017da",
               "name": "Moe Jeudy-Lamour",
               "profile_path": "/1ORu8WztjT4nMfYoWYANnfiRUmN.jpg",
               "id": 1448201,
               "order": 61
            },
            {
               "cast_id": 157,
               "character": "Secret Service Agent",
               "gender": 0,
               "credit_id": "57f87f8fc3a368311a001643",
               "name": "Neil Napier",
               "profile_path": "/irI0HpejL0ugHpyQxvUJ665bhaU.jpg",
               "id": 105496,
               "order": 62
            },
            {
               "cast_id": 158,
               "character": "Potomac River Cop",
               "gender": 0,
               "credit_id": "57f88017c3a368319e00186b",
               "name": "Mizinga Mwinga",
               "profile_path": "/4tFeeT3cAM4LcjJ8YOqf7wh7qQX.jpg",
               "id": 1148496,
               "order": 63
            },
            {
               "cast_id": 163,
               "character": "Chinese Translator",
               "gender": 0,
               "credit_id": "58d94bd8c3a368121b069337",
               "name": "Jimmy Chan",
               "profile_path": "/y9cjGDuq6s6O4RCdgXlLm0B3VN6.jpg",
               "id": 1784732,
               "order": 64
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4affc3a368484e171ff1",
               "name": "Bryan Singer",
               "profile_path": "/to8mWJabPoWkphkbYKoutCVSj06.jpg",
               "id": 9032,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4affc3a368484e172059",
               "name": "Lauren Shuler Donner",
               "profile_path": "/uwuWpT2xyhwlrfSCk6xTTvrRvEE.jpg",
               "id": 7200,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4affc3a368484e17205f",
               "name": "Bryan Singer",
               "profile_path": "/to8mWJabPoWkphkbYKoutCVSj06.jpg",
               "id": 9032,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4affc3a368484e17206b",
               "name": "John Ottman",
               "profile_path": "/AlYg0cVHpwlTR4wY1iIy9gAsPKx.jpg",
               "id": 9039,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4affc3a368484e172077",
               "name": "Simon Kinberg",
               "profile_path": "/yXlDADc2rLEMLTFZAw9irqXMq2J.jpg",
               "id": 11092,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4affc3a368484e172083",
               "name": "Stan Lee",
               "profile_path": "/dTr2gJPL7jELKVkcjtoNx80uVKR.jpg",
               "id": 7624,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4affc3a368484e172089",
               "name": "Josh McLaglen",
               "profile_path": null,
               "id": 10956,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4affc3a368484e17208f",
               "name": "Todd Hallowell",
               "profile_path": null,
               "id": 6184,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4affc3a368484e17209b",
               "name": "John Byrne",
               "profile_path": "/rWIjsIUHmJeuyd88mmRDByTw86l.jpg",
               "id": 1194953,
               "department": "Crew",
               "job": "Graphic Novel Illustrator"
            },
            {
               "gender": 1,
               "credit_id": "52fe4affc3a368484e1720a5",
               "name": "Ve Neill",
               "profile_path": "/gNYwxuK5Z7Nr3tWtSWv0qAueUIs.jpg",
               "id": 406204,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "54408f59c3a368055c001395",
               "name": "John Ottman",
               "profile_path": "/AlYg0cVHpwlTR4wY1iIy9gAsPKx.jpg",
               "id": 9039,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "54408f6bc3a3686098000810",
               "name": "Simon Kinberg",
               "profile_path": "/yXlDADc2rLEMLTFZAw9irqXMq2J.jpg",
               "id": 11092,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "55469264c3a3680ce600774f",
               "name": "Jane Goldman",
               "profile_path": "/4a1dXBKrPR3kLIcXvIbgS2eJb1Z.jpg",
               "id": 23447,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "54408f980e0a26293e000840",
               "name": "Simon Kinberg",
               "profile_path": "/yXlDADc2rLEMLTFZAw9irqXMq2J.jpg",
               "id": 11092,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "54408fa5c3a3686078000858",
               "name": "Matthew Vaughn",
               "profile_path": "/Dnbz3B7yy4u0abixuD5LakZgsy.jpg",
               "id": 957,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "54408fbcc3a368606a000836",
               "name": "Newton Thomas Sigel",
               "profile_path": "/mTauZZzOY0fhpNkNjeOeDHDk8xm.jpg",
               "id": 9040,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "54408fd4c3a3686098000823",
               "name": "John Myhre",
               "profile_path": null,
               "id": 11002,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "5461d9570e0a2672aa001bd8",
               "name": "Andrea Kenyon",
               "profile_path": null,
               "id": 17611,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5461d96e0e0a2672aa001bdb",
               "name": "Roger Mussenden",
               "profile_path": null,
               "id": 3276,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5461d97fc3a3686f35001cfc",
               "name": "Randi Wells",
               "profile_path": null,
               "id": 1198825,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5461d997c3a3686f31001c06",
               "name": "Ravi Bansal",
               "profile_path": null,
               "id": 1354916,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5461d9ab0e0a2672a3001bfa",
               "name": "Vincent Gingras-Liberali",
               "profile_path": null,
               "id": 1384358,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5461d9d70e0a2672a0001c64",
               "name": "Félix Larivière-Charron",
               "profile_path": null,
               "id": 1384359,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5461d9f1c3a3686f3c001bd3",
               "name": "Gordon Sim",
               "profile_path": null,
               "id": 14915,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5461da10c3a3686f39001d55",
               "name": "Ann Smart",
               "profile_path": null,
               "id": 1384360,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5461da420e0a2672ad001a4e",
               "name": "Louise Mingenbach",
               "profile_path": null,
               "id": 9043,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "5461da660e0a2672b3001c52",
               "name": "Norma Hill-Patton",
               "profile_path": null,
               "id": 1384361,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "5461da840e0a2672a0001c7a",
               "name": "Annick Chartier",
               "profile_path": null,
               "id": 1326401,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "5461dac8c3a3686f39001d65",
               "name": "Jean-Andre Carriere",
               "profile_path": null,
               "id": 1178908,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 2,
               "credit_id": "5461dae4c3a3686f2e001ac1",
               "name": "Brent Lambert",
               "profile_path": null,
               "id": 1204225,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "5461dafdc3a3686f31001c22",
               "name": "Raymond Larose",
               "profile_path": null,
               "id": 1380378,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 1,
               "credit_id": "5461db1d0e0a2672a3001c27",
               "name": "Lucie Tremblay",
               "profile_path": null,
               "id": 1384362,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "5461db38c3a3686f35001d21",
               "name": "Blanche Moreau",
               "profile_path": null,
               "id": 1384363,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5461db6ac3a3686f35001d2c",
               "name": "Simone Leclerc",
               "profile_path": null,
               "id": 1384364,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 0,
               "credit_id": "5461dba00e0a2672b6001b27",
               "name": "Alain Giguère",
               "profile_path": null,
               "id": 1384365,
               "department": "Art",
               "job": "Lead Painter"
            },
            {
               "gender": 2,
               "credit_id": "5461dd040e0a2672b6001b4b",
               "name": "Craig Berkey",
               "profile_path": null,
               "id": 9651,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 2,
               "credit_id": "5461dd280e0a2672a7001c3c",
               "name": "Craig Berkey",
               "profile_path": null,
               "id": 9651,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "5461dd4c0e0a2672b6001b53",
               "name": "Norman Bernard",
               "profile_path": null,
               "id": 92216,
               "department": "Sound",
               "job": "Boom Operator"
            },
            {
               "gender": 0,
               "credit_id": "5461dd67c3a3686f39001db0",
               "name": "Maxime Ferland",
               "profile_path": null,
               "id": 1384366,
               "department": "Sound",
               "job": "Boom Operator"
            },
            {
               "gender": 2,
               "credit_id": "5461dd92c3a3686f31001c5d",
               "name": "Warren Hendriks",
               "profile_path": null,
               "id": 113054,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 2,
               "credit_id": "5461dda9c3a3686f44001910",
               "name": "Chuck Michael",
               "profile_path": null,
               "id": 113075,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "5461ddcdc3a3686f35001d69",
               "name": "Susan Dawes",
               "profile_path": null,
               "id": 1384367,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "5461de00c3a3686f3c001c36",
               "name": "Dan O'Connell",
               "profile_path": null,
               "id": 1338372,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 1,
               "credit_id": "5461de2dc3a3686f4c001c95",
               "name": "Ai-Ling Lee",
               "profile_path": "/laK9Vh9RVKPxs9WqkDPy6fjsunv.jpg",
               "id": 1367494,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "5461de53c3a3686f4c001c9e",
               "name": "Ron Bartlett",
               "profile_path": "/AmFG81joHLkvnh4Io20TdCCBk8P.jpg",
               "id": 16177,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "5461de6d0e0a2672a0001ccb",
               "name": "Doug Hemphill",
               "profile_path": "/jpShbzJgiLoM4iZZcDe3KmoqnG4.jpg",
               "id": 1377220,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "5461deba0e0a2672a3001c6a",
               "name": "Patrick Rousseau",
               "profile_path": null,
               "id": 405004,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "5461df270e0a2672a0001cdb",
               "name": "Blondel Aidoo",
               "profile_path": null,
               "id": 1340132,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5461df6d0e0a2609b6001225",
               "name": "Daniel Brimer",
               "profile_path": null,
               "id": 1384368,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5461dfd10e0a2609b6001235",
               "name": "Paul Butterworth",
               "profile_path": null,
               "id": 1384369,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5461e0790e0a2672a3001c9d",
               "name": "Mark Carr",
               "profile_path": null,
               "id": 1384371,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "5461e09ac3a3686f2b001c25",
               "name": "Ryan Chavez",
               "profile_path": null,
               "id": 1384372,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "5461e0c10e0a2672b3001d05",
               "name": "Tim Crosbie",
               "profile_path": null,
               "id": 1384373,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5461e0dfc3a3686f35001db7",
               "name": "Alice Cumbaa",
               "profile_path": null,
               "id": 1384374,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5461e0f90e0a2672b6001bb1",
               "name": "Robin L. D'Arcy",
               "profile_path": null,
               "id": 1348006,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5461e160c3a3686f4400196c",
               "name": "Max Leonard",
               "profile_path": null,
               "id": 1384375,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5461e1b3c3a3686f39001e26",
               "name": "Jinnie Pak",
               "profile_path": null,
               "id": 1384381,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5461e1f50e0a2672b6001bcf",
               "name": "Richard Stammers",
               "profile_path": null,
               "id": 1384386,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5461e2370e0a2672b6001bda",
               "name": "Holger Voss",
               "profile_path": null,
               "id": 1384387,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5461e2610e0a2672aa001cad",
               "name": "James M. Churchman",
               "profile_path": null,
               "id": 1384388,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5461e27c0e0a2672b6001be4",
               "name": "Jeff Habberstad",
               "profile_path": null,
               "id": 9624,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5461e2910e0a2672a3001cd6",
               "name": "Trevor Habberstad",
               "profile_path": null,
               "id": 1384390,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5461e31d0e0a2672ad001b25",
               "name": "Blanche Boileau",
               "profile_path": null,
               "id": 1319389,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5461e355c3a3686f4c001d07",
               "name": "Bob Morgan",
               "profile_path": null,
               "id": 1322016,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5461e3850e0a2672b3001d4e",
               "name": "Julie Amyot",
               "profile_path": null,
               "id": 1384392,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "5461e3bdc3a3686f31001cef",
               "name": "Amanda Goodpaster",
               "profile_path": null,
               "id": 1384393,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "5461e3db0e0a2672aa001ccf",
               "name": "Daniel Matthews",
               "profile_path": null,
               "id": 1384394,
               "department": "Crew",
               "job": "Transportation Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5461e3f00e0a2672b6001c0b",
               "name": "John Bober",
               "profile_path": null,
               "id": 1384395,
               "department": "Crew",
               "job": "Transportation Captain"
            },
            {
               "gender": 0,
               "credit_id": "5461e406c3a3686f31001cfc",
               "name": "Eric Béliveau",
               "profile_path": null,
               "id": 1384396,
               "department": "Crew",
               "job": "Transportation Co-Captain"
            },
            {
               "gender": 0,
               "credit_id": "5461e43ec3a3686f31001d0a",
               "name": "Milena Popovic",
               "profile_path": null,
               "id": 1384397,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "5461e48bc3a3686f440019bb",
               "name": "Christine Wilson",
               "profile_path": null,
               "id": 1384398,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5461e4ad0e0a2672b6001c25",
               "name": "Michèle St-Arnaud",
               "profile_path": null,
               "id": 1384399,
               "department": "Production",
               "job": "Location Manager"
            },
            {
               "gender": 1,
               "credit_id": "5461e4ed0e0a2672aa001d05",
               "name": "Lisa Fozzati",
               "profile_path": null,
               "id": 1384400,
               "department": "Production",
               "job": "Location Manager"
            },
            {
               "gender": 0,
               "credit_id": "553408bf92514125dc001fa1",
               "name": "Brian N. Bentley",
               "profile_path": null,
               "id": 1456696,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 0,
               "credit_id": "5534711ac3a36848ca005852",
               "name": "Tony Mecca",
               "profile_path": null,
               "id": 1455610,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "553b29d8c3a36820ec00135e",
               "name": "James Baker",
               "profile_path": null,
               "id": 1457930,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 2,
               "credit_id": "553c2afd92514157f0000f9e",
               "name": "Chris O'Connell",
               "profile_path": null,
               "id": 1412756,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "570bcf4b9251413c7f000203",
               "name": "Michele Laliberte",
               "profile_path": null,
               "id": 9271,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 0,
               "credit_id": "57125e449251417bf90012b0",
               "name": "Mark Edward Wright",
               "profile_path": null,
               "id": 1407019,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "574f51b9925141185c0002be",
               "name": "Hutch Parker",
               "profile_path": null,
               "id": 584598,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "574f51e292514118680002ee",
               "name": "Kathleen McGill",
               "profile_path": null,
               "id": 6186,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "574f51fac3a36879f40002f7",
               "name": "Luca Marco Paracels",
               "profile_path": null,
               "id": 1477203,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "574f522c925141185600029c",
               "name": "Derek Hoffmann",
               "profile_path": null,
               "id": 131516,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "574f5282c3a368045b00026b",
               "name": "Jason Taylor",
               "profile_path": null,
               "id": 1486179,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 1,
               "credit_id": "57fe1db9c3a3685211002eb0",
               "name": "Mirela Rupic",
               "profile_path": "/5z0I2eRwBrJjSv27ig4VnU0lmCZ.jpg",
               "id": 1693424,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "58696f7bc3a3680f4e00e852",
               "name": "Chris Claremont",
               "profile_path": "/oZ1EqKxnw16o4XIGnLhcTfRnyge.jpg",
               "id": 934847,
               "department": "Writing",
               "job": "Comic Book"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 61.126251,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 127585,
      "vote_count": 7468,
      "budget": 250000000,
      "overview": "The ultimate X-Men ensemble fights a war for the survival of the species across two time periods as they join forces with their younger selves in an epic battle that must change the past – to save our future.",
      "similar": [
         49521,
         246655,
         1924,
         1452,
         263115,
         141052,
         383498,
         209112,
         297762,
         8536,
         297802,
         76170,
         408220,
         30061,
         298618,
         287947,
         251519,
         14011,
         65291,
         272
      ],
      "original_title": "X-Men: Days of Future Past",
      "runtime": 131,
      "poster_path": "/giUK8ppRbfistadVzHtpainkhq4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/9RO2vbQ67otPrBLXCaC8UMp3Qat.png",
            "name": "Revolution Sun Studios",
            "id": 76043,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Donners' Company",
            "id": 431,
            "origin_country": ""
         },
         {
            "logo_path": "/837VMM4wOkODc1idNxGT0KQJlej.png",
            "name": "Marvel Entertainment",
            "id": 7505,
            "origin_country": ""
         },
         {
            "logo_path": "/hQNXrYIuyLRxMSBuGHk0GX7CCBS.png",
            "name": "Bad Hat Harry Productions",
            "id": 9168,
            "origin_country": "US"
         },
         {
            "logo_path": "/qx9K6bFWJupwde0xQDwOvXkOaL8.png",
            "name": "TSG Entertainment",
            "id": 22213,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Down Productions",
            "id": 37336,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "2014-05-15",
      "vote_average": 7.5,
      "belongs_to_collection": {
         "backdrop_path": "/Abnosho2v3bcdvDww6T7Hfeczm1.jpg",
         "name": "X-Men Collection",
         "id": 748,
         "poster_path": "/1Zo4J5SAni8lyXt7NxJwJZ0f0ip.jpg"
      },
      "tagline": "To save the future, they must alter the past",
      "adult": false,
      "homepage": "http://www.x-menmovies.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bryan Singer"],
      "runtime": 132,
      "synopsis": "Patrick Stewart's Charles Xavier recounts how humans created sentinels to hunt and kill mutants. While they at first only hunted mutants, they later began targeting humans who held a probability of becoming mutants. The resulting events have created an apocalyptic wasteland in which only a handful of mutants have survived, facing extinction should they be found by the sentinels. Three strange objects are ejected from a large airship and crash to the ground. Warpath realizes that the sentinels have found them and leaves with Blink to warn the others, including Colossus, Sunspot, Bishop, Iceman, and Kitty Pryde. Bishop immediately requests that Sunspot give him some energy in the form of fire, which he absorbs and channels into his advanced rifle. Bishop takes off with Kitty Pryde as the others form a ring of defense against the invading sentinels. The sentinels drill into the mutant's base, their bodies having the ability to rearrange into different forms and tools. They break through and Sunspot engages the first, drenching it in flames. Colossus engages the second, getting knocked to the ground by the towering sentinel. Warpath tries to help but is knocked away. The third sentinel intercepts Bishop and Kitty. Bishop fires a large energy blast at the sentinel, barely affecting it. Blink appears via the use of her portals and makes an exit for the two fleeing mutants. She then opens up a portal for Iceman to assist against their foe. Iceman uses his ice slide to outmaneuver the pursuing sentinel, encasing it in a thick wall of ice. Kitty and Bishop arrive at a safe room, where Kitty has Bishop lie on a table. She puts her hands around his head as he loses consciousness. Meanwhile, the sentinels are getting the upper hand in the fight. When Colossus throws a punch that is caught by a sentinel, Colossus' metal skin begins to form over the sentinel as well. It becomes clear that the sentinels are able to absorb and replicate mutant powers. Both Colossus and Warpath are killed by the sentinel they are fighting. The sentinel fighting Sunspot begins to form a protective cocoon of ice around itself, using the powers of Iceman. It breaks through the gout of flames keeping it at bay and strangles Sunspot to death. Subsequently, the sentinel fighting iceman encases itself in fire to melt itself free from the ice, using the powers of Sunspot. It breaks through the ice and grabs Iceman by the neck. Iceman's frozen head slides across the floor and the sentinel steps on it. The sentinels proceed to melt down the door to the room Kitty and Bishop are hiding in. But as they enter, Kitty says \"Too late, assholes!\" Just before the sentinels can kill the two, everyone in the scene disappears. The remaining future mutants, Wolverine/Logan, Storm, Professor X/ Charles Xavier, and Magneto/Erik Lensherr, disembark from their jet to greet the group of mutants that we just saw die and subsequently disappear. It is revealed that Kitty Pryde's mutation has evolved to allow her to send someone's consciousness back through time. During the sentinel assault in the previous scene, Bishop's consciousness was sent back through time to his younger body. He warned the others of the impending sentinel assault so they could leave before the sentinels ever arrived. Bishop and Kitty disappeared from the opening sequence because that reality had been erased and the time line altered. Kitty explains to the four arrivals that they have done this many times before. Each time the sentinels attack: Warpath spots them, the mutants make a line of defense to buy some time, Kitty sends Bishop back through time with the warning of the attack, and the mutants of the past flee before the attack can ever take place. Professor Xavier then exclaims that he is aware and has come up with a plan to send his own consciousness back through time to the point when the sentinels were first unleashed. We learn that in 1973, Mystique assassinated Bolivar Trask, the creator of the sentinel program. This murder spurred the humans to further the sentinel program. Mystique is later captured and it is through the study of her DNA that the sentinels of the future are born. Her unique DNA allows the sentinels to adapt mutant powers for their own use. Professor Xavier plans to go back in time to stop the assassination of Bolivar Trask and in turn, prevent the anti-mutant tide that leads to the creation of the sentinels. Kitty says, however, that she can only send someone back a couple of weeks or a month into the past, not decades. She warns that the mind can only be stretched so far without breaking. Wolverine volunteers to go back, his healing ability allowing him to survive the procedure. He must go to the past and convince a broken Charles Xavier to take up arms and work with the man that he hates, Erik Lehnsherr. It is only together that they can find Mystique and prevent her from assassinating Trask. Kitty carries out the procedure, warning Logan that while his consciousness is in the past, his body will stay in the future. Only when his consciousness returns from the past will the timeline change. His mind staying in the past is contingent upon his body existing in the future and Kitty remaining at his side. Logan will have a limited amount of time before they are found by the sentinels of the future; he must complete his mission before then or all will be lost. Logan wakes up and finds himself in bed with a woman. He looks outside and realizes that the procedure has worked; it is 1973. Seconds later, three thugs burst through the door as Logan is getting dressed. Apparently, he was supposed to be guarding the someone's daughter instead of sleeping with her. He asks if they would believe that he was from the future at which they scoff. He extends his bone claws and the henchmen pull out guns and begin shooting him. He heals from his wounds and proceeds to take out the men, stealing their car. The next scenes introduces us to Bolivar Trask, who is trying to convince members of Congress to fund his sentinel program. He tries to convince the panel that mutants are a threat to humanity. The committee does not share the Trask's belief,, stating that if mutants have been among humankind for some time now, they have existed peacefully alongside their fellow humans. They decide to not provide the funding. In a US military camp in Vietnam, a high-ranking army officer walks into a segregated tent to find a man named William Stryker preparing to take a group of mutants into custody. The army officer says that these men are going home. Stryker flashes around a document claiming to be part of a special outfit who is transferring the mutants to a Trask Industries facility, informing the army officer that he doesn't have jurisdiction. The officer counters that he does, transforming into the shape-shifter Mystique. She begins to take out all of the men in tent in hand-to -and combat with some assistance from the mutants. Before she can kill Stryker, one of the mutants intervenes and knocks Stryker unconscious. This mutant is Havok from the previous film in the series and he asks about the whereabouts of Magneto. Mystique responds that she's on her own now. The mutants board a plane home while Mystique walks away in disguise, claiming that there is still work to be done. Logan drives up to the dilapidated and overgrown Xavier mansion. Hank, also known as Beast, answers the door in his human form. Logan asks to see Charles but is rebuffed by Hank. He forces his way in, exclaims that he and Hank will be good friends in the future, and punches Hank right in the face. Blue fur appears on Hank as he transforms into the Beast. He begins to throw Logan around, giving him a good beating before being stopped by Charles. Despite being paralyzed by a bullet to his spine, he's walking around normally. Logan pleads his case to Charles only to be ridiculed by the drunken and disheveled young man. Logan asks Charles to read his mind, but Charles can't. Beast/Hank explains that he developed a serum to control his mutation and keep his beast form at bay. From this, he then developed a serum to cure Xavier's paralysis. A side effect of taking the drug, however, left Charles unable to use his mutant ability to read and control minds. Logan is able to convince him nonetheless, after revealing secrets of Xavier's past that he had never told anybody. Charles refuses to help Logan and it is clear that he is a broken man, depressed and filled with the guilt of losing his friends, students, and most of all losing Raven/Mystique. Eventually, he agrees to assist Logan for the sake of Raven herself. One problem still exists: they need to enlist the help of Magneto, whom Charles absolutely loathes. Magneto is being kept underneath tons of concrete in a prison at the Pentagon, having already served 10 years in prison for the alleged killing of John F. Kennedy. We cut to Mystique disguising herself as Bolivar Trask to gain entrance to his personal office. She pores through documents and discovers that Trask has been experimenting on mutants and killing them. She pulls a file regarding an event at which Trask will be present with members of the Vietnamese government and asks Trask's secretary to type up his itinerary. To break Magneto out of prison, the group enlists the help of Pietro Maximoff/ Quicksilver. He uses his ability of ultrafast movement to almost instantly do whatever he chooses. The group arrives at the Pentagon and Hank uses a piece of equipment to interfere with the surveillance cameras. Quicksilver steals a guard's uniform and makes his way to Magneto's prison, where he vibrates his hands at a resonant frequency of the glass ceiling to shatter it. The two make their way to a kitchen when they confront Logan and Charles. Charles punches Erik the moment he sees him with Erik commenting that it was nice to see him. Just then guards burst through the door and draw their weapons. Erik asks Charles to use his powers to stop the men but Charles replies that he can't. The guards open fire and Erik readies to kill them, ignoring Charles' pleas for him not to kill the guards. Before anything can happen, we experience a scene from the perspective of Quicksilver with time almost standing still. He uses his enhanced speed to comically knock out the guards and redirect the bullets in flight. Charles, Erik, Hank, and Logan are aboard a plane en route to Paris to stop Raven from assassinating Trask. Things get heated between Charles and Erik as Charles accuses Erik of taking the things that were most precious away from him. Erik in turn asks where Charles was when they came for Angel, Banshee, Azazel, and Emma Frost. He shouts that they were taken, experimented on and killed and that both he and Charles were supposed to protect them. (It is implied that Trask was responsible.) During this heated exchange, Erik almost causes the plane to crash before calming down. In a French nightclub, Mystique seduces a Vietnamese army official whom she plans to impersonate to get to Trask. Back on the plane, Erik says that he was not the one who killed JFK. He claims that he was trying to save him, his reasoning being that JFK was a fellow mutant. Erik apologizes to Charles about how things have played out during the last decade and the two begin to play chess. Trask enters a conference room full of officials of various governments and tries to convince them of the threat posed by mutants. He is trying to get funding for his sentinel program since the US government has rejected him. During the presentation, he demonstrates how his robots are made without one ounce of metal and goes on to describe how they have the builtin capability of discerning mutants from non mutants. He pulls out a hand-held detector that can sense the Mutant X gene in people; it begins to go off. Mystique's cover has been blown -- she has disguised herself as the Vietnamese officer she seduced -- and she begins to take out many of the men in the room. Enter Logan, Charles, and Erik, who stop Mystique just before she can shoot Trask. Charles tries to explain everything to Mystique and persuade her to drop the gun. She is defiant and Erik strips the gun from her. He then does the unthinkable and aims it at her. She is a threat to all mutants because her DNA can lead to the creation of the sentinels of the future. Erik believes that it is too risky for her to remain alive. Raven pleads with Charles to use his powers to stop Erik, unaware that he is powerless. Meanwhile, upon seeing Stryker who was also at the meeting, Logan begins to lose himself emotionally as he has flashback to the experiments performed on him during the Weapon X Program; he falls into a sort of coma as his connection between future and past is disrupted. His body in the future thrashes and extends its claws, injuring Kitty Pryde, who struggles to reconnect the link through time. Logan comes to in Paris, doesn't recognize anyone or know where he is, and is told by Charles that someone gave him some bad acid. He passes out again. Hank tackles Erik but fails to stop him from firing the gun. Mystique jumps out the window but Erik is able to guide the bullet to follow her; it hits her in the leg. Outside, crowds of people with cameras capture a wounded Mystique running away. They witness as Magneto levitates outside and drags Mystique to him, the bullet still stuck in her leg. He pulls the bullet from her body, ready to finish her off with it when a transformed Beast attacks him. Onlookers watch in horror as Beast strangles Magneto underwater. Mystique uses this time to escape the area and seek medical treatment. Magneto restrains Beast using some metal ornaments from the fountain and makes an escape as well. Logan regains consciousness -- memories intact this time -- and he and Charles rendezvous with Hank and leave for the mansion to plan their next move. The media is now in a panic because of the footage of mutants creating mayhem in public. In a tense, crowded Oval Office meeting, Richard Nixon gives Trask the green light to proceed with his sentinel program. Trask says that he can have eight sentinels operational soon. Nixon want to hold a press conference to unveil the sentinels and reassure the American public that he can protect them from the mutant threat. In a crowded Metro station, Mystique ambushes Magneto, pressing a knife to his throat. He claims that he no longer wants to kill her. He notes that their previous encounter left Mystique's blood on the pavement, which Trask has undoubtedly already obtained. They go their separate ways. Upon entering the mansion, Charles' legs give way and he falls to the ground and starts hearing people's thoughts. Hank rushes to get him his serum. Charles says that he doesn't take the serum to walk, he takes it to stop the voices he keeps hearing. He is tired of having to feel and hear all of the pain that mutants and humans are experiencing. Logan convinces Charles to not take the serum, exclaiming that he needs the professor to have his powers; it's the only way to find Raven before she can make another attempt to kill Trask. They proceed to use cerebro to try and locate Raven but Charles is overwhelmed by all the noise he has been keeping out for the past 10 years. Logan pleads with Charles to try and read his mind. He does so and sees all of the pain and trauma that Logan has experienced through his lifetime. He sees glimpses of the future and has a telepathic conversation with his future self. His future self reassures Charles that there will always be pain but that it is his gift to use that pain to help others. He shows a younger Charles images of what he will accomplish and how he will use his power to bring hope to others in their most dire times. This is just what Charles needed to bring him focus. He tries locating Mystique again Back at a Trask facility, a preliminary analysis of Mystique's blood holds promise for Trask who demands that she be captured. They will need to harvest her brain tissue, spinal fluid, and bone marrow. Outside, the Mark I sentinels are loaded aboard a train for their trip to Washington DC; Magneto sneaks aboard the train before it departs. While in motion, Magneto rips the metal from the tracks as they pass over them. He manipulates the metal into small strands which he feeds throughout the metal-less bodies of the sentinels. At an airport, Charles uses random people as avatars to urge Mystique to stop her mission. Charles is not yet strong enough to mentally stop Mystique as she resists his mental probes. He fails to stop her and he, along with Hank and Logan, depart for Washington DC for the press conference. Magneto enters a secure facility holding two large ball bearings. He uses the bearings to incapacitate three guards and opens a vault. In the vault we see several artifacts: Havok's X-Men suit, one of Angel's wings, and Magneto's helmet. He is here for the helmet, which he takes. Cut to the future, where Kitty is losing a lot of blood. Standing guard outside, Warpath spots multiple sentinel ships heading their way. The mutants make their preparations for a final defense; Kitty, Iceman, Professor X, and Wolverine shelter inside while the others guard outside. Back in the past, Magneto levitates a sports stadium and moves it towards the press event on the White House lawn at which President Nixon will present Trask's sentinels. Hank, Logan, and Charles are there amongst the crowd trying to find Mystique. Nixon addresses the nation and drops the curtains, unveiling the sentinels to the public to much applause. Charles finally spots Mystique impersonating a secret serviceman and freezes her in place before she can pull her gun. Charles has a conversation with her telepathically, trying to persuade her that she was not always so quick to kill and that the Raven that he knew was incapable of doing so. All of a sudden the sentinels roar to life to the shock of Trask and the others. They fire at the police cars and it is apparent that Magneto is controlling them. Trask, Nixon, and other VIPs flee to an underground bunker. Simultaneously, the battle in the future is erupting as well. Storm uses lightning and wind to crash some of the sentinel transporters. Bishop shoots his rifle through portals created by Blink to take out a few sentinels. Magneto takes the X-Jet and modifies in into an explosive, using Storm to charge it with a bolt of lightning. It explodes sending shrapnel everywhere, decimating much of the sentinel force. Magneto is wounded in the resulting explosion by a piece of shrapnel in his abdomen. The mutants take a sigh of relief, believing the battle to be over. It is not, however, and a sentinel sneaks up behind Storm, stabbing her and throwing her off a cliff as more sentinels flood the mutant stronghold. In the past, Magneto arrives at the press event and drops the stadium around it. He has created a concrete barrier around the White House to prevent any escape. Charles is pinned by debris in the chaos. Magneto posts seven of the sentinels atop the stadium walls to guard the perimeter and leaves one to engage Wolverine and Beast, ordering the sentinel to do what it was designed to do. The sentinel identifies the two as mutants and attacks. Wolverine is unable to inflict any damage against the sentinel with his bone claws and merely distracts it long enough for Beast to jump on its back and rip out its circuitry. While this is going on we see that Nixon, Trask and company are locked securely in their bunker. Trask's mutant detector begins to go off. Before anything can happen, the room begins to shake; Magneto is ripping the safe room from its foundation. In the future, the mutants are dying one by one. Colossus is killed by being ripped in half by multiple sentinels. Bishop is bombarded by three of them with energy beams, overcharging him until he explodes. Warpath is killed after a sentinel grabs him, slowly moving the mutant's face into the path of its energy beam. One sentinel forms diamond skin like that of Emma Frost to overcome Sunspot's flames and cuts off one of his arms. He fights back but is flanked by another sentinel who stabs him with claws that resemble Lady Deathstrike's. Magneto, realizing the end is near, uses the last of his strength to apply metal reinforcements to the entrance of the building. Before the sentinels can kill him, Blink transports him inside. As the last line of defense outside, Blink puts up a valiant effort to hold the sentinels at bay but is stabbed by many of them. The sentinels then begin breaking through Magneto's barrier and Iceman leaves to reinforce it with ice. In the past, Wolverine charges at Magneto. In defense, Magneto hurls debris at Wolverine and stops his assault with a large block of concrete to the back. He then proceeds to force rebar all throughout Wolverine's body, lifting him in the air and throwing him hundred of meters into the Potomac River, where he apparently drowns. Beast is thrown from the back of the sentinel into a wrecked car. Magneto has now fully excavated the metal safe room and ripped off its door. He aims news cameras at himself and addresses the world. He explains that the sentinels were created out of fear for how dangerous mutants could be. He says that they should be scared and proclaims that a new order will be established with mutants in control, threatening to kill everyone in the safe room. Nixon emerges from the safe room, urging Magneto to kill him if he wants but to let the rest of the people go. \"Nixon\" is actually Mystique in disguise with a gun behind her back. The sentinel targeting Beast rips through the car and is ready to finish him off but Beast is able to inject himself with his serum in time to change back into normal. The sentinel thinks Hank isn't a mutant anymore and proceeds to find new targets, Magneto and Mystique are in its sights. The sentinel charges and Magneto begins tearing the robot limb from limb. Mystique uses this moment an takes a shot at Magneto with the metal-less gun. He is hit non-fatally in the neck causing him to lose focus. She is able to knock him out during his brief moment of weakness and remove his helmet. Charles uses his power to pacify Magneto and it is obvious he has lost. Attention now turns to Mystique who is aiming her gun at Trask saying that he is a monster for the cruel things he has done to her friends. Xavier stops her and makes one final plea to Mystique, saying that he has hope that she will do the right thing. He points out that right now she is a hero in the public eye. He relinquishes control over her, saying that the future is in her hands now. In the future, the sentinels have breached the room and killed Iceman with energy beams. They confront the last of the survivors and fire killing shots at the group, which includes Xavier, Kitty, and the still unconscious Logan. Just before the shots can reach them, everyone on screen disappears. Mystique has dropped the gun in the past and decided not to kill Trask. Magneto remarks that if he is turned in, they will kill him. Xavier agrees and releases control of him, allowing Magneto to levitate and flee. Newspapers run headlines saying that a mutant saved the president, that the sentinel program was being shut down, and that Trask was being indicted for treason. Flash to the future where Logan is waking up at the mansion. He hears schoolchildren outside and realizes that the plan worked. He is surprised to see Storm, Iceman, Rogue, and Beast all alive. He encounters Jean Gray. He is awestruck that she is real and doesn't understand why she is alive. Scott Summers appears and is dumbfounded by Logan's happiness at seeing them all. Logan sees Xavier and tells him it worked. Xavier welcomes him back and begins to explain what has happened in the years from 1973 to the future that Logan has missed. In a voice-over, Xavier explains that events can cause ripples through the river of time and when enough ripples are created, the flow of the river can be changed. Back in the past we see that Logan's body was recovered by military personel. He comes back to life aboard the boat with an army official asking William Stryker what he would like to do with him. Stryker replies that he will take him. As the scene cuts away we see that it is actually Mystique disguised as Stryker. In a post-credits scene, a skinny bluish mutant, robed and hooded, stands atop a structure. Hundreds of people are bowing to him and chanting his name -- En Sabah Nur -- as he uses his powers to levitate ancient pyramids into place. We see four people on horseback covered in black as the scene fades to black: Apocalypse and his Four Horsemen.",
      "writers": [
         "Simon Kinberg",
         "Jane Goldman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1877832/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEwMDk2NzY4MF5BMl5BanBnXkFtZTgwNTY2OTcwMDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Patrick Stewart, Ian McKellen, Hugh Jackman | See full cast and crew »"],
      "reviews": [
         "I must admit, the trailers didn't have me convinced - and after the sour taste 'Jack the Giant Slayer' left in my mouth, I was sceptic. I really dug Matthew Vaughn's approach with 'First Class' (who had a tough task rebooting the franchise after the lacklustre 'Last Stand' and the generic, dull 'X-Men Origins: Wolverine') and I wouldn't have minded him returning at all. But as it turns out, Bryan Singer (yes, I dare speak his name) still has a few tricks up his sleeve. For its sheer scale and epic storytelling alone, 'Days of Future Past' is fantastic. It's a shame there's so much controversy surrounding this film, but I guess whoever chooses to deprive himself willingly of such a pleasure must be fully aware that he does so at his own expense. Because this is the kind of film that made me fall in love with movies in the first place. Yet (despite my 10-star review), it's not perfect. And it's not 'The Usual Suspects' with mutants - how could it be; this is simply not that kind of film. But I have to say that pretty much my only gripe with this movie is that it has too many characters and that some of them don't get enough screen time (or actually, there's not too many characters: there's just too many great actors playing those characters � but then again, that's half of the fun). Of all the X-men films, this has the most complex plot � and also the most interesting. Different time-lines are tricky to do and can be rather hard to follow, but thanks to a (very!) clever script with a great part for Logan, we never get lost. And that's the best news: sorely missed in the last instalment (except for a hilarious cameo), the franchise has Hugh Jackman back. And of him at least we do get to see a lot, since he really leads us through this film (giving his best Wolverine performance yet along the way). If Logan can be called the heart of the X-men, then Charles Xavier must be the mind while Magneto and Mystique provide the - slightly twisted - soul, and seeing them all together again brought a broad, stupid grin to my face (which only got broader whenever Quicksilver appeared on screen - for reasons you will have to find out for yourselves). What really sets the X-men films apart from the ever more derivative comic-book adaptations � at least as far as I'm concerned � is that I always genuinely cared for the characters, and 'Days of Future Past' is no exception. I love loud, spectacular action movies as much as the next guy, but if I don't get to care for the protagonists � what's the point? The reason I gave this 10 stars, and what is so exceptional these days, is that what we get here is a complex, smart Fantasy/Sci-Fi thrill-ride that respects its origins as much as it embraces the future, while never - ever - forgetting that its first job is to entertain the audience. For finding that perfect, rare balance between character-driven human drama and no-holds-barred popcorn action spectacle, 'Days of Future Past' deserves my 10-star rating (which is a first for me: I've never given 10-stars to a comic-book movie). So my verdict: If you like to get your minds blown by something with true heart and soul, this massive 'mutant' of a film is upon you, and all you have to do is give in to the X-citement. Enjoy the ride. Favorite Films: http://www.imdb.com/list/ls054200841/",
         "With its mind-boggling premise and jaw-dropping cast, X-Men: Days Of Future Past blasts into cinemas bearing the weight of great expectations. Surely this mash-up of X-Men past and future has the potential to be the best superhero blockbuster our world will ever see? Well, yes and no. To be strictly objective, Days Of Future Past can occasionally come off as a little too earnest, its enormous cast of characters getting somewhat lost in the grinding of its narrative gears. But, when it works (which is most of the time), Days Of Future Past comes pretty darn close to nerdvana � this is a smart, rich film that effectively mines its source material (both the movies and Chris Claremont's classic 1981 storyline in the comic books) and its incredible cast for emotion, power and depth. Flash forward to the bleakest of futures. X-Men we have known � led by perennial frenemies Professor Charles Xavier (Patrick Stewart) and Erik Lensherr/Magneto (Ian McKellen) � are being hunted mercilessly by a horde of intelligent, death-mongering robots known as Sentinels. With little hope for survival, the desperate X-Men decide to send Wolverine (Hugh Jackman) back in time to the 1970s. There, he must find the younger Charles (James McAvoy) and Erik (Michael Fassbender) � several years estranged after the traumatic events of X-Men: First Class � and get them to change the future before it can happen. Sounds simple enough? Not really. Days Of Future Past frequently threatens to fall foul of its complicated puzzle-box of a narrative, one that involves time travel, quantum physics and a swirling mess of characters, action and motivations. There's Dr. Bolivar Trask (Peter Dinklage), creator of the Sentinel programme, whose assassination in the past by Charles' pseudo-sister Raven (Jennifer Lawrence) brings about the dystopia of the future. There are prison breaks, astral projections, and several grisly mutant deaths. Truthfully, this incredibly ambitious mix of character, plot and spectacle could very easily go horribly wrong. What's so impressive about director Bryan Singer's return to the franchise is how well he weaves all the disparate threads of his narrative together. This is emphatically not the Singer who gave us mediocre misfires like Superman Returns and Jack The Giant Slayer. Rather, this is the work of the Singer who made his mark with films like X1, X2 and The Usual Suspects, all of which featured a masterful blend of wit and wisdom, character and story. In Days Of Future Past, Singer skilfully plays on the schism that opened up between Erik and Charles at the end of First Class to add welcome depths of emotion to the high stakes already in play. The deep, difficult relationship between the two men has always been the fulcrum of the series, and Singer allows it to breathe and grow. With the help of McAvoy and Fassbender (not to mention Stewart and McKellen), some of the best actors in the business, the director makes it possible to believe that resentment can give way to forgiveness, and vice versa, often in the blink of an eye. McAvoy, in particular, gives a shudderingly good performance as a man called upon to help others when he's lost his own way. With such an enormous revolving cast of characters, Singer even manages to give many � though not all � of them their hearts and souls. (Alas, Storm/Ororo, we will never know ye!) Thrust into the unlikely role of mentor to the broken, heartsore Charles, Wolverine must find a different sort of strength and ingenuity within himself. Jackman plays the role beautifully, anchoring the two timelines with charm and gravitas. Though still something of an awkward fit for her part, Lawrence, too, plays Raven's dilemma very well, as she wavers between Charles' offer of hope and Erik's often bloody single-mindedness. But Days Of Future Past doesn't just mire itself in the toss and tumble of its characters' emotional journeys. Singer throws in a few crackerjack action sequences, opening the film with a heart-stopping massacre that very effectively underscores the dire threat posed by the Sentinels of the future. Crucially, Singer also finds the time and space within the darkest shadows of his story to have a little fun, judiciously tossing quips and sight gags into the mix � particularly in a tour de force prison break sequence, in which the preternaturally speedy Pietro Maximoff (Evan Peters), better known to comic aficionados as Quicksilver, literally runs away with the entire show. Make no mistake about it, this is a behemoth of a film that won't go down well with everybody. Newbies will almost certainly find themselves lost, bewildered, and perhaps even bored. Singer's tale sprawls in so many directions that, if you're not at least marginally invested in the characters, it could prove to be a trying experience. But, for everyone else, ranging from casual fans to enthusiasts and obsessives, Singer and screenwriter Simon Kinberg have crafted something truly remarkable. Steeped in history and lore, both of the cinematic and comic-book variety, Days Of Future Past feels like a dark love letter to the spirit of that original band of mutants and the message of hope, tolerance and humanity that has always accompanied their attempts to find their place on Earth. Most remarkably of all, Days Of Future Past practically radiates a bravery and freshness that you'd never expect from the seventh film in a blockbuster franchise. Instead of playing it safe and sound, Days Of Future Past mashes up past, present and future, sweeping up a lot of what has been taken for granted in the X-Men cinematic universe and, well, chucking it out of the proverbial window. The ending of this film truly opens up an intriguing plethora of narrative possibilities that stretch in any and all directions. On the strength of this outing, that's something to be anticipated, rather than feared.",
         "I was so intrigued about this movie. I had a terrible feeling of disappointment because First Class was absolutely fine and riveting. That one was even better than X-Men 2 (the last one directed by Brian Singer before this). So I tried to went to see this with low expectation. And what a wonderful entertainment and surprising thoughtful story I found here. Days Of Future Past is the best X-men movie so far for two main reasons: Fans of the original trilogy and First Class will definitely enjoy this one thanking its nostalgia and its perfect and well balanced mix between the original characters and the new ones (with just a few ones who maybe deserved more credit, but is not at all a problem for the movie). & This movie delivers a surprising top notch entertaining with a potent story and some good twists that help to live up expectations mixed with terrific special effects and cinematography. 3-D is very cool here. The actors are fantastic. Fassbender and McAvoy still delivering amazing performances meanwhile Stewart and Mckellen give their reflections in the same excellent way that in the trilogy. Hugh Jackman finally finds his character as a true important one in comparison with the last movies. Wolverine/Logan finally has a proper treatment in this movie that will help anyone who could be annoyed with his solo adventures to love him again. They are the five main stars of the story with the inclusion of a spectacular and skillful Mystique (impressive Jennifer Lawrence who steals almost every scene of hers) who is undoubtedly the sixth one. The other actors made good performances and make possible the transitions of the story until the amazing finale. It has been so many comparisons with The Avengers. Let me tell you something with all my respect. I found this one truly better. X-Men: Days of Future Past will please the fans and moviegoers and will inject fresh blood and joy to the franchise. This is a terrific time at the movies. Don't miss the opportunity to see it.",
         "2014 has proved to be a successful year so far for Marvel with 'Captain America: The Winter Soldier' and the most recent 'X-Men: Days of Future Past'. Bryan Singer returns for the most recent X-Men after being absent for the past four films, and what a return he has made. 'Days of Future Past' is truly an impressive and spectacular instalment in both the 'X- Men' franchise and the entire Marvel Cinematic Universe, combining the casts from both the original trilogy and the prequel allowing the audience to view the 'X-Men' in the past, present and future. The action scenes are intense and spectacularly choreographed with some fantastic heroes and foes fighting both against and alongside each other. As a personal opinion, 'Days of Future Past' is the best film to have graced the Marvel film franchise and one of the greatest superhero films of all-time. A visually stunning and exhilarating flick that combines the best elements of the series to create a fantastic and entertaining film.",
         "OMG!!! This movie cannot be simply described in words. If you loved X men first class then this movie is a treat for you. This is a movie even non-x men fans will enjoy. Go see this movie guys. Your mind will be blown. I've already seen this movie and looking forward to see it again. Hugh Jackman does the best wolverine ever. He became the wolverine i wanted to see on screen for ages. The interesting chemistry between James McAvoy and Michael Fassbender is more enjoyable than ever. But jennifer lawrence and Evan Peters at Quicksilver steal the movie. Quicksilver may not look so cool but he is the coolest guy in the whole movie. Believe me, this movie is worth your bucks. Moreover there are a bunch of new x men characters introduced in the movie which make it more enjoyable.Bryan Singer has done complete justice to this movie. And there is one scene just halfway through the movie which is worth watching fifty times. I am thoroughly excited to see the next entry entry in series which is being called Apocalypse. The only shortcoming in the movie is the runtime which feels a little less being only 130 mins. Rest of the movie is a jigsaw which fits together in a wondrous puzzle. So you must go to see this movie. Every element is in a balanced form. Even the soundtrack is fitting. Happy watching !!!!",
         "The Parisian premiere was yesterday and therefore, I actually did see the movie and let me tell you this: all the waiting and fuss around this movie is well worth it and well deserved. It is a great movie, easily relatable in many ways. I won't say a word about the acting. When you have established actors such as McAvoy � who repeatedly stole the screen with his heart-clenching performance � and Fassbender, along with their older 'counterparts' � McKellen and Stewart � you are in for a treat when it comes to the acting performance itself. No surprise there. This movie is a great movie in the sense that it finds its source in the very core of humanity's struggles, and shows that Xmen's themes � much like Marvel's latest movies � are still very relevant in the world today. You will see that yourself. The movie is action packed. There is no irrelevant scenes � I tend to judge movies by the ratio of irrelevant scenes per minute in it � and there is no break between action scenes and more emotional, storyline scenes. You won't be bored. But along with the action, and the acting, there is also the usual dose of humor found in most Marvel movies, without being out of place and without cutting the pace of the movie in itself. There, Hugh Jackman will provide you with a few laughs, or at least, will bring a smile to your face. The cinematography in itself was excellent. Excellent use of the 3D. Great camera work � at some point, you will be rather amazed by the use of slow mo and 3D. So, why not 10 out of 10 then? Because of the score. If the soundtrack was good, it didn't match what I got used to with the recent Marvel movies. Good score but not as good as I expected it to be. Maybe it was because we were all more focused on the fast-paced action scenes and the storyline in itself rather than whatever was playing behind. I might need to go back and watch it again once it's out for general public to really appreciate the little details that I might have missed in a cinema filled with excited fans. But over all, it was an excellent, entertaining and relevant Xmen movie. A good movie. A great Xmen movie. Full of Easter eggs for more hardcore fans as well. The waiting was worth it.",
         "As a well known director one says, to make a great movie, you have to (as a director) believe your movie is the best ever made. In today's blockbuster standards, we do not see that at all. What I see when I watch a Marvel/Disney movie (just for the example), I feel as a spectator that directors want to make an entertainment movie, with an absolutely needs of huge action and explosion scenes, with a crescendo structure ending with a KABOOM (what an illustration^^). That's great, that make good blockbusters � but not great. I had high expectations with this movie, and yet I am not an X-Men fan and Bryan singer disappointed me a lot of times - but the trailer gave me chills and as French, I really wanted to see Omar Sy in a super-production (stupid but true). Anyway, after seeing it, with 2500 X-Men fan in Paris, I was divided. In fact, I expected something else entirely. There is some plot holes, monotonous parts� However, after thought a lot about it, I have to say that is a masterpiece in super heroes' movies. Why? Because it is very different from what we see today, we are not waiting for a finale with explosions, characters just keep moving so the finale do not overdo it but is still very impressive visually. Plus, this movie is very human paradoxically: it speaks about usual mutants themes, but the very point of the movie is can we change, whether it be the past or our vision of the present. The intelligence of the movie is not to focus on changing the past but on writing the present. But the most important thing that makes this movie great is that Bryan Singer loves this franchise and more than making a great blockbuster, he wanted to make a great movie relying on the characters. He was convinced of making the best movie ever and even if it is not the case, I felt it, so despite all is defaults, X-MEN DAYS OF THE FUTURE PAST is a great movie, maybe, one of the best super-hero movies ever made. I advise you to stay till the end of the credits, the scene is just awesome.",
         "Days of Future Past continues the work of X2 as genre-defining. I have to classify it as a work of art/comic book pulp fiction. The characters, effects, and story are outstanding. Everything in this movie is exceedingly better in the sequel then even the first two films and First Class. Like X2, the acting is superb and the dialogue is rich. Every character feels believable. No cartoonish villains, every side of the issue is presented by people who believe they are the ones who are in the right and the underlying message of tolerance and bigotry only add to the depth of this film. What's better then its predecessor X3 in every way. It restores the sense of epic adventure and grand-scale storytelling that's been absent from far too many of most alleged blockbusters. This film is far more sophisticated and has a better story than any X-Men movie to date. Here, the characters previously introduced but under used are utilized in a comprehensive and cohesive manner, and the newly introduced characters are blended in seamlessly with the story. The music is very good as is the special effects. The budget clearly hit the screen fully and there are truly some amazing sequences to behold. The cast-selection is still perfect. Overall, this is one of the best genre films of all-time.",
         "X-Men: Days Of Future Past' serves as a sequel to both 'X-Men: First Class' (which is excellent) and 'X-Men: The Last Stand' (which is pretty bad). Now, I used to be a pretty big X-Men fan a few years ago, but after the disappointments of 'X-Men: The Last Stand' and 'X-Men Origins: Wolverine', I kind of just stopped caring about the franchise, even though the subsequent two movies were actually very good (the aforementioned 'X-Men: First Class' and then 'The Wolverine'). That being said, I was still looking forward to 'Days Of Future Past', what with it being the return of the old 'X-Men' crew, and I was also moderately familiar with the 'Days Of Future Past' comic. I was just expecting it to be good though, but it turns out not only is 'Days Of Future Past' the best X-Men movie yet, it's also one of the best comic-book movies ever made. In 'Days Of Future Past', the X-Men of the future are facing extinction due to the sentinels which threaten to wipe them all out. They send Wolverine back in time to 1973 where he must recruit Professor X, Magneto and Mystique in order to change the course of history so that the X-Men may survive. First things first, this is a time travel movie, and time travel movies normally either go very well or very badly. 'Days Of Future Past' marks an occasion where it goes very well, as the time travel logic in this movie is very well thought out and makes perfect sense, I can't pick any holes in it. This movie even manages to validate 'X-Men: The Last Stand' and 'X-Men Origins: Wolverine', which is something that I thought could never be done. It even feels weird just saying that, because righting the wrongs that those movies made is a huge, monumental task, yet this movie pulls it off perfectly. For a movie that's crowded with so many characters, it's surprising that all of the characters included feel meaningful and aren't shoehorned in. We have Hugh Jackman returning as Wolverine, and there's not much to say about him that hasn't already been said. He is Wolverine, the role is made for him and he absolutely owns it. James McAvoy and Michael Fassbender are incredible as Charles Xavier and Erik Lensherr respectively, their characters have an amazing relationship and the two of them are just phenomenal at pulling it off. We also have the future X-Men cast with the like of Patrick Stewart, Ian McKellan and Ellen Page, and while they have a lot less screen time they're still great. I was surprised at how prominent a role Jennifer Lawrence had as Mystique, over the past few months I've had a growing dislike towards Jennifer Lawrence but I can't deny that she is great in this role. Then we have all of the new characters, like Bolivar Trask (Peter Dinklage), Bishop (Omar Sy) and Blink (Bingbing Fan), all of whom are great. But there is one new character who is greater than all, and that character is Quicksilver. Quicksilver in this movie is perfect. In fact, it's worth seeing this movie just for him. He doesn't have a huge amount of screen time and it comes fairly early on in the movie, but he is the best part of this film by far. There is one particular sequence with him in a kitchen, and it is jaw-droppingly beautiful. The visuals in the scene are gorgeous, the music is perfect, and it's both hilarious and stunning. The way that Quicksilver's super speed effect has been done is amazing. Some people thought the costume looked goofy, but I think it works perfectly well considering the time period and the personality of the character. I've been a big fan of Evan Peters for a while, and he is great in the role, he is very entertaining and has a great screen presence. I never thought I'd be saying this, but I doubt Marvel will be able to produce a better Quicksilver in 'Avengers: Age Of Ultron' than the one that's on display here. But you know what I think all this great quality comes down to? Bryan Singer. I'm pretty sure Bryan Singer is just the perfect X-Men director. Even though up until now I thought 'X-Men: First Class' was the best of the X-Men franchise, it didn't really feel like the X-Men in the way that 'X-Men' and 'X2′ did. 'Days Of Future Past' nails that X-Men dynamic while still being an exceptionally good movie. Part of that X-Men dynamic comes from John Ottman's amazing score, as it's so good to finally hear his X-Men theme again.The action scenes are incredible, especially the opening one which uses some of the new mutant powers phenomenally, especially Blink's. The movie is very well paced, I never grew bored and I didn't want it to end. 'Days Of Future Past' also surprisingly has a lot of very funny humour in it, but it's not humour that's just forced in for the sake of it, it all feel natural and within the confines of these characters. This film nails the comic book movie aspect; it has a plot which is clearly very serious yet it is still silly enough to remain a comic book film, unlike movies like 'Man Of Steel' and 'The Dark Knight' which go so dark that they just completely ditch the comic book aspect. There are also a few nice references that fans of the comics will get, which is just a small example of the great fan service this movie does for readers of the 'X-Men' comics. 'Days Of Future Past' made me remember why I was such a big X-Men fan. It rekindled my love for the characters and story lines, and like I said above, it's one of the best comic book movies ever made.",
         "Right now, I'm still trying really hard to find out one bad thing from the X-Men movie I've just seen: The characters maybe ? No: every single character is perfectly represented,interpreted (in particularly with a stunning James McAvoy and an impressive Michael Fassbender) and useful to the story. Maybe the plot then ? No: you'll get easily into it, because it is very well written for the screen, meaning you will be transported as Bryan Singer seems to know perfectly how to put in place a very cinematic puzzle. Emotions ? You will get some, as long as you loved the original X-Men characters. The soundtrack ? It is spotless and superbly fitting. Visual Effects ? Always there when we want them to be, and not when it is unnecessary. Action scenes ? You'll be amazed, thrilled and captivated when you will realize that every single scene has a purpose, whether it has some action or simple emotions and character's development. All these qualities put together are forming a very classical but excellent & accomplished movie, completed by a skilled sense of cinematic continuity that we didn't have since Singer left the franchise (at least until X-Men First Class). In other words, you should not be afraid to see this movie, because if you don't want to be disappointed, I can tell : you won't be. But is the future of this X-Men movie truly set ? This is something you'll have to figure out by yourselves, and this until the very end of the credits..."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Twentieth Century Fox Film Corporation",
         "Marvel Entertainment",
         "TSG Entertainment"
      ],
      "summaries": [
         "Sentinels, robots that were created for the purpose of hunting down mutants were released in 1973. 50 years later the Sentinels would also hunt humans who aid mutants. Charles Xavier and his X-Men try their best to deal with the Sentinels but they are able to adapt and deal with all mutant abilities. Charles decides to go back in time and change things. He asks Kitty Pryde who can send a person's consciousness into the person's past to send him but she can only send someone back a few weeks because if she sends someone back further it could harm them. So Logan decides to go back himself because he might be able to withstand it. So Charles tells him that it's Mystique who's responsible because when she learned about the Sentinels she sought out Bolivar Trask the man who created them and killed him. She would be caught and studied and her ability to change was somehow added to the Sentinels which is why they can adapt. Logan must go to the younger Charles and ask him to help; problem is that he was despondent at that time and without his powers because he took a drug which allows him to walk but takes away his powers. Logan is also told to find Magneto.",
         "In the future, the mutants and the humans that help them are slaughtered by powerful robots named Sentinels. Professor Xavier, Wolverine, Magneto, Storm, Kitty Pryde and her friends meet at a monastery in China and Xavier explains that the invincible Sentinels were created using the DNA of Mystique that was captured in 1973 when she tried to assassinate their creator Dr. Bolivar Trask. Xavier tells that their only chance is return to 1973 using Pryde's ability to join Charles Xavier and Erik Lehnsherr to convince Mystique to give up of her intention. . However, only Wolverine can withstand the damages of the time travel. Will he succeed in stopping Mystique and the Sentinel Program and save the mutants and their human friends from annihilation?",
         "As a new fighting robot for killing mutants is created, a Sentinel, it soon leads to complete chaos - killing both humans and mutants. Wolverine is sent back to the past to prevent a tragic event from ever occurring to prevent both human and mutant extinction.",
         "The ultimate X-Men ensemble fights a war for the survival of the species across two time periods in X-Men: Days of Future Past. The characters from the original X-Men film trilogy join forces with their younger selves from X-Men: First Class in an epic battle that must change the past - to save our future.",
         "In 2023, the entire human race is on the brink of extinction. Sentinels, originally created to kill mutants now hunt all of mankind. The remaining survivors cannot stand against the onslaught of the Sentinel army. In order to save the future, Wolverine is sent back to 1973 in order to stop the war before it even starts.",
         "The X-Men send Wolverine to the past in a desperate effort to change history and prevent an event that results in doom for both humans and mutants."
      ],
      "budget": 200000000
   },
   "movielensId": 111362,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-05-15",
      "dvdReleaseDate": null,
      "directors": ["Bryan Singer"],
      "runtime": 131,
      "movieId": 111362,
      "title": "X-Men: Days of Future Past",
      "mpaa": "PG-13",
      "actors": [
         "Hugh Jackman",
         "James McAvoy",
         "Michael Fassbender",
         "Jennifer Lawrence",
         "Halle Berry",
         "Anna Paquin",
         "Ellen Page",
         "Peter Dinklage",
         "Ian McKellen",
         "Patrick Stewart",
         "Nicholas Hoult",
         "Kelsey Grammer",
         "Shawn Ashmore",
         "Omar Sy",
         "Evan Peters",
         "Josh Helman",
         "Daniel Cudmore",
         "Fan Bingbing",
         "Adan Canto",
         "Booboo Stewart",
         "Famke Janssen",
         "James Marsden",
         "Lucas Till",
         "Evan Jonigkeit",
         "Len Wein",
         "Chris Claremont",
         "Michael Lerner",
         "Gregg Lowe",
         "Mark Camacho",
         "Bryan Singer",
         "Brendan Pedder",
         "Harry Standjofski",
         "Mike Dopud",
         "Andreas Apergis",
         "Robert Montcalm",
         "Jaa Smith-Johnson",
         "Alex Ivanovici",
         "François Paquette",
         "Zabryna Guevara",
         "Zehra Leverman",
         "Angela Galuppo",
         "Victor Cornfoot",
         "Brent Skagford",
         "Kyle Gatehouse",
         "Taris Tyler",
         "Darryl Scheelar",
         "Thai-Hoa Le",
         "Johnny Tran",
         "Gregory Hlady",
         "Julian Casey",
         "Robert Crooks",
         "Matt Cooke",
         "Tim Post",
         "Jason Deline",
         "Karine Vanasse",
         "Pierre LeBlanc",
         "Jude Beny",
         "Arthur Holden",
         "Sean Curley",
         "Susanna Fournier",
         "Andrew Peplowski",
         "Moe Jeudy-Lamour",
         "Neil Napier",
         "Mizinga Mwinga",
         "Jimmy Chan"
      ],
      "imdbMovieId": "1877832",
      "originalTitle": "X-Men: Days of Future Past",
      "genres": [
         "Action",
         "Adventure",
         "Fantasy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "gsjtg7m1MMM",
         "7tByfJVtcDg"
      ],
      "plotSummary": "The ultimate X-Men ensemble fights a war for the survival of the species across two time periods as they join forces with their younger selves in an epic battle that must change the past – to save our future.",
      "tmdbMovieId": 127585,
      "avgRating": 3.76688,
      "releaseYear": "2014",
      "numRatings": 8455,
      "posterPath": "/giUK8ppRbfistadVzHtpainkhq4.jpg"
   }
}