{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "sexuality",
            "id": 738
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "wife husband relationship",
            "id": 1157
         },
         {
            "name": "grandparent grandchild relationship",
            "id": 1158
         },
         {
            "name": "sexual frustration",
            "id": 2039
         },
         {
            "name": "virgin",
            "id": 2389
         },
         {
            "name": "narration",
            "id": 2398
         },
         {
            "name": "crush",
            "id": 9986
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "loss of virginity",
            "id": 11254
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "teenage boy",
            "id": 18068
         },
         {
            "name": "masturbation",
            "id": 33451
         },
         {
            "name": "peer pressure",
            "id": 178444
         }
      ],
      "imdb_id": "tt1753584",
      "video": false,
      "title": "Sexual Chronicles of a French Family",
      "recommendations": [
         12838,
         4839,
         68594,
         153774,
         8772,
         42586,
         80473,
         138735,
         78363,
         84427,
         50493,
         72465,
         78568,
         65442,
         48601,
         35297,
         36859,
         74101,
         283327,
         27855
      ],
      "backdrop_path": "/dhsYvPtiBoNfxXqIsBKqV7cTQwm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Romain",
               "gender": 2,
               "credit_id": "52fe4b10c3a36847f81f0677",
               "name": "Mathias Melloul",
               "profile_path": "/fgXCDZPKYsn7ByJ9pVvSy0RVvGs.jpg",
               "id": 1114607,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Coralie",
               "gender": 1,
               "credit_id": "52fe4b10c3a36847f81f068b",
               "name": "Adeline Rebeillard",
               "profile_path": "/jdcgAivQwQBPnU3t4rdvG2wGgPX.jpg",
               "id": 1114612,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe4b10c3a36847f81f067b",
               "name": "Valérie Maës",
               "profile_path": "/9nXTWxH3t09T6fLJOOYLOgPWz9I.jpg",
               "id": 1114608,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Hervé",
               "gender": 2,
               "credit_id": "52fe4b10c3a36847f81f0687",
               "name": "Stephan Hersoen",
               "profile_path": "/jrJDDvdh23uMTWx1GMht9sKxAkT.jpg",
               "id": 1114611,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Marie",
               "gender": 1,
               "credit_id": "52fe4b10c3a36847f81f0683",
               "name": "Leïla Denio",
               "profile_path": "/guooxiZhaOMO1tt4PGXxPEnicfs.jpg",
               "id": 1114610,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Cédric",
               "gender": 2,
               "credit_id": "52fe4b10c3a36847f81f068f",
               "name": "Gregory Annoni",
               "profile_path": "/AjiQBIJQqYJHd5InWfgzdUlkjgz.jpg",
               "id": 1114613,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Pierre",
               "gender": 2,
               "credit_id": "52fe4b10c3a36847f81f067f",
               "name": "Nathan Duval",
               "profile_path": "/icgirfJfoeKaN45J2Zy10fSGTKy.jpg",
               "id": 1114609,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Michel",
               "gender": 2,
               "credit_id": "52fe4b10c3a36847f81f0693",
               "name": "Yan Brian",
               "profile_path": "/lqGKgZqBKE1KlzQms19oYs5dwX1.jpg",
               "id": 1114614,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Nathalie",
               "gender": 1,
               "credit_id": "5776ac0992514102e0001b4a",
               "name": "Laetitia Favart",
               "profile_path": "/42s2DrBGBog1K31HFDD9sHMfmhK.jpg",
               "id": 1643936,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Maxime",
               "gender": 2,
               "credit_id": "5776acd2c3a3687cc90018bc",
               "name": "Pierre Perrier",
               "profile_path": "/bR8EDYLNenBgRYqX7OhXvYLJwpt.jpg",
               "id": 191503,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b10c3a36847f81f066d",
               "name": "Pascal Arnold",
               "profile_path": null,
               "id": 66022,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b10c3a36847f81f0673",
               "name": "Jean-Marc Barr",
               "profile_path": "/vlWlQUc3qxNd0fIbv2lqXOv8j7i.jpg",
               "id": 1642,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "53f0442a0e0a2675bf002b8b",
               "name": "Lucy Allwood",
               "profile_path": null,
               "id": 1087669,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53f0443e0e0a2675bc002b31",
               "name": "Pascal Arnold",
               "profile_path": null,
               "id": 66022,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 16.011933,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 112160,
      "vote_count": 116,
      "budget": 0,
      "overview": "Three generations of a French family open up about their sexual experiences and desires after young Romain is caught masturbating in his biology class.",
      "similar": [
         32868,
         17130,
         14,
         141,
         86331,
         449176,
         43923,
         53932,
         232175,
         1391,
         11216,
         2105,
         7326,
         81774,
         82702,
         106646,
         85350,
         13,
         28468,
         258216
      ],
      "original_title": "Chroniques sexuelles d'une famille d'aujourd'hui",
      "runtime": 81,
      "poster_path": "/pU2nD3Llaz3Taq5FAaQUg00uJYD.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Toloda",
            "id": 9011,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Monkey Pack Films",
            "id": 8906,
            "origin_country": ""
         }
      ],
      "release_date": "2012-05-09",
      "vote_average": 4.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://chroniquessexuelles-lefilm.com/index.html",
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Pascal Arnold",
         "Jean-Marc Barr"
      ],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Lucy Allwood",
         "Pascal Arnold"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt1753584/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0Mjc3MDY0Ml5BMl5BanBnXkFtZTcwMDgwMzc4Nw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Mathias Melloul, Valérie Maës, Stephan Hersoen | See full cast and crew »"],
      "reviews": [
         "Sex a basic human necessity and as an adult one must not refrain from discussing it it may not seem appropriate at first but it can be done if one takes initiative. humans are sexual beings and after attaining sexual maturity are bound to have sex and enjoy the act of making love. Its really very hard to digest the fact that our family members and relatives have sex - oh YES lets admit it !!! Our parents,uncles aunts, brothers sisters, grand parents(O yeah old people like it too) get intimate between sheets behind closed doors. This movie deals with such subjects which focuses on the sex life of a family basically the siblings of a family. This movie is beautifully done and the chemistry between the siblings , parents and lovers just seems too realistic. Nudity is shown wherever its necessary. A movie to be watched with broad minded people who admit all human beings are sexual animals. The hand held camera work is very elegant and has managed to capture details such as the facial expressions with panache. I enjoyed this movie with my friends and cousins. Hope you enjoy it too......",
         "What is interesting is the description of the sexual life of a whole french family living nowadays : from the young teenager who makes love for the first time with her girlfriend, to his grandfather who lost his wife and makes love with a young prostitute. I found the description rather credible and realistic, all the actors are good. I saw the uncensored version which is quite less explicit than many other mainstream movies with explicit sex scenes (like \"9 songs\" for instance). The DVD issue is more explicit, but most of the versions shown in movie theatre are censored (and rated for a public above 12 in France). the sex scenes are relevant, they are linked to the story and they are neither gratuitous nor vulgar, I think.",
         "'Sexual Chronicles of a French Family', to give it its English-language title, pretty much does what it says on the tin! Members of a French family - including granddad - have sex. It all kicks off when the youngest son is suspended from school for masturbating in class, and while he mopes around the house his parents have sex, his sister has sex (with her boyfriend, often al fresco), his older brother has sex (as part of a threesome) and his grandfather has sex (with his long-term prostitute, who becomes a friend of the family). There's not much of a plot; just a lot of talk, and sex. Thankfully most of the sex scenes are between people whom you actually want to see naked (father and grandfather excepted - sorry chaps!) and it is interesting that although the older brother eventually decides he is homosexual, there's no explicit man-on-man action to match the heterosexual sex scenes, even in the two-men, one-woman threesome scenes. The version of this I saw at the 2012 Edinburgh Film Festival shied away from full-frontal shots, but it's erections galore in the German cut ('Frankreich Privat Die Sexuellen Geheimnisse einer Familie', in case anyone feels like hitting Amazon.de!)",
         "The leisurely comedy-drama follows teenage Romain, the youngest in a family whose members and various boyfriends and girlfriends more or less freely discuss their sex lives, with some interesting boundaries. Romain, the virgin of the group, laments his condition but with encouragement and validation from his father becomes confident enough to go to bed with his love interest, Coralie. The movie chronicles the dynamics of the couples with a lighthearted, unpretentious approach. As Romain, Mathias Melloul conveys just the right combination of reluctance and assertiveness, and actors playing the father and grandfather are genuinely low-key and charming. Only the mother and older brother come off as superficial, no fault of the players. It's due to a scenario that is too thin to add or sustain much depth or insight. The hardcore sex scenes that at times limit the drama are shot artlessly, although the penultimate scene between the two young leads nicely illustrates the tentative awkwardness of first love. The movie is not a documentary.",
         "I don't want to get into a discussion whether the explicit display of sex - the term 'soft porn' comes to mind - is a good or a bad thing, or necessary or not. I don't mind. The movie starts with a good idea and promise. The teenage son of the family is caught masturbating in school. The mother takes it rather easy and doesn't make a big deal of it, but she starts to think about her own sex life and that of her widowed father in law. I thought that this would lead to the uncovering of suppressed sexual desires of the parents and grandfather, and that this could cause some frictions or maybe hurt feelings somewhere. It holds vaguely with some of the characters involved, but the only real forward going story is that of the son having his first time experiences with a girl from school. Unfortunately, there is not much left of the film when you take the heavy breathing scenes out. You can write the entire plot on the back of a postage stamp. For almost an hour and a half, the movie shows a family of three generations in which most of them have a rather fulfilled sex life. This is nice, but why do I have to watch them doing it?",
         "A previous reviewer of this film suggests that people under the age of 35 might find this film difficult. However, i felt the opposite, that people over 45 would find this film blows away what they have previously known. To the older generations raised on the explosive challenges of the post war decades of a cinema which raged against both repressive censorship laws and out-moded social norms, their sense of history is invested in what is understood to be a participation in an iconic sexual revolution among other things. So many of the films of the 60s and 70s both punctuated a sense of historical change and ushered in a new permissiveness. Yet none could stand today against what we see in this essentially small film. Today's youth are emerging and sex is still central to the radical. Not one of the great classic works of cinema which created a chime with sexual liberation depicted the level of explicit sex which is slowly becoming the norm in new independent cinema. It is in many respects an extraordinary shift in the language of cinema. This new and overt form of sexual language is not a reaction against repressive norms as it was in the 60s, but rather reflects the effect on a generation of unbound exposure to pornography via the internet from early childhood. The younger generation are so sophisticated in their understanding of sex, that it is quite the norm to extend into the language of their cinema the digital habits which are available to them in private. To an older generation this may come as a shock. We're not used to such a sense of ease with the genitalia. The male penis has been a heavily censored object in cinema until very recently, though largely through the prudish choice of a director-base which was essentially male and heterosexual. Surprisingly, considering the militancy of the feminist movement, depiction of the clitoris was associated very much with male exploitation of women and has never previously been celebrated as such in cinema. These old types of restrictions, essentially generated through the dialogues of the cultural liberators of the 60s, 70s and 80s appear to have had their day. It is true that France, and Europe historically have been much more relaxed about the depiction of sex in cinema compared with for example the US and the UK. However this film really brings right up to date that natural licence and we move into a new territory of depicted sexual intimacy. All of the films emerging which depict graphic sex and i could name at least half a dozen off the top of my head, are not dabbling in pornography. Rather, what is emerging is a new world, a new honesty, a new openness, a new level of maturity, of truth, a language of signs and symbols well beyond the old order of the avoided, couched, suggested and coded. In this new utopia, the liberation has in some sense already been long around via the advent of the internet culture. Cinema needs to catch up. The old sexual reality are no longer contain the issues of the day. Sex now becomes a way of intensifying the present tense and claiming life through a sensuality finally contextualised by a pure kind of democracy. We can all see ourselves as sexual beings. We can all live, we can all have what we need. Because we all are anyway. Sex has always been linked in some sense to the arrival of the revolutionary. Certainly this new level of sexually explicit toleration blows away the old struggles which turn out to have only come so far in the end. In other films of this kind, the ease with the sexually explicit has usually been attributed to the emerging younger generation. This film breaks the mold by suggesting that everyone has nothing to hide, both young and old. it's a good development and a generous form of inclusion. Until now one had the impression that the younger generation were only able to celebrate their own interests. This film confirms that this is no longer the case and both the curiosity and technology of the young is capable of transforming and touching the lives of all generations.",
         "The story is simple, just a cross-section of an everyday family with very real sexual scenarios. I was stunned to see such great acting in a cast readily open to perform explicit sex acts. Romain's, the recently turned 18 male lead, very real awkwardness is cringe-worthy and forced out of me an embarrassed laugh. All the actor's chemistry with each other was perfect, I couldn't imagine it done better, because it didn't need to be done better. The film is careful to steer clear of pornographic style and only shows a minimum of explicit acts while remaining so real you may as well be there with them. I'm not giving it a ten only because I felt it didn't challenge me enough as a viewer. Although, If you're on the more reserved side towards sexual expression this may be a very challenging viewing indeed. *side note: Some characters aren't given much development though, but I think too much complexity might detract from the film's simple journey. Highly recommended film",
         "I'm giving this a top score (which I do extremely rarely) not because it it a great film but, because it is a much needed film that no one has been brave enough to make until now. Reading the other reviews I get the impression that the writers watched the film as 'entertainment', it is that and has enough of a plot & deep enough characters to stand up as such. However, I believe the films real value shows when seen as what a school biology curriculum may title as \"Facts of life: Advanced Course (Sex As A Part Of Life)\". It is clichéd and a little unreal, as such educational films are, but still very good. Of course this film is never going to be shown as part of a school curriculum, or is it? Life itself is a school. Most of us are raised with a closed-minded attitude to sex, and as a result have a perverted view of it. This film shows us that all us adult pupils of the school of life (from age 16 to the end) are sexual beings for which sex can be a very enjoyable & enriching part. This applies whether or not we have a 'good-looking' appearance, sex can be a beautiful act even when old wrinklies are involved. It also shows that it is to be treated with care & responsibility. It also drops in that sex is something to be shared, not taken or merely bought. While commercialised sex is at best empty & possibly damaging. Someday this film will be unnecessary, in which case this would be merely entertainment. When that happens I would probably give this a mere 5 or 6, and the other reviews I see would be apposite. Until then this film is great art, given that great art is meant to challenge us & make us think. Unfortunately most of us have a 'broken' thinking machine so most only see porn. For those can do only see it a such, try watching & understanding the expressions of the sexual participants, both pre & post coition, also during. You will see that love and care comes out much more vividly than eroticism. You will also how it can be awkward for first-time participants but then, as they learn to relax with each other, how the bond between them grows. This is not porn, this is a very worthwhile piece of art for whom I would like to praise all the participants. Edit: I saw a pirate version of this film after it was taken from a P2P download. But having seen it I decided that it was worth buying and attempted to. However, I was only able to source worthless censored versions. So it seems that I am disallowed from financially supporting the making of such films, and that we are only allowed to learn about sex from perverts (i.e. schoolmarm types & pornography). Hmmmm, what a weird world we live in... it just emphasises the need for more stuff like this film.",
         "Warning: This review includes spoilers! I saw the uncut version. From a straight male point of view there were indeed some scenes with lovely nude ladies who may even have been genuinely aroused by what they were participating in. But! There was a lot of emphasis on male sexuality, by comparison little emphasis on female sexuality. There was a lot of explicit male nudity (genitals), but no explicit female nudity (apart from a short dark scene at the beginning). This was extremely unbalanced. If they want to include scenes like that they should give equal attention to both sexes. Typically they didn't. In the end one male character came out of the closet. But in fact, the whole film had done that already.",
         "This is no feature movie, it's a documentary. Varying stages of sexual development are condensed documented in one 90 minute movie embedded in a story. I wish I could have seen it when I was in puberty. Would have saved me some embarrassment. Watching it will be very disturbing for anyone under 30 to 35 years of age. That's because your own memories of shameful incidents during your puberty will be brought up. But it's also quite instructive: When the mother discusses with the school principal, you'd wish your own parents would have reacted like her. As it is an European movie, it contains nudity where nudity is essential to the content, wouldn't merit a single \"X\" in most countries over here. Guess it should be rated PG12 as smaller children would actually be bored by the plot."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Toloda",
         "Monkey Pack Films",
         "Supersonic Productions"
      ],
      "summaries": [
         "The school catches 18-year-old Romain video taping himself masturbating in class and suspends him. Though the school drops the matter after learning it's only one incident in a game in which all students participate, Romain remains distressed. He's still a virgin and the only member of his family not engaged in sexual activity.",
         "Three generations of a French family open up about their sexual experiences and desires after young Romain is caught masturbating in his biology class."
      ],
      "budget": 0
   },
   "movielensId": 112193,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2012-05-09",
      "dvdReleaseDate": null,
      "directors": [
         "Pascal Arnold",
         "Jean-Marc Barr"
      ],
      "runtime": 81,
      "movieId": 112193,
      "title": "Sexual Chronicles of a French Family",
      "mpaa": "",
      "actors": [
         "Mathias Melloul",
         "Adeline Rebeillard",
         "Valérie Maës",
         "Stephan Hersoen",
         "Leïla Denio",
         "Gregory Annoni",
         "Nathan Duval",
         "Yan Brian",
         "Laetitia Favart",
         "Pierre Perrier"
      ],
      "imdbMovieId": "1753584",
      "originalTitle": "Chroniques sexuelles d'une famille d'aujourd'hui",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["uZq9OfchXEE"],
      "plotSummary": "Three generations of a French family open up about their sexual experiences and desires after young Romain is caught masturbating in his biology class.",
      "tmdbMovieId": 112160,
      "avgRating": 2.68,
      "releaseYear": "2012",
      "numRatings": 25,
      "posterPath": "/pU2nD3Llaz3Taq5FAaQUg00uJYD.jpg"
   }
}