{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bravery",
            "id": 3930
         },
         {
            "name": "kingdom",
            "id": 4152
         },
         {
            "name": "army",
            "id": 6092
         },
         {
            "name": "honor",
            "id": 9812
         },
         {
            "name": "knight",
            "id": 10466
         },
         {
            "name": "dragon",
            "id": 12554
         },
         {
            "name": "valor",
            "id": 161516
         },
         {
            "name": "wizard",
            "id": 177912
         },
         {
            "name": "courage",
            "id": 189098
         },
         {
            "name": "quest",
            "id": 207372
         }
      ],
      "imdb_id": "tt1639826",
      "video": false,
      "title": "Justin and the Knights of Valour",
      "recommendations": [
         102492,
         134218,
         161831,
         119200,
         184915,
         429866,
         226343,
         118898,
         215585,
         116886,
         202443,
         133632,
         203531,
         75503,
         158112,
         194246,
         130457,
         163910,
         144952,
         178448
      ],
      "backdrop_path": "/hjd7Wzb4q5coizMC2QbCBYrIz5V.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Talia (voice)",
               "gender": 1,
               "credit_id": "52fe4b7f9251416c75104c11",
               "name": "Saoirse Ronan",
               "profile_path": "/7P82k4UhqnKcCwUENZtK561ZKVs.jpg",
               "id": 36592,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Justin (voice)",
               "gender": 2,
               "credit_id": "52fe4b7f9251416c75104c15",
               "name": "Freddie Highmore",
               "profile_path": "/5wou22G4dMRcnpMrRyPfLclZ2lD.jpg",
               "id": 1281,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Sir Clorex (voice)",
               "gender": 2,
               "credit_id": "52fe4b7f9251416c75104c1d",
               "name": "Antonio Banderas",
               "profile_path": "/85197jARsr06xQ84NhP9YoBL3sR.jpg",
               "id": 3131,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Heraclio (voice)",
               "gender": 2,
               "credit_id": "52fe4b7f9251416c75104c19",
               "name": "Mark Strong",
               "profile_path": "/svq7VWJqKN4Fq8ZJK1Yd8W711rn.jpg",
               "id": 2983,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Gran (voice)",
               "gender": 1,
               "credit_id": "52fe4b7f9251416c75104c21",
               "name": "Julie Walters",
               "profile_path": "/f88FYv3EYWvbXaeTXyO56dWCbez.jpg",
               "id": 477,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Queen (voice)",
               "gender": 1,
               "credit_id": "52fe4b7f9251416c75104c25",
               "name": "Olivia Williams",
               "profile_path": "/sFPpzOuDOLyB0YmTstS7MTSzEb6.jpg",
               "id": 11616,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Reginald (voice)",
               "gender": 2,
               "credit_id": "52fe4b7f9251416c75104c29",
               "name": "Alfred Molina",
               "profile_path": "/uJQVkqEVJGLMaJbwI2tTDlJ9Oo0.jpg",
               "id": 658,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Legantir (voice)",
               "gender": 2,
               "credit_id": "52fe4b7f9251416c75104c2d",
               "name": "Charles Dance",
               "profile_path": "/bLT03rnI29YmbYWjA1JJCl4xVXw.jpg",
               "id": 4391,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Sota (voice)",
               "gender": 2,
               "credit_id": "52fe4b7f9251416c75104c31",
               "name": "Rupert Everett",
               "profile_path": "/jGTaV5htTRo2T0aeM2eoHZcpLG4.jpg",
               "id": 4757,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Lara (voice)",
               "gender": 1,
               "credit_id": "52fe4b7f9251416c75104c35",
               "name": "Tamsin Egerton",
               "profile_path": "/os7KI6aqns4MH1BKGYDl3fcZOAV.jpg",
               "id": 66442,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Blucher (voice)",
               "gender": 2,
               "credit_id": "52fe4b7f9251416c75104c39",
               "name": "James Cosmo",
               "profile_path": "/523gSqAG9eSSNmKexFFZYh38SxL.jpg",
               "id": 2467,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Braulio (voice)",
               "gender": 2,
               "credit_id": "52fe4b7f9251416c75104c3d",
               "name": "Barry Humphries",
               "profile_path": "/ccJHmzU8wzOe4sAmeVeScu5mygl.jpg",
               "id": 22,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Melquiades (voice)",
               "gender": 2,
               "credit_id": "52fe4b7f9251416c75104c41",
               "name": "David Walliams",
               "profile_path": "/3CrenEjzotOmk2FidLQ1mePjPNS.jpg",
               "id": 80536,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b7f9251416c75104bef",
               "name": "Manuel Sicilia",
               "profile_path": null,
               "id": 228708,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b7f9251416c75104bf5",
               "name": "Matthew Jacobs",
               "profile_path": null,
               "id": 80110,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b7f9251416c75104bfb",
               "name": "Manuel Sicilia",
               "profile_path": null,
               "id": 228708,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b7f9251416c75104c01",
               "name": "Antonio Banderas",
               "profile_path": "/85197jARsr06xQ84NhP9YoBL3sR.jpg",
               "id": 3131,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b7f9251416c75104c07",
               "name": "Kerry Fulton",
               "profile_path": null,
               "id": 1124083,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b7f9251416c75104c0d",
               "name": "Ralph Kamp",
               "profile_path": null,
               "id": 41286,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5531714f92514152950007a9",
               "name": "Juan Miguel Vadell",
               "profile_path": null,
               "id": 1455618,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 6.847145,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 146381,
      "vote_count": 106,
      "budget": 22000000,
      "overview": "A heart-warming tale about friendship, honour &amp; courage, which sees a young boy become a man as he embarks on a quest to become a knight.",
      "similar": [
         10882,
         62177,
         809,
         122,
         10140,
         10473,
         9093,
         2312,
         12444,
         12445,
         27022,
         34584,
         810,
         121,
         674,
         767,
         808,
         259316,
         49051,
         10693
      ],
      "original_title": "Justin and the Knights of Valour",
      "runtime": 90,
      "poster_path": "/jCRKQ6afS5LwSLeIrKZ78KVgv1C.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/psRQSvf78E2JL37OuepCrozuU6e.png",
         "name": "Constantin Film",
         "id": 47,
         "origin_country": ""
      }],
      "release_date": "2013-08-09",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Manuel Sicilia"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Manuel Sicilia",
         "Matthew Jacobs"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1639826/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODM2ODg5NzAwOV5BMl5BanBnXkFtZTgwOTE5MTAwMDE@._V1_SY278_CR78,0,214,278_AL_.jpg",
      "actors": ["Stars: Freddie Highmore, Antonio Banderas, James Cosmo | See full cast and crew »"],
      "reviews": [
         "Watched Justin and the Knights of Valour this weekend with my 8 year old daughter, my friend and her two similar age kids and they absolutely loved it! they were well entertained during the whole film, and I quite enjoyed it too as animation films go. Makes a nice change to see a classical animated story as opposed to dancing animals or the smurfs... And there are nice things in it for adults too: the British voice cast is great (watch out for Charles Dance as one of the monks)and the music was a nice surprise too. Nice simple story, packed with the action that the kids love and with some nice things for parents too.",
         "I liked the movie.....maybe not so surprising if you are USED to a flying crocodile??? I don't understand the bad reviews i've been reading here....Okay, Shrek en how to train a dragon would be rated a 9 or 10 but this one still is very amusing! The schizophrenic wizard, the flying crocodile...I had a few laughs! Maybe adults shouldn't rate a movie like this...and kids shouldn't be too small to watch it and understand the humor......but i thought it was worth rating and thumbs up for Anthonio!! The vain fake knight caught in his own greedy web! and now i have to fill my comment up till ten lines...i just wanted to put in a good word for this movie and didn't agree at all with the other comments....",
         "Wonderful story about a young boy becomes a man as he embarks on a quest to become a knight , as he wants to follow in the footsteps of his grandfather and join the Knights of the Roundtable . It deals with Justin (Freddie Highmore voice) lives in a kingdom where bureaucrats rule and knights have been ousted. Justin, the son of chief counsel to the Queen, lives in a kingdom where knights have been outlawed, and the land is over subscribed with laws for everything imaginable. His dream is to be become one of the Knights of Valour, like his grandfather was, but his father Reginald (voice by Alfred Molina) , the chief counsel to the Queen , wants his son to follow in his footsteps and become a lawyer. After an inspiring visit to his beloved grandmother and bidding farewell to his supposed lady-love Lara (Tamsin Egerton) , Justin leaves home and embarks on a quest to become a knight. Along the way he meets the beautiful, feisty Talia (Saoirse Ronan) ,and is mentored by three monks Whilst an unlikely candidate for knighthood, Justin must rise to the challenge quickly when banished former knight Sir Heraclio and his army, lead by Sota (Rupert Everett) , return and threaten to destroy the Kingdom . As Sir Heraclio (Mark Strong) wants Justin to join him and fight by his side. When the teen refuses, the king has no other choice but to unleash his flesh-hungry horde of vicious warriors on Justin and his girlfriend. Can he save the Kingdom from impending doom and a few other clichés? . This amusing 3D cartoon has great animated sequences well staged with stylish and vitality , adventure , romance , outstanding final and results to be pretty entertaining . Enjoyable action sequences in castles , monastery , falls , including amusing ending confrontation at the climax of the film and a fun flying croc . Well produced by Antonio Banderas, fresh from providing his sexy Spanish tones for four Shrek films, has clearly decided that providing the voice of a cat in some near decent animated movies has given him all the knowledge he needs to produce similar animated box office gold . While the film has an addictive color and design graphics and 3D computer generator animation itself is extremely attractive, we are in presence of a film too simplistic and Manichean in his story to end. So, unfortunately, not much progress in achieving empathy and convey emotions that excite. Along his quest, the protagonist encounters a slew of quirky characters, a fun plethora of secondaries , as a strange wizard called Melquiades voiced by David Wailians , the handsome Sir Cloirex voice by Antonio Banderas ; the monks : Blucher , Legantir and Braulio voiced by James Cosmo , Charles Dance and Barry Humphries respectively , who teach and test him in the ancient ways of the Knights of Valour . The character \"Sota\" is inspired in one card of the Spanish deck, which is equivalent to the Jack in the international Deck, and has a very similar look to this character. Also, the name of the villain, Heraclio, matches the best known publisher of card decks in Spain, Heraclio Fournier . Furthermore , this funny movie contains a nice Original Music by Ilan Eshkeri . Colorful and glimmer Cinematography by Javier Fernández .This Spanish motion picture was well written and directed Manuel Sicilia . Worthwhile seeing , better than average . The film will appeal to kiddies and teenagers .",
         "Justin and the Knights of Valour is very well executed and exciting adventure film. In costume and characterisation it has many similarities with 'Tangled', 'How to Train Your Dragon' and 'Brave'. All three last named are films I love by the way. For me Justin and the Knights of Valour is a worthy successor to them all. The artwork is very beautiful and imaginative, the script is intricate (for a children's film) and all the main characters are amusing and likable. They are also nicely voiced. I particularly liked Saoirse Ronan's Irish accented Talia. I'm in my late sixties (male) and saw the film on my own. I wasn't bored for a single second. On the contrary, I found the story to be totally absorbing. I'm also a bit of an unashamed romantic - so I was keen to discover how things would work out between Justin and his (two) young lady friends. There are also a couple of better than average songs I'd like to hear again. As best as I can recall the incidental music is fitting and well performed. (I intend to see the film again soon, so I will pay more attention to the musical score then.) I highly recommend this film and feel confident in predicting that it will have lasting appeal to both young and old for many years to come.",
         "The main attraction was the voice cast, full of talented people and what a line-up. The trailer wasn't really all that promising, it was of the competently animated but thinly plotted with flat jokes kind of animated film. Unfortunately, Justin and the Knights of Valour as a film wasn't that much better than its trailer. Was it completely terrible? No. Justin and the Knights of Valour doesn't have amazing animation but it is very competent and colourful with nice textures. The only not-so-good thing in this regard was the dragon, too bumblingcrocodile-like in design. It's pretty much the same with the music, rousing and pleasant to listen to if not particularly memorable. Freddie Highmore is a likable protagonist and the wise monks played by Charles Dance, James Cosmo and Barry Humphries are a nice touch and provide what spark there is to the story. Was Justin and the Knights of Valour disappointing? Yes it was, one of the weakest animated films of 2013, or at least what has been seen by me so far. The voice cast are talented but their talents are not used well and most didn't seem to be connecting with the material. Saiorse Ronan brought some sass to her role but often sounded forced, Antonio Banderas sounded uninterested in a pale imitation of Puss in Boots role(sadly that was true of Alfred Molina as well), Rupert Everett camps it up and over-compensated and David Walliams is painfully unfunny and is just annoying. Mark Strong was reasonably good, but he had material that was beneath him and suffered from a villainous character that was poorly written and underdeveloped. They were let down by a rather dreary script that is laden with jokes that are flat in alternative to witty and dialogue that is rather lacking in life. As well as a thin story that didn't do anything imaginative or fresh with a predictable premise. The pacing felt stretched out and dull with the writing as vapid as it was, and the film ends on an unsurprising and somewhat syrupy note. The archetypal characters lack colour and interesting personalities, so it's not easy to root for them. They're poorly developed too, Strong's character was written as almost feeling like an afterthought and seems to be just there as a form of obligatory conflict. All in all a very disappointing animated family film, there was a lot of potential but the film does little with it. This is of course a subjective personal opinion- and to be taken with a pinch of salt- from a 21 year old who adores animated films and is aware of who they're mainly aimed at. That's not attention-seeking, merely to stop any stereotyping, condescension or parental ignorance(like the old, annoying and unnecessarily patronising \"it's a kids film don't be so cynical). 4/10 Bethany Cox",
         "While it will not win prestigious awards this animation movie comes as a surprise with beautiful animations and a light plot that brings smiles upon any young heart while delivering a message now almost forgotten: the courage to dream and chose own way in life. The dedication and the work performed on this little gem is visible in the lovely drawn characters and the great voice acting delivered by known artists. Personally I recommend this independent movie as a breath of fresh air in confront of the overrated and overpriced sequels upon sequels delivered by big animation studios.",
         "I think this movie deserves more than the current rating it has. Sure, the plot is entirely predictable and there are plenty of \"borrowed\" moments and gags from other films, but the animation is nowhere near as bad as some make it out to be. In fact, it is perfectly fine. The reason the animation comes in for a kick to the head is because it isn't Hollywood animation. It's European. FRankly it makes a nice change to see a different art style. Some of the backgrounds are actually quite gorgeous to see and the texturing is excellent in many places. Trust me when I say, the animation is not a problem. Apart from the formula story and movie nods and adult humour, there is one thing wrong with the film... Freddie Highmore as the main character's voice. I just didn't detect much passion in the performance. In fact, he does a lead in narrative right at the start that had me wondering if I was listening to an amateur dubbed version. It isn't good! His voice just never seemed to fit the character of Justin. The rest do a decent job but I agree with some others that say it all seemed slightly off somehow, or out of synch by a tiny fraction. That aside, it isn't a deal breaker and you quickly get used to it. So, is this movie going to be an animated classic? No, no it isn't. But it isn't as bad as the ratings might make you think. If you are having to sit through a kid's film with your little ones, then there are far worse (for adults) films you could pick - pretty much any of the Chipmunks movies, for instance - so give it a go! SUMMARY: Not the greatest animated feature, but far from the worst.",
         "I don't understand why it has such a bad score. It Definitely beats Frozen for plot and consistency, and it is lot more interesting. It is set in middle ages and it strangely deals with a theme of bureaucracy and administration destroying lives and defying all logic and also about parents that try to prevent their children from achieving their dreams. Something MANY of us are able to relate to. Justin wants to be a knight in the world where administration and lawyers rule and it is forbidden to be a knight and seek out justice, and law rules supreme in every way, even when it is unjust and stupid. Justin's grandfather was a knight and an idol of his. He was killed trying to defend the widow queen who angered another knight by signing a treaty to forbid knights. Justin's father, the lawyer, is trying to push him to law school, unlike his grandmother. She supports him and gives him a quest to find his grandfather's sword and receive training from three guys that still offer it on an isolated island castle. Justin escapes and makes some friends on the way and ends up finding true love as well, winning the day and making everyone proud. Animation is interesting, and for those of us that are enamoured with medieval music, pleasant surprise is the soundtrack, some of which was not made for the movie but rather a well-known medieval melody. The movie knows when to shut up and the villains are positively devious. There is a gay character included and it is pleasant to see they were not scared to make him a secondary villain. The few things I didn't like are: Unconvincing development of feelings between Justin and love interest because it is simply not believable, and some scenes which need to convince us that a certain character is not alone in his head last a bit longer than really necessary making it slightly awkward to see. I wish Banderas got bigger role, but he took care of his character just fine, and I hope to see him do more voice acting.",
         "Well, this is a pretty normal story of a man trying to become a knight but in a different reason for doing so. Although all his life he wanted to be a knight, he lives in a time where it was outlawed to be a knight. His father wants him to be a lawyer but of course he doesn't want to be one so he runs away to become what he wants. I'm not going to lie, there are a lot of clichés but they still were able to keep it slightly new. We have a boy that goes against his father's wishes, a love interest who doesn't actually care about him, a sort crazy wizard (mimicking the dragon from 'Quest for Camelot'), a cast out knight as the bad guy, and normal teachers for the boy to learn from. Though there are all these clichés, there are some things that stand out such as the laws that were being passed but sadly those are not as prominent. I mostly see a movie that tried to be like every other story about a knight. It's sad because they could have done so much to make it better and yet stuck with the normal ideas. The animation is actually rather nice, looking a bit cartoony but overall similar to 'How to Train Your Dragon' in some of the detail work. The background is so detailed that it makes the characters look slightly bland. They do fit in with the rest of the world but sometimes they I wish that they had a bit more texture to them. As for the movement, it's actually very fluid and believable even if slightly overboard. The characters don't really stand still very long, always using there hands and being a bit over the top in some occasions. The voices are alright although somewhat hard to listen to at times since our main character has such an overpowering old English voice. This is a voice that I would have thought would be on a person in a romance type setting, not from a pip squeak body like him. Don't get me wrong, the voice is pleasant compared to what they could have picked for him but it's not a voice I picture coming out of our main character. When other characters speak in the old English dialect, sometimes I can't understand what they are saying like the old man in the beginning or the little girl. The voices seem to be muddled together, like they are mumbling. The music really does not fit the show. It's just to pop starish and not enough medieval tone. I felt like I was pulled out of the story every time they started playing the soft pop songs. Don't get me wrong, the songs are good but they just don't fit. I liked the show but it didn't stand out for me. It felt as though I was watching similar movies so I can't give it a very high rating.",
         "The animation superb! the plot by the numbers! the script lays it on a bit thick in parts but all of that is fine hokum for a Sunday afternoon! But the audio? I thought it was a bug in the trailer on IMDb but it was not! the sound is about a 10th of a second out of sync and it was flat and deadpan not rich and vibrant. I think that unless I was just unlucky or imagining things someone needs to get a lawsuit going! As someone messed up in post production! and that is a lot of highly skilled highly paid voice acting that they messed with. It is not a game breaker but it does detract from the whole experience. Other than the sound, my only other gripe was a it being a little to shallow with the main female character in some crude attempt at feminine empowerment which I have no issue with in principle, they took a 3d character and made an unconvincing 2d personality."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Family"
      ],
      "productionCompanies": [
         "Aliwood Mediterráneo Producciones",
         "Kandor Graphics",
         "Out Of The Box Features"
      ],
      "summaries": [
         "Justin lives in a kingdom where bureaucrats rule and knights have been ousted. His dream is to be become one of the Knights of Valour, like his grandfather was, but his father Reginald, the chief counsel to the Queen, wants his son to follow in his footsteps and become a lawyer. After an inspiring visit to his beloved Grandmother and bidding farewell to his supposed lady-love Lara, Justin leaves home and embarks on a quest to become a knight. Along the way he meets the beautiful, feisty Talia, a quirky wizard called Melquiades, and the handsome Sir Clorex and is mentored by three monks; Blucher, Legantir and Braulio, who teach and test him in the ancient ways of the Knights of Valour. Whilst an unlikely candidate for knighthood, Justin must rise to the challenge quickly when banished former knight Sir Heraclio and his army, lead by Sota, return and threaten to destroy the Kingdom.",
         "A young boy becomes a man as he embarks on a quest to become a knight."
      ],
      "budget": 22000000
   },
   "movielensId": 115065,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-08-09",
      "dvdReleaseDate": "2014-07-22",
      "directors": ["Manuel Sicilia"],
      "runtime": 90,
      "movieId": 115065,
      "title": "Justin and the Knights of Valour",
      "mpaa": "PG",
      "actors": [
         "Saoirse Ronan",
         "Freddie Highmore",
         "Antonio Banderas",
         "Mark Strong",
         "Julie Walters",
         "Olivia Williams",
         "Alfred Molina",
         "Charles Dance",
         "Rupert Everett",
         "Tamsin Egerton",
         "James Cosmo",
         "Barry Humphries",
         "David Walliams"
      ],
      "imdbMovieId": "1639826",
      "originalTitle": "Justin and the Knights of Valour",
      "genres": [
         "Animation",
         "Adventure"
      ],
      "youtubeTrailerIds": ["c9R9x9RfyGE"],
      "plotSummary": "A heart-warming tale about friendship, honour &amp; courage, which sees a young boy become a man as he embarks on a quest to become a knight.",
      "tmdbMovieId": 146381,
      "avgRating": 2.48214,
      "releaseYear": "2013",
      "numRatings": 28,
      "posterPath": "/jCRKQ6afS5LwSLeIrKZ78KVgv1C.jpg"
   }
}