{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rain",
            "id": 2217
         },
         {
            "name": "future",
            "id": 2964
         },
         {
            "name": "water",
            "id": 4237
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "survivor",
            "id": 5385
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "bandit",
            "id": 33344
         },
         {
            "name": "alcoholic",
            "id": 33457
         },
         {
            "name": "land",
            "id": 156378
         },
         {
            "name": "drought",
            "id": 180999
         },
         {
            "name": "rejuvenate",
            "id": 208737
         }
      ],
      "imdb_id": "tt2693664",
      "video": false,
      "title": "Young Ones",
      "recommendations": [
         80318,
         201066,
         179154,
         41587,
         339355,
         51321,
         214096,
         239056,
         38966,
         122843,
         286709,
         61418,
         31281,
         36832,
         69851,
         60109,
         319910,
         229182,
         44032,
         307479
      ],
      "backdrop_path": "/6A3UPYZEnMUlUgC7XOMntvdT0ni.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Ernest Holm",
               "gender": 2,
               "credit_id": "52fe4dfbc3a368484e20802f",
               "name": "Michael Shannon",
               "profile_path": "/5yGCJ6znHM96zTfW2LNP6uPPDCZ.jpg",
               "id": 335,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Flem Lever",
               "gender": 2,
               "credit_id": "52fe4dfbc3a368484e208027",
               "name": "Nicholas Hoult",
               "profile_path": "/27NbnWKzco1CCDHtR2AVVab8Dli.jpg",
               "id": 3292,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Mary Holm",
               "gender": 1,
               "credit_id": "52fe4dfbc3a368484e20802b",
               "name": "Elle Fanning",
               "profile_path": "/cbFVl9NWREa0xD2vW9Z3J4ursiu.jpg",
               "id": 18050,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jerome Holm",
               "gender": 2,
               "credit_id": "52fe4dfbc3a368484e208033",
               "name": "Kodi Smit-McPhee",
               "profile_path": "/vJLSwYtJH8NHEUDh508XxewnrjD.jpg",
               "id": 113505,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Katherine Holm",
               "gender": 1,
               "credit_id": "52fe4dfbc3a368484e20803b",
               "name": "Aimee Mullins",
               "profile_path": "/jRDUIRZHQ80Y0ePkHgWssydfjZh.jpg",
               "id": 1033252,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Robbie",
               "gender": 0,
               "credit_id": "546384740e0a26780a002632",
               "name": "Christy Pankhurst",
               "profile_path": "/3ZY1yunMhQkE50saye6zFoB7zN5.jpg",
               "id": 1384876,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Sooz",
               "gender": 0,
               "credit_id": "52fe4dfbc3a368484e208037",
               "name": "Alex McGregor",
               "profile_path": "/3Kz4zusBSqPVR8q3gRzV84au3ph.jpg",
               "id": 204108,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Caleb",
               "gender": 2,
               "credit_id": "52fe4dfbc3a368484e20803f",
               "name": "Robert Hobbs",
               "profile_path": "/yN6gVehZi1Y5P5kDazI8FmB8Bb0.jpg",
               "id": 82190,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Sam Lever",
               "gender": 0,
               "credit_id": "546381990e0a26780300257d",
               "name": "David Butler",
               "profile_path": "/nZUFoRw9vkxPIbLbmRrF7mt0RFu.jpg",
               "id": 1384871,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Calvin Hooyman",
               "gender": 0,
               "credit_id": "546384dc0e0a26780600266d",
               "name": "David Clatworthy",
               "profile_path": "/sYy5IKaWGDlsEm8uiABzIxRlnAr.jpg",
               "id": 1073473,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Anne",
               "gender": 0,
               "credit_id": "5463844ac3a3681243002502",
               "name": "Liah O'Prey",
               "profile_path": "/3kNKn3XB5qbJrD9bLIkHHRRqlid.jpg",
               "id": 1384875,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Bandit",
               "gender": 0,
               "credit_id": "546505cec3a36804b0002604",
               "name": "Carel Nel",
               "profile_path": "/qGbo2Qxh35eK0XOPfoEbXbGpEHc.jpg",
               "id": 1385276,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Bandit Brother",
               "gender": 0,
               "credit_id": "5465076ec3a36804c50025f0",
               "name": "Gideon van Schoor",
               "profile_path": null,
               "id": 1385280,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Foreman Jay",
               "gender": 2,
               "credit_id": "546505ed0e0a26294600263d",
               "name": "Andy McPhee",
               "profile_path": "/x3MFZjfrrMKde4NtGW40nleLidu.jpg",
               "id": 78962,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Water Guard",
               "gender": 0,
               "credit_id": "54650616c3a36804ce002461",
               "name": "Benny Horowitz",
               "profile_path": null,
               "id": 1149255,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Orderly",
               "gender": 0,
               "credit_id": "546506f8c3a36804ce002478",
               "name": "Rachel Wood",
               "profile_path": null,
               "id": 1385278,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Border Inspector",
               "gender": 0,
               "credit_id": "54650744c3a36804b0002622",
               "name": "Charles Tertiens",
               "profile_path": "/oKUXTeTDpjVS6WBhqASDV2klQ1a.jpg",
               "id": 1385279,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Mailman",
               "gender": 0,
               "credit_id": "546507b30e0a26294a0026a1",
               "name": "Vlam Beukes",
               "profile_path": null,
               "id": 1385282,
               "order": 17
            },
            {
               "cast_id": 18,
               "character": "Well Dressed Man",
               "gender": 0,
               "credit_id": "54650637c3a36804c50025cf",
               "name": "Barry Armitage",
               "profile_path": "/azpaR1xJilwRQ6MF6H1BrncfRsN.jpg",
               "id": 1385277,
               "order": 18
            },
            {
               "cast_id": 22,
               "character": "Well Dressed Woman",
               "gender": 0,
               "credit_id": "546507900e0a26767e00079a",
               "name": "Karen Snyman",
               "profile_path": null,
               "id": 1385281,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4dfbc3a368484e208049",
               "name": "Jake Paltrow",
               "profile_path": "/gPbD8Vpo0NQt7YQybiviIneZPzq.jpg",
               "id": 122582,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4dfbc3a368484e20804f",
               "name": "Jake Paltrow",
               "profile_path": "/gPbD8Vpo0NQt7YQybiviIneZPzq.jpg",
               "id": 122582,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Western",
            "id": 37
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.885962,
      "production_countries": [
         {
            "iso_3166_1": "ZA",
            "name": "South Africa"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         }
      ],
      "id": 215379,
      "vote_count": 130,
      "budget": 0,
      "overview": "In a future where water is scarce, a farmer defends his land and hopes to rejuvenate his parched soil. However, his daughter's boyfriend schemes to steal the land for himself.",
      "similar": [
         281,
         59967,
         19959,
         180,
         2048,
         97020,
         101299,
         281957,
         49530,
         238636,
         445954,
         9739,
         133805,
         979,
         23483,
         4771,
         320,
         3597,
         27022,
         6075
      ],
      "original_title": "Young Ones",
      "runtime": 100,
      "poster_path": "/kCTYduARud4wGjv6sracsqsbDtq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Quickfire Films",
            "id": 4186,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Spier Films",
            "id": 8275,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bifrost Pictures",
            "id": 38284,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Subotica Entertainment",
            "id": 39004,
            "origin_country": ""
         }
      ],
      "release_date": "2014-06-28",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "In a future without water, vengeance will rain.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Africa",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jake Paltrow"],
      "runtime": 100,
      "synopsis": "In a post draught-apocalyse USA, people would literally kill for water. Ernest Holm lives with his son Jerome and daughter Mary in their small town house and field. While everybody has left, Ernest stays, believing that the land will grow once more if only theres irrigation. Ernest gets water for his family by trading supplies with the water people who extract water from deep wells. When his mule breaks its legs and he has to kill it, Ernest goes to the auction and buys a robotic carrier machine to replace it, beating the offers of Flem, a young man whos been seeing Mary without his consent. Ernest rejects Flems offer to rent the machine. One morning Ernest finds his machine is missing, and he goes looking for it. When he gets to the water people, Ernest is accused of stealing. He wins a fight with the water peoples leader Caleb and takes his knife. Continuing on, he finds his machine and Flem with it, transporting a supply of water. Flem is taking it somewhere. Ernest takes Flem tied up but he soon gets weary due to refusing to take a drink from the water theyre carrying. Flem, wanting to continue his smuggling run, then throws a bottle at Ernest killing him. Time went by, the people found and buried Ernest, but the machine has gone missing. Flem marries Mary after helping the family build an irrigation system thus saving their farm. But the machine, limping and mangled, didnt shut down, and its default protocol makes it walk to a store in town. The store owner reaches Jerome in the Holm residence, informing about the machine. After tricking his way to town over border patrol, Jerome gets to the store to find the store owner has repaired the machine. Jerome gets interested to the machines laser sensor. It turns out the sensor can behave like a video recorder. Curious about the machines adventure, Jerome plays the recording and finds the truth about Flem and Ernest. Arriving home before Flem, Jerome picks on him as how did the machine find its way home. Flem lies further, which only infuriates Jerome even more. But he doesnt take any action. One day Flem goes on a supply run with the machine, and accidentally falls into a pit, breaking his legs. As he cries for help, Jerome, who has been secretly following him, comes at the pits mouth. As Jerome only stands there, Flem realizes that Jerome already knows about what happened to Ernest. Flem tries to talk his way into Jeromes mercy. Eventually Jerome shoots him in the head, and decides not to tell anything, even about Ernest, to Mary.",
      "writers": ["Jake Paltrow"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2693664/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTk1NjE5MTc0NV5BMl5BanBnXkFtZTgwODc1MzE1MjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Nicholas Hoult, Kodi Smit-McPhee, Michael Shannon | See full cast and crew »"],
      "reviews": [
         "First up I'd really like to counter the earlier reviewers claims that this is \"A story that had true potential was crippled by a lack of character development, and the nonexistence of focus\" What utter nonsense, just because a film uses subtly instead of a sledgehammer to get it's message across and credits the viewer with at least a glimmer of intelligence does not make it a bad film. On the contrary this is a fantastic film with a story arc that builds to a satisfying conclusion. Yes the pace is slow but clearly this is to enforce the ideas within the narrative, a parched existence if you will. For me the pacing wasn't an issue at all and created a pleasant tension. Visually it is stunning and the production design and the near-future technology was extremely well realised and executed. Fans of 70's sci-fi should look no further.",
         "This is a great film and a superb sci-fi film. The premise is relatively simple with this area of the US, possibly all of the US falling apart because of a lack of water. It centres around a dry dust-bowl of a farm lived on by a man and his two children. The cinematography is fantastic and the views often epic. The acting is great throughout with the whole cast genuinely shining. I am a big science fiction fan but I feel this movie hits the perfect balance between \"the future\" and current times. It takes place in a recognisable world and is a human story - accessible to everyone including those who aren't necessarily fans of the genre. It's great to see a film that seems to so confidently do what it wants to without watering pandering to the lowest common denominator and adding explosions or trying to fill meaning silence with extraneous talking. It's an absolute joy to watch and I'll be recommending it to most of my friends!",
         "I got to admit that i have never reviewed any title in IMDb before. I do watch lot of movies but never felt like writing a review. Young ones is an amazing movie that i have watched in an while. I kinda shows us the expectation of how the world would be 50 years from now. The cinematography had me thru the entire movie.The characters and their relation are well formed and showcased in likable way. The lead characters grab our attention right from the start and get in flow the movie plot. I really felt sad all on with characters, revived by the revenge and fell in love with the movie all over again. Young ones is one of a kind. Soundtrack by Nathan Johnson did a sensational piece of art, taking the movie scenes to the next level. Over all . 8/10",
         "If you love the artistic and non-mainstream risks taken by art-house films, then Young Ones belongs on your watch list with other indie Sci-Fis such as Lars von Trier's Melancholia, Juan Solanas' Upside Down, and Terry Gilliam's The Zero Theorem. A gritty film about pioneers in a drought ridden landscape, it's a futuristic dust bowl tale as grim as Grapes of Wrath. It's memorable and keeps your attention, while portraying Sci-Fi in a very believable way. The mix of poverty and high technology, the extremes of the haves and have-nots, and water shortages in the US, amplifies the current state of a society as all good sci-fi films do. Good actors and acting, and gorgeous to watch. What's not to like?",
         "This is a good movie. It looks good. It's interesting. It has a decent plot. It also has a few well defined characters, one of which is Ernest Holm, the father of two teenage children and the owner of a barren stretch of farm land turned desert. Holm is played by Michael Shannon in convincing fashion. He is determined without being unscrupulous. He is flawed yet humble enough to know it. He has convictions. He loves his family. This film reminded me of There Will Be Blood. The Daniel Day-Lewis movie is, of course, superior to this one although there is a similar perspective of harsh land and desperate men whose fates lie in their ability to coax wealth from it. The other major difference its that this is set in the near future and has the conceivable technological improvisations of a world where water has become the most rare commodity. All in all a pretty good movie well deserving of a much higher rating than it currently averages.",
         "Let's get this right of the bat: This is a low budget movie and it is draining the viewer (slow paced). But just because you have some recognizable faces, do not expect this to be \"Hollywood\" (as one other reviewer did). And do not even think about comparing this to Tarantino. If that's what you expect/your whole extension of movie knowledge, do not read any further, but especially: do not watch this movie at all. You'll be doing yourself a favor mostly. Back to the actors, who are giving extraordinary performances. No matter the age of the ones involved, we do get amazing on our screen. While to some it might seem there is no story, that is not true. It's just hidden well behind all that character driven development we're seeing. It's not a fun ride, but it's a well made one!",
         "There's a tone in the Young One's that even though I can't put my finger on, it feels very familiar, almost a languid natural ease. The story is compelling, so much so, that almost a year after seeing it, I reflect on the bright light of the desert and still hear the soundtrack. There were movies with this light made in the 70's, panoramic, larger then life, but full of individual stories. Without even delving into the true nature of the accurate rendering of future issues regarding the environment, and natural resources, this is a story about justice and metering that out in the harsh climate of a shaken world.",
         "Young Ones, to me, is a revolutionary film for this decade. Look at the other films that are being released today: Divergent, The Hunger Games, Twilight, and The Maze Runner. They all have one thing in common; THEIR THE SAME THING. Honestly, I feel that every film these days is the exact same film with certain changes. In other words, they are very unoriginal. By that I don't mean unoriginal in setting, because a lot of settings in movies are unoriginal on their own in these days, but instead I mean unoriginal in how they tell their stories in their settings: The Hunger Games and Divergent have the same setting of a broken, faction based society, and thats fine, but they tell very, very similar stories, and thats not fine. Young Ones is unique in that it takes a familiar concept as its setting, but tells a very unfamiliar and different story with its characters. To call the film original is a stretch; it does do some familiar things with its story and has some pretty archetypal characters, but for what it is, its the most original character film to be released in this day and age. Young Ones tells the story of a family of farmers in a future world where water is scarce. The family struggles to keep their dwindling supply of water in good condition and out of the wrong hands. The film is not post-apocalyptic: there is a society and a city in the world and the city is functioning nicely. The farmers are the ones who are struggling, and through these details the film conveys a sort of allegorical comparison between the rich and the poor and the naturalistic. The characters are a little familiar, but the way they react to the world and the way it drives them to do what they do is pretty fresh for the time. The things they do in the film feel realistic and settling for the fiction at the same time. Even better, the things they do don't feel too familiar to what other characters do in other films. Aside from the story, the film has BEAUTIFUL cinematography. For those who know of the film Walkabout, by Nicholas Roeg, this film is very much like that. Think Walkabout mixed with Blade Runner. The imagery is steady, vast, colorful and imaginative. The fact that all this was filmed on location makes the film feel even more expansive than what is shown. Its not to say that Young Ones is for everybody. It is an art film (the trailer makes it seem like a Mad Max action film, when it really only has two scenes of action and their pretty brief), so not everyone will find it to be good. But for those who enjoy movies, like Sci-Fi, and want a refreshing take on the genre, Young Ones delivers on all promises",
         "This is set in the future when after prolonged droughts water has become the most precious commodity on the planet. The story is told in three chapters from the perspectives of the three main players. Ernst Holm comes first; he has stuck it out on his dehydrated farmstead. He has alcohol issues, a wife in hospital and two young children, his daughter Mary and son Jerome. He ekes an existence by servicing the local water mine and life is hard. His daughter has a beau in the shape of Flem Lever (Nicholas Hoult) who has designs on both her and her daddies land. He soon decides to put his designs into action with repercussions for all. Now this is an indie effort and the CGI is excellent despite that. The story is a slow burner but it is one that is very much worth staying with. Michael Shannon an Ernst is particularly effective as the guilt ridden, hard bitten man who is clinging on to hope. The sci- fi parts in terms of machines are also done quite well, there is some action, but this is a character piece with violence as a driver for the story and not the raison d'être. I like dystopian futuristic films and this is one that goes for that in most parts whilst still clinging to some of the more regular societal norms and I felt they got the mix really well. If you like to have to think about a film, but not too much, then there may well be something of merit for you here.",
         "This film was very good Science Fiction: great images, great story. It's original and full of remarkable details: the machine, the opening scene, the hospital� together with smaller things that contributed to make the story more believable and increased overall quality. The plot, although classical under some respects, is not easily predictable and keeps the attention high. So does the beautiful South Africa landscape that Country Music makes sound 100% American. When both the script and the visual results are so good it is uncommon that they are the work of just one person. Jake Paltrow however both wrote and directed the movie, alone, and this is impressing. I didn't think of him as a top author (in my own private, useless, mental list) and I owe him a (private, useless, mental) apology."
      ],
      "genres": [
         "Action",
         "Drama",
         "Sci-Fi",
         "Western"
      ],
      "productionCompanies": [
         "Subotica Entertainment",
         "Spier Films",
         "Quickfire Films"
      ],
      "summaries": [
         "Set in a near future when water has become the most precious and dwindling resource on the planet, one that dictates everything from the macro of political policy to the detailed micro of interpersonal family and romantic relationships. The land has withered into something wretched. The dust has settled on a lonely, barren planet. The hardened survivors of the loss of Earth's precious resources scrape and struggle. Ernest Holm Michael Shannon lives on this harsh frontier with his children, Jerome Kodi Smit-McPhee and Mary Elle Fanning. He defends his farm from bandits, works the supply routes, and hopes to rejuvenate the soil. But Mary's boyfriend, Flem Lever (Nicholas Hoult), has grander designs. He wants Ernest's land for himself, and will go to any length to get it. From writer/director Jake Paltrow comes a futuristic western, told in three chapters, which inventively layers Greek tragedy over an ethereal narrative that's steeped deeply in the values of the American West.",
         "Set in the future when water is hard to find, a teenage boy sets out to protect his family and survive."
      ],
      "budget": 0
   },
   "movielensId": 115235,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-06-28",
      "dvdReleaseDate": null,
      "directors": ["Jake Paltrow"],
      "runtime": 100,
      "movieId": 115235,
      "title": "Young Ones",
      "mpaa": "",
      "actors": [
         "Michael Shannon",
         "Nicholas Hoult",
         "Elle Fanning",
         "Kodi Smit-McPhee",
         "Aimee Mullins",
         "Christy Pankhurst",
         "Alex McGregor",
         "Robert Hobbs",
         "David Butler",
         "David Clatworthy",
         "Liah O'Prey",
         "Carel Nel",
         "Gideon van Schoor",
         "Andy McPhee",
         "Benny Horowitz",
         "Rachel Wood",
         "Charles Tertiens",
         "Vlam Beukes",
         "Barry Armitage",
         "Karen Snyman"
      ],
      "imdbMovieId": "2693664",
      "originalTitle": "Young Ones",
      "genres": [
         "Western",
         "Action",
         "Drama",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "nJbtJ6mpkvM",
         "mH9_tU5PbGs"
      ],
      "plotSummary": "In a future where water is scarce, a farmer defends his land and hopes to rejuvenate his parched soil. However, his daughter's boyfriend schemes to steal the land for himself.",
      "tmdbMovieId": 215379,
      "avgRating": 3.20492,
      "releaseYear": "2014",
      "numRatings": 61,
      "posterPath": "/kCTYduARud4wGjv6sracsqsbDtq.jpg"
   }
}