{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "civil war",
            "id": 393
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "superhero",
            "id": 9715
         },
         {
            "name": "based on comic",
            "id": 9717
         },
         {
            "name": "imax",
            "id": 156395
         },
         {
            "name": "aftercreditsstinger",
            "id": 179430
         },
         {
            "name": "duringcreditsstinger",
            "id": 179431
         },
         {
            "name": "marvel cinematic universe",
            "id": 180547
         },
         {
            "name": "3d",
            "id": 209714
         }
      ],
      "imdb_id": "tt3498820",
      "video": false,
      "title": "Captain America: Civil War",
      "recommendations": [
         99861,
         209112,
         246655,
         100402,
         102899,
         284052,
         293660,
         76338,
         127585,
         118340,
         297761,
         1771,
         283995,
         10195,
         330459,
         140607,
         188927,
         1726,
         68735,
         102382
      ],
      "backdrop_path": "/m5O3SZvQ6EgD5XXXLPIP1wLppeW.jpg",
      "revenue": 1153304495,
      "reviews": [
         {
            "author": "Frank Ochieng",
            "id": "572d7bc1c3a3680fdb001d69",
            "content": "Well another super-sized Marvel Comics superhero saga hits the big screen with the selected savior Captain America taking the top billing on the marquee. Thus, the pulsating popcorn pleaser **Captain America: Civil War** arrives on the scene to giddy audiences that have been loyal and fixated on the successful spring of mighty Marvel heroes that have been paraded to viewers throughout the last few years. Thankfully, **Captain America: Civil War** carries on the tradition of spry superhero-studded spectacles that have been glorious and adventurous from the stable of Marvel-based movies guaranteed to win over the enthusiastic hearts of avid comic book fanboys everywhere. Joyously overstuffed and convincingly extensive with a super team armed with crime-fighting excess, **Civil War** seizes the moment to introduce a noteworthy twist: two factions of rescuing superpowers engaging in some explosive in-house fighting led by two of Marvel Comics main standouts in Chris Evans’s Captain America and Robert Downey Jr.’s Iron Man.\r\n\r\nCo-directors Anthony Russo and Rene Russo were instinctively crafty to link the overly successful Iron Man film franchise to the **Captain America: Civil War** inner circle to ensure an even more treasured toxic atmosphere. Superhero fans will get a thrill of witnessing the extra add-ons concerning other dynamic titans to join the action-packed festivities involving Team Captain America versus Team Iron Man. True, **Civil War** has its share of flaws but that does not take away from this heroes-in-crisis flick demonstrating its ambitious overtones.\r\n\r\nSo what has caused the bad blood among the great and grand good guys known for protecting the world from evil dominance and destruction? Essentially the theme of collateral damage, the involvement regarding civilian-related deaths and injuries plus the world-wide backlash has created a controversy pitted against The Avengers. Specifically, Captain America (a.k.a. Steve Rogers) and Scarlet Witch/Wanda Maximoff (Elizabeth Olsen)  are responsible for the boisterous battle that caused such negative sensation resulting in political turmoil. Avengers head honcho Iron Man (a.k.a. Tony Stark) is dealing with his own personal regrets in the ill-advised creation of the unpredictable Ultron. The political authority want to hold Iron Man, second-in-command Captain America and the rest of the Avengers accountable for the global devastation that have taking its toll when trying to oversee the potential harm wreaking havoc on humanity.\r\n\r\nLeading the charge in putting a watchful eye on the labeled reckless Avengers is Secretary of State Thaddeus Ross (William Hurt) that suggests the super group be monitored by the United Nations. Naturally friction develops between the superheroes that either agree with Ross’s UN restriction policies or disagree with being placed under a microscope that threatens to handcuff their free-wheeling heroic duties. All these contrasting beliefs eventually turn into epic back-and-forth confrontations where the raging Avengers are at odds with each other.\r\n\r\nFor Stark/Iron Man’s stance, he is willing to toe the line and ultimately agree that his crew needs to tone down their tenacious tactics as crime-stoppers. Iron Man’s consciousness, particularly in the case of a disillusioned mother (Alfre Woodward) making him feel guilt-ridden over her son’s death during an intense Battle of Sokovia, is probably the main factor behind his decision to have his team reigned in a bit from the political watchdogs. Siding with Iron Man’s viewpoint are the likes of Black Widow (Scarlett Johansson), Vision (Paul Bettany) and War Machine (Don Cheadle). As for Rogers/Captain America, he is not too thrilled being put in check by the intrusive governmental pencil-pushers that want to scrutinize the team’s every move. Standing with Captain America firmly are Falcon (Anthony Mackie) and the aforementioned Scarlet Witch.\r\n\r\nOn top of Captain America’s current Avengers-oriented strife in his contentious mingling with Iron Man and his ardent backers, he now finds himself trying to defend his old buddy-turned-wanted man Winter Soldier (Sebastian Stan) who is accused of killing civilians. Iron Man believes in Winter Soldier’s innocence and goes so far as to help him escape. Yes…Winter Soldier does come with more baggage attached to him–mainly in the form of the menacing Zemo (Daniel Bruhl).\r\n\r\nThe Russos and screenwriters Christopher Marckus and Stephen McFeely (all attached to the previous “Captain America: Winter Soldier”) provide the eyeful visual effects that predictably stimulate and effectively add to the overload of frenzied frolicking in this boisterous blockbuster. Certainly the deepened angst among this bombastic bunch works far more solidly than what was displayed in the stiffened and problematic Batman v. Superman. The notion that the entire globe and its leaders are weary of all the collective chaos at the hands of the Avengers trying to save their hides is a bit ridiculous. Besides, why are not the foes of the Avengers put on the hot coals for the societal ruination? It seems rather counterproductive to chastise the noble superpowers offering the safety of mankind yet the detractors not being grateful for the services that the Avengers bring to the table. It is somewhat convoluted to think that the global community are sour on our heralded heroes or that the heat generated within the walls will completely destroy the Avengers and their colorful, capable colleagues.\r\n\r\nThe movie’s aptly entitled **Civil War** does invite more punch to the proceedings especially when a who’s who of superhero showstoppers join the feisty fray at hand. The noted inclusion of defiant do-gooders are packed with the likes of Spider-Man (Tom Holland), the retired returnee Hawkeye (Jeremy Renner), Ant-Man (Paul Rudd), and nifty newcomer Black Panther (Chadwick Boseman). No doubt Captain America: Civil War is the impish and energizing launch pad for upcoming Marvel-induced movies waiting to make their future distinctive arrival on the big screen. Although Evans’s steady and charismatic Captain America more than holds his own as the solo act billed in the film’s title one cannot overlook Downey’s compelling Iron Man as the reliable source that lifts the profile of Evans’s Masked Wonder. This is indeed a collaborative big score for the glorified costumed cast but special kudos are reserved for Stan’s killing culprit as well as Boseman’s African president assuming the slick and resourceful Black Panther.\r\n\r\nYeah, **Captain America: Civil War** is true to its frenetic form as revved up entertainment preparing moviegoers for the upcoming summertime sizzle at the box office. After all, the on-screen Marvel Comics gravy train keeps moving merrily along so stay tuned.\r\n\r\n**Captain America: Civil War (2016)**\r\n\r\nWalt Disney Pictures\r\n\r\n2 hrs 26 mins.\r\n\r\nStarring: Chris Evans, Robert Downey, Jr., Scarlett Johansson, Sebastian Stan, Anthony Mackie, Don Cheadle, Jeremy Renner, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Paul Rudd, Daniel Bruhl, Alfre Woodward, William Hurt\r\n\r\nDirected by: Anthony Russo and Joe Russo\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Superheroes Saga/Action and Adventure/Science Fiction/Fantasy\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)\r\n\r\n**(c) Frank Ochieng**",
            "url": "https://www.themoviedb.org/review/572d7bc1c3a3680fdb001d69"
         },
         {
            "author": "Austin Singleton",
            "id": "57acf05cc3a36820750001c8",
            "content": "The Russo Brother's and Marvel did it again! Read my full review here!\r\n\r\nhttp://www.hweird1reviews.com/allreviews/captain-america-civil-war-review",
            "url": "https://www.themoviedb.org/review/57acf05cc3a36820750001c8"
         },
         {
            "author": "Reno",
            "id": "57f40f319251417fe300171a",
            "content": "**The heroes're divided and so the fans!**\r\n\r\nBefore watching this I thought what the Avengers are doing here. I believed they got the title wrong. Once I watched it, I'm still the same. Because it did not look like the Captain America's film, he never was dominated, so calling it as his film totally inappropriate. Technically, it is a third Avengers film and well done. I liked it, it was entertaining. But the Civil War means it's nothing a nation's war within, just these super-guys fight for themselves against what kind of administration they want to come under.\r\n\r\nI think they have heard that people's complaint about blowing up the buildings during reviewing other films by bringing up this one. So they finger pointed those events in this narration and that is one of the reasons for the Civil War to take place. Particularly disturbing the public and loss of many lives when these powerful men fighting the bad guys. The fun part is they are off the street and had a most important confrontation of the film in a deserted airfield. So does it make people who were whining about that be happy?\r\n\r\nI don't know, but as an entertaining film, it did everything it can give the best for the viewers. Like the title and posters reveal, the heroes are divided here and probably you're going to take a side. Like usual, I'm with the Stark. So if you're like me, then you would feel the annoyance with the opposite team, particularly like Antman and obviously Captain America's rebellious decision. It was like the world versus United States, because only Americans are behind Captain America. Anyway, I did not like dividing the fans and what this film has been a serious damage. I hope the fans won't take it seriously.\r\n\r\n_8/10_",
            "url": "https://www.themoviedb.org/review/57f40f319251417fe300171a"
         },
         {
            "author": "Per Gunnar Jonsson",
            "id": "5895ee519251412e1600b62d",
            "content": "Recently I have quite liked the Marvel movies that I have watched. Sadly I did not like this movie at all. The only reason that it does not get a zero or one star rating is cool special effects and a few laughs.\r\n\r\nI want my heroes to be just that, heroes. Unfortunately this movie gets off on the wrong foot right away by not only “incriminating” the Avengers in the eyes of dimwit politicians and putting them on surveillance of a political body but to make matters worse it is the useless black hole of taxpayers money, the United Nations, that are supposed to surveil them. That pretty much ruined the movie right away for me.\r\n\r\nWhen I though that it could not get any worse it actually does. In true Hollywood fashion the Avengers start to bicker and fight among themselves.\r\n\r\nThe few redeeming qualities of this movie is great special effects and a few fun comments that made me laugh from time to time. Even the ending is pretty crappy with the Avengers remaining divided and the main bad guy feeling that he achieved what he wanted.\r\n\r\nTechnically there is not really anything wrong with the movie. The actors are good, the filming is good and, as I wrote, the special effects are great. The story however is not my cup of tea to put it mildly. I cannot express how much I despised the story in this movie.",
            "url": "https://www.themoviedb.org/review/5895ee519251412e1600b62d"
         },
         {
            "author": "ianlo930627",
            "id": "59ecf0f59251412a29001cca",
            "content": "Good movie, love Captain American.",
            "url": "https://www.themoviedb.org/review/59ecf0f59251412a29001cca"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Steve Rogers / Captain America",
               "gender": 2,
               "credit_id": "543ecb490e0a2667450001db",
               "name": "Chris Evans",
               "profile_path": "/8CgFKCZJVwZxa1F88n8drEux0vT.jpg",
               "id": 16828,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Tony Stark / Iron Man",
               "gender": 2,
               "credit_id": "543ecb5fc3a3684fe90001a9",
               "name": "Robert Downey Jr.",
               "profile_path": "/1YjdSym1jTG7xjHSI0yGGWEsw5i.jpg",
               "id": 3223,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Natasha Romanoff / Black Widow",
               "gender": 1,
               "credit_id": "54b95becc3a3686c6800520e",
               "name": "Scarlett Johansson",
               "profile_path": "/8EueDe6rPF0jQU4LSpsH2Rmrqac.jpg",
               "id": 1245,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Bucky Barnes / Winter Soldier",
               "gender": 2,
               "credit_id": "54b95c039251411d77004980",
               "name": "Sebastian Stan",
               "profile_path": "/8MOp9cazWpC4CrGLZnD11A6Dv8c.jpg",
               "id": 60898,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Sam Wilson / Falcon",
               "gender": 2,
               "credit_id": "54ce33afc3a3687f92005096",
               "name": "Anthony Mackie",
               "profile_path": "/5VGGJ0Co8SC94iiedWb2o3C36T.jpg",
               "id": 53650,
               "order": 4
            },
            {
               "cast_id": 27,
               "character": "James \"Rhodey\" Rhodes / War Machine",
               "gender": 2,
               "credit_id": "554ba7adc3a3685e630024fe",
               "name": "Don Cheadle",
               "profile_path": "/b1EVJWdFn7a75qVYJgwO87W2TJU.jpg",
               "id": 1896,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Clint Barton / Hawkeye",
               "gender": 2,
               "credit_id": "54fadad59251417b26001187",
               "name": "Jeremy Renner",
               "profile_path": "/l6CxIOFCjF65298teEJd5mCnPDO.jpg",
               "id": 17604,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "T'Challa / Black Panther",
               "gender": 2,
               "credit_id": "544fe6eec3a368023c0024b7",
               "name": "Chadwick Boseman",
               "profile_path": "/if0BTPOSkbnvIjry5OcfV7GfRrO.jpg",
               "id": 172069,
               "order": 7
            },
            {
               "cast_id": 26,
               "character": "Vision",
               "gender": 2,
               "credit_id": "554ba79cc3a3685e5800278d",
               "name": "Paul Bettany",
               "profile_path": "/1zmr8C7TCqsoCjDVKJycVp2wWyf.jpg",
               "id": 6162,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Wanda Maximoff / Scarlet Witch",
               "gender": 1,
               "credit_id": "553a2e6ac3a3684022001284",
               "name": "Elizabeth Olsen",
               "profile_path": "/8vgj3i5ByHUHP6p2jN2o5pcNbaL.jpg",
               "id": 550843,
               "order": 9
            },
            {
               "cast_id": 28,
               "character": "Scott Lang / Ant-Man",
               "gender": 2,
               "credit_id": "554ba7ed925141469c002586",
               "name": "Paul Rudd",
               "profile_path": "/8eTtJ7XVXY0BnEeUaSiTAraTIXd.jpg",
               "id": 22226,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Sharon Carter",
               "gender": 1,
               "credit_id": "554aff6a925141469c001048",
               "name": "Emily VanCamp",
               "profile_path": "/2nBBndedoyJvuDaUwZ1nNgip6Tn.jpg",
               "id": 84247,
               "order": 11
            },
            {
               "cast_id": 33,
               "character": "Peter Parker / Spider-Man",
               "gender": 2,
               "credit_id": "5589c2489251410dd4000308",
               "name": "Tom Holland",
               "profile_path": "/dO9FYcPPShhiYQ9D50Takd2W8xo.jpg",
               "id": 1136406,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Brock Rumlow / Crossbones",
               "gender": 2,
               "credit_id": "54c6739dc3a368792900aa24",
               "name": "Frank Grillo",
               "profile_path": "/7JNCBT6A7zEN3ZqRjFNiTXGISo6.jpg",
               "id": 81685,
               "order": 13
            },
            {
               "cast_id": 29,
               "character": "Thaddeus \"Thunderbolt\" Ross",
               "gender": 2,
               "credit_id": "554ba80ec3a3685e58002795",
               "name": "William Hurt",
               "profile_path": "/zp6UOht6c1iyHDbpYn1hkX103lG.jpg",
               "id": 227,
               "order": 14
            },
            {
               "cast_id": 12,
               "character": "Helmut Zemo",
               "gender": 2,
               "credit_id": "546b762d92514101ec001e4f",
               "name": "Daniel Brühl",
               "profile_path": "/ekMLRjJgRyYJUT8XwjHOZU9KYtU.jpg",
               "id": 3872,
               "order": 15
            },
            {
               "cast_id": 155,
               "character": "Howard Stark",
               "gender": 2,
               "credit_id": "5716b8289251413d30000b9d",
               "name": "John Slattery",
               "profile_path": "/53hxIYkC93E1FEkqOvAHRgRIxXX.jpg",
               "id": 21134,
               "order": 16
            },
            {
               "cast_id": 156,
               "character": "F.R.I.D.A.Y. (voice)",
               "gender": 1,
               "credit_id": "5716b8b69251414e7c000a29",
               "name": "Kerry Condon",
               "profile_path": "/iODZhVleWthSMNpCIl999hzy3B7.jpg",
               "id": 62105,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "Everett K. Ross",
               "gender": 2,
               "credit_id": "5549db4e9251413820000a90",
               "name": "Martin Freeman",
               "profile_path": "/ashlWz2KDQTbo8NPUbVOwcB3zXJ.jpg",
               "id": 7060,
               "order": 18
            },
            {
               "cast_id": 153,
               "character": "May Parker",
               "gender": 1,
               "credit_id": "570ddf48c3a3680a390015fc",
               "name": "Marisa Tomei",
               "profile_path": "/l87UKhZ1ethWmn8lksmLZ2LcQJ1.jpg",
               "id": 3141,
               "order": 19
            },
            {
               "cast_id": 154,
               "character": "T'Chaka",
               "gender": 2,
               "credit_id": "5716b7afc3a3686678012c97",
               "name": "John Kani",
               "profile_path": "/iOKWcdeCNbEREAWMWIZBy6p805j.jpg",
               "id": 51878,
               "order": 20
            },
            {
               "cast_id": 157,
               "character": "Maria Stark",
               "gender": 1,
               "credit_id": "5716b9a3c3a3685e54000a3e",
               "name": "Hope Davis",
               "profile_path": "/m1RBUwfxms0o4PAOaHYaGT0DpAj.jpg",
               "id": 15250,
               "order": 21
            },
            {
               "cast_id": 55,
               "character": "Vasily Karpov",
               "gender": 2,
               "credit_id": "56944483c3a3680ea80004ea",
               "name": "Gene Farber",
               "profile_path": "/hgkrTtK6ixHdX7G1v78mC5UaEmc.jpg",
               "id": 116969,
               "order": 22
            },
            {
               "cast_id": 56,
               "character": "Ayo",
               "gender": 1,
               "credit_id": "5694449c9251414b7200045b",
               "name": "Florence Kasumba",
               "profile_path": "/oLKR9435H3sjeCWWvD0rLGsL5t9.jpg",
               "id": 139900,
               "order": 23
            },
            {
               "cast_id": 151,
               "character": "Miriam Sharpe",
               "gender": 1,
               "credit_id": "570c14c5c3a36802b0000b56",
               "name": "Alfre Woodard",
               "profile_path": "/aCAjUOrV2WG3OaLUvQHVkyk8S2P.jpg",
               "id": 1981,
               "order": 24
            },
            {
               "cast_id": 152,
               "character": "Faculty member at M.I.T.",
               "gender": 2,
               "credit_id": "570c14d6c3a36802b9000acf",
               "name": "Jim Rash",
               "profile_path": "/cXat9HZ5ajQZsrAZ8xE4zIEVEcb.jpg",
               "id": 161932,
               "order": 25
            },
            {
               "cast_id": 35,
               "character": "FedEx deliveryman",
               "gender": 2,
               "credit_id": "565ae5a2925141691e001be1",
               "name": "Stan Lee",
               "profile_path": "/dTr2gJPL7jELKVkcjtoNx80uVKR.jpg",
               "id": 7624,
               "order": 26
            },
            {
               "cast_id": 227,
               "character": "Theo Broussard",
               "gender": 2,
               "credit_id": "58ce0e239251415a8b0177a7",
               "name": "Joe Russo",
               "profile_path": "/679Os4tbY1YsU01KdLhM1NPXNWu.jpg",
               "id": 19272,
               "order": 27
            },
            {
               "cast_id": 222,
               "character": "Crossbones' mercenary",
               "gender": 2,
               "credit_id": "58ce0d4f9251415a74017d55",
               "name": "Damion Poitier",
               "profile_path": "/zBoq4SAauhVmbHSyWZXYXvA36Ky.jpg",
               "id": 150194,
               "order": 28
            },
            {
               "cast_id": 163,
               "character": "MRI Tech",
               "gender": 0,
               "credit_id": "58ce06239251415a61017c4c",
               "name": "Michael A. Cook",
               "profile_path": "/rBqNliXPfqvnNyPZsCCcDrm5YgA.jpg",
               "id": 1502949,
               "order": 29
            },
            {
               "cast_id": 164,
               "character": "Vicar",
               "gender": 0,
               "credit_id": "58ce06319251415a7d01743a",
               "name": "Laughton Parchment",
               "profile_path": null,
               "id": 1779511,
               "order": 30
            },
            {
               "cast_id": 165,
               "character": "Josef / Super Soldier #1",
               "gender": 0,
               "credit_id": "58ce06469251415a8b016e59",
               "name": "Jackson Spidell",
               "profile_path": null,
               "id": 1779512,
               "order": 31
            },
            {
               "cast_id": 166,
               "character": "Super Soldier #2",
               "gender": 0,
               "credit_id": "58ce065c9251415a74017462",
               "name": "Yi Long",
               "profile_path": null,
               "id": 1779513,
               "order": 32
            },
            {
               "cast_id": 167,
               "character": "Super Soldier #3",
               "gender": 1,
               "credit_id": "58ce06b69251415a41016ead",
               "name": "Heidi Moneymaker",
               "profile_path": "/1ZMYFB93wZ45gUQ7yMEeVnvqkhr.jpg",
               "id": 1582803,
               "order": 33
            },
            {
               "cast_id": 168,
               "character": "Super Soldier #4",
               "gender": 2,
               "credit_id": "58ce06d59251415a74017534",
               "name": "Aaron Toney",
               "profile_path": "/mbiEv99WI2jRGH3VEK3EE8SpnDs.jpg",
               "id": 1566267,
               "order": 34
            },
            {
               "cast_id": 169,
               "character": "Super Soldier #5",
               "gender": 0,
               "credit_id": "58ce070b9251415a8b016f6f",
               "name": "Cale Schultz",
               "profile_path": "/fjbYJtD0Ci2k7ImRgcKpNBbiruM.jpg",
               "id": 1779514,
               "order": 35
            },
            {
               "cast_id": 170,
               "character": "Zemo's Wife (voice)",
               "gender": 0,
               "credit_id": "58ce0736c3a36850f30169d1",
               "name": "Ann Russo",
               "profile_path": "/dulOMjk4nCawoE4YidVYBjj75A0.jpg",
               "id": 1483700,
               "order": 36
            },
            {
               "cast_id": 171,
               "character": "Attaché",
               "gender": 2,
               "credit_id": "58ce07c7c3a368510e01650d",
               "name": "Cornell John",
               "profile_path": "/rl0EawwZcysnbKhoA4g99k8kLFf.jpg",
               "id": 25135,
               "order": 37
            },
            {
               "cast_id": 172,
               "character": "Man at Kiosk",
               "gender": 0,
               "credit_id": "58ce08229251415a3d017763",
               "name": "Sven Hönig",
               "profile_path": null,
               "id": 1327810,
               "order": 38
            },
            {
               "cast_id": 173,
               "character": "GSG9 Task Force Gunner",
               "gender": 0,
               "credit_id": "58ce08579251415a4501712c",
               "name": "Joshua Peck",
               "profile_path": null,
               "id": 1779516,
               "order": 39
            },
            {
               "cast_id": 174,
               "character": "GSG9 Task Force Pilot",
               "gender": 2,
               "credit_id": "58ce086f9251415a74017751",
               "name": "Brent McGee",
               "profile_path": "/jwObq47Z45cr3cMTlZLD1DRM8Bj.jpg",
               "id": 1480044,
               "order": 40
            },
            {
               "cast_id": 175,
               "character": "German Innkeeper",
               "gender": 0,
               "credit_id": "58ce08819251415a7d01775a",
               "name": "Be Satrazemis",
               "profile_path": null,
               "id": 1779517,
               "order": 41
            },
            {
               "cast_id": 176,
               "character": "Raft Guard",
               "gender": 2,
               "credit_id": "58ce08919251415a7d01776b",
               "name": "Blair Jasin",
               "profile_path": null,
               "id": 1003792,
               "order": 42
            },
            {
               "cast_id": 177,
               "character": "Barge Man #1",
               "gender": 0,
               "credit_id": "58ce092a9251415a45017254",
               "name": "Oli Bigalke",
               "profile_path": "/vebZCxPzoxfkk5vE7bZZgL438lM.jpg",
               "id": 1323073,
               "order": 43
            },
            {
               "cast_id": 178,
               "character": "Barge Man #2",
               "gender": 0,
               "credit_id": "58ce093e9251415a6101806d",
               "name": "Rafael Banasik",
               "profile_path": null,
               "id": 1779519,
               "order": 44
            },
            {
               "cast_id": 179,
               "character": "Custodian",
               "gender": 2,
               "credit_id": "58ce09849251415a3d01793a",
               "name": "David de Vries",
               "profile_path": "/5dhZVrTfNFpJZP5qvbiaaYrC7Z4.jpg",
               "id": 114634,
               "order": 45
            },
            {
               "cast_id": 180,
               "character": "Funeral Director",
               "gender": 0,
               "credit_id": "58ce0a449251415a8b017360",
               "name": "John Curran",
               "profile_path": null,
               "id": 1779520,
               "order": 46
            },
            {
               "cast_id": 181,
               "character": "Woman in Lobby #1",
               "gender": 0,
               "credit_id": "58ce0a56c3a36850d701620c",
               "name": "Katie Amess",
               "profile_path": null,
               "id": 1779521,
               "order": 47
            },
            {
               "cast_id": 182,
               "character": "Woman in Lobby #2",
               "gender": 0,
               "credit_id": "58ce0a669251415a39016f3c",
               "name": "Austin Sanders",
               "profile_path": null,
               "id": 1779522,
               "order": 48
            },
            {
               "cast_id": 183,
               "character": "Delivery Truck Driver",
               "gender": 0,
               "credit_id": "58ce0a8a9251415a740179e2",
               "name": "Brett Gentile",
               "profile_path": "/94LLu0rSZoCbvtZdk5179sxr2K5.jpg",
               "id": 209125,
               "order": 49
            },
            {
               "cast_id": 184,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0a9f9251415a4101734a",
               "name": "Matthew Anderson",
               "profile_path": null,
               "id": 1779523,
               "order": 50
            },
            {
               "cast_id": 185,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0aaac3a36850c00147b0",
               "name": "Andrew Botchwey",
               "profile_path": null,
               "id": 1779524,
               "order": 51
            },
            {
               "cast_id": 186,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0ab39251415a450173fa",
               "name": "Chase Bradfield",
               "profile_path": null,
               "id": 1779525,
               "order": 52
            },
            {
               "cast_id": 187,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0ac9c3a36850fb016945",
               "name": "Ernest Charles",
               "profile_path": null,
               "id": 1779526,
               "order": 53
            },
            {
               "cast_id": 188,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0ad8c3a36850f3016e1f",
               "name": "Hendricks Coates",
               "profile_path": null,
               "id": 1779527,
               "order": 54
            },
            {
               "cast_id": 189,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0ae09251415a39016fa7",
               "name": "Ethan Condon",
               "profile_path": null,
               "id": 1779528,
               "order": 55
            },
            {
               "cast_id": 190,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0ae8c3a368508c016e86",
               "name": "Shen Dynes",
               "profile_path": null,
               "id": 1779529,
               "order": 56
            },
            {
               "cast_id": 191,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0af09251415a8b017421",
               "name": "Nathaniel Ellis",
               "profile_path": null,
               "id": 1779530,
               "order": 57
            },
            {
               "cast_id": 192,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0af8c3a36850e9016209",
               "name": "Jariah Ferguson",
               "profile_path": null,
               "id": 1779531,
               "order": 58
            },
            {
               "cast_id": 193,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b06c3a36851040166c9",
               "name": "Evan Ffrench",
               "profile_path": null,
               "id": 1779532,
               "order": 59
            },
            {
               "cast_id": 194,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b119251415a8b017447",
               "name": "Justin Freeman",
               "profile_path": null,
               "id": 1779533,
               "order": 60
            },
            {
               "cast_id": 195,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b239251415a61018269",
               "name": "Ralphael Grand'Pierre",
               "profile_path": null,
               "id": 1779534,
               "order": 61
            },
            {
               "cast_id": 196,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b2b9251415a7d017a98",
               "name": "Julian Grimes",
               "profile_path": null,
               "id": 1779535,
               "order": 62
            },
            {
               "cast_id": 197,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b32c3a36850f3016e82",
               "name": "Aaron Hayes",
               "profile_path": null,
               "id": 1779536,
               "order": 63
            },
            {
               "cast_id": 198,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b39c3a36850c0014848",
               "name": "Austin Hooper",
               "profile_path": null,
               "id": 1779537,
               "order": 64
            },
            {
               "cast_id": 199,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b40c3a3685104016715",
               "name": "Amiri Jones",
               "profile_path": null,
               "id": 1779538,
               "order": 65
            },
            {
               "cast_id": 200,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b48c3a36850fb0169ce",
               "name": "Myles Joseph",
               "profile_path": null,
               "id": 1779539,
               "order": 66
            },
            {
               "cast_id": 201,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b5bc3a3685104016735",
               "name": "Stephen Lewis",
               "profile_path": null,
               "id": 1779540,
               "order": 67
            },
            {
               "cast_id": 202,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b63c3a3685104016740",
               "name": "Jacob Ludwick",
               "profile_path": null,
               "id": 1779541,
               "order": 68
            },
            {
               "cast_id": 203,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b71c3a36850c0014886",
               "name": "D'Mahrei McRae",
               "profile_path": null,
               "id": 1779542,
               "order": 69
            },
            {
               "cast_id": 204,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b7a9251415a74017b09",
               "name": "Ashwin Mudaliar",
               "profile_path": null,
               "id": 1779543,
               "order": 70
            },
            {
               "cast_id": 205,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b81c3a368508c016f44",
               "name": "Eli Ollinger",
               "profile_path": null,
               "id": 1779544,
               "order": 71
            },
            {
               "cast_id": 206,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b899251415a74017b22",
               "name": "Parker Pape",
               "profile_path": null,
               "id": 1779545,
               "order": 72
            },
            {
               "cast_id": 207,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b91c3a36850c00148c1",
               "name": "Daniel Parada",
               "profile_path": null,
               "id": 1779546,
               "order": 73
            },
            {
               "cast_id": 208,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0b989251415a8b0174e6",
               "name": "Jonah Ruffin",
               "profile_path": null,
               "id": 1779547,
               "order": 74
            },
            {
               "cast_id": 209,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0ba09251415a8b0174f7",
               "name": "Darryl Sampson",
               "profile_path": null,
               "id": 1779548,
               "order": 75
            },
            {
               "cast_id": 210,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0ba79251415a74017b54",
               "name": "Cameron Sardone",
               "profile_path": null,
               "id": 1779549,
               "order": 76
            },
            {
               "cast_id": 211,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0bb19251415a3d017b7d",
               "name": "Stanley Sellers",
               "profile_path": null,
               "id": 1779550,
               "order": 77
            },
            {
               "cast_id": 212,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0bba9251415a8b01751b",
               "name": "Miles Selles",
               "profile_path": null,
               "id": 1779551,
               "order": 78
            },
            {
               "cast_id": 213,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0bc09251415a45017519",
               "name": "Jacob Sung",
               "profile_path": null,
               "id": 1779552,
               "order": 79
            },
            {
               "cast_id": 214,
               "character": "Choir",
               "gender": 0,
               "credit_id": "58ce0bca9251415a410174a7",
               "name": "Caden Wilkinson",
               "profile_path": null,
               "id": 1779554,
               "order": 80
            },
            {
               "cast_id": 215,
               "character": "Chinese Newscaster",
               "gender": 0,
               "credit_id": "58ce0be49251415a3d017bba",
               "name": "Kim Scar",
               "profile_path": null,
               "id": 1779557,
               "order": 81
            },
            {
               "cast_id": 216,
               "character": "German Newscaster #1",
               "gender": 0,
               "credit_id": "58ce0cab9251415a61018441",
               "name": "Jessica Walther-Gabory",
               "profile_path": null,
               "id": 1779562,
               "order": 82
            },
            {
               "cast_id": 217,
               "character": "German Newscaster #2",
               "gender": 0,
               "credit_id": "58ce0cb49251415a74017c8c",
               "name": "Beniamino Brogi",
               "profile_path": null,
               "id": 1779563,
               "order": 83
            },
            {
               "cast_id": 218,
               "character": "News Reporter",
               "gender": 0,
               "credit_id": "58ce0ce3c3a36851040168ff",
               "name": "Silvina Buchbauer",
               "profile_path": null,
               "id": 570756,
               "order": 84
            },
            {
               "cast_id": 219,
               "character": "Busboy (Lagos)",
               "gender": 0,
               "credit_id": "58ce0cf4c3a36850e9016437",
               "name": "Henry Amadi",
               "profile_path": null,
               "id": 1779564,
               "order": 85
            },
            {
               "cast_id": 220,
               "character": "Waiter (Lagos)",
               "gender": 0,
               "credit_id": "58ce0d0b9251415a41017618",
               "name": "Ugochukwu Ani",
               "profile_path": null,
               "id": 1779565,
               "order": 86
            },
            {
               "cast_id": 221,
               "character": "Secretary Ross's Aide",
               "gender": 2,
               "credit_id": "58ce0d1cc3a3685104016943",
               "name": "Michael Anthony Rogers",
               "profile_path": null,
               "id": 1779567,
               "order": 87
            },
            {
               "cast_id": 223,
               "character": "Hero Merc #2",
               "gender": 0,
               "credit_id": "58ce0d6e9251415a3901726a",
               "name": "Umar Khan",
               "profile_path": "/UhLT8FT6geFCiH63U8YAP9B4c7.jpg",
               "id": 1375186,
               "order": 88
            },
            {
               "cast_id": 224,
               "character": "Hero Merc #3",
               "gender": 0,
               "credit_id": "58ce0db59251415a410176d9",
               "name": "David Brown",
               "profile_path": null,
               "id": 1779569,
               "order": 89
            },
            {
               "cast_id": 225,
               "character": "Hero Merc #4",
               "gender": 0,
               "credit_id": "58ce0de2c3a36850f301719b",
               "name": "Guy Fernandez",
               "profile_path": null,
               "id": 1569801,
               "order": 90
            },
            {
               "cast_id": 226,
               "character": "Teenage Girl",
               "gender": 0,
               "credit_id": "58ce0df3c3a3685104016a20",
               "name": "Sophia Russo",
               "profile_path": null,
               "id": 1779570,
               "order": 91
            },
            {
               "cast_id": 158,
               "character": "UN Staffer Gibson",
               "gender": 0,
               "credit_id": "5716bbbf925141695b000810",
               "name": "Amelia Morck",
               "profile_path": "/w9RwUkyFV8aZ2QcqILeIdsJlqKx.jpg",
               "id": 232256,
               "order": 92
            },
            {
               "cast_id": 159,
               "character": "Stark's Assistant",
               "gender": 1,
               "credit_id": "5716bbdec3a3685378017b87",
               "name": "Julianna Guill",
               "profile_path": "/myHcPhxZcDk9yCL2F2yafQudMih.jpg",
               "id": 78430,
               "order": 93
            },
            {
               "cast_id": 228,
               "character": "Nurse",
               "gender": 0,
               "credit_id": "58ce0ec79251415a390173f2",
               "name": "Surely Alvelo",
               "profile_path": "/cKQuUXjSRZyHnxcoZktEjv138EJ.jpg",
               "id": 1731337,
               "order": 94
            },
            {
               "cast_id": 229,
               "character": "Cultural Attaché",
               "gender": 0,
               "credit_id": "58ce0ef39251415a61018736",
               "name": "Brian Schaeffer",
               "profile_path": null,
               "id": 1265796,
               "order": 95
            },
            {
               "cast_id": 230,
               "character": "Helicopter Pilot",
               "gender": 0,
               "credit_id": "58ce0f1b9251415a450178d7",
               "name": "Kevin LaRosa Jr.",
               "profile_path": null,
               "id": 1779572,
               "order": 96
            },
            {
               "cast_id": 231,
               "character": "Helicopter Pilot",
               "gender": 0,
               "credit_id": "58ce0f2fc3a368510e016db8",
               "name": "Al Cerullo",
               "profile_path": "/szDkSiUOtHf9xEf0ZIIl30KoQTo.jpg",
               "id": 91042,
               "order": 97
            },
            {
               "cast_id": 232,
               "character": "Helicopter Pilot",
               "gender": 0,
               "credit_id": "58ce0f459251415a74017f85",
               "name": "Frédéric North",
               "profile_path": null,
               "id": 1738113,
               "order": 98
            },
            {
               "cast_id": 30,
               "character": "Auctioneer (uncredited)",
               "gender": 0,
               "credit_id": "554be7cec3a3685e58002f3e",
               "name": "Ray Sahetapy",
               "profile_path": "/nqKNGkVUltpsOnGejWLSpqhvd4N.jpg",
               "id": 592495,
               "order": 99
            },
            {
               "cast_id": 235,
               "character": "Barge Man #1",
               "gender": 2,
               "credit_id": "5a233eeb0e0a264cbe0bbd86",
               "name": "Oliver Bigalke",
               "profile_path": "/m0iPewlPX5C8HOC9o514VMGDEyh.jpg",
               "id": 1524919,
               "order": 100
            },
            {
               "cast_id": 236,
               "character": "IFID (uncredited)",
               "gender": 0,
               "credit_id": "5a233eec92514103300b9382",
               "name": "Chris Jai Alex",
               "profile_path": "/8eY0xDVxrIIDZBKknvKQrPYcsih.jpg",
               "id": 1103625,
               "order": 101
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "537d792c0e0a2624c0001210",
               "name": "Anthony Russo",
               "profile_path": "/fIa5wXK7MHAquhefTr3TcnZiYy8.jpg",
               "id": 19271,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "537d793e0e0a2624bd001166",
               "name": "Joe Russo",
               "profile_path": "/679Os4tbY1YsU01KdLhM1NPXNWu.jpg",
               "id": 19272,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "537d79700e0a2624bd00116d",
               "name": "Christopher Markus",
               "profile_path": "/tyeKi52yruPdxOkEMKhBKCnkp5V.jpg",
               "id": 5551,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "537d79820e0a2624b400118a",
               "name": "Stephen McFeely",
               "profile_path": "/fa8DAGpANcBTTXO4bbNMrCFufmV.jpg",
               "id": 5552,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "537d79eb0e0a2624b700118b",
               "name": "Kevin Feige",
               "profile_path": "/AewbqQQT0FbcE358rcbopZ3zgDV.jpg",
               "id": 10850,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "569442269251414b780003a5",
               "name": "Joe Simon",
               "profile_path": "/AUjHsfoq7y6bGYYUoqDn8JWsKS.jpg",
               "id": 18996,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "569442309251414b640003c4",
               "name": "Jack Kirby",
               "profile_path": "/xLVSa7mX1BCyVoKD2wyRGEQXj8M.jpg",
               "id": 18866,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "5694427ac3a3680eb0000454",
               "name": "Jeffrey Ford",
               "profile_path": "/jcnSoKsJj7131oScRDmg8HMhK77.jpg",
               "id": 35176,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "550f0042c3a3681db2009b56",
               "name": "Henry Jackman",
               "profile_path": "/wJYFGHG5Vsh8cbiyiS8zpO2SMHb.jpg",
               "id": 227440,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "550f0061c3a3683dd6002cb0",
               "name": "Alan Fine",
               "profile_path": "/7Ntt3WWg25ivLT8Os3LeZW1WxIC.jpg",
               "id": 113672,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "550f006e92514164ac000de0",
               "name": "Lars P. Winther",
               "profile_path": "/dlTTK8caYVYU1B7SlGdTwI03vsG.jpg",
               "id": 1349452,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "550f008092514107010030fc",
               "name": "Mitchell Bell",
               "profile_path": "/4DXk3sVS1bYHekZfekQrBbvntE9.jpg",
               "id": 1117747,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "566c5c6292514173ff00ce47",
               "name": "Mark Millar",
               "profile_path": "/a7yrmhp9msWEu5LIjCSSCSpm1YJ.jpg",
               "id": 87172,
               "department": "Writing",
               "job": "Comic Book"
            },
            {
               "gender": 0,
               "credit_id": "5694425fc3a3680ea800044d",
               "name": "Trent Opaloch",
               "profile_path": null,
               "id": 967026,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56944292c3a3680ea300041a",
               "name": "Louis D'Esposito",
               "profile_path": "/pNvtXPy8kil9WWFtySahnNbvc3R.jpg",
               "id": 57027,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5694429d9251414b6e000410",
               "name": "Stan Lee",
               "profile_path": "/dTr2gJPL7jELKVkcjtoNx80uVKR.jpg",
               "id": 7624,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "569442bfc3a3680e9f00039e",
               "name": "Nate Moore",
               "profile_path": "/y6aSGvSXO4ZUyTMx04DXOXddJeg.jpg",
               "id": 1067682,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "569442d89251414b6e000427",
               "name": "Henning Molfenter",
               "profile_path": null,
               "id": 10903,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "569442f1c3a3680e9d0003b1",
               "name": "Christoph Fisser",
               "profile_path": null,
               "id": 1089142,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "569443159251414b720003de",
               "name": "Charlie Woebcken",
               "profile_path": null,
               "id": 10905,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 1,
               "credit_id": "5694433d9251414b720003f9",
               "name": "Patricia Whitcher",
               "profile_path": null,
               "id": 8703,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5694435e9251414b64000416",
               "name": "Victoria Alonso",
               "profile_path": "/xF7Qe1tqgk9KtY8kThKHBWhMqxc.jpg",
               "id": 113674,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "569443729251414b7200040d",
               "name": "Sarah Finn",
               "profile_path": null,
               "id": 7232,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5694438e9251414b6b0003c1",
               "name": "Owen Paterson",
               "profile_path": null,
               "id": 9343,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "569443c1c3a3680eb00004b6",
               "name": "Judianna Makovsky",
               "profile_path": "/fdRHxR0k3b95mY8p3VOzFTFN2p9.jpg",
               "id": 10970,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "569443d59251414b67000428",
               "name": "Ronald R. Reiss",
               "profile_path": null,
               "id": 2529,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "569443e3c3a3680e9f0003ef",
               "name": "Gregory S. Hooper",
               "profile_path": null,
               "id": 1172441,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56e547fac3a3685aa800646f",
               "name": "Greg Berry",
               "profile_path": null,
               "id": 936841,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 1,
               "credit_id": "56e5486bc3a3685aa400654f",
               "name": "Theresa Greene",
               "profile_path": null,
               "id": 1389129,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56e548e792514109d80050dd",
               "name": "Andres Cubillan",
               "profile_path": null,
               "id": 1530686,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "56e548f892514109d80050e0",
               "name": "Matthew Gatlin",
               "profile_path": null,
               "id": 1340093,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "56e54909c3a3685a9000707e",
               "name": "Jim Wallis",
               "profile_path": null,
               "id": 1393435,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "56e5491d92514103c5002f59",
               "name": "Michael Fissneider",
               "profile_path": null,
               "id": 1338964,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "56e5493c9251411fef00229a",
               "name": "Stacey S. McIntosh",
               "profile_path": null,
               "id": 1378162,
               "department": "Art",
               "job": "Construction Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56e549bf9251416d46006587",
               "name": "Russell Bobbitt",
               "profile_path": "/5KW97eHDacxWlBkhtyasBUETJcR.jpg",
               "id": 1004624,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 2,
               "credit_id": "56e549d59251413269003e1a",
               "name": "Eckart Friz",
               "profile_path": "/ofrfVjnN90iWX2cuujMSXx41sr0.jpg",
               "id": 1590390,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 1,
               "credit_id": "56e54a079251413269003e22",
               "name": "Tara Feldstein",
               "profile_path": "/8Mtv58QeYereQ7OgkNjTxJDRrXg.jpg",
               "id": 1345611,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "56e54a1b92514115ec003e37",
               "name": "Chase Paris",
               "profile_path": null,
               "id": 1345610,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "56e54a2dc3a3685a92006841",
               "name": "Jason B. Stamey",
               "profile_path": null,
               "id": 1543191,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "56e54a5c92514115ec003e45",
               "name": "Hayden Bilson",
               "profile_path": null,
               "id": 1590391,
               "department": "Crew",
               "job": "Armorer"
            },
            {
               "gender": 0,
               "credit_id": "56e54aa1c3a3685a900070b4",
               "name": "Ron Licari",
               "profile_path": null,
               "id": 1543230,
               "department": "Crew",
               "job": "Armorer"
            },
            {
               "gender": 0,
               "credit_id": "56e54ab7c3a3685a9e006aa8",
               "name": "Larry Zanoff",
               "profile_path": null,
               "id": 1530726,
               "department": "Crew",
               "job": "Armorer"
            },
            {
               "gender": 0,
               "credit_id": "56e54b1dc3a3685a92006865",
               "name": "Joel Thingvall",
               "profile_path": null,
               "id": 1342054,
               "department": "Production",
               "job": "Researcher"
            },
            {
               "gender": 0,
               "credit_id": "56e54bcbc3a3685a9a006583",
               "name": "Daniel Pinder",
               "profile_path": null,
               "id": 1400088,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 2,
               "credit_id": "56e54bf69251416d40006c36",
               "name": "Dave Jordan",
               "profile_path": null,
               "id": 24192,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e54c43c3a3685a92006886",
               "name": "Nick Scarano",
               "profile_path": null,
               "id": 1319825,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e54c7ec3a3685a9a006599",
               "name": "Pablo Borges",
               "profile_path": null,
               "id": 1533084,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "56e54c92c3a3685a96006f93",
               "name": "Michael Crow",
               "profile_path": null,
               "id": 1590392,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 2,
               "credit_id": "56e54ca5c3a3685a90007105",
               "name": "Lisa Tomczeszyn",
               "profile_path": null,
               "id": 11106,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "56e54cc7c3a3685aa40065e1",
               "name": "Chris Allegro",
               "profile_path": null,
               "id": 1590393,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "56e54cdd9251413269003e85",
               "name": "Valentina Aulisi",
               "profile_path": null,
               "id": 1399320,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "56e54cffc3a3685aa800654c",
               "name": "David Butler",
               "profile_path": null,
               "id": 1417839,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "56e54d13c3a3685a920068b1",
               "name": "Steven Butler",
               "profile_path": null,
               "id": 1590394,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "56e54d2e9251416d40006c63",
               "name": "Dustin Fletcher",
               "profile_path": null,
               "id": 1477793,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 2,
               "credit_id": "56e54dabc3a3685a9a0065c5",
               "name": "Maurice K. McGuire",
               "profile_path": null,
               "id": 1378241,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e54dc4c3a3685aa4006607",
               "name": "Onofrio Nino Pansini",
               "profile_path": null,
               "id": 1439104,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e54dd8c3a3685aa4006609",
               "name": "Jörg Widmer",
               "profile_path": null,
               "id": 40766,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e54df392514109d800517c",
               "name": "Charles Schner",
               "profile_path": null,
               "id": 239788,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 2,
               "credit_id": "56e54e0492514115ec003ec8",
               "name": "Michael J. Walker",
               "profile_path": null,
               "id": 1411271,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e54e16c3a3685aa0006b0a",
               "name": "Eric Laudadio",
               "profile_path": null,
               "id": 1567950,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e54e2b92514103c5002feb",
               "name": "Jeremy Braben",
               "profile_path": null,
               "id": 1400092,
               "department": "Camera",
               "job": "Helicopter Camera"
            },
            {
               "gender": 2,
               "credit_id": "56e54e3fc3a3685a90007134",
               "name": "David B. Nowell",
               "profile_path": null,
               "id": 1403415,
               "department": "Camera",
               "job": "Helicopter Camera"
            },
            {
               "gender": 2,
               "credit_id": "56e54e6192514103c5002ff2",
               "name": "Mark Goellnicht",
               "profile_path": null,
               "id": 1494210,
               "department": "Camera",
               "job": "Steadicam Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e54e829251416525002502",
               "name": "Zade Rosenthal",
               "profile_path": null,
               "id": 1400082,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 2,
               "credit_id": "56e54eb79251416d40006c90",
               "name": "James Whitaker",
               "profile_path": null,
               "id": 19002,
               "department": "Crew",
               "job": "Second Unit Cinematographer"
            },
            {
               "gender": 0,
               "credit_id": "56e54ee392514103c500300b",
               "name": "Jeff Murrell",
               "profile_path": null,
               "id": 1204332,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "56e54efac3a3685aa800657c",
               "name": "Albrecht Silberberger",
               "profile_path": null,
               "id": 40778,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "56e54f10c3a3685aa800657f",
               "name": "Joshua Davis",
               "profile_path": null,
               "id": 1392943,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "56e54f3292514115ec003efd",
               "name": "Mike Pearce",
               "profile_path": null,
               "id": 1590395,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "56e54f5392514109d800519b",
               "name": "Patrick Loungway",
               "profile_path": null,
               "id": 12575,
               "department": "Crew",
               "job": "Second Unit Cinematographer"
            },
            {
               "gender": 0,
               "credit_id": "56e54f8fc3a3685a9a00660b",
               "name": "Peter Hawkins",
               "profile_path": null,
               "id": 189241,
               "department": "Camera",
               "job": "Additional Camera"
            },
            {
               "gender": 1,
               "credit_id": "56e54fd89251413269003ee1",
               "name": "Camille Friend",
               "profile_path": "/oqRHAueWWqslWfVHRGQAjEd8vTI.jpg",
               "id": 1424894,
               "department": "Costume & Make-Up",
               "job": "Hair Department Head"
            },
            {
               "gender": 1,
               "credit_id": "56e55004c3a3685a92006904",
               "name": "Cydney Cornell",
               "profile_path": null,
               "id": 1444908,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56e5501ac3a3685a9e006b61",
               "name": "Jeri Baker",
               "profile_path": null,
               "id": 1442097,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56e5505f9251416d40006ccc",
               "name": "Robert Wilson",
               "profile_path": null,
               "id": 1548530,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56e55091c3a3685aa0006b58",
               "name": "Fawn Ortega",
               "profile_path": null,
               "id": 1590400,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56e550ae9251416d40006cdb",
               "name": "Laura Dandridge",
               "profile_path": null,
               "id": 1590401,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56e550c29251413269003efa",
               "name": "Allan A. Apone",
               "profile_path": null,
               "id": 102343,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 1,
               "credit_id": "56e550db925141652500255b",
               "name": "Deborah La Mia Denaver",
               "profile_path": null,
               "id": 23787,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56e55143c3a3685a9e006b9b",
               "name": "Ryan J. Frias",
               "profile_path": null,
               "id": 1590402,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e5515b92514109d80051cc",
               "name": "Stuart McCowan",
               "profile_path": null,
               "id": 1445834,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e551869251413269003f1a",
               "name": "Randall L. Johnson",
               "profile_path": null,
               "id": 1364411,
               "department": "Sound",
               "job": "Boom Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e551a2c3a3685aa0006b7d",
               "name": "Etienne Haug",
               "profile_path": null,
               "id": 1590403,
               "department": "Sound",
               "job": "Boom Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e551b592514103c500308c",
               "name": "Malo Thouément",
               "profile_path": null,
               "id": 1590404,
               "department": "Sound",
               "job": "Boom Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e551cac3a3685aa0006b88",
               "name": "Shelley Roden",
               "profile_path": null,
               "id": 80827,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "56e551e59251416525002589",
               "name": "Shannon Mills",
               "profile_path": null,
               "id": 8159,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "56e551fe925141652500258e",
               "name": "Jeremy Bowker",
               "profile_path": null,
               "id": 1394418,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 2,
               "credit_id": "56e5521d92514115ec003f7b",
               "name": "Tom Johnson",
               "profile_path": null,
               "id": 3996,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "56e552339251416525002597",
               "name": "Juan Peralta",
               "profile_path": null,
               "id": 8166,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "56e5524d925141652500259d",
               "name": "Shannon Mills",
               "profile_path": null,
               "id": 8159,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e552649251416d460066ca",
               "name": "Daniel Laurie",
               "profile_path": null,
               "id": 16344,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e552f092514115ec003fa7",
               "name": "Pimentel A. Raphael",
               "profile_path": null,
               "id": 1409237,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e5530892514103c50030b9",
               "name": "Simone Kraus Townsend",
               "profile_path": null,
               "id": 1590405,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e553369251411fef0023fc",
               "name": "David Marsh",
               "profile_path": null,
               "id": 1590406,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e5534ec3a3685a9e006c00",
               "name": "Pavel Pranevsky",
               "profile_path": null,
               "id": 1408352,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e553eb9251416d46006707",
               "name": "Gerd Nefzer",
               "profile_path": null,
               "id": 1530231,
               "department": "Crew",
               "job": "Special Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56e5542ac3a3685a90007214",
               "name": "Carlo Perez",
               "profile_path": null,
               "id": 1590407,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e55449c3a3685aa40066f4",
               "name": "Daniel Sudick",
               "profile_path": null,
               "id": 15356,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e55486c3a3685aa8006665",
               "name": "Matthew Lloyd",
               "profile_path": null,
               "id": 1590408,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56e554b0c3a3685a960070d1",
               "name": "Sean McGrath",
               "profile_path": null,
               "id": 1338241,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56e554c9c3a3685a920069ca",
               "name": "Jennifer Mizener",
               "profile_path": null,
               "id": 1403408,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56e554ed9251416d40006d8c",
               "name": "Brittany Montero",
               "profile_path": null,
               "id": 1543227,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56e55538c3a3685a9e006c4b",
               "name": "Adam Pere",
               "profile_path": null,
               "id": 1590409,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56e5555592514115ec003ff2",
               "name": "Cole Darby",
               "profile_path": null,
               "id": 1580858,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56e5556cc3a3685a960070f1",
               "name": "Samuel Perkins",
               "profile_path": null,
               "id": 1590410,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e5558ac3a3685a9e006c58",
               "name": "Jen Underdahl",
               "profile_path": null,
               "id": 1590411,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "56e555acc3a3685a9a0066e6",
               "name": "Huseyin Caner",
               "profile_path": null,
               "id": 1590412,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e555c79251416d4600673b",
               "name": "Dan Deleeuw",
               "profile_path": null,
               "id": 1590413,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "56e555e0c3a3685aa4006734",
               "name": "Jamie Hallett",
               "profile_path": null,
               "id": 1472788,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e555f9c3a3685a90007258",
               "name": "Russell Earl",
               "profile_path": null,
               "id": 1379990,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e55616c3a3685a9000725e",
               "name": "Vincent Cirelli",
               "profile_path": null,
               "id": 1327027,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e5563bc3a3685a9600710c",
               "name": "James Andrykowski",
               "profile_path": null,
               "id": 1548461,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e55652c3a3685a9e006c81",
               "name": "Cassie Dixon",
               "profile_path": null,
               "id": 1590414,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e55678c3a3685a96007118",
               "name": "Christos Voutsinas",
               "profile_path": null,
               "id": 1590415,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e556ce92514115ec00401d",
               "name": "Lisa Fiorito",
               "profile_path": null,
               "id": 1590416,
               "department": "Production",
               "job": "Researcher"
            },
            {
               "gender": 2,
               "credit_id": "57c4541c9251416b61004b36",
               "name": "Joe Russo",
               "profile_path": "/679Os4tbY1YsU01KdLhM1NPXNWu.jpg",
               "id": 19272,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "57d2d9aec3a3684281000b42",
               "name": "Scheryl W Brown",
               "profile_path": "/Aqxl93JmTMqhxVmo7q3QTyxRxkG.jpg",
               "id": 1676849,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 1,
               "credit_id": "57d58d7c92514112ec0014f4",
               "name": "Stefanie Bruhn",
               "profile_path": null,
               "id": 18714,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "59551047c3a36813880534d6",
               "name": "Wendy M. Craig",
               "profile_path": null,
               "id": 1327146,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "5ac41548c3a3682d1a03e740",
               "name": "Daniel Hargrave",
               "profile_path": "/iLjQxDKgMP3Ou8T59800KSyyt0v.jpg",
               "id": 1825883,
               "department": "Crew",
               "job": "Utility Stunts"
            },
            {
               "gender": 2,
               "credit_id": "5ac415529251412712040b16",
               "name": "Daniel Hargrave",
               "profile_path": "/iLjQxDKgMP3Ou8T59800KSyyt0v.jpg",
               "id": 1825883,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 63.25977,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 271110,
      "vote_count": 9443,
      "budget": 240000000,
      "overview": "Following the events of Age of Ultron, the collective governments of the world pass an act designed to regulate all superhuman activity. This polarizes opinion amongst the Avengers, causing two factions to side with Iron Man or Captain America, which causes an epic battle between former allies.",
      "similar": [
         1452,
         155,
         1924,
         141052,
         8536,
         9531,
         379291,
         13640,
         49026,
         272,
         99861,
         24428,
         49521,
         209112,
         299534,
         297762,
         30061,
         382322,
         287947,
         251519
      ],
      "original_title": "Captain America: Civil War",
      "runtime": 147,
      "poster_path": "/kSBXou5Ac7vEqKd97wotJumyJvU.jpg",
      "spoken_languages": [
         {
            "name": "Română",
            "iso_639_1": "ro"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [{
         "logo_path": "/hUzeosd33nzE5MCNsZxCGEKTXaQ.png",
         "name": "Marvel Studios",
         "id": 420,
         "origin_country": "US"
      }],
      "release_date": "2016-04-27",
      "vote_average": 7.2,
      "belongs_to_collection": {
         "backdrop_path": "/nZSYqitBkAvmoq5IrsGsSWuhSC8.jpg",
         "name": "Captain America Collection",
         "id": 131295,
         "poster_path": "/2tOgiY533JSFp7OrVlkeRJvsZpI.jpg"
      },
      "tagline": "Divided We Fall",
      "adult": false,
      "homepage": "http://marvel.com/captainamericapremiere",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Anthony Russo",
         "Joe Russo"
      ],
      "runtime": 147,
      "synopsis": "In 1991, Bucky Barnes (Sebastian Stan), brainwashed to be the Winter Soldier, causes a car to crash and recovers bags of a serum that turns people into super soldiers. After the Avengers defeated Ultron, Thor and Hulk are nowhere to be found. Hawkeye (Jeremy Renner) has gone home to spend time with his family. Even Iron Man (Robert Downey Jr.) has apparently disengaged. Captain America (Chris Evans) and Black Widow (Scarlett Johansson) are leading a new team of Avengers, consisting of Scarlet Witch (Elizabeth Olsen), Vision (Paul Bettany), War Machine (Don Cheadle) and Falcon (Anthony Mackie). But the world hasn't forgotten the numerous civilian casualties that resulted from the Avengers' previous missions. In Lagos, Nigeria, the team is tracking the movements of Brock Rumlow (Frank Grillo), a Hydra agent who had infiltrated S.H.I.E.L.D. until Captain America exposed him. Brock was on one of the three ships that Cap had caused to fire on each other, and he managed to survive the resulting crash, but he was badly burned, and now he wears a skull mask and goes by the name Crossbones. In Lagos, Crossbones and his team of mercenaries ram a garbage truck into the Institute for Infectious Disease building and clear out the guards with smoke canisters. Crossbones uses hydraulic gauntlets to give him super strength, and pounds open the glass around the lab. He grabs a vial containing a deadly, highly contagious virus. Cap's team takes out some of the mercenaries, and Crossbones and the rest of the men make their escape in a truck. After a chase, the truck is taken out of action. Crossbones hands the vial to one of his men, and tells them all to scatter. He then engages Cap, repeatedly punching him with enhanced strength, while the rest of the team chases after the mercenaries. Falcon finds the one holding the vial and shoots him, with Black Widow grabbing the vial before it hits the ground. Cap gets the upper hand on Crossbones, pinning him against the wall. Crossbones tells him that Bucky Barnes remembers him. With Cap momentarily distracted, Crossbones pushes a button, triggering a bomb on his vest. Cap braces himself, but Scarlet Witch is able to contain the force of the explosion. She uses her powers to push it up into the air, but she's only able to elevate it a bit before she loses control, and the explosion rips into the seventh floor of a nearby hotel. Cap calls for fire and rescue, and then runs into the building to help evacuate. Wanda tearfully looks at the destruction. In a theater inside Tony Stark's old college, a video plays of him and his parents, Howard (John Slattery) and Maria. At the end, Tony tells the students that he is starting the Howard and Maria Stark Foundation, and each one of them has been approved for a research grant. In a corridor, a woman confronts him and shows him a picture of her son, who had been killed in Sokovia, crushed by a building that the Avengers had knocked down. At the Avengers' headquarters, the team is watching news footage of the Lagos mission. The reporter says that eleven people were killed in the hotel. Steve tells them that he let his guard down, and people died because of it. Vision tells Steve that Tony has arrived, and he brought the Secretary of State as a guest. General Thaddeus Ross (William Hurt) had been involved in the experiment that turned Bruce Banner into the Hulk, and then had spent years trying to hunt him down. Ross tells them that some people look up to them as heroes, but others think they're vigilantes. He shows pictures of the destruction that follows the team wherever they go. Then he sets a thick document down on the table and tells them it's the Sokovia Accords, ratified by 117 countries. The accords state that the Avengers will operate under a panel's supervision, only acting when the panel decides it's necessary. He says there will be a meeting in Vienna in three days, and if they don't sign on, they'll have to retire. The team spends hours debating whether to agree to the accords, and Tony pulls out the picture of the boy who was killed in Sokovia. Steve asks what will happen if there's somewhere they need to go, but the panel won't allow them. Tony replies that if they don't agree to this now, it will be forced on them later. Getting nowhere, Steve leaves in disgust. The next day, Natasha finds him in an old church. She tells him that she, Tony, James Rhodes and Vision had signed on, with Clint and Wanda holding out. In Vienna, several heads of state have gathered for the ratification of the accords. Natasha meets the prince of Wakanda, T'Challa (Chadwick Boseman), and his father, King T'Chaka (John Kani). Wakanda had become abundant in vibranium, the material that was used to make Captain America's shield, after a meteorite crashed there. Additionally, some of the Lagos victims were from Wakanda. King T'Chaka takes the podium for the keynote address, and Natasha notices security personnel surrounding a van parked outside. An explosion rips through the building, killing the king. Back in the U.S., Steve is sitting in a hotel room with Sam and his old friend, Sharon Carter (Emily VanCamp), when a news report comes in, showing the destruction in Vienna. Security footage shows the man who planted the bomb, and Steve realizes that it's Bucky. Sharon gets a text, and tells Steve that she has to go to work, and takes a military plane to Vienna. Natasha looks around and sees hundreds of injured people. Prince T'Challa picks up a printed photo showing Bucky leaving the van that had the bomb. Natasha calls Steve, and he tells her that he has to be the one to bring in Bucky. He hangs up and looks at the damaged building, having already arrived in Vienna. Sharon sees him, and she hands him a file so he can get a head start on the manhunt, ahead of a German military task force, GSG9, who have orders to shoot to kill. In Bucharest, Bucky picks up a newspaper and sees that he is being accused of the bombing in Vienna. He realizes that he'll have to leave quickly. Steve goes to Bucky's apartment and finds him there. The GSG9 storm in, and Bucky blocks their bullets with Cap's shield. He jumps down to the street, where he is confronted by the Black Panther, who scrapes his armor with metal claws on his hands. Cap jumps down and lands next to them, and all three take fire from the GSG9. Cap and Bucky run for cover, but the Black Panther stands still, letting the bullets hit him and bounce off harmlessly. Cap realizes his armor must be made of vibranium. Bucky runs through the streets with Black Panther coming after him, and Cap and Falcon following the Panther. Cap commandeers a GSG9 SUV, while the Panther leaps from the top of one car to the next, steadily gaining on Bucky. Bucky knocks a man off a motorcycle, then jumps on himself and guns the engine, driving into a tunnel. Black Panther is still tirelessly giving chase. Cap drives the SUV near Bucky's motorcycle, and the Panther jumps onto the SUV's roof, and then onto the back of the motorcycle. Bucky swings backward, knocking the Panther off, but he sticks his claws into the side of the SUV and clings to its side. Bucky looks ahead and sees Falcon flying straight toward him. He hits the brakes, and turns the motorcycle around and drives back past the SUV. Cap throws it into reverse, trying to keep up with Bucky. The Panther jumps into the air, and lands on Falcon's wings. Bucky takes a metal ball and throws it up to the roof of the tunnel. It explodes, blowing a hole in the concrete. Falcon uses his wings to shield himself, throwing off the Panther, who went straight through the explosion, unharmed. Bucky swerves to avoid a car, and falls off the bike. The Panther jumps on him, swinging his claws at him. Cap tackles the Panther, and they trade blows, with the Panther's claws leaving gashes in Cap's shield. War Machine flies in through the hole, and the GSG9 surrounds them all and tells them to put their hands up. They are all arrested, and the Black Panther's mask is removed. Cap recognizes him as Prince T'Challa of Wakanda. On the ride to the task force headquarters in Berlin, Cap tells the prince that he has the wrong man. Cap, Falcon and the prince get out, and in another truck, Bucky is taken out in a cage. They are met by Everett Ross (Martin Freeman), the leader of the headquarters. The men have their weapons removed, and they are led inside the building, where Black Widow is waiting for them. Everett takes Prince T'Challa into one room, and the others are led to another room, where Tony tells them that Secretary Ross wants to have them all prosecuted. Tony says that as a compromise, they won't get back the shield and wings, which are now government property. T'Challa uses his influence to have Bucky extradited to Wakanda, where he will face charges of terrorism. Bucky is given an evaluation to determine his mental state. Still in the room with Tony, Cap watches it unfold. Tony tells him that if he signs the accords now, Bucky will be transferred to an American psych facility instead of a Wakandan jail. Steve agrees, but only if safeguards are put into place. Tony brightens, telling Steve that this will get him and Wanda reinstated. Steve asks what he means about Wanda, and he tells Steve that she is being confined to the compound by Vision. Tony says it's the best he can do, since she's not a U.S. citizen and they won't give her a visa. Steve says that she's only a kid, and doesn't deserve to be imprisoned. He leaves without signing onto the accords. Hawkeye breaks into the facility where Vision is holding Scarlet Witch. He attacks Vision, but is unable to hurt him. Scarlet Witch uses her powers to make Vision fall through the floor, and she and Hawkeye escape. Colonel Zemo (Daniel Brühl), having already killed a Hydra agent and recovered a book containing a list of words that will trigger Bucky's reversion to his brainwashed state, infiltrates the compound and reads off the list. Bucky pounds his way out of his cell and fights Cap and Iron Man. Cap subdues him and takes him away. Regaining his senses, Bucky tells Steve that Zemo is going to Siberia, where there are several more super soldiers waiting for someone to wake them up and give them a mission. Cap assembles a team consisting of Bucky, Falcon, Hawkeye, Scarlet Witch and Ant-Man (Paul Rudd) to stop Zemo. By operating outside of authority, they all become renegades. Iron Man forms his own team, made up of War Machine, Black Panther, Black Widow, Vision and Spider-Man (Tom Holland) to arrest the others. In the battle, Ant-Man turns into a giant, distracting Team Iron Man and buying time for Cap and Bucky to escape to an aircraft hangar. Black Widow appears intent on stopping them, but she turns on Black Panther, allowing Cap and Bucky to fly off. War Machine tries to stop them from escaping, but Falcon flies after him. Vision shoots an energy beam at Falcon, but he dodges and it hits War Machine instead, causing him to fall from the sky and nearly killing him. After seeing evidence that Bucky was framed for the Vienna explosion, Iron Man heads to Siberia to meet up with Cap and Bucky and make peace. They find that the super soldiers have already been killed, and Zemo, hidden behind indestructible glass, reveals that his real plan was to find footage of the Winter Soldier's first mission. Black Panther had been following, unseen, and he hears Zemo admit responsibility for the explosion. Zemo shows them a videotape of Bucky causing the car crash, and then murdering the occupants, Howard and Maria Stark, in cold blood. Incensed, Iron Man attacks both Cap and Bucky, and he demands to know if Steve knew what had happened. Steve tells him that he only knew that Hydra was behind his parents' murder. They fight, and Iron Man blasts off Bucky's metal arm. Cap disables Iron Man's suit, and Tony tells him that he doesn't deserve to carry his shield. Steve drops it and leaves with Bucky. Zemo is sitting outside, and Black Panther stands behind him. He tells Black Panther that his family was killed in Zokovia, and he wouldn't stop until he destroyed the Avengers from within. With his success, Zemo tries to commit suicide with a gun, but Black Panther places his hand over the barrel, stopping the bullet, and then apprehends Zemo for judgment. Tony is helping Rhodes with his recovery, giving him robotic legs to recover from paralysis. Steve breaks the heroes out of their island prison and they go to Wakanda, where T'Challa gives them asylum. Bucky elects to be put back into cryogenic sleep until they can find a way to cure his brainwashing, so that no one will be able to manipulate him again. Peter Parker is recovering from his injuries at home, and he tries out a new version of the web shooter that Tony gave him. It projects the Spidey signal onto the ceiling.",
      "writers": [
         "Christopher Markus",
         "Stephen McFeely"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3498820/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjQ0MTgyNjAxMV5BMl5BanBnXkFtZTgwNjUzMDkyODE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Chris Evans",
         "Robert Downey Jr.",
         "Scarlett Johansson"
      ],
      "reviews": [
         "I don't understand the hate for this movie it actually surprised me, I really enjoyed this film. Captain America: Civil War is a descent awesome MCU super action the third film of the Captain America trilogy. To me the second movie Captain America: The Winter Soldier is still the best one I just love that movie to death, but I like this one I love the first one but I just love all three of Captain America films. I thought the cast did a good job Chris Evens kicks ass once again he is Captain America and I look this movie from his point of view. He is really become my favorite hero of the Marvel Cinematic Universe and the Avengers films especially Age of Ultron, Captain America is still a guy who has a lot of screen time that it is the focus of a movie and he is still the guy I can take a side I agree with him, I can understand his choices. We have also almost everyone from Avengers films except Thor and Hulk actors Chris Hemsworth and Mark Ruffalo did not appear. Chris Hemsworth thought that MCU fired him because he was not cast as Thor but he was later explained that MCU wants his own movie and his own stand alone path which I can't wait for Thor: Ragnarok. The cast beside Chris Evens includes Robert Downey Jr., Scarlett Johansson, Sebastian Stan, Anthony Mackie, Don Cheadle, Jeremy Renner, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Paul Rudd, Emily VanCamp, Tom Holland, Frank Grillo, William Hurt, and Daniel Brühl. In Captain America: Civil War, disagreement over international oversight of the Avengers fractures them into opposing factions-one led by Steve Rogers and the other by Tony Stark. We have two opposite teams now fighting each other: Team Iron Man: War Machine, Black Widow, Black Panther, The Vision, Spider-Man. Team Captain America: Hawkeye, Sharon Carter, Falcon, Bucky Barnes, Ant-Man, Scarlet Witch. The battle between Captain America and Iron Man draws a political line in the sand. On one side, you have Tony Stark, a man looking to protect the world from super-powered individuals who've proved in the past to be more destructive than helpful. On the other, you have Steve Rogers championing civil liberties. It's the age old debate of safety coming at the cost of freedom, and we'll get to see it play out to a hopefully satisfying conclusion this year. The action scenes are fantastic, the fight scenes on the airport are incredible heart pulse breath taking awesome. The fight scenes were very well done and well choreographed. I liked this movie more the story drew me in, the villain wasn't that good. Robert Downey Jr. does a good job, Paul Rudd he is fun in the flick, he has a great moment as Ant-Man he has a few moments but one predictable. Scarlett Johansson did great! Black Widow kicked ass specially in the beginning of the flick. Anthony Mackie I really like him as Falcon he as a lot of good stuff in this. He was down played in Age of Ultron but has a lot screen time in here which was excellent and they made that for that in this one I am glad for it. Anthony Mackie has a lot of good screen time, specially in the action moments. Falcon has a remote control like a mini Flacon I thought that was really cool. Chris Evens is to root for this character, Black Panther interesting the actor playing black panther was really good I like him and I am really interested seeing his up coming movie. Bucky Barnes: Winter Soldier did fine. A lot of people are complain about how terrible this movie is I am sorry I don't see it that way, I don't see at all it is peace of sh**. I wish that Frank Grillo as Brock Rumlow / Crossbones wouldn't die and it was nice to see him in the beginning of the movie. I still wish he would work for the villain I still enjoy his screen time. I thought Chris Evens and Robert Downey Jr, did work great as a opposite team. I love the end of fighting between Cap, Iron Man and Bucky Barnes. I thought the last fight scene was well choreographed I honestly think Iron Man would have won and he would killed Bucky Barnes. If Cap wouldn't have hurt his heart. I know when Tony find out Bucky killed his parents and he killed his mom in 1991 he decide to kill him. I mourn with Tony and it was a great dialogue \"That shield doesn't belong to you. You don't deserve it! My father made that shield!\" Captain America: Civil War is a 2016 American superhero film based on the Marvel Comics character Captain America, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. I understand the hate, because Captain turn the law politics back to save his friend, but he actually try to safe an innocent man who was framed by Zemo. Captain America Civil War WAS BETTER THAN X-MEN APOCALYPSE, Batman v Superman: Dawn of Justice, Man of Steel and Deadpool I don't like those movies they are peace of sh** and too way overrated. The rating I am giving is 10/10",
         "People says: an Avengers movie with 'emotional depth' and 'moral complexity', and now I have to question what planet they're living on. Seriously, WTF people!! if this is 'emotional depth' and 'moral complexity' then Marsellus Wallace is a bitch! When their operation to stop the theft of a biological weapon in Lagos goes explosively wrong leaving dozens of civilian casualties and themselves under scrutiny. It may be that I'm misremembering, but were there any civilian casualties in the past??? Didn't whole cities go up without anyone even wandering around dazed with a nosebleed? But the plot needs what the plot needs so now the Avengers have always blown up innocent people, which leads to 100 nations gathering together and saying: this must stop. And: you must all be brought under the control of the UN. While Iron Man is for it, Captain America, who is more Brexit, quickly goes rogue and becomes a fugitive. This could have then set the scene for, perhaps, saying something almost interesting about government control, military might and divided loyalties, but instead it results in all the superheroes choosing #TeamCap or #TeamIronMan\u0097 there are no takers for #TeamNeither, which would have been the sensible option WHY WHY they fight!! Come on!!! Captain America a rebel soldier???",
         "The WINTER SOLDIER is the best MCU film, but its sequel has a serious identity crisis. Captain America: Civil War wants to be great. But for the most part it isn't. The film is an overstuffed 2 and half hour film that has one too many ideas thrown into the mix. It is essential a cash grab of the BVS variety. But why can't people see this? Now this is a Captain America as the title suggests. But in the end a more fitting title would read: Bucky VS Ironman: Dawn of who's the Captain's Bestie. The reason I say this is the film felt disjointed to the point of it being a joke. It felt like two separate films weaved together to try and make a film that makes sense. But it didn't It's one half a Captain flick/ the other half a mini Avengers film. But they both drown each other. It's clear this is a film Marvel wanted to make, but why on earth rush into it? One film could never service this iconic plot line. It should have been gradual, and while we did see Cap and Tony tense up in Ultron, this is where a strain in their relationship should have been definite and it should have still been in effect at the beginning of this film. For the most part of the Airport sequence there was no real danger. It was a carefully orchestrated scene that showed these films are for young cinema-goers. Even when one character is looked to be written off \"BAM\" they are back, giving everyone some cheep laughs at the end of the film. Now from a writing and filmmaking point of view and dare I say it, this film has worse interconnecting scenes then The Amazing Spiderman 2. Re-shoots are obvious, editing is sub par, cinematography lacked style and was evident to be a \"quick\" point-and-shoot at the action affair. Such a disappointment. But yes this film has it's fun moments (the same can not be said for BVS). But they can't help a film tailored to a certain demographic that leaves out those looking for a film that doesn't kill a few braincell upon leaving the cinema. The laughs are hardly inspirational writing and forced, so forced. sidetone: ONLY SOME OF THEM HAVE SUPER POWERS, SO WHY DO THEY ALL RECOVER FROM HARD HITS AND KNOCKS? it's just makes the stakes so much lower and less respectable.",
         "The Marvel universe gets tenser with the most-awaited \"Civil War\". For what fans clamor to be a storyline that the MCU is building towards, here comes a showdown of Marvel's biggest properties. \"Captain America 3\" starts off where \"Avengers: Age of Ultron\" ended, when the New Avengers, led by Steve Rogers/Captain America (Chris Evans), are cornered by international concern in response to continuous collateral damage. As a result, a governing act is proposed to the Avengers, fracturing the team to two sides, one led by Rogers and another led by Tony Stark/Iron Man (Robert Downey Jr.). But when a new threat is on the horizon, the team has to face the repercussions of their brawls. It is a huge help that the Russo Brothers returned to hold the weights of Marvel's Phase Three, after their spontaneous effort in \"The Winter Soldier\". Though \"Civil War\" may not be as solid as its predecessor, it is still a worthy addition to the Avengers storyline and Captain America's saga. Yet, it excels for taking a mature route that brings a compelling character study, a token from the first Avengers movie. Out of such character study is the major theme of vengeance. I am not going to give any more details about it. It is best to be seen and be enamored by how such themes are delivered with an affecting yet entertaining vibe. Kudos to the cast ensemble that all brought their A-game, even though some characters are not that fleshed out, or feeling shoehorned. Evans is at his most moving as the fading patriot who wishes the best for his team and loved ones. Downey Jr. is still what we expected from RDJ. Scarlett Johansson as Black Widow has a neutral but affectionate presence, despite her rather little involvement. The rest of the cast is great to see, with notable breakout performances from Paul Rudd as Scott Lang/Ant-Man/Giant-Man, Chadwick Boseman as T'Challa/Black Panther and Tom Holland as Spider-Man/Peter Parker. And Daniel Bruhl as Helmut Zemo is a better addition to Marvel's lacking lineup of antagonists. But despite the cast's collective efforts, there is an obvious battle for screen time with all characters. Thankfully, it was all salvaged as the two parties brawl in a cleared airport, in an exhilarating action sequence that will surely make every audience member cheer. For all the makings of a summer blockbuster, \"Captain America: Civil War\" gets it all started right. Besides being a loyal companion to the comic book storyline, it is a worthy setup to Marvel's other properties and one that truly can hold on its own, courtesy of its consistent superhero action scenes, the Russo brothers' tense direction, the excellent cast, its thought-provoking themes and its exciting story with its signature Marvel snappy dialogue. Let us hope for the best for MCU's future, including Tom Holland's \"Spider-Man\".",
         "I'm confused so much, all these movies sorta blend into each other. Since they are tied together. Hulk, Thor, Cap America, Iron man, etc.... Since the avengers were in this I assumed it was another Avengers movie. But no it's Captain America: Civil War? Huh? Don't you need the Avengers for a civil war? What it being CIVIL and all. Umm....so confused. Where is Thor and Hulk, and Loki and and and.....I can go on and on, but you get the point. We really know it was budget issues. They are IN the Avengers, SO why are they not asked to sign? ????? Confusion. WHY do, ALL OF A SUDDEN, half the avengers seem not to trust Cap???? OH right since that is what the plot needed. This whole movie is just trash. Random spider man and ant man thrown in too, why not? Just whatever at this point. Explosions and random sh*t. Can anyone make sense of these movies anymore? All started with Cap, the Nazis stole something from Thor/Loki....then he was frozen, woken up....umm Tony Stark's father knew Cap. Umm Cap almost banged Peggy? She did stuff created shield or something....then Hydra got in. Then Loki went crazy, and Thor stopped him, or didn't. Umm then Iron man made suits....Black widow wore tight tight clothes. She was in ballet??? Kissed Cap, but loves Hulk??? Umm....wtf is even happening any more. Robin hood has a secret family??? And who was that guy in a panther suit. RANDOM AS F***! LOL ????? If you LOVE confusing white noise this is the movie for you!!!!! \"Confusing White Noise: The Movie!\"",
         "Captain America Civil War is the thirteenth film of the Marvel Cinematic Universe. It is directed by Anthony and Joe Russo, with a screenplay by Christopher Markus & Stephen McFeely. In Captain America: Civil War, disagreement over international oversight of the Avengers fractures them into opposing factions - one led by Steve Rogers and the other by Tony Stark. Civil War is definitely one of the best Marvel movies to date, and absolutely on par with The Winter Soldier which was also great. They are both on top in the Marvel Cinematic Movies ranking of mine so far. The conflict between these well beloved characters is done in a brilliant and fantastic way by the amazing Russo brothers who took the cheese out of the first Captain America movie , made one serious and great second movie, and build upon them both with the third outing. Everyone does a great job here, Chris Evans has made Captain America his own same as Robert Downey Jr for Iron Man. It features a very big ensemble cast and not one of them is anything less than great on the role. The fight scenes are also some of the best ever made in a comic book movie, even better than in The Winter Soldier. Especially the airport scene is just mesmerizing and totally stands out from everything else that's going on. Spider-Man is also unbelievably well done and Tom Holland is just fantastic. I am one of the few people who actually loved The Amazing Spider Man movies, and really got mad to hear that they are going to reboot the character again but I can see now that it was worth it. The visuals are great from beginning to end, the music is also good as usual. The villain is something that most people though it was the weakest point but I strongly disagree with that. He had reasoning as to why he is doing those things, and he pushes the other characters in new directions which is also necessary. I generally adored this movie, and even though I am a DC fan, there's just no denying that Marvel knows what they're doing and that is why they are much more successful right now.",
         "Hi, I saw civil war and I come with good news; it's AWESOME! Im not gonna spoil one single thing, since this movie should be seen by only the two trailers you probably saw. Don't watch any tvspots after the second trailer or whatever! Im gonna touch a few aspects and rate them. Acting: Of course it's amazing. The characters we were waiting for were black panther and of course SPIDERMAN! Both were done amazing! Spiderman has a bigger role than I personally expected and it's done with grace. Love it. Black Panther was such a good character with great motivation why he's doing what he's doing. The acting per usual from the other characters were great! 10/10 Story: Now where another (let's leave it) unnamed superhero movie failed this year, and no I'm not talking about dead-pool.., was the story. Now this story is what I expected from the other unnamed superhero movie. I didn't know what side I wanted to be on; cap's or iron man's. I was so conflicted and even while they're fighting you don't know who to root for. The villain in this movie felt a bit, not really out of place, but unnecessary in my opinion. But Marvel always struggles to find a good fleshed out villain except for Loki & kingpin in the series. 8/10 Action/Cinematography: O boy..If you're an action freak you will love this, if you're a comic book fan.. you're gonna LIVE these amazing action set pieces. The much anticipated airport scene is AMAZING. You've seen nothing, literally nothing of the amazing action that will bestow upon you guys. The airport scene is in complete imax and has a runtime of around 17 minutes. Just let that sink in! The Russo brothers know how to create great action and film it great as well. I can go on record and say this is by far the best superhero action scenes ever. 20/10. Verdict: Was it a perfect movie? No. But for me as a fan it came darn close. The only thing that bothered me were the villains, well actually one of the few that are in there. Was it better than... Batman v superman.. yes by far. I mean we're in a comic book movie year, so we might as well compare it. Batman v superman lacked in a lot of places and civil war just did it better. Just the conflict in ideologies made it so much more believable why the characters fought and because this whole story arc is happening now after 2 cross over movies, 3 iron movies and 2 cap movies.. the stakes are so incredibly high. I tried to compare dead-pool with it as well, but it's a different movie in terms of it being a solo movie and setting something up, instead of showing a conflict between good and good instead of good and evil. 9 out of 10! Near Perfect movie for the fans(9.5) and a good solid action film for the general movie go-ers(9)",
         "This review contains spoilers and my English is kinda bad.... so lets start: After seeing 8.5/10 my expectations were really high but after watching this movie i was so disappointed (probably the worst marvel film since first CA what is really ironic since CA 2 was one of the top three... ) Story: story is meh, nothing special, just CA and his buddy (with support of 1/2 avengers) against the world My PERSONAL problems with this film : 1. Terrible villain again, didn't remember his name 20min after the movie ended, did pretty much nothing but showed some amazing prophet skills 2.So many stupid things like how did villain know iron man will come at the very end, how did he know nobody told iron man how his parents died, also the big fight at the airport was just too dumb, pretty much all mighty jean nm.2 and vision in the same fight where black widow and hawk eye should just really be hoping, praying and dodging some random explosions... this list could really go on and on 3.SO OVERCROWDED. Why the hell did ant-man join the fight? What is his motivation? How does random Nigerian prince have powers to fight CA and bucky ? HOW ??? Nobody but CA, Iron man and bucky had story behind them (pretty pathetic though),others were just useless guys fighting. At least they didn't ruin Hulk even more :-) 4.Really ? Tony tried to kill his friend CA and bucky and then after being defeated he is f***ing cool with it? Best buddies again? 5.In iron man 3 tony was able to call 30 auto iron mans to fight for him, here he got challenged by a freaking falcon with his wings? Also at the airport he was unable to defeat CA and at the very end he almost rekt two of them ? ... Guess I'm back to stupid stuff... On the other side, good things: 1.Spider-man - yea this kid with no story in movie at all was one of few good funny things about this movie 2.Cool fights right ? All in all , 4/10 (coz i love superheroes movies), 1/10 is to balance things...",
         "Superheroes may misunderstand and they make mistakes but, ultimately, they are morally incorruptible. If they find themselves on the wrong side of a fight it's because they've misunderstood the nature of the problem. However, when reality finally hits home we can rely on them to admit their error and go off to fight together in the name of Truth, Justice and the American Way. People who die are unavoidable collateral damage, superheroes are beyond reproach and we need them too much to limit their powers. The world is just too scary and too dangerous to shackle the mighty with red tape and bureaucracy. Superheroes are better than us mere mortals, not just more powerful but also more moral. They don't need to follow the same rules we do. After Winter Soldier I was under the (apparently mistaken) belief that Marvel's Capt. America franchise was criticising neoliberal America. There was all that stuff about the ends not justifying the means and about how politicians use terror to convince the population they need to be oppressed for their own good. How wrong could I be! Now I see that it's actually the opposite. It pretends to be anti-establishment but really it's just about justifying a sense of self-entitlement. Like Donald Trump, Capt. America criticises the State for oppressing people whilst simultaneously adhering to exactly the sort of high-handed moral superiority that inevitably leads to that oppression. He (I mean Capt. America) obviously skipped school on the day they taught the importance of checks-and-balances and why one of the central principles of US Democracy is that of the separation of powers. The message of this film is simple. If you believe you are right, then you can do whatever you want as long as it's in the name of *insert moral cause*. Anyone who tries to limit your personal crusade is either stupid, naïve or oppressing you. Freedom from oppression means the freedom to act like you're better than other people, because, well, you ARE better than other people (go on, admit it, you're amongst friends here).",
         "Captain America is only a stupid cowboy in this movie. Why does he not sign the regulation papers? He isn't a god like Thor or Superman. Who is Captain America to be above the Law? Superman or a American cowboy? Why did he not tell Iron Man what his best friend have done with H.Stark and his mother? Does he know how to talk with his friends like Tony? I think not. He only knows how to fight... like a perfect soldier... And what about the conflict? And the consequences? Will we see them? Or Captain is already a friend for Tony? He has given a cheap cellphone to Tony... so... the conflict doesn't matter... Only the action scenes are good...",
         "A movie can do everything else right, but if the story requires the characters to do something that they would never do, ignores a huge elephant in the room that no one would ignore, etc., then it suddenly becomes garbage because it forces me out of the experience of going along for the ride. This movie could have been good. I love superheroes, especially when movies work in lesser known heroes. There's some witty dialogue and plenty of star power and special effects. However, the plot has an absurd contrivance that I cannot get past. In order to plot Captain America versus Iron Man, the authors could not come up with an intelligent misunderstanding. Instead, Captain America's friend is framed for a crime and Iron Man thinks he's guilty, even when event after event makes this highly dubious, and even when his \"friend\" Captain America tells him he thinks his friend may be innocent. Sorry, based on the track record of this relationship in the movies, Iron Man would HAVE to step back and think twice about this friend's guilt if Captain America really asked him to. Moreover, when towards the end Iron Man learns the friend was framed, but learns this friend also had been previously brainwashed to kill in the past, and had killed his parents, he then tries quite un- heroically to kill Cap's now un-brainwashed (and framed) friend. What part of brainwashing and mind-control does Iron Man not understand? If some one kills while under the influence of brainwashing and mind-control, they are the VICTIM, and you do NOT try to kill them after they manage to escape and overcome the brainwashing and mind-control. The writers somehow thought they could just sweep this under the intellectual rug by just moving the action along very quickly, as if this would not give the audience time to connect the dots and see how ridiculous and unrealistic this \"dilemma\" really was. Sorry, there was no true dilemma. Captain America was right and Iron Man was wrong, completely, and in a ridiculously contrived manner.",
         "1st, Civil War is basically a copy of BvS. A government building gets blown up by a bomb, killing a prominent government official. A villain manipulating heroes into fighting. 2nd, too many characters just popping up without any reason at all and just shoehorned into the movie - Ant-Man/Giant Man - Black Panther - Hawkeye (was retired, now suddenly abandons the girlfriend and kids to come back and help a fugitive escape from the authorities) - The Annoying Spider-Kid (more annoying than Jar Jar Binks in The Phantom Menace; did more talking than fighting) 3rd, after all the buildup about a disagreement over the issues of collateral damage and government oversight of the heroes, those issues were completely trivialized by a \"big fight\" that was nothing more than a friendly sparring contest with bad one-liners thrown in: \"Are we still going to be friends after this?\" \"We haven't met before?\" \"Mr Stark. What do I do now?\" \"You have a METAL arm?\" \"I'm from Queens. I'm from Brooklyn.\" Was the \"Civil War\" supposed to be a real fight for something they believed in, or just a \"Joke-Off\" to determine who could deliver the best jokes? 4th, MCU fans had been saying for months that Captain America was justified in opposing government oversight of the heroes because he didn't want the Avengers to be controlled by HYDRA. But it wasn't HYDRA who requested the Sokovia accords. It was the United Nations. The Avengers had caused massive deaths and destruction so the United Nations wanted oversight of the Avengers. But Captain America didn't want the Avengers to be held responsible and have to answer to the people for the massive deaths and destruction that they caused. Captain America wanted the Avengers to be the supreme authority (exactly like Hitler, Stalin, and Saddam Hussein made themselves the supreme authority) to make decisions on what's best for the people instead of letting the elected representatives of the people make decisions on what's best for the people (like the way a Democracy works). So basically, Captain America opposes Democracy and favors Tyranny. 5th, plenty of plot holes and lazy, contrived writing. Tony Stark had called Secretary of State Ross to evacuate the airport prior to the big fight. So Ross knew before the big fight that the Captain America and the Bucky were planning to hijack a plane at that airport. So why didn't Ross just have military fighter jets hovering in the sky nearby in case they succeed in hijacking a plane? There's already a \"shoot on sight\" order for Bucky so if they succeed in hijacking a plane, then the military fighter jets can just fly in and either shoot at their plane to force them to land or shoot down their plane. Since Captain America and Bucky can't fly on their own, their powers are useless when they're inside a plane being fired upon by military fighter jets. And their plane wouldn't be able to evade military fighter jets. But the script needed Captain America and Bucky to escape so that it could set up the final fight between Iron Man and Captain America. Also, the 1st half of the movie is all about Tony Stark trying to get all the Avengers to sign the Sokovia Accords, which state that the Avengers would operate only when approved by a UN panel. Then in the 2nd half of the movie, Tony recruits Peter Parker to join his team even though Peter is a minor and wouldn't be able to sign a legal document and thus wouldn't be approved by the UN panel to operate under the Sokovia Accords. Another egregious error is that the whole movie set up Bucky as the killer of Iron Man's parents, thus setting up the main conflict in the movie, but why would there be video footage of their accident on some random back road in 1991? And how did whomever filmed the video footage know to place the camera at that EXACT spot where their car crashed, and not a mile ahead or a mile behind where the car crashed? If there was video footage, then wouldn't Iron Man or Jarvis or even Ultron have stumbled across it by now? Tony hacked classified government networks in seconds in Iron Man 2, hacked Shield in The Avengers and has apparently been watching Peter Parker on a regular basis. Seems like he would have found video footage of his parents' deaths a long time ago. And better yet, how could the coroner rule their deaths an accident when the ligature marks around Maria Stark's neck and the fist imprints in Howard Stark's face would have been immediately evident in the autopsy? Was the coroner just incompetent? Also, Tony Stark believed his parents died in an accident and never suspected foul play at all. So how did Zemo know that their \"accident\" from 25 years ago was actually foul play? How did Zemo know there was video footage from 25 years ago of Tony's parents being murdered and how did Zemo find that footage when Tony never knew about or found that same footage? Tony Stark was more angry at Steve Rogers because Steve knew but didn't tell him. So how did Zemo know that Steve knew the \"accident\" 25 years ago was actually foul play? Those are massive pills we're asked to swallow that exist only because they conveniently set up the final conflict between Iron Man and Captain America. Now that's some mighty contrived writing. 6th, another forgettable MCU villain. Zemo was about as invisible in Civil War as Luke Skywalker was in The Force Awakens. 7th, critics and haters of BvS complained about how Lex knew Superman is Clark Kent and how Superman knew Batman is Bruce Wayne, but there was no explanation at all for how Tony Stark knew Spider-Man is a high school kid in Queens.",
         "I loved every second of Captain America: Civil War. Everything was so well put and the story and plot worked very smoothly. This movie is everything Batman V. Superman should've been. Every character fit right and at no point did the movie feel crammed with superheroes. In my opinion, the two heroes that stole the show was Spider-Man and black panther. They got both of these characters right especially black panther. As much as I loved Batman V. Superman, I have to give this movie more credit. The Russo brothers did not disappoint and they delivered another marvel masterpiece just like the winter soldier. This movie was very good and I plan on seeing it again when it comes out to all theaters and maybe a couple more times! This movie made me very excited to see what comes next in the MCU.",
         "Checkmate, haters. And sorry, it's just not your year. I have seen this movie, but I won't mention a single spoiler here. (If you guys want proof, you can PM me and I'll tell you how the movie ends and the after credits). The reason I'm really writing this review is that I KNOW THERE WILL BE BIASED PEOPLE HERE WHO'LL WRITE THAT BVS IS BETTER and this is trash, etc, etc. Well, just see this movie and judge for yourself. Speaking briefly of the movie, it is an emotional roller coaster with an absolutely beautiful end. Spidey had a satisfying screen time. As for the acting, by the time the movie ended, I was a happy man. Russov's are handling Infinity War, and after watching this movie, how they did justice to characters, I'll not worry. A movie we wanted as well as deserve.",
         "The story goes, Marvel runs out of ideas. They got excellent stuff shown in the first movie, then something lesser in the second one, and then the third one was like - somebody damn insisted on making it, even though there was no story written... When the evil is all defeated, the continuation is not due till the next movie, and all avengers are simply bored, in the shortage of anything interesting going on, why not have all the heroes beating the crap out of each other? That should do the trick, and keep the sheep happy. The movie has no story, its conflict is superficial and borderline idiotic, even for the way the avengers split into two groups had no logic in it, and, of course, no explanation. They just really wanted to flex their muscles, and so they did, period.",
         "I was one of the few fortunate people who got to watch this early. This movie was everything i hoped Civil War to be. It was funny, got you emotionally involved and Action Packed. Yes! the action is done brilliantly. The best I've ever seen in a comic book movie. Maybe one of the best in movies in general. This movie is not your average comic book good vs evil movie. It's much of a clash between ideologies which was really interesting to see. I also have to talk about how Spiderman was portrayed in this movie. I really liked him. As expected he was not the focus of the movie. However, he was not just a cameo either. The few scenes he was in the movie was enough to like him. If i have to point out flaws there is hardly any. Marvel is almost perfect. Almost. I do have one problem with the movie. It was the main villain. Like other marvel villain, this villain just didn't work for me. The movie would have done fine even without the villain. It feels like he was just there because ...he was just there!. But it's not a deal breaker people!! The story isn't about the villain. It's about Civil War. And you're gonna get it.. I can't recommend this movie enough. Believe me guys, the 1 star reviews are all from Marvel haters. They just can't accept the fact that Civil War was a great move. Most of those reviewers probably haven't even watched the movie. Ignore the haters and watch the movie. You won't be disapppointed.",
         "Russo Brothers did an amazing job with this film. I loved every scene in this film.The action is amazing,its good to see Chris Evans again as Capitan America,Robert , well he is tony stark and i actually loved him this film more than in his own movies. Black Panther, Antman y Spiderman, they are just amazing and interesting characters in the film. Visual effects are amazing and the battles are really good. I thought that marvel will never do a very good movie like it was winter soldier, but i was wrong, i was totally wrong I don't like to compare, but i enjoy this film more than batman v superman. It's obviously that it is not perfect, that's sure but for me this is the best marvel movie, and i cant wait for the infinity war, the MCU is in good hands with the Russo brothers",
         "I would give it 0/10 But had to settle for the lowest which was 1/10. This movie is as inconsistent as it is poorly written. Black Widow survives being thrown in a armored truck with a grenade, not to mention no one even bothers to shoot at her. The scene where Scarlett Which blows up part of a building was ridiculous, out of all the places she could've chosen to throw the bomb it was at the one tall building in the area. Captain America freezes due to hearing the name Bucky and even says that. The scene where Black Panthers Dad dies is ridiculous given that Black Panther should've been killed in the blast, not to mention how was that part of the building the only part that suffered the most damage? I guess they didn't want to kill off Black Widow. The explosion would've leveled the lower floors thus resulting in the higher floors crumbling. Not just that one room being majorly affected. Tony Stark is the only one in this that makes sense. Everyone complains about Tony and says he's the bad guy and will stab you in the back, when they are the one's who broke the law and have a cry about it. Scarlett Witch being \"rescued\" by Hawkeye was completely ridiculous, she has a guilt trip about killing people and she snaps out of it just because she is told to get up off her ass. Not to mention Tony just grows a conscious after a few years of all these other people dying but changes his tune after talking to a Mother. Jokes are forced. Lets not forget how bad the reasoning for their fighting is. Captain America especially, Bucky being a trained killer, who would be out in public and he thinks it's a good idea to break him out and beat up the German police. Also the part where black Widow goes off at Tony for things getting out of hand and that Captain America will always be on the run and she let Captain America go. This is why the Avengers can't have nice things.",
         "When politicians and world leaders think that people like Captain America and Iron Man are running amok, they tell them they need to be regulated. tony Stark, Iron Man thinks it's necessary. While Steve Rogers, Captain America doesn't think so. That eventually splits their team, The Avengers. At a UN gathering where the regulations are being worked out, there's an explosion and some people are killed among them is the King of Wakanda. Investigation reveals that the bomb was planted by the Winter Soldier, who is Bucky Barnes, Captain Amerioca's friend during the war. Everyone is out to get Barnes and kill him if necessary but Steve wants to get to him first and help him. When he finds him he says he didn't plant the bomb, suddenly another person shows up who's out to get him dressed in black. When security forces catches up to them they are arrested and the one in black is revealed to be the son of the Wakandan King, T'Challa and he is the Black Panther the guardian of Wakanda. While in custody, a psychiatrist is sent to evaluate Bucky but suddenly the power goes out that's when he begins to say some words that have an effect on Bucky. He breaks out and Steve tries to get him. Believing that Bucky is innocent Steve sets out to find the man who got to him. Tony is told that because Steve helped Bucky he is now also wanted. He offers to bring him in so he asks War Machine ,and Black Widow to join him. He recruits someone to help him while Widow offers T'Challa to join them. Steve brings Falcon with him who gets Ant Man and Steve calls Hawkeye who gets Wanda whom tony has under lock and key under the eye of Vision. They get away and Vison joins tony. Eventually they all have a confrontation.",
         "Just saw it. Not gonna go in depth but incoherent plot with lack of motivations for a lot of the characters to even fight to begin with. Didn't like the actor who played Spider-Man, his jokes were bad and misplaced in the middle of action scenes. Spider-Man seemed like he was added in at the last possible moment of production as he seemed out of place. I mean Tony Stark shows up and just blindly follows Tony. Black Panther was alright but oh boy does his mind change fast but like Spider-Man, he was shoehorned in. Ant-Man dragged along to be beside Captain America, he just blindly follows Cap. Too many jokes in the middle of action scenes. Winter Soldier almost killed some of the Avengers but Captain Americas gay love for bucky blinds him from him. Captain America being so stubborn and showing his true colours as a terrible individual as he doesn't seem to care about anyone's safety. I thought Cap was suppose to be a leader but really, this movie only showed lack of leadership skills as he almost got everyone killed. The highly praised airport fight was not impressive. I'm not sure what people saw here. Zoomed-in action scenes, close up to the faces, lame jokes in between, Black Widow asking if were friends to Hawkeye, camera shaking. The heroes just scatter/disappear and end up on the raft?. Terrible pacing from one scene to the next. Captain America just having a casual talk with Spider-Man while they are fighting and you can see Evans laughing after he mentions that he's from Brooklyn ugh. So bad and so cheesy. Cap holding the helicopter ugh so cheesy. They say bucky is brainwashed but in some scenes, he seems to have it together but in other scenes, he don't. If he is brainwashed, why does Zemo need to activate him when he says the code?. After Zemo says the code, he almost killed some of the Avengers but later on, he fights alongside them?. And now he has it together or what?. Is he brainwashed or not, what's going on here?. Why is he back and forth on killing the Avengers and then working beside them?. Ugh so awful. Chris Evans wooden acting. Lack of facial expressions for the intense moments of the film. Captain Americas lame letter to Tony Stark. All these Marvel movies and they still can't make War Machine the true badass he is like in the comics. The character has been under utilized since Rhodes has put on the suit. They made him a laughing stock in Iron Man 2. The character has very little screen time in every other Marvel movie. Absolutely awful how they treated War Machine in this movie and previous movies. Terence Howard should be happy that he's not playing this character anymore. Disney/Marvel made him a joke. RDJ as Tony Stark/Iron Man is fantastic as always. No complaints here, his motivation for killing Bucky makes sense here. Captain America protecting bucky nope other then that they are friends from back in the day. A lot of the faults people give to BvS which are warranted is also in this movie Civil War. This is not even a Cap Movie, it's a Avenger movie. It's a overcrowded mess with too much going and too many shoe-horned characters and too many characters lacking any real motivation for even fighting each other. I could go on about why I think this is the worst Marvel film to date. I'm not sure what critics saw here. I rated it a 1 as a place holder and reserved judgement until I saw it. I finally saw it. I'm leaving it at a 1/10. An absolutely awful dreadful film that's only to please the fanboys and children.",
         "So the year of the big Superhero movies started so well with Deadpool and Batman v Superman, two movies I enjoyed very much, both different from one another and I felt delivered on what they were meant to be. I was looking forward to Civil War a lot due to the love I have for Cap's previous movie, the Winter Solder. However, this film was a massive disappointment for me. The film starts off in Wakanda where the Avengers have tracked down terrorists, led by Crossbones and as a result of the confrontation between the two groups, part of a building gets blown up and people die, which all of a sudden is a big deal. Due to that the government wants the Avengers to be reigned in an be controlled solely by the government, which Tony Stark is for (following a brief encounter with the mother of a dead child thanks to the Avengers) and Steve Rogers is against. From there on, the film is mainly focused on Tony trying to get Steve to agree to the terms posed by the government, with no success until it all comes to a head once both Tony and Steve create their respective teams. Marvel took a serious storyline in Civil War and just didn't know how to handle it in my opinion. It felt like the Russo's were caught between making a darker movie about a serious issue and making a light hearted comic book movie. In the end, we got a standard Marvel movie. Nothing different or ground breaking about it whatsoever... and its taken 13 movies to get to this point. It feels like the Marvel films are standing still and cannot progress to the next level, maybe in fear of the backlash from fans if they changed the formula. What the movie does well is it showcases the arguments of both Toney and Steve well and you cant really pick a side of your own. However, we don't really get anywhere and by the time the famous airport scene comes about, you forget who's fighting for which team. Some heroes don't even know why they're there! It all felt very forced. The action was great and so where the debuts of Spider-Man and Black Panther , however the whole movie could have been done without Spider-Man. He added no value to the story. The film had its standard levels of humour and whilst some of the comedy was done well, it went into overdrive once we had the inclusion of Ant-Man and Spider-Man. The only part of the movie that was heart felt was the final scene between Cap, Iron Man and Bucky as you felt the heartbreak that Tony had at that moment - great acting from Robert Downey Jr. However, even that scene came about via coincidence, which was really the trend of this film.... everything that happened was coincidental, from Tony showing his younger self with his parents at the MIT presentation, to the video of Bucky killing Tony's parents. Civil War was the wrong title for this movie. It should've been called, 'A Minor Disagreement'. All in all, the movie felt pointless as nothing was achieved by the end. Everyone remained friends and the only casualty of the movie was the least cared about character in War Machine. The movie just felt like a stepping stone to Infinity War and the solo Spider-Man and Black Panther movies. No doubt that this will be praised by everyone and will make a ton of money, but as someone who appreciates movies, this one fell well short of the mark.",
         "This movie is so great directed by the Russo Brothers they done a great success. A better movie than BvS, this is possible the best movie of MCU with respect of Winter Soldier. Spiderman OMG great performance by Tom Holland and Black Panther another great debut for a great character of the Marvel franchise. Infinity Wars is in great hands of the Russo Brothers.In other things this movie only fails in the villain Baron Zemo but the fight in the airport was possibly the best action sequence in the history of super hero movies. It's not a revolution of super hero movies but this is fresh air for the MCU and overall the genre, DC/Warner needs to learn of how make a great universe.",
         "Cynically speaking, the whole mold that the latest Marvel movie creates, is a colossal set up that engenders subsequent sequels and solo outings in the ever expanding Marvel Cinematic Universe. The third for titular Captain America, \"Civil War\" is essentially the third Avengers film, starting with events happening a year after \"Age of Ultron\". That is not to say the film is mistakenly titled, because it still is, in all important aspects, a Captain America movie. It's just that, he isn't alone. The sheer size of this potential billion-dollar movie calls for an equally mammoth effort from sibling directors, Anthony and Joe Russo, who also both helmed Cap's previous film, Winter Soldier. Their deft maneuver results in a beautifully crafted cinematic piece, whose towering bravura, bestows the entire proceedings with striking depth and sentimentality, which may not be the first for the genre, but enough to make it Marvel's best film, to date. In \"Civil War\", the brewing enmity between Steve Rogers/ Captain America (Chris Evans) and Tony Stark/Iron Man (Robert Downey Jr.) inevitably arises and turns bitter in the wake of their relentless campaigns to save humanity. The irony emerges amidst of their efforts, when greater authority finally asked who should be held accountable for the collateral damages brought both by their offensive and defensive operations. The motion begins to roll when a mission in Lagos resulted to unexpected amount of destruction and deaths. Differences in views divide the once solid group into two colliding factions. With Stark and his allies resigned to submit under the Sokovia Accords, Captain and the rest of his team, move away with staunch stand to operate freely under no greater force's jurisdiction. There is an intelligent attempt from both sides to meet halfway, but battle line is imminently drawn as a result of another attack which Cap's best buddy, Winter Soldier— now simply, Bucky Barnes— is believed to orchestrate. Doctrinal contrasts force heroes to pick sides, and the resulting chaos ensues a much bigger damage than what came in the missions they've previously pulled off together. While Joss Whedon's \"Age of Ultron\" is as massive as a superhero movie could be, Russo's Civil War is colossal in its own right, maintaining the former's size as it shifts to a more character- driven narrative, with its emotional weight heaviest on Steve Rogers' shoulders. There is a striking hint of effort to not overpopulate the proceedings with relentless chaos and destructions, but the ones inevitably allowed, are delivered in immaculate visual glory, each explosive action set- piece captured with breathtaking panoramic ingenuity. Even with all the intersecting plot lines laid out for every important character of this superhero extravaganza, they all eventually converge at one point, in which Captain Rogers and his connection with Stark, plays a key part. There is a visceral profoundness in how his character is written that finally places him at the center of his own film, and Evans has his commitment fully deployed for the role. And for a film whose own size seems to undermine its very own titular hero, the accomplished feat is truly massive for Captain, himself. A film of this size naturally gets devoured by its very own ambitions. Character-wise, Civil War is as big as the last two Avengers movies. And while Thor and Hulk are both missing in action here, newcomers are welcomed to fill in their shoes. The film facilitates the solid introduction of Chad Boswick's Black Panther, whose stand-alone film is due in 2018. But perhaps, as most people who've seen it, will say, the entry of the amazing web- slinger is the film's most anticipated highlight. Tom Holland's Spider- Man is a breath of fresh air, and it delivers some hope for the character's looming third big screen incarnation, next year. His comic timing may have been at par with that of Paul Rudd's Ant- Man, who shares one of the most genuine fanboy moments in the movie. This lightness comes amid the political tensions and philosophical differences between the opposing forces, one that is utterly missing in DC's Batman v Superman's messed-up attempt to pull off an essentially similar drama, last month."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Marvel Studios",
         "Vita-Ray Dutch Productions (III)",
         "Studio Babelsberg"
      ],
      "summaries": [
         "With many people fearing the actions of super heroes, the government decides to push for the Hero Registration Act, a law that limits a hero's actions. This results in a division in The Avengers. Iron Man stands with this Act, claiming that their actions must be kept in check otherwise cities will continue to be destroyed, but Captain America feels that saving the world is daring enough and that they cannot rely on the government to protect the world. This escalates into an all-out war between Team Iron Man (Iron Man, Black Panther, Vision, Black Widow, War Machine, and Spider-Man) and Team Captain America (Captain America, Bucky Barnes, Falcon, Scarlet Witch, Hawkeye, and Ant Man) while a new villain emerges.",
         "SPOILER: When politicians and world leaders think that people like Captain America and Iron Man are running amok, they tell them they need to be regulated. Tony Stark, Iron Man thinks it's necessary. While Steve Rogers, Captain America doesn't think so. That eventually splits their team, The Avengers. At a UN gathering where the regulations are being worked out, there's an explosion and some people are killed among them is the King of Wakanda. Investigation reveals that the bomb was planted by the Winter Soldier, who is Bucky Barnes, Captain America's friend during the war. Everyone is out to get Barnes and kill him if necessary but Steve wants to get to him first and help him. When he finds him he says he didn't plant the bomb, suddenly another person shows up who's out to get him dressed in black. When security forces catches up to them they are arrested and the one in black is revealed to be the son of the Wakandan King, T'Challa and he is the Black Panther the guardian of Wakanda. While in custody, a psychiatrist is sent to evaluate Bucky but suddenly the power goes out that's when he begins to say some words that have an effect on Bucky. He breaks out and Steve tries to get him. Believing that Bucky is innocent Steve sets out to find the man who got to him. Tony is told that because Steve helped Bucky he is now also wanted. He offers to bring him in so he asks War Machine ,and Black Widow to join him. He recruits someone to help him while Widow offers T'Challa to join them. Steve brings Falcon with him who gets Ant Man and Steve calls Hawkeye who gets Wanda whom tony has under lock and key under the eye of Vision. They get away and Vison joins tony. Eventually they all have a confrontation.",
         "After another international incident involving the Avengers, world leaders and political powers move to get the Avengers to be registered in lieu of previous missions that have caused collateral damage. This results in the Avengers having to decide whether to remain free or to be registered. It also results in two factions with one led by Captain America, who believes that heroes should remain free and the other led by Iron Man, who surprisingly begins supporting government regulation and oversight. And all the while, Cap must try and protect his old friend Bucky from both Tony and the schemes of a new villain who emerges with a plan that could shock the world.",
         "A possible cure for superheroes deeply divides courageous Captain America and arrogant Tony Stark. Factions of superheroes divides themselves in to Team Captain America and Team Stark. Black Widow and Hawekye must choose sides. Plus, Bucky Barnes is possibly behind the murder of King T'Chaka, a member of one of the factions, and T'Challa his son plans to kill him.",
         "After another incident involving the Avengers results in collateral damage, political pressure mounts to install a system of accountability, headed by a governing body to oversee and direct the team. The new status quo fractures the Avengers, resulting in two camps, one led by Steve Rogers and his desire for the Avengers to remain free to defend humanity without government interference, and the other following Tony Stark's surprising decision to support government oversight and accountability.",
         "Political involvement in the Avengers' activities causes a rift between Captain America and Iron Man."
      ],
      "budget": 250000000
   },
   "movielensId": 122920,
   "movielens": {
      "languages": [
         "Română",
         "English",
         "Deutsch",
         "Pусский"
      ],
      "releaseDate": "2016-04-27",
      "dvdReleaseDate": null,
      "directors": [
         "Anthony Russo",
         "Joe Russo"
      ],
      "runtime": 147,
      "movieId": 122920,
      "title": "Captain America: Civil War",
      "mpaa": "PG-13",
      "actors": [
         "Chris Evans",
         "Robert Downey Jr.",
         "Scarlett Johansson",
         "Sebastian Stan",
         "Anthony Mackie",
         "Don Cheadle",
         "Jeremy Renner",
         "Chadwick Boseman",
         "Paul Bettany",
         "Elizabeth Olsen",
         "Paul Rudd",
         "Emily VanCamp",
         "Tom Holland",
         "Frank Grillo",
         "William Hurt",
         "Daniel Brühl",
         "Martin Freeman",
         "John Slattery",
         "Marisa Tomei",
         "Hope Davis",
         "John Kani",
         "Kerry Condon",
         "Gene Farber",
         "Florence Kasumba",
         "Alfre Woodard",
         "Jim Rash",
         "Stan Lee",
         "Joe Russo",
         "Damion Poitier",
         "Michael A. Cook",
         "Laughton Parchment",
         "Jackson Spidell",
         "Yi Long",
         "Heidi Moneymaker",
         "Aaron Toney",
         "Cale Schultz",
         "Ann Russo",
         "Cornell John",
         "Sven Hönig",
         "Joshua Peck",
         "Brent McGee",
         "Be Satrazemis",
         "Blair Jasin",
         "Oli Bigalke",
         "Rafael Banasik",
         "David de Vries",
         "John Curran",
         "Katie Amess",
         "Austin Sanders",
         "Brett Gentile",
         "Matthew Anderson",
         "Andrew Botchwey",
         "Chase Bradfield",
         "Ernest Charles",
         "Hendricks Coates",
         "Ethan Condon",
         "Shen Dynes",
         "Nathaniel Ellis",
         "Jariah Ferguson",
         "Evan Ffrench",
         "Justin Freeman",
         "Ralphael Grand'Pierre",
         "Julian Grimes",
         "Aaron Hayes",
         "Austin Hooper",
         "Amiri Jones",
         "Myles Joseph",
         "Stephen Lewis",
         "Jacob Ludwick",
         "D'Mahrei McRae",
         "Ashwin Mudaliar",
         "Eli Ollinger",
         "Parker Pape",
         "Daniel Parada",
         "Jonah Ruffin",
         "Darryl Sampson",
         "Cameron Sardone",
         "Stanley Sellers",
         "Miles Selles",
         "Jacob Sung",
         "Caden Wilkinson",
         "Kim Scar",
         "Jessica Walther-Gabory",
         "Beniamino Brogi",
         "Silvina Buchbauer",
         "Henry Amadi",
         "Ugochukwu Ani",
         "Michael Anthony Rogers",
         "Umar Khan",
         "David Brown",
         "Guy Fernandez",
         "Sophia Russo",
         "Amelia Morck",
         "Julianna Guill",
         "Surely Alvelo",
         "Brian Schaeffer",
         "Kevin LaRosa Jr.",
         "Al Cerullo",
         "Frédéric North",
         "Ray Sahetapy",
         "Oliver Bigalke",
         "Chris Jai Alex"
      ],
      "imdbMovieId": "3498820",
      "originalTitle": "Captain America: Civil War",
      "genres": [
         "Adventure",
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "dKrVegVI0Us",
         "43NWzay3W4s"
      ],
      "plotSummary": "Following the events of Age of Ultron, the collective governments of the world pass an act designed to regulate all superhuman activity. This polarizes opinion amongst the Avengers, causing two factions to side with Iron Man or Captain America, which causes an epic battle between former allies.",
      "tmdbMovieId": 271110,
      "avgRating": 3.72242,
      "releaseYear": "2016",
      "numRatings": 4876,
      "posterPath": "/kSBXou5Ac7vEqKd97wotJumyJvU.jpg"
   }
}