{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ant",
            "id": 3126
         },
         {
            "name": "shrinking",
            "id": 6380
         },
         {
            "name": "superhero",
            "id": 9715
         },
         {
            "name": "based on comic",
            "id": 9717
         },
         {
            "name": "good vs evil",
            "id": 10842
         },
         {
            "name": "miniaturization",
            "id": 12101
         },
         {
            "name": "miniature people",
            "id": 159075
         },
         {
            "name": "aftercreditsstinger",
            "id": 179430
         },
         {
            "name": "duringcreditsstinger",
            "id": 179431
         },
         {
            "name": "marvel cinematic universe",
            "id": 180547
         },
         {
            "name": "3d",
            "id": 209714
         },
         {
            "name": "special suit",
            "id": 229653
         }
      ],
      "imdb_id": "tt0478970",
      "video": false,
      "title": "Ant-Man",
      "recommendations": [
         99861,
         100402,
         76338,
         166424,
         271110,
         177677,
         127585,
         102382,
         207703,
         87101,
         135397,
         1771,
         158852,
         246655,
         257344,
         118340,
         98566,
         10195,
         209112,
         137113
      ],
      "backdrop_path": "/kvXLZqY0Ngl1XSw7EaMQO0C1CCj.jpg",
      "revenue": 519311965,
      "reviews": [
         {
            "author": "owen333",
            "id": "55d5a00792514102cf0041f2",
            "content": "I loved it it was so much fun and very funny, another marvel masterpiece",
            "url": "https://www.themoviedb.org/review/55d5a00792514102cf0041f2"
         },
         {
            "author": "Frank Ochieng",
            "id": "56207bd192514171cb006642",
            "content": "When one thinks of a typical super-hero actioner, they imagine the boisterous boundaries that are associated with such an explosive genre: eye-popping special effects, outlandish and grand-standing villains, world domination escapades, complex yet flashy super-heroes that seem unreal and unapologetic and a big scale of unbelievable escapism that is tellingly becoming of a comic book epic on the big screen for the hungry eyes of the giddy moviegoer. Remember, all these described elements are not a bad thing when it comes to larger than life comic book/superhero fantasies. In fact, we almost insist that our volt-minded vehicles have some kinetic kick to its pulsating, pithy adventures. After all, there is certainly nothing wrong with that approach to the cinematic sensationalism of summertime popcorn pleasers and the costumed heroes that take us on that daring, rollicking ride of magical mayhem.\r\n\r\nHowever, director Peyton Reed’s ‘Ant-Man’ symbolizes a different texture and tone to the familiar action-packed world of Marvel Comics’ outrageous universe both on the printed pages and in the dark movie theaters. It does not necessarily use the overwrought or ultra-stimulating tactics to sell its percolating product as a super-charged heroic fable of mighty manipulators out to save the planet in the tradition of frantic favorites such as ‘The Avengers’ film franchise for instance. Instead, ‘Ant-Man’ relies on its small and intimate take of quirkiness, introspection, a gentle doomsday message of despair and a measurement of an awkward man that wears his bugged-out wardrobe with a sense of curiosity and conviction. In essence, ‘Ant-Man’ is a costumed caper that is high-spirited in its low-key excitement…something quite refreshing and revered in the wild and wacky world of Marvel Comics’ representation of the super-studs and sasses that invade our cinematic sensibilities in the hazy days of summer.\r\n\r\n‘Ant-Man’ lead Paul Rudd, an affable actor that has shown various levels of competence in both comedies and dramas over the years, is the unlikely source to don an ant-oriented attire and let his charm and cheekiness take over as the tiny bugged-eyed avenger of right and might. Rudd plays Scott Lang, a former troubled lawbreaker and gifted engineer whose demons come back to haunt him when he gets involved in the burglary shenanigans with his bad news buddies (T.I. and Michael Pena). The reason for Lang’s lure back to crime: a cockeyed but convenient way to win over the affections of his estranged young daughter.\r\n\r\nInterestingly, another great analytical mind of mechanics and science in stand-offish Hank Pym (Oscar-winner Michael Douglas) is spotlighted as he too struggles to relate to his daughter as well in the pretty Hope Van Dyne (Evangeline Lilly). Anyhow, Pym has a colorful backstory as it is revealed that he used to save the world from harm as the underrated crime-fighter Ant-Man. There was no glory or special recognition for Pym’s heroics as the buggy super-hero but his devotion to his crime-stopping craft was realized nevertheless.\r\n\r\nAs ANT-MAN Paul Rudd's Scott Lang has plans to stop the criminnal foolishness besides raiding a giant-sized picnic basket in Peyton Reed's modest costume caper.\r\nAs ANT-MAN Paul Rudd’s Scott Lang has plans to stop the criminal foolishness besides raiding a giant-sized picnic basket in Peyton Reed’s modest costume caper.\r\nThe conflicted father-daughter tandem of Pym and Hope eventually recruit the beleaguered Lang to climb into the exo-skeletal red-and-black suit and become the current Ant-Man to continue the mission of promoting goodness over evil. In this specific case, Lang’s Ant-Man is asked to foil the nefarious agenda of Pym’s former protege and associate Darren Cross (Corey Stoll) who threatens to expose the revolutionary shrinking technology to anyone sinister that offers him an insane and immediate price for such secretive scientific information that could jeopardize mankind in the long run. Of course, it goes without saying, that Cross has an ominous alter-ego in the vile Yellowjacket whose back-and-forth clashing with Lang’s Ant-Man leads to the calculating and corrosive chess game of one skillful insidious insect trying to outwit and outmaneuver a conscientious one.\r\n\r\nSome may dismiss ‘Ant-Man’ as being too low-grade, cheesy and incidental in its confrontational canvas of saints versus sinners. Still, Reed’s handling of his Marvel-inspired ‘battle of the bugs’ is a winning formula in simplicity because it does not have to be rooted in a spectacular and showy landscape as the other successful bombastic blockbusters that come out of the frivolous factory of Hollywood. Essentially, ‘Ant-Man’ demonstrates the right kind of personality and prestige for its presentation as a scaled-down comic book actioner steeped in the personalized disillusionment of the characterizations and their assorted psyches. Sure, ‘Ant-Man’ will not let anyone forget its popular competitor in the much glorified and iconic standing of another insect-fighting Marvel mastermind in ‘Spider-Ma’n anytime soon. Yet Scott Lang’s Ant-Man is just as angst-ridden, impish, awkward and devoted as Peter Parker’s resilient web-headed wonder Spidey.   \r\n\r\nThe drama unfolds so convincingly in ‘Ant-Man’ not so much because of the dire dilemma of comicbook goodness and badness but because of the examination of deteriorating relations between broken men and their families or more specifically between fathers and daughters. Both Rudd and Douglas are committed to their roles as the Ant-Men that saved the world with ease past and present but could not say the same thing about rescuing the domestic responsibilities that eluded them under their own roofs. As Lang tries to find an opening for forgiveness toward his little girl and remarried ex-wife (Judy Greer), his current adviser Pym struggles to put the pieces together with a disgruntled Hope that blames her father for the neglect of her well-being as well as the death of her beloved late mother known as the Wasp, a super-heroine that shined in her own shadow of accomplishment.\r\n\r\n‘Ant-Man’ is a soulfully weird, witty sliced-down spectacle of a comicbook film that is rare in its skin to deliver the message of a connection not just to stamping out the cartoonish crime and chaos that is routinely found in the playful playground of Marvel’s movie machine of high-powered personalities armed with skillful brute and brilliance. It also has something called heart and hope as it tackles the alienation and isolation of fathers and their vulnerable daughters. It will take more than a gigantic can of Raid to destroy the indomitable presence of ‘Ant-Man’ and what his hedonistic heroics, both physical and psychological, bring to the prized picnic table.\r\n\r\nAnt-Man (2015)\r\n\r\nWalt Disney Studios\r\n\r\n1 hr. 57 mins.\r\n\r\nStarring: Paul Rudd, Michael Douglas, Evangeline Lilly, Crey Stall, Michael Pena, Tip “T.I.” Harris, Judy Greer, Bobby Cannavale, Wood Harris and Abby Ryder Fortson\r\n\r\nDirected by: Peyton Reed\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Comic Book Fantasy, Super-heroes, Action and Adventure\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)",
            "url": "https://www.themoviedb.org/review/56207bd192514171cb006642"
         },
         {
            "author": "John Chard",
            "id": "566befe49251412dbc0029c4",
            "content": "The Pocket Rocket.\r\n\r\nGiven the production problems and its long gestation period, Ant-Man is arguably far better than it had right to be. Unsurprisingly with a Marvel Super Hero film, the critical reactions have been mixed, but given it's not as gargantuan as most Marvel pics it proves to have a big entertaining heart. A pic cunningly viewing the Marvel Universe from a different angle, whilst also not over egging the pudding.\r\n\r\nThe effects work is impressive, the origin story narrative engrossing and with it carrying a lightness of touch, and there's a very enjoyable cast enthusiastically buying into the comic book frivolity. Sure, some of it's just plain daft, our hero's powers are hardly blunderbuss stuff, while the family melodramas bubbling away feel tired, but come the glorious finale, pandering to the child in us all, it's another Marvel winner readying itself for further adventures of Ant-Man. 7.5/10",
            "url": "https://www.themoviedb.org/review/566befe49251412dbc0029c4"
         },
         {
            "author": "Reno",
            "id": "566ee3b4925141664f00f834",
            "content": "> Size doesn't matter if he's a superhero who committed to save the world.\r\n\r\nMy confession is I never read 'Ant-man' comics and I never knew such kind of superhero even exist in Marvel till this movie was announced. (But I know Danish film 'Antboy'.) So I'm glad they brought cinematic version of 'Ant-man' and I'm sure he'll return to the next 'Avengers' as they promoted strongly in this film itself to know what would be the audience response. I don't know others, but I definitely welcome the idea.\r\n\r\nAnother CGI magic, another Marvel's wonder. As long as they pick the right cast and crew with a good story, the sci-fi like this continues to rule the cinema world. It was a great team work, that must be appreciated. As usual the top notch visuals as well the performances, even the sidekicks. But I was surprised to see when Paul Rudd was attached to this project. I believed it would be a comedy sci-fi packed with full of action, and I was wrong. It was a simple tale, a heist theme and of course it was fun to watch, but never was a comedy movie.\r\n\r\nA wonderful beginning, especially for the first film in the series. You know strong foundation is the key to raise a building above. I know the sequels would only get better by progressing and it should be. Because in all the Marvel's superhero flicks, this one was the most family and young kids friendly. That does not mean there were no violence, but from the title to the characters and presentation, all were so casual and can be understood by all.\r\n\r\nIt was so great to see a legend like Michael Douglas to be a part in the modern movie. Now I am eager to see Evangeline Lily as Wasp-girl in the follow-up. It would be like Peter Pan and Tinker Bell, but in a sci-fi version. The extras were very interesting, I enjoyed them as well. If you're are yet to see the film, don't expect anything like Disney's 'Honey' trilogy, after all, if you enjoy the Marvel Cinematic Universe (MCU) then you would do same for it which is the twelfth to follow.\r\n\r\n7.5/10",
            "url": "https://www.themoviedb.org/review/566ee3b4925141664f00f834"
         },
         {
            "author": "mattwilde123",
            "id": "58c16f88c3a36825db00a955",
            "content": "I like Paul Rudd and was hoping this would be as funny as 'The Guardians of the Galaxy' but it wasn't. It looked good and the direction was solid but I think it suffered from the constant screenplay rewrites that the film underwent by changing the screenwriters (Edgar Wright and Joe Cornish).\r\n\r\nI also felt it was a bit too long-winded and it was unbalanced. However, the main good feature in this film was the special effects.\r\n\r\n★★★",
            "url": "https://www.themoviedb.org/review/58c16f88c3a36825db00a955"
         },
         {
            "author": "Per Gunnar Jonsson",
            "id": "5a797cd1c3a368224e01f813",
            "content": "I have to say that I did not have great hopes for this movie. However, I found it surprisingly enjoyable. As can be expected from a Marvel super hero movie it is not the most intelligent plot around but instead rather heavy on special effects.\r\n\r\nHaving said that the plot is not bad given the context. I have never read any of the Ant-Man comics so I had no idea what to expect. The little expectation I had was of some guy turning into some ant like creature smashing things left right and center. So it was somewhat of a surprise to me when I found out that the guy was actually shrinking himself to ant size. Actually I went a bit “what the f…” when I first realized this and felt that this was going to be boring.\r\n\r\nHowever, in the end, I felt it worked out quite well. If it would have just been about some guy shrinking himself then it would indeed have been somewhat boring but the added coolness of this guy being able to command armies of bad-ass ants really helped stave of the boredom.\r\n\r\nAs I wrote above it is a Marvel super hero movie so it is heavy on special effects and, personally, I felt they where quite okay. There is of course quite a bit of action in the movie as well as a bit of humour. I quite liked the parts where the Ant-Man and his nemesis slugged it out in a children’s room and a giant size Thomas the Tank Engine was thrown through the roof and into the garden. Maybe I liked it because Thomas the Tank Engine is a TV show that my kids liked to watch when they were smaller. There where of course a few of the usual Hollywood silly, brain-dead stunts like the tank scene. It could have been so cool but it was really ruined by the total lack of intelligence in the stunt following the cool revelation.\r\n\r\nI really liked Michael Douglas as Dr. Hank Pym as well as Evangeline Lilly as Hope Van Dyne. I was not too impressed by Paul Rudd but on the while I guess he was not too bad. It is a bit of a shame though that when Hollywood feels they need to throw in a bit of family drama they always have to throw in a divorce. It is rather depressing for us that have lived through such a tragedy after all.\r\n\r\nBottom line, this was a surprisingly enjoyable movie. Far better than quite a few of the super hero movies that Marvel/Hollywood have produced like for instance the abysmal Spiderman movies although that is of course a personal opinion.",
            "url": "https://www.themoviedb.org/review/5a797cd1c3a368224e01f813"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 205,
               "character": "Scott Lang / Ant-Man",
               "gender": 2,
               "credit_id": "56637296c3a3682bde004f8b",
               "name": "Paul Rudd",
               "profile_path": "/8eTtJ7XVXY0BnEeUaSiTAraTIXd.jpg",
               "id": 22226,
               "order": 0
            },
            {
               "cast_id": 206,
               "character": "Dr. Hank Pym",
               "gender": 2,
               "credit_id": "566372adc3a3682bcd005339",
               "name": "Майкл Дуглас",
               "profile_path": "/nmlitv4g2jXO3sJrnA9g980j2uc.jpg",
               "id": 3392,
               "order": 1
            },
            {
               "cast_id": 207,
               "character": "Hope van Dyne",
               "gender": 1,
               "credit_id": "566372c09251412ad5005340",
               "name": "Evangeline Lilly",
               "profile_path": "/h8Lerr3D362n1jZvywtbvUzgBIN.jpg",
               "id": 19034,
               "order": 2
            },
            {
               "cast_id": 208,
               "character": "Darren Cross / Yellowjacket",
               "gender": 2,
               "credit_id": "566373b79251412ac4005460",
               "name": "Corey Stoll",
               "profile_path": "/yhMa3nzOsxQYSLr51OcvCsrovFa.jpg",
               "id": 74541,
               "order": 3
            },
            {
               "cast_id": 209,
               "character": "Paxton",
               "gender": 2,
               "credit_id": "566373e9c3a3682c01005473",
               "name": "Bobby Cannavale",
               "profile_path": "/o3xnmePoOUCw7sjoZ4xM4W5DL26.jpg",
               "id": 21127,
               "order": 4
            },
            {
               "cast_id": 212,
               "character": "Luis",
               "gender": 2,
               "credit_id": "566374859251412ad900571c",
               "name": "Michael Peña",
               "profile_path": "/oqlIKSglghuX7kSTalODn71nlOd.jpg",
               "id": 454,
               "order": 5
            },
            {
               "cast_id": 214,
               "character": "Dave",
               "gender": 2,
               "credit_id": "566374b59251412ad9005724",
               "name": "T.I.",
               "profile_path": "/ycNO8wU6H75wDDfojMCTjoxtEmt.jpg",
               "id": 76126,
               "order": 6
            },
            {
               "cast_id": 210,
               "character": "Sam Wilson / Falcon",
               "gender": 2,
               "credit_id": "566373fcc3a3682be9005901",
               "name": "Anthony Mackie",
               "profile_path": "/5VGGJ0Co8SC94iiedWb2o3C36T.jpg",
               "id": 53650,
               "order": 7
            },
            {
               "cast_id": 215,
               "character": "Gale",
               "gender": 2,
               "credit_id": "566374e1c3a3682c010054be",
               "name": "Wood Harris",
               "profile_path": "/u88haG6iG7zwV0PTk9tSG5obaeP.jpg",
               "id": 65829,
               "order": 8
            },
            {
               "cast_id": 211,
               "character": "Maggie Lang",
               "gender": 1,
               "credit_id": "5663740d9251412ac600531e",
               "name": "Judy Greer",
               "profile_path": "/ooEejsGv4loFIKnbe2arzOwWy6H.jpg",
               "id": 20750,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Cassie Lang",
               "gender": 0,
               "credit_id": "54067b0e0e0a26373000060b",
               "name": "Abby Ryder Fortson",
               "profile_path": "/zqHdCFKHBNKeWmEbR1bRyDxCPHm.jpg",
               "id": 1360010,
               "order": 10
            },
            {
               "cast_id": 213,
               "character": "Kurt",
               "gender": 2,
               "credit_id": "5663749a9251412acd00541f",
               "name": "David Dastmalchian",
               "profile_path": "/3cdrnfthY40ZsIhq1FBEwGJq9mE.jpg",
               "id": 83854,
               "order": 11
            },
            {
               "cast_id": 39,
               "character": "Mitchell Carson",
               "gender": 2,
               "credit_id": "55261ce7c3a3687e11003918",
               "name": "Martin Donovan",
               "profile_path": "/bNS43B8maD5A4UYSWy4UjgHru1a.jpg",
               "id": 42993,
               "order": 12
            },
            {
               "cast_id": 38,
               "character": "Peggy Carter",
               "gender": 1,
               "credit_id": "55261cb49251415c7c00dbec",
               "name": "Hayley Atwell",
               "profile_path": "/mUp8PkCiIvtiFb4tOzMVtowEJBt.jpg",
               "id": 39459,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Howard Stark",
               "gender": 2,
               "credit_id": "54067af10e0a263730000600",
               "name": "John Slattery",
               "profile_path": "/53hxIYkC93E1FEkqOvAHRgRIxXX.jpg",
               "id": 21134,
               "order": 14
            },
            {
               "cast_id": 53,
               "character": "Car Driver",
               "gender": 2,
               "credit_id": "55e513a692514137a6000c1d",
               "name": "Garrett Morris",
               "profile_path": "/2Sd1njRdKzWEHNY2AqFZGTv1xtT.jpg",
               "id": 83187,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Dale",
               "gender": 0,
               "credit_id": "54067b210e0a26372a0005fb",
               "name": "Gregg Turkington",
               "profile_path": "/1NjhOtLud39grRV5EXWtVEEPn73.jpg",
               "id": 1224999,
               "order": 16
            },
            {
               "cast_id": 54,
               "character": "Hydra Buyer",
               "gender": 0,
               "credit_id": "55e513a6c3a36813f6000ab7",
               "name": "Rod Hallett",
               "profile_path": "/ucW4QgVp5pdBZwNe4hJCkGPeTa2.jpg",
               "id": 1220103,
               "order": 17
            },
            {
               "cast_id": 98,
               "character": "Frank",
               "gender": 2,
               "credit_id": "560e6d749251415e53000271",
               "name": "Joe Chrest",
               "profile_path": "/fVaVq1UetdXuWyCHeiLsi0704Qg.jpg",
               "id": 141762,
               "order": 18
            },
            {
               "cast_id": 56,
               "character": "Buyer",
               "gender": 2,
               "credit_id": "55e513a7c3a36813ed000d33",
               "name": "Joe Bucaro III",
               "profile_path": "/6hspwgnTwEtz7tkAQQCHLPMAEBS.jpg",
               "id": 51302,
               "order": 19
            },
            {
               "cast_id": 57,
               "character": "Buyer",
               "gender": 1,
               "credit_id": "55e513a792514137a2000bef",
               "name": "Jean Louisa Kelly",
               "profile_path": "/mJJltLZRxaoMoMVpGvJXPqZE9b4.jpg",
               "id": 26495,
               "order": 20
            },
            {
               "cast_id": 58,
               "character": "Young Pym",
               "gender": 0,
               "credit_id": "55e513a79251413797000c08",
               "name": "Dax Griffin",
               "profile_path": "/v1Ih71brZMwm1zLkqVZGwPjgXwr.jpg",
               "id": 1224311,
               "order": 21
            },
            {
               "cast_id": 52,
               "character": "Janet van Dyne / The Wasp",
               "gender": 1,
               "credit_id": "55aa058ac3a3682ff40059a9",
               "name": "Hayley Lovitt",
               "profile_path": "/fbUxeHxXjFebcdpj4HqjvarZQbr.jpg",
               "id": 1156046,
               "order": 22
            },
            {
               "cast_id": 59,
               "character": "Spanish Woman",
               "gender": 0,
               "credit_id": "55e513a892514137a8000c17",
               "name": "Norma Alvarez",
               "profile_path": "/rt4lpJp4tLLwikGGHDDPzdsfbCN.jpg",
               "id": 1181556,
               "order": 23
            },
            {
               "cast_id": 60,
               "character": "Young Daughter",
               "gender": 0,
               "credit_id": "55e513a8c3a36813f8000c43",
               "name": "Darcie Isabella Cottrell",
               "profile_path": "/jgHNQLwe5bqMItWhk7lruEBngNe.jpg",
               "id": 1502943,
               "order": 24
            },
            {
               "cast_id": 61,
               "character": "Raver",
               "gender": 0,
               "credit_id": "55e513a89251413797000c0b",
               "name": "Teddy Williams",
               "profile_path": "/8lWvmzAzCCSGaevoFKSGsl4Svfe.jpg",
               "id": 1502944,
               "order": 25
            },
            {
               "cast_id": 62,
               "character": "Raver",
               "gender": 0,
               "credit_id": "55e513a8c3a36813f8000c48",
               "name": "Carol Anne Watts",
               "profile_path": "/yhPifdQqcMjip5VhB5OZwYh4iAP.jpg",
               "id": 1382011,
               "order": 26
            },
            {
               "cast_id": 63,
               "character": "Raver",
               "gender": 2,
               "credit_id": "55e513a99251413797000c10",
               "name": "Chuck David Willis",
               "profile_path": "/1rho9Ya4L28UydCigYJrHee1uAa.jpg",
               "id": 1502945,
               "order": 27
            },
            {
               "cast_id": 64,
               "character": "Raver",
               "gender": 0,
               "credit_id": "55e513a9c3a36813f6000aba",
               "name": "Diana Chiritescu",
               "profile_path": "/t1eg2bsoOHmPMsNCeWIzQ3nys9C.jpg",
               "id": 1502946,
               "order": 28
            },
            {
               "cast_id": 65,
               "character": "Pool BBQ Dad",
               "gender": 0,
               "credit_id": "55e513a992514137a0000c9f",
               "name": "Neko Parham",
               "profile_path": "/1PNmRyKnFF05DX0nUFzPu3GRW0H.jpg",
               "id": 112546,
               "order": 29
            },
            {
               "cast_id": 66,
               "character": "Pool BBQ Mom",
               "gender": 1,
               "credit_id": "55e513aac3a36813f8000c4a",
               "name": "Onira Tares",
               "profile_path": "/h77ovlJj18n1BDaOvTBY6gDr5T6.jpg",
               "id": 971519,
               "order": 30
            },
            {
               "cast_id": 67,
               "character": "Pool BBQ Kid",
               "gender": 2,
               "credit_id": "55e513aa92514137a2000bf2",
               "name": "Kylen Davis",
               "profile_path": "/z5qyRfIdhr5D5KQGV8XQVdvJRLZ.jpg",
               "id": 1502947,
               "order": 31
            },
            {
               "cast_id": 68,
               "character": "Pool BBQ Kid",
               "gender": 0,
               "credit_id": "55e513aac3a36813eb000c0e",
               "name": "Zamani Wilder",
               "profile_path": "/4mgBgxgfgvSXlHdRqumrhRC7J74.jpg",
               "id": 1502948,
               "order": 32
            },
            {
               "cast_id": 69,
               "character": "Pym Tech Gate Guard",
               "gender": 0,
               "credit_id": "55e513abc3a3681405000c80",
               "name": "Jim R. Coleman",
               "profile_path": "/hXVUwGegUIb7zpnbTPdtZD5dbq4.jpg",
               "id": 78885,
               "order": 33
            },
            {
               "cast_id": 70,
               "character": "Pym Tech Security Guard",
               "gender": 0,
               "credit_id": "55e513abc3a3681405000c82",
               "name": "Desmond Phillips",
               "profile_path": "/5lyZ3OIHBaivlJB8ce4DGxXN4Xd.jpg",
               "id": 558899,
               "order": 34
            },
            {
               "cast_id": 71,
               "character": "PYM Tech Security Guard",
               "gender": 0,
               "credit_id": "55e513abc3a36813eb000c12",
               "name": "Aaron Saxton",
               "profile_path": "/d6oWf1VyXQr0nfeycQAyi0BV6bG.jpg",
               "id": 1187061,
               "order": 35
            },
            {
               "cast_id": 72,
               "character": "EMT",
               "gender": 0,
               "credit_id": "55e513ac925141379d000c1e",
               "name": "Michael A. Cook",
               "profile_path": "/rBqNliXPfqvnNyPZsCCcDrm5YgA.jpg",
               "id": 1502949,
               "order": 36
            },
            {
               "cast_id": 73,
               "character": "Gorgeous Blonde",
               "gender": 0,
               "credit_id": "55e513ac92514137a8000c1b",
               "name": "Ricki Lander",
               "profile_path": "/9B9h9aK16tZpbdDIH1XJR62o5Ls.jpg",
               "id": 210842,
               "order": 37
            },
            {
               "cast_id": 74,
               "character": "Superior Officer",
               "gender": 2,
               "credit_id": "55e513ac925141379d000c22",
               "name": "Rus Blackwell",
               "profile_path": "/xYMkiZQuoramEeabUPnrtiS19vn.jpg",
               "id": 52483,
               "order": 38
            },
            {
               "cast_id": 75,
               "character": "Ice Cream Store Customer",
               "gender": 2,
               "credit_id": "55e513acc3a36813f2000cc2",
               "name": "Johnny Pemberton",
               "profile_path": "/lV9UognW1VG8P8nESSrArveBRou.jpg",
               "id": 1060081,
               "order": 39
            },
            {
               "cast_id": 76,
               "character": "Ernesto",
               "gender": 0,
               "credit_id": "55e513ad92514137a2000bf8",
               "name": "Nicholas Barrera",
               "profile_path": "/degXHRzE9L9VvAc6KIHUdOW7mzk.jpg",
               "id": 1502950,
               "order": 40
            },
            {
               "cast_id": 77,
               "character": "Carlos",
               "gender": 0,
               "credit_id": "55e513adc3a3681405000c85",
               "name": "Carlos Aviles",
               "profile_path": "/pAbilV8zlEVKuuDwecFbY5DTOU4.jpg",
               "id": 1502951,
               "order": 41
            },
            {
               "cast_id": 78,
               "character": "Emily",
               "gender": 0,
               "credit_id": "55e513ad92514137a8000c1e",
               "name": "Lyndsi LaRose",
               "profile_path": "/mhJGbE3I6RuWbRrNMyhqqGS9I9F.jpg",
               "id": 1502952,
               "order": 42
            },
            {
               "cast_id": 79,
               "character": "Peachy",
               "gender": 0,
               "credit_id": "55e513aec3a36813f6000ac2",
               "name": "Robert Crayton",
               "profile_path": "/mOdSrdMT4jTxsVKy5XDgPuyxXRS.jpg",
               "id": 1502953,
               "order": 43
            },
            {
               "cast_id": 80,
               "character": "Cop on Speaker",
               "gender": 2,
               "credit_id": "55e513ae9251413797000c14",
               "name": "Ajani Perkins",
               "profile_path": "/nXnvNhRDclhefIQcXYQHKF1ahqg.jpg",
               "id": 1209727,
               "order": 44
            },
            {
               "cast_id": 81,
               "character": "Alpha Guard",
               "gender": 0,
               "credit_id": "55e513aec3a3681405000c89",
               "name": "Jessejames Locorriere",
               "profile_path": "/nr2L55uNQGt1OXaNVVAzDo5f1LM.jpg",
               "id": 1363395,
               "order": 45
            },
            {
               "cast_id": 82,
               "character": "Beta Guard",
               "gender": 2,
               "credit_id": "55e513ae92514137a8000c22",
               "name": "Zack Duhame",
               "profile_path": "/vewRMKCtxTL0x3HlG3bKZMm6KpU.jpg",
               "id": 186573,
               "order": 46
            },
            {
               "cast_id": 83,
               "character": "Vault Guard",
               "gender": 0,
               "credit_id": "55e513afc3a36813f2000cc5",
               "name": "Kevin Lacz",
               "profile_path": "/pC5eRbhV98XK7PwvonmQAOwoKrv.jpg",
               "id": 1502954,
               "order": 47
            },
            {
               "cast_id": 84,
               "character": "Vault Guard",
               "gender": 0,
               "credit_id": "55e513af92514137a8000c25",
               "name": "Michael Trisler",
               "profile_path": "/ftPncRfoxIUV0hBRKZiSTUY9DD7.jpg",
               "id": 1502955,
               "order": 48
            },
            {
               "cast_id": 85,
               "character": "Armed Guard",
               "gender": 0,
               "credit_id": "55e513afc3a36813eb000c15",
               "name": "Daniel Stevens",
               "profile_path": "/zKtQEnb1eeoUAcwpLsEvUQzTTLc.jpg",
               "id": 1502956,
               "order": 49
            },
            {
               "cast_id": 86,
               "character": "Armed Guard",
               "gender": 0,
               "credit_id": "55e513b0925141379a000cb8",
               "name": "Alex Chansky",
               "profile_path": "/pQ14iXudDp0wnwmB0HdkVA8kgcp.jpg",
               "id": 1502957,
               "order": 50
            },
            {
               "cast_id": 87,
               "character": "Armed Guard",
               "gender": 0,
               "credit_id": "55e513b0c3a36813eb000c1a",
               "name": "Clay Donahue Fontenot",
               "profile_path": "/ykNZqTr6pyoOWdyzdu2Vm59p4fY.jpg",
               "id": 1291797,
               "order": 51
            },
            {
               "cast_id": 88,
               "character": "Armed Guard",
               "gender": 0,
               "credit_id": "55e513b0925141379a000cbc",
               "name": "Michael Jamorski",
               "profile_path": "/fEnbVirPnfNqgGBQSqr57Q5FoQH.jpg",
               "id": 1463672,
               "order": 52
            },
            {
               "cast_id": 89,
               "character": "Armed Guard",
               "gender": 0,
               "credit_id": "55e513b1c3a36813ed000d3c",
               "name": "Casey Pieretti",
               "profile_path": "/dXqVwGShNA9j72ZUJbDZGZLDMb7.jpg",
               "id": 1502958,
               "order": 53
            },
            {
               "cast_id": 90,
               "character": "Lab Guard",
               "gender": 2,
               "credit_id": "55e513b19251413794000b80",
               "name": "Antal Kalik",
               "profile_path": "/pHPdailHD0IsNg5YpuLNLEaCYsc.jpg",
               "id": 210312,
               "order": 54
            },
            {
               "cast_id": 91,
               "character": "Lab Guard",
               "gender": 2,
               "credit_id": "55e5143cc3a36813ed000d5d",
               "name": "Adam Hart",
               "profile_path": "/dEBsG7444cq5DjKv4UBCvZMOso4.jpg",
               "id": 1445583,
               "order": 55
            },
            {
               "cast_id": 92,
               "character": "Lab Guard",
               "gender": 0,
               "credit_id": "55e515ad9251413794000bde",
               "name": "Reuben Langdon",
               "profile_path": "/oppPILAmMxJjpP1RBCBd7lfqsaN.jpg",
               "id": 237163,
               "order": 56
            },
            {
               "cast_id": 231,
               "character": "Lab Guard",
               "gender": 0,
               "credit_id": "566457519251412ad9008aa0",
               "name": "Todd Schneider",
               "profile_path": "/gxIknBsdSrnIALdeyszQlNAIlpf.jpg",
               "id": 1545551,
               "order": 57
            },
            {
               "cast_id": 94,
               "character": "Lab Tech",
               "gender": 0,
               "credit_id": "55e51628c3a36813eb000c93",
               "name": "Kevin Buttimer",
               "profile_path": "/iL8cSJ3WuOOpXvxQqg7qZ9yiyDQ.jpg",
               "id": 1502963,
               "order": 58
            },
            {
               "cast_id": 96,
               "character": "Ignacio",
               "gender": 0,
               "credit_id": "55e5174992514137a2000c8f",
               "name": "Danny Vasquez",
               "profile_path": "/8OE39x0PG8Sd8pdpC0agOuWagWl.jpg",
               "id": 549524,
               "order": 59
            },
            {
               "cast_id": 95,
               "character": "Writer",
               "gender": 1,
               "credit_id": "55e516f4c3a36813f8000cfd",
               "name": "Anna Akana",
               "profile_path": "/jktW4VOgSKnIOmRIopjB1XDmp3b.jpg",
               "id": 1267375,
               "order": 60
            },
            {
               "cast_id": 47,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "55552ea59251411e570008ba",
               "name": "Stan Lee",
               "profile_path": "/dTr2gJPL7jELKVkcjtoNx80uVKR.jpg",
               "id": 7624,
               "order": 61
            },
            {
               "cast_id": 97,
               "character": "Hideous Rabbit (voice)",
               "gender": 2,
               "credit_id": "55e51749c3a36813ed000dfd",
               "name": "Tom Kenny",
               "profile_path": "/uU2VLWHkKZN0UkYVJBf1s1z2l3k.jpg",
               "id": 78798,
               "order": 62
            },
            {
               "cast_id": 232,
               "character": "Helicopter Pilot",
               "gender": 2,
               "credit_id": "566457519251412d7b00873a",
               "name": "Rick Avery",
               "profile_path": "/rXar2OrwkorJyQ9dRGf18zUEByW.jpg",
               "id": 81687,
               "order": 63
            },
            {
               "cast_id": 233,
               "character": "Helicopter Pilot",
               "gender": 0,
               "credit_id": "56645752c3a3682bcd008470",
               "name": "Erik Betts",
               "profile_path": "/pG5LiannuUgZQLAd47iOnRkMIEC.jpg",
               "id": 1348580,
               "order": 64
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5640f5db92514176b8000652",
               "name": "Joe Cornish",
               "profile_path": "/hVISeuZZwCwSol9tKz9hKL1zCzx.jpg",
               "id": 155531,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5393496ec3a368642b00191d",
               "name": "Peyton Reed",
               "profile_path": "/oSIfCq3alHGQnrutnwDzEcFmGgu.jpg",
               "id": 59026,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "553a0fedc3a36831dd0098bc",
               "name": "Adam McKay",
               "profile_path": "/pwc6pHC5d3y8NVsphURkKK8y2fL.jpg",
               "id": 55710,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5640f6c6c3a36815020006e7",
               "name": "Dan Lebental",
               "profile_path": null,
               "id": 11455,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfc403c3a3683d46009cce",
               "name": "Leo Birenberg",
               "profile_path": null,
               "id": 1272997,
               "department": "Crew",
               "job": "Additional Music"
            },
            {
               "gender": 2,
               "credit_id": "54067b8a0e0a2637370005fe",
               "name": "Louis D'Esposito",
               "profile_path": "/pNvtXPy8kil9WWFtySahnNbvc3R.jpg",
               "id": 57027,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54067b970e0a263724000662",
               "name": "Kevin Feige",
               "profile_path": "/AewbqQQT0FbcE358rcbopZ3zgDV.jpg",
               "id": 10850,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54067ba70e0a2637330005bb",
               "name": "Alan Fine",
               "profile_path": "/7Ntt3WWg25ivLT8Os3LeZW1WxIC.jpg",
               "id": 113672,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54067bb30e0a263730000626",
               "name": "Stan Lee",
               "profile_path": "/dTr2gJPL7jELKVkcjtoNx80uVKR.jpg",
               "id": 7624,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "553a0fd6c3a36831dd0098b7",
               "name": "Edgar Wright",
               "profile_path": "/912vB9enhaErCSMpJpyWAB4yOOH.jpg",
               "id": 11090,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "553a0fde92514138a9004114",
               "name": "Joe Cornish",
               "profile_path": "/hVISeuZZwCwSol9tKz9hKL1zCzx.jpg",
               "id": 155531,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5640f636c3a36814dd0006af",
               "name": "Stan Lee",
               "profile_path": "/dTr2gJPL7jELKVkcjtoNx80uVKR.jpg",
               "id": 7624,
               "department": "Writing",
               "job": "Comic Book"
            },
            {
               "gender": 2,
               "credit_id": "5640f66492514176c10006c6",
               "name": "Jack Kirby",
               "profile_path": "/xLVSa7mX1BCyVoKD2wyRGEQXj8M.jpg",
               "id": 18866,
               "department": "Writing",
               "job": "Comic Book"
            },
            {
               "gender": 2,
               "credit_id": "5640f68492514176c4000693",
               "name": "Larry Lieber",
               "profile_path": "/6zFjMrk50yZri9KiVqli477gWYB.jpg",
               "id": 18876,
               "department": "Writing",
               "job": "Comic Book"
            },
            {
               "gender": 0,
               "credit_id": "5640f753c3a36814d6000603",
               "name": "Shepherd Frankel",
               "profile_path": "/baixwjPAPDxdvpr1FLxOTsRVgtt.jpg",
               "id": 7234,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "553a0ff8c3a3681be40064d6",
               "name": "Paul Rudd",
               "profile_path": "/8eTtJ7XVXY0BnEeUaSiTAraTIXd.jpg",
               "id": 22226,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5640f5c592514176c10006a4",
               "name": "Edgar Wright",
               "profile_path": "/912vB9enhaErCSMpJpyWAB4yOOH.jpg",
               "id": 11090,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5640f6b792514176bd0005d8",
               "name": "Colby Parker Jr.",
               "profile_path": null,
               "id": 18617,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfbc0d9251415e3c00a28e",
               "name": "Ross Newton",
               "profile_path": null,
               "id": 1787832,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 2,
               "credit_id": "5640f15ec3a36814d300052a",
               "name": "Christophe Beck",
               "profile_path": "/2fnJUmCk6IEpVIptpYaUk31epHx.jpg",
               "id": 23486,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5640f24c92514176c700056d",
               "name": "Russell Carpenter",
               "profile_path": "/zhcM8RBTC8goTfJT3TbraeO1x5n.jpg",
               "id": 8523,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5640f73892514176c7000631",
               "name": "Edgar Wright",
               "profile_path": "/912vB9enhaErCSMpJpyWAB4yOOH.jpg",
               "id": 11090,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "5640f7a8c3a36814d6000616",
               "name": "Sammy Sheldon",
               "profile_path": null,
               "id": 11271,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5640fe64c3a36814dd000832",
               "name": "Dave Jordan",
               "profile_path": null,
               "id": 24192,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "5640ff5492514176c1000855",
               "name": "Tanya Noel Hill",
               "profile_path": null,
               "id": 1339459,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "5640ff9192514176bd0007ae",
               "name": "Zade Rosenthal",
               "profile_path": null,
               "id": 1400082,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 1,
               "credit_id": "5640ffe1c3a36814dd000866",
               "name": "Leslie A. Pope",
               "profile_path": "/kQCmYkLcHHPPovZMviLAUJCeGTm.jpg",
               "id": 19157,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "56410073c3a36814dd000880",
               "name": "Peter Rosenfeld",
               "profile_path": null,
               "id": 1399877,
               "department": "Camera",
               "job": "Steadicam Operator"
            },
            {
               "gender": 0,
               "credit_id": "564100a4c3a36814d600078f",
               "name": "Dennis J. Lootens",
               "profile_path": null,
               "id": 1413124,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "564100db92514176b8000864",
               "name": "Wendy M. Craig",
               "profile_path": null,
               "id": 1327146,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "564101a092514176ba00088b",
               "name": "Victoria Alonso",
               "profile_path": "/xF7Qe1tqgk9KtY8kThKHBWhMqxc.jpg",
               "id": 113674,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "564101c692514176b8000882",
               "name": "Brad Winderbaum",
               "profile_path": null,
               "id": 1256726,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "5641024cc3a36814e70008d5",
               "name": "David J. Grant",
               "profile_path": "/5JngWUEQfNkAURQgrWNiLyqNn8n.jpg",
               "id": 1533708,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "5641026dc3a36814d60007d0",
               "name": "Jeff Habberstad",
               "profile_path": null,
               "id": 9624,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5641027cc3a36814fa000838",
               "name": "Trevor Habberstad",
               "profile_path": null,
               "id": 1384390,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 1,
               "credit_id": "56410343c3a3685bd6000002",
               "name": "Sarah Finn",
               "profile_path": null,
               "id": 7232,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "564f6e6b9251414af90045a4",
               "name": "Michael Grillo",
               "profile_path": null,
               "id": 30383,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "564f6e9fc3a36833e7000584",
               "name": "Lars P. Winther",
               "profile_path": "/dlTTK8caYVYU1B7SlGdTwI03vsG.jpg",
               "id": 1349452,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "565d75969251416da10013dd",
               "name": "Jason B. Stamey",
               "profile_path": null,
               "id": 1543191,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "565d763fc3a3687cf7001347",
               "name": "Nicole Young",
               "profile_path": null,
               "id": 1319752,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "565d7730c3a3687cf10013b1",
               "name": "Danny Molaschi",
               "profile_path": null,
               "id": 1543193,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "565d78049251416dad001478",
               "name": "Dustin Berry",
               "profile_path": null,
               "id": 1477395,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "565d782dc3a3687cff001533",
               "name": "Janine Rath",
               "profile_path": null,
               "id": 1416093,
               "department": "Costume & Make-Up",
               "job": "Hair Department Head"
            },
            {
               "gender": 0,
               "credit_id": "565d78aac3a3687cfb001804",
               "name": "Heba Thorisdottir",
               "profile_path": null,
               "id": 1389609,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 1,
               "credit_id": "565d7938c3a3687cfb001849",
               "name": "Jacqueline Fernandez",
               "profile_path": null,
               "id": 1543196,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "565d7964c3a3687cf300134e",
               "name": "Jill Oshry",
               "profile_path": null,
               "id": 114492,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "565d7996c3a3687cfb001870",
               "name": "Cameron Beasley",
               "profile_path": null,
               "id": 1543198,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "565d79d79251416da4002571",
               "name": "Jann Engel",
               "profile_path": null,
               "id": 1322017,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "565d7ab8c3a3687cf100150c",
               "name": "Calla Klessig",
               "profile_path": null,
               "id": 1543202,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "565d7ae79251416db0001553",
               "name": "Rachel Block",
               "profile_path": null,
               "id": 1543203,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "565d7b6cc3a3687ced001952",
               "name": "Lauren Rosenbloom",
               "profile_path": null,
               "id": 1543205,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "565d804c9251416db400175c",
               "name": "Daniel Sudick",
               "profile_path": null,
               "id": 15356,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "565d80d99251416db0001766",
               "name": "Kelly Chow",
               "profile_path": null,
               "id": 1543223,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "565d810c9251416daa00165c",
               "name": "Tyler Cordova",
               "profile_path": null,
               "id": 1543224,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "565d82259251416da4002867",
               "name": "Diana Giorgiutti",
               "profile_path": null,
               "id": 1401731,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "565d849b9251416db4001879",
               "name": "Dan Riffel",
               "profile_path": null,
               "id": 1408360,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "565d8539c3a3687ce50018bb",
               "name": "Larry Zanoff",
               "profile_path": null,
               "id": 1530726,
               "department": "Crew",
               "job": "Armorer"
            },
            {
               "gender": 0,
               "credit_id": "565d855a9251416da7001803",
               "name": "Ron Licari",
               "profile_path": null,
               "id": 1543230,
               "department": "Crew",
               "job": "Armorer"
            },
            {
               "gender": 0,
               "credit_id": "56640e7cc3a3682bcd0078fa",
               "name": "Daniel Laurie",
               "profile_path": null,
               "id": 16344,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "56640eb29251412ad5007a1f",
               "name": "Shannon Mills",
               "profile_path": null,
               "id": 8159,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 2,
               "credit_id": "56640f28c3a3682bd00074b2",
               "name": "Tom Johnson",
               "profile_path": null,
               "id": 3996,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "56640f4d9251412aca007f6d",
               "name": "Juan Peralta",
               "profile_path": null,
               "id": 8166,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "5664100b9251412ad3007bd0",
               "name": "Bob Kellough",
               "profile_path": null,
               "id": 1397196,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "56641026c3a3682bde0073e1",
               "name": "Jack Whittaker",
               "profile_path": null,
               "id": 1408799,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "5664103f9251412ac400794e",
               "name": "Josh Gold",
               "profile_path": null,
               "id": 1406873,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "566410579251412ac4007955",
               "name": "Jeremy Bowker",
               "profile_path": null,
               "id": 1394418,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "566410d59251412ad3007beb",
               "name": "David Farmer",
               "profile_path": "/oYNchEjc32GucUPvXAHMXajk3xJ.jpg",
               "id": 3504,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "5664111c9251412ad9007f5b",
               "name": "Kerry Lyn McKissick",
               "profile_path": "/5IAKLVCEBwqWBmMG0JEYgjfDaO0.jpg",
               "id": 1355532,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56641162c3a3682bde00741c",
               "name": "Jenny Sandell",
               "profile_path": null,
               "id": 1545386,
               "department": "Production",
               "job": "Production Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "566411929251412ad9007f85",
               "name": "Jason Tamez",
               "profile_path": null,
               "id": 1545387,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "570bcdddc3a36802a3000177",
               "name": "David Lazan",
               "profile_path": null,
               "id": 8221,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 0,
               "credit_id": "58dfb666c3a3683d0b009736",
               "name": "JoAnn Perritano",
               "profile_path": null,
               "id": 59834,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "58dfb678c3a3683d0b009741",
               "name": "Lars P. Winther",
               "profile_path": "/dlTTK8caYVYU1B7SlGdTwI03vsG.jpg",
               "id": 1349452,
               "department": "Directing",
               "job": "First Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "58dfb7ed9251415e4000997f",
               "name": "Walter Garcia",
               "profile_path": null,
               "id": 1442142,
               "department": "Crew",
               "job": "Fight Choreographer"
            },
            {
               "gender": 2,
               "credit_id": "58dfb8639251415e400099c8",
               "name": "Austin Gorg",
               "profile_path": null,
               "id": 19663,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "58dfb9679251415e36009d35",
               "name": "Peter Rosenfeld",
               "profile_path": null,
               "id": 1399877,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "58dfb9b99251415e4400a3e5",
               "name": "Bill O'Drobinak",
               "profile_path": null,
               "id": 1418485,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 2,
               "credit_id": "58dfbabe9251415e6a009ea4",
               "name": "Jim Harrison",
               "profile_path": null,
               "id": 1550058,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfbb1b9251415e4800a069",
               "name": "Scott McPhate",
               "profile_path": null,
               "id": 1787830,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "58dfbb21c3a3683d460096bb",
               "name": "Michael Asiman",
               "profile_path": null,
               "id": 1543221,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "58dfbb4dc3a3683d3500a0c1",
               "name": "Kosta Saric",
               "profile_path": null,
               "id": 1408326,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfbba39251415e7f009fa0",
               "name": "Greg Reed",
               "profile_path": null,
               "id": 1787831,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfbc76c3a3683cbe00996b",
               "name": "Jim Stubblefield",
               "profile_path": null,
               "id": 1787835,
               "department": "Art",
               "job": "Assistant Property Master"
            },
            {
               "gender": 2,
               "credit_id": "58dfbc879251415e4800a150",
               "name": "Whit Norris",
               "profile_path": null,
               "id": 548441,
               "department": "Sound",
               "job": "Sound Mixer"
            },
            {
               "gender": 0,
               "credit_id": "58dfbcc0c3a3683d2a009af6",
               "name": "C. Douglas Cameron",
               "profile_path": null,
               "id": 1787836,
               "department": "Sound",
               "job": "Boom Operator"
            },
            {
               "gender": 0,
               "credit_id": "58dfbd6cc3a3683d1e009e38",
               "name": "Jim Shelton",
               "profile_path": null,
               "id": 1760569,
               "department": "Camera",
               "job": "Key Grip"
            },
            {
               "gender": 0,
               "credit_id": "58dfbd7ac3a3683cff009fa5",
               "name": "Richard L. Carden",
               "profile_path": null,
               "id": 1745935,
               "department": "Camera",
               "job": "Dolly Grip"
            },
            {
               "gender": 0,
               "credit_id": "58dfbd81c3a3683cff009fad",
               "name": "Brad Rea",
               "profile_path": null,
               "id": 1760567,
               "department": "Camera",
               "job": "Dolly Grip"
            },
            {
               "gender": 0,
               "credit_id": "58dfbe329251415e4400a6ea",
               "name": "Grace Lambert Pyke",
               "profile_path": null,
               "id": 1787838,
               "department": "Costume & Make-Up",
               "job": "Key Costumer"
            },
            {
               "gender": 0,
               "credit_id": "58dfbe3dc3a3683cff00a020",
               "name": "Branden Marks",
               "profile_path": null,
               "id": 1436195,
               "department": "Costume & Make-Up",
               "job": "Key Costumer"
            },
            {
               "gender": 0,
               "credit_id": "58dfbe44c3a3683d1e009edc",
               "name": "Edward T. Hanley",
               "profile_path": null,
               "id": 1550064,
               "department": "Costume & Make-Up",
               "job": "Key Costumer"
            },
            {
               "gender": 0,
               "credit_id": "58dfbe4bc3a3683d3500a352",
               "name": "Heather Sease",
               "profile_path": null,
               "id": 1364426,
               "department": "Costume & Make-Up",
               "job": "Key Costumer"
            },
            {
               "gender": 0,
               "credit_id": "58dfbf3f9251415e3c00a50d",
               "name": "Yvette Stone",
               "profile_path": null,
               "id": 1408509,
               "department": "Costume & Make-Up",
               "job": "Key Hair Stylist"
            },
            {
               "gender": 0,
               "credit_id": "58dfbf479251415e3600a13a",
               "name": "Kerrie Smith",
               "profile_path": null,
               "id": 1416796,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "58dfbf599251415e5f00a403",
               "name": "Michelle Diamantides",
               "profile_path": null,
               "id": 1543197,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "58dfbf649251415e4400a7de",
               "name": "Greg Funk",
               "profile_path": null,
               "id": 555329,
               "department": "Costume & Make-Up",
               "job": "Key Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "58dfbfadc3a3683d3e00a97f",
               "name": "Claire Koonce",
               "profile_path": null,
               "id": 1759751,
               "department": "Production",
               "job": "Casting Assistant"
            },
            {
               "gender": 0,
               "credit_id": "58dfc004c3a3683d3e00a9ca",
               "name": "John M. Pisani",
               "profile_path": null,
               "id": 1606657,
               "department": "Crew",
               "job": "Unit Publicist"
            },
            {
               "gender": 0,
               "credit_id": "58dfc08d9251415e4800a42a",
               "name": "Jimmy Ray Pickens",
               "profile_path": null,
               "id": 375719,
               "department": "Crew",
               "job": "Transportation Captain"
            },
            {
               "gender": 0,
               "credit_id": "58dfc09c9251415e3c00a600",
               "name": "Tyson Weatherford",
               "profile_path": null,
               "id": 1787841,
               "department": "Crew",
               "job": "Transportation Captain"
            },
            {
               "gender": 0,
               "credit_id": "58dfc0a5c3a3683d0b009e07",
               "name": "Rick Chouinard",
               "profile_path": null,
               "id": 1701752,
               "department": "Crew",
               "job": "Transportation Co-Captain"
            },
            {
               "gender": 0,
               "credit_id": "58dfc0d0c3a3683d3e00aa5d",
               "name": "John Armstrong",
               "profile_path": null,
               "id": 1688600,
               "department": "Crew",
               "job": "Picture Car Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "58dfc1149251415e6a00a2fe",
               "name": "John Buscema",
               "profile_path": null,
               "id": 1145873,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 2,
               "credit_id": "58dfc1309251415e4400a909",
               "name": "Gene Colan",
               "profile_path": "/f3N37BElhbJwjEY2EI0JMdK9PTU.jpg",
               "id": 1116441,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 0,
               "credit_id": "58dfc13ac3a3683cff00a285",
               "name": "John Byrne",
               "profile_path": "/rWIjsIUHmJeuyd88mmRDByTw86l.jpg",
               "id": 1194953,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 2,
               "credit_id": "58dfc1509251415e40009fd3",
               "name": "Robert Kirkman",
               "profile_path": "/ha6DOlWp2pd0QEZPtmS2Ga4f3Yz.jpg",
               "id": 1223867,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 0,
               "credit_id": "58dfc322c3a3683cbe009ddf",
               "name": "David C. Hughes",
               "profile_path": null,
               "id": 1399117,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "58dfc33b9251415e6a00a468",
               "name": "Nia Hansen",
               "profile_path": null,
               "id": 1406872,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfc3449251415e4400aa76",
               "name": "Kim Foscato",
               "profile_path": null,
               "id": 1352422,
               "department": "Sound",
               "job": "ADR Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfc34a9251415e3600a3fa",
               "name": "Kim Foscato",
               "profile_path": null,
               "id": 1352422,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfc359c3a3683d46009c60",
               "name": "Chris Gridley",
               "profile_path": null,
               "id": 1787842,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfc360c3a3683d2a009f5b",
               "name": "Brad Semenoff",
               "profile_path": null,
               "id": 1388864,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfc36a9251415e4800a5db",
               "name": "Christopher Barnett",
               "profile_path": null,
               "id": 1543231,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfc3739251415e7f00a4f9",
               "name": "Jim Likowski",
               "profile_path": null,
               "id": 1763133,
               "department": "Sound",
               "job": "Foley Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfc37a9251415e7f00a4ff",
               "name": "Dee Selby",
               "profile_path": null,
               "id": 8165,
               "department": "Sound",
               "job": "Foley Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfc388c3a3683d3500a6f7",
               "name": "Ryan J. Frias",
               "profile_path": null,
               "id": 1590402,
               "department": "Sound",
               "job": "First Assistant Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfc397c3a3683cbe009e2f",
               "name": "Samson Neslund",
               "profile_path": null,
               "id": 1669139,
               "department": "Sound",
               "job": "Assistant Sound Editor"
            },
            {
               "gender": 1,
               "credit_id": "58dfc3e69251415e4400aae0",
               "name": "Barbara Harris",
               "profile_path": null,
               "id": 230436,
               "department": "Production",
               "job": "ADR Voice Casting"
            },
            {
               "gender": 0,
               "credit_id": "58dfb53dc3a3683d3e00a22c",
               "name": "Jake Morrison",
               "profile_path": null,
               "id": 1467332,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "58dfb6889251415e5f009e6b",
               "name": "Walter Gasparovic",
               "profile_path": null,
               "id": 1016148,
               "department": "Directing",
               "job": "First Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "58dfb6a7c3a3683d0b009762",
               "name": "Brian Avery Galligan",
               "profile_path": null,
               "id": 1787802,
               "department": "Directing",
               "job": "Second Assistant Director"
            },
            {
               "gender": 1,
               "credit_id": "58dfb807c3a3683d1e009a69",
               "name": "Jackie Burch",
               "profile_path": null,
               "id": 1097,
               "department": "Production",
               "job": "Local Casting"
            },
            {
               "gender": 1,
               "credit_id": "58dfb886c3a3683cff009c51",
               "name": "Sarah Contant",
               "profile_path": null,
               "id": 1047108,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "58dfb8a7c3a3683d460094fa",
               "name": "Josh Lusby",
               "profile_path": null,
               "id": 1334782,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "58dfb8ad9251415e48009eae",
               "name": "John Moredock",
               "profile_path": null,
               "id": 1580943,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 2,
               "credit_id": "58dfb8b89251415e3c00a062",
               "name": "Thomas T. Taylor",
               "profile_path": null,
               "id": 61097,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 2,
               "credit_id": "58dfb8cac3a3683d1e009ae5",
               "name": "Dean Wolcott",
               "profile_path": null,
               "id": 969743,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "58dfb8d99251415e6a009d72",
               "name": "Chad S. Frey",
               "profile_path": null,
               "id": 11102,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "58dfb8f69251415e5f009fd8",
               "name": "Bryan Andrews",
               "profile_path": null,
               "id": 1218986,
               "department": "Art",
               "job": "Storyboard Designer"
            },
            {
               "gender": 0,
               "credit_id": "58dfb8fdc3a3683cff009ca3",
               "name": "Danelle Davenport",
               "profile_path": null,
               "id": 1635175,
               "department": "Art",
               "job": "Storyboard Designer"
            },
            {
               "gender": 0,
               "credit_id": "58dfb9059251415e5f009fe4",
               "name": "David Krentz",
               "profile_path": null,
               "id": 1055222,
               "department": "Art",
               "job": "Storyboard Designer"
            },
            {
               "gender": 0,
               "credit_id": "58dfb90e9251415e7f009e0d",
               "name": "Jim Magdaleno",
               "profile_path": null,
               "id": 1583828,
               "department": "Art",
               "job": "Storyboard Designer"
            },
            {
               "gender": 0,
               "credit_id": "58dfb925c3a3683cbe00970d",
               "name": "James Rothwell",
               "profile_path": null,
               "id": 1787824,
               "department": "Art",
               "job": "Storyboard Designer"
            },
            {
               "gender": 2,
               "credit_id": "58dfb92d9251415e4400a388",
               "name": "Jay Oliva",
               "profile_path": "/y7EbnuoKFMvU7uZ4aD50jThyNoF.jpg",
               "id": 105643,
               "department": "Art",
               "job": "Storyboard Designer"
            },
            {
               "gender": 0,
               "credit_id": "58dfb971c3a3683d2a009886",
               "name": "Jeffrey N. Civa",
               "profile_path": null,
               "id": 1748851,
               "department": "Camera",
               "job": "First Assistant Camera"
            },
            {
               "gender": 0,
               "credit_id": "58dfb9f3c3a3683d460095e8",
               "name": "Sean Hunter Moe",
               "profile_path": null,
               "id": 1552009,
               "department": "Camera",
               "job": "First Assistant Camera"
            },
            {
               "gender": 0,
               "credit_id": "58dfba28c3a3683cff009d67",
               "name": "Sheilah Sullivan",
               "profile_path": null,
               "id": 1573618,
               "department": "Crew",
               "job": "Production Controller"
            },
            {
               "gender": 0,
               "credit_id": "58dfba38c3a3683d3e00a537",
               "name": "Richard Castro",
               "profile_path": null,
               "id": 1627520,
               "department": "Production",
               "job": "Production Accountant"
            },
            {
               "gender": 0,
               "credit_id": "58dfba5fc3a3683d0b00997f",
               "name": "Jesse Torres",
               "profile_path": null,
               "id": 1787826,
               "department": "Crew",
               "job": "Post Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "58dfba7d9251415e40009b38",
               "name": "Adam Kimmerlin",
               "profile_path": null,
               "id": 1700118,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfba84c3a3683cbe0097df",
               "name": "Dawn Michelle King",
               "profile_path": null,
               "id": 1787829,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "58dfbc179251415e4800a0ff",
               "name": "Ryan Laney",
               "profile_path": null,
               "id": 1787833,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 0,
               "credit_id": "58dfbc4dc3a3683d460097a4",
               "name": "Shiloe Swisher",
               "profile_path": null,
               "id": 1787834,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 0,
               "credit_id": "58dfbc579251415e36009ef9",
               "name": "Christopher Grandel",
               "profile_path": null,
               "id": 1761468,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 0,
               "credit_id": "58dfbc649251415e7f00a010",
               "name": "Russell Bobbitt",
               "profile_path": "/5KW97eHDacxWlBkhtyasBUETJcR.jpg",
               "id": 1004624,
               "department": "Art",
               "job": "Property Master"
            },
            {
               "gender": 0,
               "credit_id": "58dfbcf09251415e3c00a316",
               "name": "Len Levine",
               "profile_path": null,
               "id": 1407740,
               "department": "Lighting",
               "job": "Chief Lighting Technician"
            },
            {
               "gender": 0,
               "credit_id": "58dfbcff9251415e5f00a260",
               "name": "Michael Lowrance",
               "profile_path": null,
               "id": 1787837,
               "department": "Lighting",
               "job": "Best Boy Electric"
            },
            {
               "gender": 0,
               "credit_id": "58dfbe7ec3a3683d3e00a88f",
               "name": "David Butler",
               "profile_path": null,
               "id": 1417839,
               "department": "Costume & Make-Up",
               "job": "Key Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "58dfbe899251415e3c00a467",
               "name": "Bob Moore Jr.",
               "profile_path": null,
               "id": 1392143,
               "department": "Costume & Make-Up",
               "job": "Key Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "58dfbe909251415e3c00a46b",
               "name": "Melanie Mascioli",
               "profile_path": null,
               "id": 1345613,
               "department": "Costume & Make-Up",
               "job": "Key Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "58dfbeb89251415e7f00a1fb",
               "name": "Russell R. Anderson",
               "profile_path": null,
               "id": 1355526,
               "department": "Art",
               "job": "Leadman"
            },
            {
               "gender": 1,
               "credit_id": "58dfbee4c3a3683d46009961",
               "name": "Amy Lehman",
               "profile_path": null,
               "id": 1459198,
               "department": "Art",
               "job": "Set Decorating Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "58dfbef0c3a3683d3e00a8ec",
               "name": "Karen Gerbs",
               "profile_path": null,
               "id": 1787839,
               "department": "Art",
               "job": "Set Decoration Buyer"
            },
            {
               "gender": 0,
               "credit_id": "58dfbef8c3a3683d3500a3d3",
               "name": "Helen Kozora",
               "profile_path": null,
               "id": 1586890,
               "department": "Art",
               "job": "Set Decoration Buyer"
            },
            {
               "gender": 0,
               "credit_id": "58dfbeffc3a3683d3500a3de",
               "name": "Samuel J. Tell",
               "profile_path": null,
               "id": 1422866,
               "department": "Art",
               "job": "Set Decoration Buyer"
            },
            {
               "gender": 2,
               "credit_id": "58dfbfc89251415e3c00a570",
               "name": "David B. Nowell",
               "profile_path": null,
               "id": 1403415,
               "department": "Camera",
               "job": "Aerial Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58dfbfd1c3a3683d0b009d78",
               "name": "Michael Kelem",
               "profile_path": null,
               "id": 91123,
               "department": "Camera",
               "job": "Aerial Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58dfbff6c3a3683d1e00a031",
               "name": "Sean Ricigliano",
               "profile_path": null,
               "id": 1787840,
               "department": "Camera",
               "job": "Epk Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "58dfc01b9251415e7f00a2f9",
               "name": "John H. Samson",
               "profile_path": null,
               "id": 1400532,
               "department": "Art",
               "job": "Construction Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "58dfc06ac3a3683d0b009dde",
               "name": "Joel Marrow",
               "profile_path": null,
               "id": 1399328,
               "department": "Crew",
               "job": "Transportation Captain"
            },
            {
               "gender": 2,
               "credit_id": "58dfc16c9251415e3600a2a3",
               "name": "David Michelinie",
               "profile_path": null,
               "id": 1195200,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 2,
               "credit_id": "58dfc40dc3a3683d1e00a2fd",
               "name": "Kevin Kliesch",
               "profile_path": null,
               "id": 65644,
               "department": "Sound",
               "job": "Orchestrator"
            },
            {
               "gender": 2,
               "credit_id": "58dfc4159251415e4400ab00",
               "name": "Tim Davies",
               "profile_path": null,
               "id": 1634469,
               "department": "Sound",
               "job": "Orchestrator"
            },
            {
               "gender": 0,
               "credit_id": "58dfc41cc3a3683d1e00a30e",
               "name": "Dave Metzger",
               "profile_path": null,
               "id": 61974,
               "department": "Sound",
               "job": "Orchestrator"
            },
            {
               "gender": 0,
               "credit_id": "598ecbf4925141676600d40e",
               "name": "Allen Coulter",
               "profile_path": null,
               "id": 1868186,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 2,
               "credit_id": "5ac417470e0a260c39044270",
               "name": "Daniel Hargrave",
               "profile_path": "/iLjQxDKgMP3Ou8T59800KSyyt0v.jpg",
               "id": 1825883,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 58.944515,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 102899,
      "vote_count": 7572,
      "budget": 130000000,
      "overview": "Armed with the astonishing ability to shrink in scale but increase in strength, master thief Scott Lang must embrace his inner-hero and help his mentor, Doctor Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.",
      "similar": [
         1924,
         1452,
         99861,
         141052,
         8536,
         9531,
         379291,
         13640,
         24428,
         1726,
         272,
         49521,
         155,
         299534,
         209112,
         297762,
         30061,
         382322,
         287947,
         251519
      ],
      "original_title": "Ant-Man",
      "runtime": 117,
      "poster_path": "/D6e8RJf2qUstnfkTslTXNTUAlT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/hUzeosd33nzE5MCNsZxCGEKTXaQ.png",
         "name": "Marvel Studios",
         "id": 420,
         "origin_country": "US"
      }],
      "release_date": "2015-07-14",
      "vote_average": 7,
      "belongs_to_collection": {
         "backdrop_path": "/2KjtWUBiksmN8LsUouaZnxocu5N.jpg",
         "name": "Ant-Man Collection",
         "id": 422834,
         "poster_path": "/lEdpEJWJdtVLgmpPkXSTd2xczmY.jpg"
      },
      "tagline": "Heroes don't get any bigger.",
      "adult": false,
      "homepage": "http://marvel.com/movies/movie/180/ant-man",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Peyton Reed"],
      "runtime": 117,
      "synopsis": "In 1989, Hank Pym (Michael Douglas) resigns from SHIELD after realizing that Howard Stark (John Slattery) had been trying to replicate his shrinking technology. In the present day, Scott Lang (Paul Rudd) has just served his last day at San Quentin State Prison. Waiting to pick him up is his old cellmate, Luis (Michael Peña), who offers to let him stay at his apartment. Scott is unable to find a legitimate job with his criminal record. He had found out that the company he worked for had been overcharging their customers, so he hacked into the system and transferred millions of dollars back to the customers. Luis introduces him to Dave (T.I.), a getaway driver, and Kurt (David Dastmalchian), an identity theft specialist. Luis has a tip about a robbery they could do together. Hank gets invited to a presentation at the company he founded, Pym Tech. He runs into his daughter, Hope Van Dyne (Evangeline Lilly), and his former protege, Darren Cross (Corey Stoll), who shows him a prototype of the Yellow Jacket suit, modeled after the Ant-Man suit that Hank wore. Darren has not had success at shrinking living tissue. Scott borrows Luis' van and drops in on the birthday party of his daughter, Cassie (Abby Ryder Fortson). He runs into Cassie's soon-to-be stepfather, Officer Jim Paxton (Bobby Cannavale) , who is not happy to see him. His ex-wife, Maggie (Judy Greer) tells him that he has to find a legitimate job and pay off his delinquent child support before she'll allow visitation with Cassie. Jim and his partner, Gale (Wood Harris) insist that Scott leave the party after saying goodbye to Cassie. At Pym Tech, Hope and Darren are trying to shrink sheep to microscopic size. Their experiment fails, and a sheep is killed. Darren insists they press forward with another sheep. Scott realizes that it will be more than a year before he can see Cassie again if he takes a minimum-wage job, so he takes up Luis on his offer. Luis' cousin, Ernesto (Nicholas Barrera) had a friend, Emily (Lyndsi LaRose), who was a housekeeper and was dating Ernesto's friend, Carlos (Carlos Aviles). She told Carlos that the man whose house she was cleaning has a giant safe that's sure to be holding valuables. Scott agrees to help them with the robbery. Luis picks up supplies for the break-in, and Kurt steals a communication technician's uniform. That night, Kurt climbs up a pole outside Hank's house and blocks the electrical circuit, cutting off all phone communication. Scott climbs the fence and takes out the window sensors, then pries open a window and heads to the basement. He unlocks the basement door only to find a second door that is fingerprint-coded. Using tape, he lifts Hank's print and opens that door. When he gets to the safe, he realizes that he'll need some ingenuity to break the steel door. He drills small holes around the lock, then squirts in water and uses nitrogen to freeze it. The frozen water warps the steel and causes the bolts to shoot out. When he opens the safe, the only thing inside is a weird-looking body suit and helmet. He grabs that and heads out. Meanwhile, Hank has been watching the whole episode upstairs. Dejected at not having gotten anything valuable, the group heads back to Luis' apartment. Scott goes into the bathroom and examines the suit he stole, wondering why it was so heavily guarded. He notices tubes full of red and blue liquid. Out of curiosity, he puts it on and steps into the bathtub to get a better look at himself in the mirror. Noticing a red button on the glove, he pushes it and instantly shrinks, becoming a half-inch tall. Luis comes into the bathroom and he turns on the water in the tub, which is like a tidal wave for tiny Scott. He hears a voice coming from an earpiece in the helmet. He tries pushing a blue button to return to normal size, but it's broken. Panicked, he jumps away from the water and finds himself sailing across the room. He lands in a crack and falls through to the apartment below. In that room, there's a party going on, and Scott realizes he's on a record player, with the needle moving toward him. He jumps free and lands on the floor where people are dancing. Avoiding the giant footsteps, he gets under the door and into the hallway, where he is promptly sucked up into a vacuum cleaner. When the dust bag gets emptied, he jumps again, this time landing on a rat. He runs away, but lands on a mouse trap. When it's triggered, it sends him flying out through a window and into the rainy night. He sees raindrops as big as his head, before landing on a car. The impact jarred the blue button free, and he grows back to normal size. Scott races home and takes off the suit. Realizing that someone had been tracking him all along, he decides to return the suit to Hank's safe. He easily breaks into the house again and puts the suit back. But when he gets out, he's surrounded by cops. He is arrested and brought to prison, where Paxton is waiting for him. Gale tells Paxton that Scott's lawyer is there. Confused, Scott goes to see the lawyer that he hadn't asked for and doesn't know. The \"lawyer\" waiting for him is Hank. He offers Scott two choices, life in prison or follow his instructions. Scott is thoroughly bewildered, so Hank tells him that he allowed him to steal the suit. Scott is taken back to his cell, and an army of ants brings him back the suit. He puts it on and shrinks, and then quickly escapes from the prison. One of Hank's ants spreads its wings, and Scott climbs on and flies over the city. Hank tells Scott that he invented the suit, but was afraid it would be misused, and so he had locked it away. Darren had found out about the shrinking technology, but when Hank wouldn't give it to him, Darren forced Hank out of Pym Tech. When Hope realized how dangerous Darren was, she teamed up with Hank to stop him. Hank tells Scott that he needs him to become \"Ant-Man\" to stop people like Darren. Scott realizes he has a chance to become a true hero, the kind of father his daughter deserves. Scott gets trained in martial arts and how to lead the ant colonies. He practices his timing with shrinking and growing back. Hank tells him that one piece of technology he'll need to steal the suit from Darren is in an abandoned SHIELD building. When Scott flies to the building, he sees that it's the current Avengers' headquarters. Pressing forward, Scott lands on the roof, triggering a sensor. Sam Wilson (Anthony Mackie) arrives to investigate, and he can see Scott even at small size. A battle ensues, with Scott going inside Falcon's jetpack and causing it to short out. Scott escapes with the equipment he needs. When Scott returns, Hank explains the truth about how Hope's mother died. There was an ICBM that had been launched at the U.S., and Hank was trying to stop it, but even at ant-size, he couldn't get inside. She had a similar suit, called the Wasp. She decided to shrink to sub-atomic size and was able to stop the missile, but she couldn't return from that size and was lost in the quantum realm. Darren Cross finally has success at shrinking a lamb. He envisions himself taking over Pym Tech. He invites Hank to the grand unveiling, then calls Hope and tells her that he has increased security, including covering all the vents with microscopic mesh. They realize the job will be harder than they thought, and they'll need more people. Luis, Kurt and Dave are brought in. Luis poses as a security guard and lowers the water pressure so Scott can get in through the pipes. Scott plants explosives throughout the building, but when he tries to steal the suit, he gets caught in a glass cage by Darren, who had anticipated the burglary. Darren plans to sell the technology to HYDRA. Scott breaks free and takes out the Hydra agents. Darren gets into a chopper on the roof and escapes just before the building blows up. Hank and Hope break out by turning a tiny tank to full-size, and ride it out the side of the building. Darren puts on the Yellow Jacket suit, and he and Scott fight inside the helicopter. After they both fall out, Scott is able to trap Darren inside a bug zapper, but Jim Paxton shows up to arrest him before he can destroy the suit. Darren goes to Jim and Cassie's house and threatens their lives, hoping to draw Scott in. Scott arrives and they fight. The only way Scott can get inside Darren's suit is to shrink to sub-atomic size, and he causes Darren to shrink into nothing. Lang is trapped in the quantum realm, but hearing Cassie's voice, he manages to rewire the suit, reversing the process and returning him to normal size. Following the battle, a grateful Paxton covers for Scott so he would not have to go back to prison. Hank wonders if Hope's mother is also still alive somewhere. Luis tells Scott that the Falcon is looking for him. Hank shows Hope a new version of the Wasp suit, and tells her that it was made for her. Captain America (Chris Evans) and Falcon have trapped the Winter Soldier (Sebastian Stan), and are trying to figure out what to do next. They decide not to tell Iron Man, and Falcon says he knows who to contact.",
      "writers": [
         "Edgar Wright",
         "Joe Cornish"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0478970/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjM2NTQ5Mzc2M15BMl5BanBnXkFtZTgwNTcxMDI2NTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Paul Rudd",
         "Michael Douglas",
         "Corey Stoll"
      ],
      "reviews": [
         "Antman. When I first heard about the plans for this movie I laughed to myself and thought, \"How can becoming smaller be cool?\" Sure enough, Marvel has surpassed my expectations and turned something I thought would be lame and uninteresting into something hilarious and actually pretty cool. I'm not going to include any spoilers, but I will say the fighting style of Antman is much better than I thought it would be. I learned a lot about the story as well as the abilities he has. Antman gets much more interesting when doing combat. The ability to shrink and grow at will is something Marvel has gotten very creative with. The language in this film is good enough for my young children to watch. There are no F or GD bombs to ruin the mood and the moment with the family. I'd say I'd surely watch it again.",
         "AntMan is a lesser know character of marvels but by no means does that effect the quality of this movie. First off I thought that the casting of this film wasn't going to work, that been Paul Rudd mainly, just because I have read a few of the AntMan comics and didn't think it was going to work, I was wrong he is brilliant, hilarious and believable, all of the jokes he made actually made laugh out load which doesn't happen much. Michael Pena was great in this film, he plays the same kind of character he always seems too, but it really works, especially the story telling scenes were hilarious. This was a all round well cast film. The action and CGI Was great, on first thoughts I thought when AntMan shrinks down that the CGI would take you out of the movie but let me tell you it doesn't, it's awesome! Especially seeing the world from that size and scenes where AntMan is shrinking and enlarging when fighting i thought would get a little too much but the honestly don't. All around I AntMan felt different to all the other MCU movies that have come out, but a good different.    A well cast,directed and acted film that will be a welcome addition to my marvel collection.",
         "I went to see Avengers: Age of Ultron to the cinema, and it was not that bad. Still, the first one keeps the first position. After that, i knew that MCU's next movie was Ant-Man, a completely new hero. But i wasn't so excited for that movie. And it was weird, because i always do it when a new Marvel movie is about to come out. I thought it was going to be just fine, even boring, 'cause that particularly hero didn't look attractive. I was very wrong. The movie is about Scott Lang, a thief who gets a second chance from Dr. Hank Pym, the inventor of the Pym Particle, that makes a man reduce his size and become stronger. What Pym needs Scott to do is to destroy the Jellowjacket, a suit similar to Pym's suit (Ant-Man's suit), created by Darren Cross. And it needs to be destroyed because Darren's intension is to sell that suit to Hydra. The story is very simple, but it's entertaining enough to make us see it to the end. I was afraid that Ant-Man would be full of comedy, like Guardians of the Galaxy, that had so much that was tiresome. But this film had jokes in the right moment, it was very well used. To be honest, i was very surprised by Ant-Man. Paul Rudd makes a very good performance as Scott. I think that the best part of the entire film was the battle between Scott and Anthony Mackie's Falcon in the Avenger's new base. An epic battle with a short appearance of a new Avenger. I recommend this movie to any MCU's fan. Now we have to wait for Captain America: Civil War, that promises to be awesome.",
         "Like many people, I came into the theater wondering how Marvel would make the audience care about such a little-known character with decidedly unimpressive powers. It turns out they used the opportunity to make one of their best movies yet. Ant-Man was not at all what I expected. I have been a fan of most of the previous movies of the Marvel Cinematic universe, but you don't have to be a fan of super hero movies to enjoy this movie. it has good pacing and holds your interest throughout. There are plenty of action and the fight scenes, but unlike the previous Marvel movies, this movie focuses on a heist. This, along with the comedy throughout, makes it a breath of fresh air in the Marvel universe. No Marvel movie since has so seamlessly bonded the genre of action and comedy. The main character, Scott Lange, is not a billionaire or scientist or ancient god, and he doesn't have super strength or intelligence; he is a thief who deals with holding down a job and being able to see his daughter. This makes him incredibly relatable. Being played by Paul Rudd doesn't hurt either. Rudd, along with the rest of the cast, delivers a memorable performance. The idea of a father trying to reconcile his relationship with his daughter may have been used before, but Evangeline Lilly and Michael Douglas make it work without seeming trite or overused. The role that really stands out is Corey Stoll as Yellowjacket. He is, in my opinion, the most terrifying villain the Marvel universe has seen yet. He doesn't want global domination, he wants money and power, and that makes him a very believable villain. Stoll's performance is more three-dimensional than one might expect in a super hero movie, and adds to the already great cast. Perhaps the most impressive part of Ant-Man was the visual effects. I saw this movie in IMAX 3D, and the quality was stunning. I don't like most movies in 3D, but this one worked well. The shrinking and growing looked very good as well as the action sequences. Although the action happens on a small scale, it can stand up to any of the other movies Marvel has made. If you haven't seen this film yet, I would highly recommend it. The acting, directing, and cinematography all make this film highly enjoyable, even if you haven't seen any of Marvel's previous films.",
         "Had it been too desperate and hopeless, ANT-MAN would have shrunk its way for admission to the almost-complete, Avengers team. But neither such concern nor saving the world from an impending catastrophic destruction, holds weight heavy enough to pull this miniature superhero from his top priority: winning back his daughter. The emotional weight of the narrative comes across as an anomalous content to the generally comedic structure of the film, but they serve purpose for the overall flow of the proceedings, nonetheless. The film follows Scott Lang (Paul Rudd), who has just been released from prison after committing burglary. He has been prohibited to see his daughter due to his inability to provide financial support, no thanks to his being an ex-con that keeps hindering him from getting a job. He meets the highly-intellectual yet solitary scientist, Hank Pym (Michael Douglas), who has a job for him: pulling off a heist on his ex-protégé, Darren Cross (Corey Stoll), who is in possession of a size-changing prototype, that poses massive amount of threats to worldwide security. Using a military suit that allows him to shrink back and forth, in size, Lang carries on with the mission with the hope that by doing so, he would be able to reclaim and earn the reputation and respect he lost, especially his daughter's. It's easier to see Ant-Man as a beautiful mess, rather than a well-crafted superhero flick with profound depth and sense . There's a lot of illogical nonsense that always nearly sends the film to wreckage, but there's also so much of the fun side to make up for the eventual narrative shortcoming. At the center of its comic efforts, Paul Rudd's Scott Lang/Ant-Man shines with his general amiability, pulling off his role with credible wit and comic allure. Rudd is such a delight here, and his presence and effortless take on his character make the mostly messed-up flow of the events, extremely palatable. There's also much to say about Michael Douglas, how his character, Pym, easily integrates well with Lang and his daughter, Hope (Evangeline Lily) , to provide a firm and well-knitted character framework. Corey Stoll, on the other hand, is less impressive, barely providing the needed threat to make his presence felt and his belligerence imminent. But on moments where he and Lang engage in beautifully-choreographed fight scenes, the ineptitude gets relegated below the more important aspects of the proceedings, and once it does, the breathtaking visual schemes work under the spotlight, capturing Lang's size-changing skill with epic elaborateness. There's magic in every size shift, and the visual artistry is at its peak to deliver the moment. Perhaps, one of the most immediately-noticeable difference of Ant-Man from its Marvel fellows is that it doesn't engage, nor rush too much, to explosive battles that generally results to immeasurable destruction. It is noticeably evident on the fact that its most interesting and most jaw-dropping action setpiece, happens in a toy train set. Most importantly, this new addition to the Marvel Cinematic Universe places its comic prowess at the center of its general effort to validate its entry to the franchise, and that is achieved without putting the natural action/adventure tendency of its superhero, nor the inevitable emotional nature of its characters, at risk of getting overshadowed by the rudimentary elements of the narrative. It's actually hard to gauge ANT-MAN using the same measure that made the rest of its pack, mammoth and omnipotently powerful. But in its own right, and sub-atomic scale, this microscopic superhero is clearly a power behemoth, and it will surely spring back to its even bigger form, once the Avenger call is delivered.",
         "For a few brief moments, the unstoppable juggernaut that is the Marvel Cinematic Universe (MCU) looked like it was about to grind to a halt with Ant-Man. Unlike most other films under the Marvel Studios umbrella, this production has been haunted by doubt and dissension. Fans were nervous about the narrative decisions to relegate Hank Pym – the original Ant-Man in the comic books – to the sidelines, while killing off his wife Janet Van Dyne (who, as the Wasp, is one of the founding members of the Avengers). Then came that hugely publicised parting of the ways between Marvel and original director Edgar Wright, who oozes so much geek cred that people understandably mourned his departure from the project after years of development. And yet, the final product – Peyton Reed's Ant-Man – is a fun, frothy delight, one that proves once and for all that Marvel knows precisely what it's doing and where it's going with the most crazily interconnected movie-and-television franchise of all time. After serving his jail sentence, Scott Lang (Rudd) just wants to reunite with his daughter Cassie and get his life back on track. But he soon discovers that people in the outside world – including his ex- wife Maggie (Greer) and her new cop boyfriend Paxton (Cannavale) – aren't particularly kind to former convicts. Beaten down by circumstances, he agrees to pull off one last heist with his eternally optimistic buddy Luis (Pena). It's a crime that places him squarely in the path of Dr. Hank Pym (Douglas), a retired, semi-reclusive scientist who decides to enlist Scott in his life-long mission of preventing the Pym Particle – a technological breakthrough that allows him to become the super- small, super-strong Ant-Man – from falling into the wrong hands. Truth be told, Ant-Man gets off to a somewhat shaky start. The tale of an honourable rogue who's looking for a shot at redemption is a well-worn storytelling trope, one that the film initially seems to embrace rather too eagerly. As we watch Scott soldier through a host of tiny indignities, the dialogue – still credited to Wright and his co-writer Joe Cornish, with rewrites by Rudd and Adam McKay – is uninspired, and oftentimes uncomfortably on-the-nose. There's no subtlety here, and the sense of fun that accompanies Scott's attempt to hold down a job in Baskin Robbins feels a wee bit forced. But the film kicks into higher gear, and stays there, once Scott stumbles onto or, more accurately, steals his second chance. His discovery of the Ant-Man suit and all that entails – working with Hank, meeting Hank's aloof but eminently capable daughter Hope (Lilly), training to prevent Hank's former protégé Darren Cross (Stoll) from replicating the Pym Particle for sale to the highest bidder – give the story the shot of adrenaline it needs. In the blink of an eye, this superhero heist flick finds its feet, and transforms into a whirlwind of action, humour and heart. Reed's camera zigs merrily from Luis' unique method of exposition (brilliant) to Scott's attempts to survive Hope's training (bruisingly hilarious), before zagging into the dark, trembling heart of Hank's troubled relationship with his daughter. Indeed, what makes Ant-Man work so well is its insistence on respecting its characters and taking their concerns and relationships seriously. This provides the film with an emotional anchor amidst all the madcap chaos and gleeful irreverence. Scott's overpowering love for his young daughter runs parallel to Hank's own concern for Hope, and even Paxton – initially caricaturised as the stereotypical brutish new boyfriend – is given layers and depth beyond what might be expected of a film that seems so silly on the surface. This culminates in the film's best action sequence: one that manages to be utterly ridiculous, as the camera cheekily zooms in and out of a conflict that's entirely proportional to the size of its participants; but also deeply heartfelt, when Scott makes a split-second decision between life and probable death. For anyone concerned about Ant-Man subsisting in its own little bubble within the MCU, rest assured that there's plenty on display here to please even the most die-hard of fans. The film features not only a welcome cameo from a very popular agent of S.H.I.E.L.D., but also ties Scott firmly into MCU continuity with a hugely pleasing direct reference to Avengers: Age Of Ultron. The subsequent semi-aerial battle that takes place between Ant-Man and a certain Avenger proves that this miniscule hero has what it takes to stand proud alongside the world's mightiest champions. (Stay through the credits, by the way, for two incredibly exciting hints at what's to come for the MCU in the future.) As with all the other films and television shows in Marvel's burgeoning media empire, the cast of Ant-Man is pitch-perfect. Rudd puts his goofy and amiably sexy charisma to excellent use as Scott, allowing us to believe that this one man can be as silly as he is strong, and as serious as he is funny. Lilly gets the big-screen role she richly deserves in Hope, who's acknowledged at every point in the film as being better, stronger, and more capable than the men around her think she is. Douglas plays a far more palatable version of Dr. Pym (who can be tough to swallow in the comics), and does so with his trademark charm and magnetism, while Stoll gives good psychopath as the increasingly unhinged, patently cruel Cross. Ant-Man may not edge out the other films that make up Phase Two of the MCU in a straw poll – it does, after all, face some pretty serious competition in what has been an unbroken run of truly excellent superhero films. But it's an incredibly solid effort: smart, rich, deep and funny, teeming with ideas, genres and the potential for so much more. Now if that doesn't make for a great superhero movie, what does?",
         "This movie is incredible. A ton of fun with brilliant action and hilarious dialogue this is another fantastic win for Marvel. Paul Rudd plays a likable and charismatic hero who really makes you root for him and his goals. Michael Pena is the real heist of this film as he steals every scene that he is in. Corey Stoll as the villain was a fantastic choice from Marvel. He can play the corporate business man and an intimidating villain. The visuals are stunning in this film. All of the tiny ant scenes are visually outstanding and hilarious. The are two post credit scenes which are fantastic and really tie into the larger universe. Ant Man is a fantastic movie which is worth your money and I suggest that you see it in cinemas.",
         "I went into this flick not expecting much. I'm not an Ant Man fan so I was not waiting in anticipation for this as much as I wanted to see Age of Ultron. The character that Paul Rudd plays in this movie is not the Ant Man I wanted to see, and Micheal Douglas' role as Hank Pym, the original Ant man only made me want to see him dawn the suit even more, cause Micheal Douglas was everything a superhero should be in this movie, Charming, really good dialog, and ready for action. Overall, Ant Man surprised me. It was one of the more unique superhero movies out. Ant Man did things far beyond just punching and kicking that a lot of superheroes are doing on the big screen and went places no other super hero could go making for an action packed adventure. As cool as Ant Man was when he was regular size beating up the bad guys, was as good as when he was shrunken, riding and controlling ants in a world only he can go to. The villain Darren Cross was actually pretty good too. Not as good as Loki, but just as psycho. Once again, not an Ant Man fan but this movie is changing my mind. I'm so impressed with what Paul Rudd did with the character. Not only that, but it's a great Marvel comic movie, in how it intertwines with the whole Marvel cinematic Universe. Definitely recommend seeing in 3D cause it's that type of movie that deserves it.",
         "OK, so I will probably target the wrath of a legion of fan-boys but as a PhD Physicist I will categorically state that much of the science in the Marvel universe is total nonsense. For example, it requires a certain suspension of belief that whole cities can be levitated. But it's called \"Science Fiction\" for a reason, right? \"Ant Man\" pushes that suspension of belief to whole new levels. The concept that a miniaturised man, were such a thing even possible, could exert the same moment and force as a full sized person would make Newton spin in his grave. With these nagging doubts I watched the trailer increasingly comfortable in my view that, (even with a free cinema pass), this was a film I would avoid like the plague. That was until the final scene, featuring Thomas the Tank engine, that was ludicrously and surprisingly comical. Could it be that, like last year's \"Guardians of the Galaxy\", Marvel had pulled its pompous head out of its ass and come up with an 'Avengers-lite' that could entertain a broader audience? I decided to risk it. And I was glad I did. Paul Rudd (\"Friends\", \"Anchorman\") plays ex-con Scott Lang who is recruited by brilliant scientist and would-be superhero Dr Hank Pym (Michael Douglas) and his gorgeous daughter Hope (\"Lost\" and \"The Hobbit\"'s Evangeline Lilly) to steal a jacket. (No, really). The owner of said jacket, albeit a high-tech jacket, is businessman and all-round bad-guy Darren Cross (Corey Stoll), with evil intent. (You can tell he's evil by what he does to a cute little lamb - this is the worst viewing for sheep since \"Far from the Madding Crowd\".) By miniaturising Lang and securing the help of an army of ants, the stage is set for a heist of a most unusual kind. This sounds ridiculous to even write. So why does it work? First up, the script by Edgar Wright ( of \"3 Flavours Cornetto\" fame), Adam McKay (\"The Other Guys\"), Joe Cornish and Paul Rudd himself is as tight as a drum, with some situations and lines that are downright hilarious. A couple of brilliant lip sync scenes, one featuring the requisite Stan Lee cameo, are grin-inducing pleasures. Supporting the screenplay, the three leading players pull off their roles with enormous panache. Rudd is hugely likable, with all of the smart-whip humour of Downey Jnr.'s \"Iron Man\" but with none of the appalling arrogance. Michael Douglas, in his one outing this year, seems to be revelling in his role and (presumably with the help of some clever makeup and/or CGI) looking very dapper in the 1987 version of his character. And Evangeline Lilly enters the Avenger's world with a bang and looks very comfortable there. In an effective supporting role, Michael Peña (\"American Hustle\") adds a comic lightness of touch as fellow robber Luis. Abby Ryder Fortson also deserves special mention (and an Oscar for cuteness) as Lang's young daughter. Whilst real fan-boys might object to the flippant nature of the film, there are a number of clever cross-overs into the 'mainstream' \"Avengers\" films, with one B-list Avenger guest star and (eventually) an A-list appearance. And (as is common in these films, and notable as 80% of the audience stayed in their seats for the full credits) there is both a mid-credits scene (that's a set-up for the sequel) and a final post-credit scene that (so I'd told) is hugely significant for next year's \"Captain America: Civil War\" (in which Rudd is set to reprise his \"Ant Man\" role). The director is Peyton Reed, whose limited movie portfolio to date includes Jim Carrey's \"Yes Man\" and \"Bring it On\". As I found myself thoroughly enjoying the experience, my rating, against all the odds, is twice what I expected it to be. I can't believe I'm saying this\u0085 but I recommend you go see this for a fun movie summer experience.",
         "I am abysmally disappointed in the execution of this film. This film, like it's peers, has all the Hallmarks of a produced-for-the masses, generic, and stereotypical film created for the lowest common denominator. There is no innovation in this film, only mind-numbing clichés that fill the monotonous hours otherwise spent counting the number of in-world errors the films directors manage to commit. As a cinephile and a resolute fan of super-hero movies and action flicks alike I can forgive a meaningless plot focused once again on a dysfunctional family unit where a well-meaning male protagonist finds himself at odds with a morally bankrupt society, a teary-eyed \"I only want the best for our daughter\" token mother, and a cliché domineering \"replacement father\" with a skewed perspective of our hero's motivations. The daughter managed to swim a little higher than the bottom of the barrel but only just enough to reach the \"I'm a smart sassy kid with more self-awareness than the adults think and I'll express that with a few endearing one liners\" level. I can forgive the generic antagonist meglomaniac who used to \"hold so much promise\" until he effectively \"turns to the dark side\" using his abilities for evil and/or personal gain and in a way designed to convey as much sensitive information about his intentions to his enemies as possible thereby giving them ample opportunity to thwart his every plan. I can look past the incredibly cliché nameless \"investors\" representing the greed and hunger of a capitalistic world for domination as this amazing, new, and world changing technology is sold to the highest bidder despite the fact that this approach is a clear step below the ability of an motivated antagonist who intends to put their potential to personal use. (Predictably, despite the best efforts of our hero's, our antagonist still finds an opportune time to don his suit to give us our much anticipated climatic battle scene.) I can even forgive the stereotypical \"wizened\" scientist with emotional baggage who can never allow his creation to fall into the wrong hands, a son/daughter with resentment and abandonment issues, and, surprise, the mysterious death of their spouse illogically requiring them to lie about the details to \"protect\" their loved ones until the right \"time.\" But, in addition to every stereotype, cliché, and generic element of this movie, I am incredibly annoyed at also being expected to lower my intellect to the point where it is assumed I will pay no attention to anything but the most shallow details of a movie so that if/when the producers violate their own in-universe laws I won't care or notice. Specifically, the suit functions simply by reducing or increasing the distance between atoms of an object. This in turns makes an object more or less dense without altering it's total mass, hence the multiple characterizations of Antman as still weighing and having the strength of a 200 pound man, being able to kill with a single punch, being much faster, stronger, etc. Apparently these details only matter when it's convenient for the producers. As many have already stated, how in the Hell does Antman ride an ant when he is effectively a 200lb man in compact form? If I reduced the earth to the size of a marble I can tie it to my dog but he still won't be dragging it around anytime soon. How is he able to stand on the shoulders of his friends? When he runs he should be exponentially faster, when he struggles to lift things (toy blocks) they should be several times heavier than an object that can be lifted by a 200 pound man or go zinging away like a bullet. The whole purpose of the suit is to reduce the spread of force over a relative area thereby increasing it's overall impact and strength. Think of the Human body like a cannon and the ant suit like a focused laser. Time and time and time again within the movie these in world laws of physics are ignored or turned on and off at whim to suit the needs of a given scene. The enlarged train should have still weighed no more than a toy train, the enlarged ant no more than a normal ant, and the damn tank on the scientists keychain should have been nigh immovable. How in the world is Antman denser upon shrinking and yet a tank appears to weigh about as much as a couple pencils. Obviously this is a movie. Clearly it isn't meant to simulate the laws of our own universe. However, it's hard to sit back and imagine that either the director and producers are so stupid and profit driven they are unable to take the time to produce something that even appears to try and conform to the rules and expectations given to the audience, or apparently I, as an audience member, am considered so intellectually challenged that I'm expected to focus on the bright lights, cool sounds, and pretty pretty colors at the expense of any clear story-line at all beyond the cliché \"oohs\" and \"aahhs\" we all get when our own personal stories and imaginations are confirmed through the lives of these on screen characters. I will say, I thoroughly enjoyed the film style associated with the token comedic relief characters monologue scenes. They were beautifully executed and I could probably watch hours of them.",
         "This movie exceeds all expectations. From a tight and streamlined plot, to outstanding performances from the cast. This isn't a simple comedy. It's a movie with depth and heart. The cast gave great performances from top to bottom keeping the viewer engaged. Paul Rudd is another great choice as lead from the Marvel casting department. Michael Douglas gives a signature performance as Hank Pym, and Evangeline Lilly is another kick-ass female character in the MCU. Oh yeah, Michael Pena stills the show with his comedic timing. The action in this movie is like nothing you've ever seen. And the comedy was on point throughout. The heart of the movie is it's focus on a father's love for his daughter, and what he'd do to show that love and protect her. All in all an amazing release from the House of Mouse.",
         "Once upon a time, Ant-Man was the Marvel movie to beat. A founding Avenger with less baggage of expectation, Ant-Man allowed the studio increasing danger of collapsing under the titanic weight of their own 'universe-building' a chance to shake things up with something small (ha\u0085), intimate, and quirky. Paired with the eclectic stylistic flair and consummate comedic timing of visionary writer/director Edgar Wright, Ant-Man was primed to become the breath of fresh air in the Marvel Cinematic Universe. Alas. Wright's departure from the project, followed by shady, last minute rewrites, and the hiring of Peyton Reed, best known for helming despicably generic attempts at comedy, didn't bode well. But Marvel's impeccable track record and the inspired casting of Paul Rudd suggested there was still Hope (ha\u0085) an enjoyable romp could be salvaged out of the film's prior potential. Indeed, it's hard not to sneer that the film's theme of \"second chances,\" uttered roughly 1800 times by Michael Douglas with all the subtlety of a children's bedtime story, reads as a meta plea for clemency on behalf of the studio. And yet, even with this growing backlog of worrisome evidence against it, none could have predicted the final product to come. Ant-Man is, not to mince words, an insultingly poor film. Inexcusably lazy, under-thought, clichéd, soulless\u0085 the list of adjectives is endless. Purportedly structured around a heist narrative, the miserable excuse for a script slaps together a slew of loathsome narrative crutches (released con coaxed into \"one last job\", disgraced dad trying to win back custody rights to his daughter, emotionally distant genius forced to confront the demons of his past\u0085yawn), glued together with laughably contrived MCU tie-ins (a dire prologue tacked on to remind audiences that Marvel's Agent Carter still exists, an Avengers cameo so embarrassingly out of place I won't dare spoil it here, ugh) in a shamefully textbook example of 'safe studio filmmaking'. One would imagine that after the rampant success of the eccentric, daring Guardians of the Galaxy Marvel would push the envelope even further into the realm of clever humour and weird levity. Instead, Reed inexplicably stoops to sassy 'comedic relief' side characters that would have felt stale in the 1980s, otherwise leaning on Paul Rudd's indestructibly affable charisma to keep the film afloat. And though Rudd is nearly impossible to dislike, turning on the charm and puppy-dog pathos and mining the abysmal script for laughs like never before, even he can only do so much to save a sinking ship (it's ironic Rudd's Lang makes a Titanic reference\u0085). Running less than two hours and still feeling offensively overlong, Ant-Man plods along at an insomnia-curing pace (Reed may as well have re-titled the film Slug-Man), counterbalancing a stupefying long training montage with terse monologues about morality so repetitive there is a legitimate worry of having entered the simulacrum of Groundhog Day. The sole consolation: the film's visual effects, while often looking slapdash and rushed, do conjure an ant-sized handful of fascinating imagery. Lang's first shrinking experience into the suddenly desolate wasteland of a bathtub provides a blip of entertainment, and there is brief joy – nay, perhaps even a chuckle or two – to be found in his ant-training escapades (watching him surf through a drainpipe on a skittering carpet of ants is a highlight). Similarly, Lang's accidental descent into the subatomic realm provides a gorgeous feast of Escher- influenced surrealism. But, before you know it, we're back to being pummelled senseless by cliché once again. Sigh. Speaking of pummelling: despite a surprisingly sound rationalization of the physicality of Ant- Man (small yet compact, \"like a bullet\"), the film's action sequences are tragically sparse. It's a shame, as the unique size-changing fight choreography offers a few precious where the film momentarily sputters with some life and vigour. Surely a couple of minutes of Michael Douglas' droning could have been shaved off for a few more shots of unorthodox pounding? Ah, but that would require a director with even a skeletal grasp of energy, pace, or vision (ahem). Among the film's immeasurable log of missed opportunities: no Lang entering the human body and attacking from within, and not even a fleeting glimpse of a triumphant Giant-Man transformation (at least one climactic moment provides an ideal setup). And the Wasp? Shamefully, unforgivably absent. All the while, Christophe Beck's musical score bwomps away in the background, the most hackneyed pastiche of heroic musical clichés yet, and there are even a couple of moments where Reed has the gall to attempt to mimic Edgar Wright's trademark kinetic 'swish-pan' editing and cinematography. Rub salt in the gaping wound, why dontcha. The squandered potential on screen is almost too much to bear. Even the film's generally talented cast is Hopeless (see what I did there? I used the same joke twice. Just like Ant-Man) at providing any respite from the turgid mess surrounding them. Apart from Rudd – and even he starts to seem tired by the end – Michael Douglas snores through the film, his Hank Pym an unmistakably extraneous mentor archetype, while Evangeline Lily continues her Hobbit streak of astoundingly flat 'token action woman' cardboard cutouts. Corey Stoll, saddled with the worst lines the script has to offer (which is saying something), is so embarrassingly cartoonish here it almost overrides his previously impressive work in House of Cards, while poor Michael Peña is forced to constantly mug for increasingly cheap laughs as Lang's fellow ex-con buddy. The worst of the lot: Bobby Canavale's oafish cop/stepdad rival is hilariously out of place, while Judy Greer is given so little screen time as Lang's estranged wife she may as well have played the Invisible Woman. In conclusion (just to finish beating that dead horse): Edgar Wright once opined that \"the only bad films are dull films.\" Ladies and gentlemen, Ant-Man is a bad film. -3/10",
         "Went to see \"Ant-Man\" the other day. I have no idea how it is getting its 4 star rating, the 79% Rotten Tomatoes rating seems about right to me. So I guess you either love it or you hate it. Me well I only wish I had gone to see Terminator for the 4th time instead. I felt is was a waist of an opportunity. Way too much time was spent on explaining \"Ant-Man\" and no enough time was spent on action. And as for the Science well while it might be possible to shrink someone by reducing the space between their molecules. If you make anything larger it would tend to have the effect of turning a solid into a gas. (Wait to the near the end of the movie see what I mean). The Ant man suite itself turns out to be a very flexible thing it can either be warn by Michael Dogulas aka Dr Hank Pym or Paul Rudd, Scott Lang or his Daughter Evangeline Lilly yes one size Ant-Man suite really does fit all? I only wish my clothing was as flexible as this suite. I could go on but I will stop there. I would suggest go see it for yourself see what you think but only once Terminator is no longer on in your cinema and if you do not have any children with you that might get easily bored. All if you do decided to go see it do not leave until the very last of the credits have finished or you could quite possibly miss the best thing about this movie. And I do mean the very end of the credits not half way though.",
         "Ant-Man must have been a challenge for these filmmakers. The preceding films from the Avengers Universe featured an epic roster of out-of-this-world heroes whose names alone make you tinkle a little: IRON MAN, THOR, THE INCREDIBLE HULK, GUARDIANS OF THE GALAXY\u0085 and then there's Ant-Man. (Womp-womp) While die-hard fans of the comics would recognize Ant-Man as an original member of the ensemble, the general audience may be left to wonder WTF?! Ant-Man, do you even lift, Bro? The filmmakers must have been aware of this, considering the tongue-in-cheek treatment of the script. With a screenplay largely penned by Shaun of the Dead legend Edgar Wright, and built upon by other great comedic writers, Joe Cornish (Attack the Bock), Adam McKay (Anchorman), and Ant-Man himself Paul Rudd, Ant-Man does indeed do some heavy lifting, delivering one of the funniest, most entertaining, and visually satisfying superhero movies to date. The ant super-suit is sick. Red and silver with bulging insectoid eyes, it looks like a modern day motocross version of the Japanese monster slayer Ultraman. As soon as he hits the shrink button, you are sucked into a world so awesome you have no choice but to brace yourself and see where the ride takes you. Stan Lee wanted to make this movie in the 80's but ironically Disney, the production company behind today's Ant-Man, already had a shrinking movie of its own in the works. While \"Honey, I Shrunk the Kids\" was amazing in its time, I couldn't be happier that they waited for the movie effects of today to let Ant- Man zip this way and that, from our world to the minuscule one and back. Coincidentally an ant saved the kids from a giant scorpion in that Rick Moranis classic, and in Ant-Man the ants also play a major role in saving the day. That's right. His power is not only to shrink to the size of an ant, but also to control an army of them. In that respect, this movie is unlike any superhero movie you've ever seen. The Pym Particle, created by Dr. Hank Pym (Michael Douglas) has the ability to shrink a living human being. Think of the possibilities! Microsurgery, mobility, and of course, warfare! The latter makes Dr. Pym realize just how dangerous this technology really is and he decides to cease research and development altogether. Years pass, and the existence of this technology is reduced to a myth. What Dr. Pym didn't know is that his own assistant Darren Cross (Corey Stoll, House of Cards) had been obsessing over this myth and has been trying to replicate this technology on his own. Stoll has a unique ability to make you sympathize for his character at times, but can also be straight up scary. Dr. Pym and his daughter Hope (Evangeline Lilly, Lost) know they have to stop Cross but keep butting heads. Hope is a badass, but Pym refuses to let her get involved, which reveals some deeper, more serious daddy issues. Their only hope is Scott Lang (Paul Rudd, my man crush), an ex-convict who was a professional burglar, not a robber because Lang insists that implies physical violence, and he's not about that life. To pull off the job, Lang enlists his original heist crew, played by David Dastmalchian, Rapper T.I., and Michael Peña, who offers some of the most hilarious scenes in the movie. What ensues is an adventure, a comedy, an action movie and a heist rolled into one Little Debbie oatmeal cookie crumb of elephantine excitement and pure elation. If you haven't noticed, I like this movie. Close friends may say I am biased because it stars Paul Rudd, whom I have been enamored with ever since Clueless. When Cher realized she was in love with Josh, I too realized Paul Rudd is my number one man crush. Let me close this by taking a moment to acknowledge how perfect Paul Rudd is in the role of Scott Lang/Ant-Man. He is a master at self-deprecating humor, as seen in movies like \"I Love You, Man\" and \"Knocked Up\" and his role as Mike Hannigan on \"Friends.\" This is a necessity when you see how Ant-Man may have somewhat of a Napoleon Complex when he inevitably has to measure up against the mighty Avengers. Paul Rudd has shown his chops as a dramatic actor in movies like \"The Shape of Things\" and \"Admission,\" and again here in Ant- Man as an estranged father, who wants nothing more than to spend more time with his daughter Cassie. While elements of his various roles can be seen in Ant-Man this was nothing like anything Paul Rudd has ever done before, and he pulled it off. His dedication can be seen not only in the moment that reveals his handsomely chiseled abs. In preparation for the role, Paul Rudd bought an ant farm to study. Even after he finished shooting, he decided to keep it. Just when you thought you couldn't fall in love with Paul Rudd any further. On the week the movie was released, Paul Rudd earned a Star on the Hollywood Walk of Fame, and deservedly so. Somehow it's not the star that immortalizes him in film history. It's his stellar performance in Ant-Man, the movie that will shrink and find its way into your heart and stay there forever.",
         "I think all the people who've written a negative review of this movie because of its apparent \"scientific contradictions\" are missing the point. How can people who accept a man turning into a green monster or holes opening in the sky and spitting out an army of hover bike-riding space aliens criticise the science in this film? That's probably the worse case of deluded double standards I've ever witnessed. No, the REAL problem with this movie is just like any other MCU film. The thunderingly dull expository dialogue, the pantomime characters, the cheap cinematography, the flat and stilted performances, the dramatically compromised script and the infantile tone. And the most insulting aspect is that every single one of these cinematic atrocities spends vast amounts of its running time promising us even more of this trash is still to come. The problem with Disney and Marvel and the relentless machine they've created is that so much money has been made from this dross that actually MAKING A GOOD MOVIE now seems to be nowhere near the top of their agenda. Another $175m gets spent, it opens, pimply faced kids vomit out their cash for a couple of weeks, then it goes to China, makes more, numbers are counted, accountants smile, Disney smiles, rinse and repeat. But nobody's making a good movie. And guess what? The studio doesn't care. THEY DON'T NEED TO ANYMORE. It's time to boycott this insanity. Life's too short and there are so many good films out there that won't make you feel like you've been brain-raped and just lost two perfectly good hours of your life. Disney be warned. Your days of guaranteed return on these turds is imminent.",
         "Through this masterpiece, on par with, in my humble opinion, all other Marvel movies currently out in the Avengers Saga, obviously including the side series, Marvel has completely blown me away. Character development, solid plot, fantastic humour and amazing cast all done flawlessly and did not leave me hoping for more, but rather asking 'When's the sequel coming out?' With Michael Douglas and Michael Peña, having seen them both in previous movies where their performances are exemplary to say the least, I expect such mastery, but with Paul Rudd, and all the other actors, given this is the first movie in which I ever saw them, I had no idea what to expect. Complete success! The fighting style of Ant-man is was as I expected since I have some background knowledge of the character, and yet I nonetheless could not have dreamt for such a good combination of just-enough special effects and fantastic actor performances! Ant-man is already brilliantly made, and it only gets more so during the combat scenes, for the ability to shrink and grow at will is something with which, to my great delight, Marvel got very creative, not holding back. I'm trying to figure out when I can watch it again.",
         "Its a shame so much money was spent on so little. I'm not talking about the premise of the movie, a microscopic super hero. No I'm talking about the dismal film, Ant Man, represents. This film, in spite of its budget and reasonable cast, feels a hell of a lot like a badly made B-Grade flick. The kind that goes straight to television. The acting is hammy and melodramatic, the storyline tedious and formulaic and the action badly timed and somehow, rather awkward and clumsy. In fairness, this is not easy subject matter to migrate from comic book to big screen. The notion of a super hero who can shrink in size is a tough one requiring very careful handling and timing. The fact the subject matter is tossed around like a football is the reason its such a mess. My advice, give this one a miss. Two out of ten from me.",
         "Okay, enough already! Another formulaic load of old tripe featuring boring, cocksure, dumb and supposedly somehow charming hero blessed with super powers he doesn't deserve and boring us all to death through two turgid hours of special effects and a plot you could write on the back of a postage stamp. (Iron Man, Green Lantern, et al. anybody?) This one thinks it's a bit of a comedy...except the lame jokes are sign posted about a mile away and deserve to be punctuated with a ba-dumb-tish on the snare drum. Ant Man. A lousy idea and a lousy film. 2 hours of my life I will never get back. And the threat at the end?: \"Ant Man will return!\" Don't bother!!",
         "I'll grant it from the start that Ant-Man is not my first choice for a superhero movie. Apart from Aquaman and The Wall, it was the stupidest thing one could think for a superhero. As it stands, I watched the movie mostly because my wife is a fan of Paul. So far every other movie he has starred in has been my cup of tea. Unfortunately this one is not. I'll give the movie a few credits. It had some humor effects that caused my to actually laugh out loud (instead of merely stating lol aloud) and some of the special effects used in the movie were decent enough. It also gave tidbits of information about ants. Unfortunately the storyline was awkward. Granted, the original concept wasn't much better either so I'd guess the screenwriters had to do with the concept of ... sigh ... Ant-Man to begin with. The shrinking / growing up suit mumbo-jumbo is ridiculous from the start, but I expected it and was able to get past that. It was just that the plot had enough holes in it that were fit for a truck to drive through. I actually laughed most when the sidekick character was worried about the well-being of a security guard he had knocked out earlier and dragged him off the building before it explodes, but paid no attention to the two guys he just knocked out. Of course, a few days is always enough time to teach a man to fight martial arts well enough to beat dozens of people. I attended Karate for two years and probably could not hurt a fly with my moves. The villain was a stereotypical bad guy with less depth than the world's shortest book (Swedish military victories since 18th century). Much like any of the bad guys in the very bad Steven Seagal / Chuck Norris / Van Damme movies I've watched in my youth (forgive me, I did not know better). In addition, in this movie he is stupid enough to aim for the super suit that will change everything when he already has a gun that can instantly remove any person from the face of the earth, leaving hardly any evidence of his/her existence behind. No, none of the powers in the world would pay any money for such weapon. Sigh. Supersuit has to have lasers that copy the sound world of imperial troopers. The idea of shrinking has been dealt in movies such as Innerspace or Honey, I Shrunk the Kids back in the 80s and truth be told, while the effects are slightly better these days, the story of a good movie requires more than a guy who can instantly change his size and use his fists to beat people up. Truth be told, superhero movies follow the same pattern. It would be more interesting to watch a movie about guys who have to clean up after the superheroes and villains have fought. They have to pick up the pieces, clean the neighborhood and rebuild everything. Only to start from scratch the next time the good/bad guys decide to have a go at each other. That said. Paul Rudd plays his character decent enough where Michael Douglas and the rest of the cast show up just to collect their paychecks and fail to deliver anything resembling any sort of realistic emotion or character behavior. If you like the guy, you might check this movie out. If not, there's better things to do for the next 2 hours of your life.",
         "This reviewer wants to be like Paul Rudd when he turns 46. He first saw the New Jerseyborn actor on the popular sitcom Friends as Phoebe's love interest Mike Hannigan, and loved how he carried off the character with a slacker charm. He then went on to takes on roles in Anchorman: The Legend of Ron Burgundy (2004), The 40 Year Old Virgin (2005) and Knocked Up (2007). Although he played supporting characters in this comedies, there's always that special something which made viewers pay attention. And now, Rudd is Ant-Man! Yes, a Marvel superhero! If you are like this reader, who isn't a walking encyclopaedia of Marvel history, you probably haven't heard of Ant-Man. Who can take a superhero with a name like that seriously? Not us. Are you sure you need Ant-Man when you've already got Iron Man, Thor, Hulk, Captain America, Black Widow and Hawkeye from The Avengers? One thing we are setting straight here – we enjoyed Ant-Man more than the recent The Avengers: Age of Ultron. The Peyton Reed directed movie, which is also the 12th installment of the Marvel Cinematic Universe (who's keeping count, really?), sees protagonist Scott Lang (Rudd) help Dr Hank Pym (the always reliable Michael Douglas) safeguard the mystery of a technology which allows users to decrease in size but increase in strength. In the movie, you will hear some scientifically complicated terms, but there isn't really much to know. You just need to be aware of the fact that there is a need to stop a heist that will destroy Earth, The threat comes in the form of Yellojacket, a thwarted version of the technology helmed by Darren Cross, and coming along for the ride is Dr Pym's daughter Hope van Dyne, and a motley crew of former thieves who will aid Lang save the world. The 117 minute movie is a very refreshing change from the slew of superhero movies we've been seeing. No overwrought emotions, no excessive self righteousness and no overbearingly dark tones. What you get instead, is a very likable protagonist (thanks to Rudd's appeal, of course) who is an everyman you want to root for. The result is a superhero movie that makes you sit up and watch, laugh and enjoy till the very last minute. Because it is backed up by a major studio, you can still expect the usual special effects, big explosions and well choreographed action sequences. These are enough to keep fans of Hollywoodblockbusters happy, and to have them feeling that the movie is well worth the price of the ticket. Credit goes to a wonderful ensemble cast, which includes Evangeline Lilly (The Hobbit series, TV's Lost) as the serious but well intending daughter, Corey Stoll (Dark Places, TV's House of Cards) as the villainous disciple and Bobby Cannavale (Blue Jasmine, Chef) as a stepfather to Lang's daughter, as well as Michael Pena (End of Watch, American Hustle), rapper Tip \"T I\" Harris and David Dastmalchian (The Glass Menagerie, Buried Child) as Lang's amusing but resourceful friends. In this day and age where everyone takes everything too seriously, this is one superhero movie that you'll fine immensely entertaining and enjoyable, without compromising on storytelling and action. Oh, you should also stick around to watch not one, but two end credit scenes which will eventually take the Internet by storm.",
         "Marvel returns to top form after the extremely underwhelming and disappointing 'Avenger's: Age of Ultron' to give us 'Ant-Man'. It is the 12th film in the long running cinematic franchise. A refreshing look at a whole set of new character and a whole new adventure to accompany them. This for me is without a doubt one of the best MCU films, if not marvel films in general, to come out in recent years. With an intelligently written, charming and HILARIOUS script. WITHOUT a doubt Marvel's funniest movie to date. The dialogue in this movie has Edgar Wright written all over it. There's not a joke that doesn't hit at least one member of the audience. Lines that nobody laughed at I understood the references and found them to be hilarious. It definitely has a style of humour that will cater to all kinds of people. But it isn't a comedy, it's just unbelievably funny, at heart it's a heist film. And a damn good one at that It never diverted off track as many blockbusters in recent years have done. It was a well told plot, it never really felt convoluted or messy. When one arc was being told it stuck to that one arc and it was clear cut and you always knew what was happening on screen when it was happening. As I've stated in my previous paragraph it's obvious to any one that this was in some parts written and influenced by Edgar Wright. Some of the coolest and likable characters in the whole of the MCU appear in this movie. Every word that came out of Michael Peña's mouth had me in stitches, he was one of the many highlights of the movie. One of which being Paul Rudd as the titular character. With such charisma and character he graces the screen and the majority of the scenes he's in, well, any scene without Peña that is. Having such a likable person play a very down on his luck guy who's just trying to turn his life around and be a better father to his daughter really adds to the sympathy you feel for the character. And makes you want him to succeed. I liked how they stuck to the mythos of Scott Lang, having him be a thief and a crook, having him steal the suit from Hank Pym (Michael Douglas) was straight out of the comics. Unlike with Tony creating Ultron instead of Pym. It's definitely one of the most 'close to the source material' marvel films to be released which is something admirable in itself. All the little details like having the daughter of Hank, Hope, added into the mix. The story of how Janet died wasn't exactly accurate but it worked perfectly with the story. It seemed like a good way of going about it, it added emotion and depth to the characters to make you care for them more. To which the critics say there was no emotional weight, but when you have likable characters in a movie played by likable people and a well written script to go along, you definitely start to feel sympathy for them in a way that it doesn't feel shoehorned in. Unlike again, the Black Widow and Bruce Banner love interest or the death of a certain character. It isn't forced in there out of the blue to make you care how they end up. You care because of how well they're written. You may feel like in nitpicking and bashing Age of Ultron but I'm not, these little detours have a reason. That reason is the right and wrong way to do it. And this was definitely the right way. The villain: He wasn't top tear MCU villain like, in my opinion Loki and, who else? Nope just him. He wasn't in it a huge deal. He wasn't really fleshed out, but I could see from the trailers that he wasn't really going to be. He showed emotion and reasoning that could seem justifiable to some. But he never had a just cause, the story of why he was doing what he was doing wasn't really explained. He just seemed angry at Hank for tossing him aside. It felt in a way like a good old fashion revenge story but with a slightly different agenda more than it did anything else. He could have been a little more developed, but it's marvel, what can you do? He was menacing and Corey Stoll portrayed him quite well considering what he was given. I think another thing I liked about this movie was it's use of CGI and special effects. It wasn't overbearing like in *Cough* Age of Ultron *cough*, sorry. It was well used, it was easy on the eyes and not shoved right in your face like he whom shall not be named. It was just the right amount. The action scenes are great, there's levels of threat that you feel. You feel kind of suspenseful, not much but it's definitely there. The parts where the main characters were in peril weren't as life threatening as they maybe could have been. But these are minor if not unnoticeable discrepancies. All in all 'Ant-Man' is a SUPER FUN MOVIE, I had a ball with this film. I was in hysterics as the humour hit a good 90% of the time. Action is realistic and believable and the villain while not very fleshed out was threatening on screen. This movie is, as Jeremy Jahns would put it. AWESOMETACULAR!!",
         "This film was just plain terrible. This was actually the first film that I saw that had Paul Rudd in it. Besides that fact, being that I've enjoyed most other Marvel films, I decided to give Ant-Man a try. This, film, however, was simply not good. Once the film was finished, I actually walked out of the theater somewhat happy knowing that I used a free ticket that I got through my theater's rewards program to go see it. Otherwise, I would've regretted even spending money on it. As a superhero, Ant-Man seems to be one of the weakest links in the Marvel superhero chain, as his only special ability is to shrink to the size of an ant while confusing his enemies of his presence at the same time. Not much of a superpower, if you ask me. My biggest gripe with this film was that there was WAY too much forced comedy in it. Michael Pena had to be the most annoying person in this film, with his constant carrying on about almost everything, aiming to be funny when in reality, it's just annoying. Quite a few of Paul Rudd's jokes in the film seemed to fall flat, too. The story plot seemed incredibly slow, too, aiming to focus on more of the main character's relationship with his ex-wife and family than anything else. Just when things couldn't get any worse, the biggest head scratcher in the film seemed to be an unnecessary cameo from Falcon, who seemed terribly out of place. The fight with Yellowjacket was lame, too, as it didn't even seem to last that long. One thing I will mention, though, is how well they managed to make Michael Douglas look about 30 years younger in the beginning of the film. So whoever was in charge there, well done! Moreover, perhaps the funniest part of the film is when an ant is super-sized and was seen walking out of Lang's house. Not only that, but when Lang's daughter Cassie had her toy train (Thomas the Tank Engine) super-sized and then came crashing out of the house onto a police car...that in itself was also moderately amusing. Aside from that, this film wasn't anything to ride home about, and I can only hope that Marvel realizes that by not making a sequel to this...EVER. I'll take The Avengers and Captain America film series over this film any day.",
         "With a story that is pretty good, but it's not great. Quite cohesive. Good point showing the old superhero training the young one. A little too many cliché phrases. Paul Rudd is quite good, handles well the comic point, which otherwise would be a disaster.It's entertaining, with good special effects. Some great fighting scenes, specially the one in which they make the giant train. They have made a decent movie with a superhero who at first seems to not give much of itself. The little superhero has rightfully earns a place amongst marvel MOVIES superheroes. Nice ending with the reference to Avengers. quenometoque.wix.com/unaltodelante"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Gary Sanchez Productions",
         "Marvel Studios",
         "Walt Disney Pictures"
      ],
      "summaries": [
         "Armed with the astonishing ability to shrink in scale but increase in strength, con-man Scott Lang must embrace his inner-hero and help his mentor, Dr. Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.",
         "Scott Lang, an engineer who committed a crime he felt that was justified, is sent to prison. When he gets out he wants to be on the straight and narrow for his daughter but having a record doesn't help. And his ex-wife refuses to let him see his daughter because he can't find a regular job. Eventually his friend tells him of a job and he decides to take it. Scott has to break into a vault and when he does all he finds is a weird suit. After he takes it, he puts it on and discovers it shrinks him. Scott tries to return it and when he does he's arrested, A man claiming to be his attorney goes to see him and he tells him that the suit was an opportunity which he should have taken. Later some ants bring him the suit and he puts it on and gets out of jail. He then goes to the man who says he's Hank Pym the man who created the suit. He used it before and called himself Ant-Man. He gave it up when he found out people were planning to use his technology for things he doesn't think is right so he made sure no one could replicate it and put it away. But he now needs Scott to be Ant-Man because it seems like his protégé, Darren Cross, who forced him out of his company, is close to replicating it. So he wants Scott to get into the lab and take it. Scott is uncertain if he can do it and Pym's daughter who thinks she should be the one to go agrees. But Pym thinks Scott is the one. So they train him while trying to make sure Cross doesn't suspect anything.",
         "In 1989, the scientist Dr. Hank Pym quits working for the S.H.I.E.L.D. when he discovers that they have unsuccessfully tried to replicate his shrinking technology named Ant-Man that he considers too dangerous for mankind. In the present days, Dr. Pym was forced by his daughter Hope van Dyne and his former protégé Darren Cross to leave his company Pym Technologies to them. Further, he finds that Darren is developing his own shrinking technology named Yellowjacket. Meanwhile, the small-time criminal Scott Lang is released from prison and welcomed by his former cell mate Luis that wants him to participate in a heist. However Scott wants to find an honest job to take care of his beloved daughter Cassie that lives with his estranged wife Maggie and her future husband Detective Paxton. However his criminal record does not give a chance to him and he accepts to participate in the heist of the house of a millionaire. He finds only a special suit in the safe and he is arrested again by the police. Soon he learns that he is part of the scheme plotted by Dr. Pym and Hope to make him a superhero wearing the suit and save the world destroying the Yellowjacket. Without any alternative, Scott is trained by Dr. Pym and Hope in the beginning of an incredible adventure.",
         "After serving a few years in prison, former burglar Scott Lang is released. Now wanting to be straight, Scott sets out to find himself a job. But he is totally unaware that his record is preventing him from working and seeing his young daughter Cassie. When he steals a powerful suit, he quickly returns it only to find himself arrested again. But a mysterious man named Hank Pym has other ideas for him. Pym explains that it has the power to shrink in size and increase in strength due to a special formula called the Pym Particle. He was once it's owner and called himself Ant-Man. Unfortunately during his SHIELD days, Pym discovers that others wanted to replicate his design. Now Pym wants to use Scott to being the new Ant-Man because his former apprentice Darren Cross is working to replicate the formula for his own evil purposes. So Scott and Pym, along with Pym's daughter Hope must plan a heist that will stop Cross and save the world from certain chaos.",
         "Armed with a super-suit with the astonishing ability to shrink in scale but increase in strength, cat burglar Scott Lang must embrace his inner hero and help his mentor, Dr. Hank Pym, plan and pull off a heist that will save the world."
      ],
      "budget": 130000000
   },
   "movielensId": 122900,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-07-14",
      "dvdReleaseDate": null,
      "directors": ["Peyton Reed"],
      "runtime": 117,
      "movieId": 122900,
      "title": "Ant-Man",
      "mpaa": "PG-13",
      "actors": [
         "Paul Rudd",
         "Michael Douglas",
         "Evangeline Lilly",
         "Corey Stoll",
         "Bobby Cannavale",
         "Michael Peña",
         "T.I.",
         "Anthony Mackie",
         "Wood Harris",
         "Judy Greer",
         "Abby Ryder Fortson",
         "David Dastmalchian",
         "Martin Donovan",
         "Hayley Atwell",
         "John Slattery",
         "Garrett Morris",
         "Gregg Turkington",
         "Rod Hallett",
         "Joe Chrest",
         "Joe Bucaro III",
         "Jean Louisa Kelly",
         "Dax Griffin",
         "Hayley Lovitt",
         "Norma Alvarez",
         "Darcie Isabella Cottrell",
         "Teddy Williams",
         "Carol Anne Watts",
         "Chuck David Willis",
         "Diana Chiritescu",
         "Neko Parham",
         "Onira Tares",
         "Kylen Davis",
         "Zamani Wilder",
         "Jim R. Coleman",
         "Desmond Phillips",
         "Aaron Saxton",
         "Michael A. Cook",
         "Ricki Lander",
         "Rus Blackwell",
         "Johnny Pemberton",
         "Nicholas Barrera",
         "Carlos Aviles",
         "Lyndsi LaRose",
         "Robert Crayton",
         "Ajani Perkins",
         "Jessejames Locorriere",
         "Zack Duhame",
         "Kevin Lacz",
         "Michael Trisler",
         "Daniel Stevens",
         "Alex Chansky",
         "Clay Donahue Fontenot",
         "Michael Jamorski",
         "Casey Pieretti",
         "Antal Kalik",
         "Adam Hart",
         "Reuben Langdon",
         "Todd Schneider",
         "Kevin Buttimer",
         "Danny Vasquez",
         "Anna Akana",
         "Stan Lee",
         "Tom Kenny",
         "Rick Avery",
         "Erik Betts",
         "Chris Evans",
         "Sebastian Stan"
      ],
      "imdbMovieId": "0478970",
      "originalTitle": "Ant-Man",
      "genres": [
         "Science Fiction",
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": [
         "79mfp1hY3Uw",
         "pWdKf3MneyI",
         "Nfcn9Um8sk8",
         "TfTcx_TwXq8",
         "xInh3VhAWs8",
         "cx3joJnXydc"
      ],
      "plotSummary": "Armed with the astonishing ability to shrink in scale but increase in strength, master thief Scott Lang must embrace his inner-hero and help his mentor, Doctor Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.",
      "tmdbMovieId": 102899,
      "avgRating": 3.58667,
      "releaseYear": "2015",
      "numRatings": 5244,
      "posterPath": "/D6e8RJf2qUstnfkTslTXNTUAlT.jpg"
   }
}