{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "birthday",
            "id": 1421
         },
         {
            "name": "song",
            "id": 4528
         },
         {
            "name": "birthday party",
            "id": 5732
         },
         {
            "name": "princess",
            "id": 7376
         },
         {
            "name": "snowman",
            "id": 10115
         },
         {
            "name": "animation",
            "id": 10336
         },
         {
            "name": "reindeer",
            "id": 10385
         },
         {
            "name": "birthday cake",
            "id": 14599
         },
         {
            "name": "frozen",
            "id": 181128
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "birthday present",
            "id": 190703
         },
         {
            "name": "short",
            "id": 214549
         }
      ],
      "imdb_id": "tt4007502",
      "video": false,
      "title": "Frozen Fever",
      "recommendations": [
         82881,
         150689,
         355338,
         109445,
         44683,
         297270,
         293299,
         10198,
         224141,
         75258,
         286192,
         175112,
         13179,
         159824,
         228161,
         25475,
         172385,
         14128,
         270946,
         11224
      ],
      "backdrop_path": "/ubioPGniCfDiASmYYpeJs5RRNaC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Anna (voice)",
               "gender": 1,
               "credit_id": "54e7501792514126ae000a2a",
               "name": "Kristen Bell",
               "profile_path": "/9DoDVUkoXhT3O2R1RymPlOfUryl.jpg",
               "id": 40462,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Elsa (voice)",
               "gender": 1,
               "credit_id": "54e7502592514110f6001079",
               "name": "Idina Menzel",
               "profile_path": "/h7xxQ7jVPBy5jjOsE89V3LSAkns.jpg",
               "id": 19394,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Kristoff (voice)",
               "gender": 2,
               "credit_id": "54e75039c3a3685af7001ae9",
               "name": "Jonathan Groff",
               "profile_path": "/xkFr1vd1pO2Ls2gQxxuMd1mgrfL.jpg",
               "id": 221611,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Olaf (voice)",
               "gender": 2,
               "credit_id": "54e750449251416f490018a0",
               "name": "Josh Gad",
               "profile_path": "/6ctni3kK4lPteBAInd7kKZyCdZD.jpg",
               "id": 54415,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Oaken (voice)",
               "gender": 2,
               "credit_id": "550d7e92c3a368487d005e40",
               "name": "Chris Williams",
               "profile_path": "/eE2NDdeKN1DC3XuV6L4xuEbVaS.jpg",
               "id": 70238,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Marshmallow (voice)",
               "gender": 0,
               "credit_id": "550d7ea3925141469c005ac1",
               "name": "Paul Briggs",
               "profile_path": "/vccGfQWvG6nBaMD080uDS4Vaj26.jpg",
               "id": 1340669,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "54e75064c3a3685b0000164d",
               "name": "Chris Buck",
               "profile_path": "/aFzDfJIIOC0tkGgqpwsZoDHzqu0.jpg",
               "id": 15774,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "54e7507a92514110f600107e",
               "name": "Jennifer Lee",
               "profile_path": "/9BkQnsppXFWcNSRGo4GJ6QNq313.jpg",
               "id": 1120694,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "550d7ebcc3a368487700587b",
               "name": "Christophe Beck",
               "profile_path": "/2fnJUmCk6IEpVIptpYaUk31epHx.jpg",
               "id": 23486,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "550d7ec9c3a36848720060dd",
               "name": "John Lasseter",
               "profile_path": "/7EdqiNbr4FRjIhKHyPPdFfEEEFG.jpg",
               "id": 7879,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "550d7ed7c3a3684886005db7",
               "name": "Peter Del Vecho",
               "profile_path": null,
               "id": 61416,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "550d7ef4c3a3684877005883",
               "name": "Aimee Scribner",
               "profile_path": null,
               "id": 1443211,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "550d80dc92514133c3003989",
               "name": "Jeff Draheim",
               "profile_path": null,
               "id": 968327,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "550d80f0c3a368487d005e8b",
               "name": "Angela Frances D'Anna",
               "profile_path": null,
               "id": 1046477,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "55316553925141529b00071b",
               "name": "Nicole Mitchell",
               "profile_path": null,
               "id": 1364882,
               "department": "Writing",
               "job": "Storyboard"
            },
            {
               "gender": 0,
               "credit_id": "555171169251414f39003bb6",
               "name": "Jeff Williams",
               "profile_path": null,
               "id": 1460478,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 9.306146,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 326359,
      "vote_count": 788,
      "budget": 0,
      "overview": "On Anna's birthday, Elsa and Kristoff are determined to give her the best celebration ever, but Elsa's icy powers may put more than just the party at risk.",
      "similar": [
         10530,
         109445,
         11544,
         10693,
         10882,
         10555,
         10144,
         10198,
         10020,
         808,
         812,
         38757,
         634,
         773,
         2649,
         4523,
         376660,
         5393,
         9607,
         35690
      ],
      "original_title": "Frozen Fever",
      "runtime": 8,
      "poster_path": "/lKJiVPzsAO9IJ4LKWXZ8vkR2bg4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         },
         {
            "logo_path": "/tVPmo07IHhBs4HuilrcV0yujsZ9.png",
            "name": "Walt Disney Animation Studios",
            "id": 6125,
            "origin_country": "US"
         }
      ],
      "release_date": "2015-03-09",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Chris Buck",
         "Jennifer Lee"
      ],
      "runtime": 8,
      "synopsis": "Queen Elsa is excited because today is Anna's birthday and intends to make sure her sister's special day is perfect. Using her ice powers, she creates a special ice decoration on the top of Anna's birthday cake: figures of Anna and Elsa ice-skating happily together. Kristoff made a banner that he hung up across the castle courtyard which reads \"Happy Birthday Anna\". Elsa and Kristoff spent all morning preparing everything and now time was running out. Before dashing off to wake up Anna, Elsa leaves Kristoff in charge of looking after everything until the guest of honor arrives. Elsa tiptoes into Anna's room and gently nudges her sister, who is still asleep. Anna struggles to wake up but after being told about the day Elsa has planned for them, she immediately jumps out of bed. When Elsa sneezes, neither of the sisters notice that two tiny snowmen pop into the air, drop to the floor and scamper away. Starting off the day, Elsa uses her magic to create sparkly new dresses for each of them before heading out on a mystery tour which involves following a long string that Elsa had wound through the castle, leading Anna to different gifts. Inside a suit of armor, Anna finds a bracelet. Inside an armoire, she finds an Olaf cuckoo clock. And on a balcony, there's a bouquet of sunflowers. Elsa sneezes again and more little snowmen pop into the air and tumble to the ground, but still the girls don't notice. The snowmen scurry into the courtyard where Olaf finds them and is thrilled to see them. Anna and Elsa follow the string all over Arendelle. Along the way, Anna discovers more presents: a family portrait, silk stockings, even a fishing pole. All the while, Elsa continues to sneeze and each time she does, more little snowmen appear and still the girls don't spot any of them. Anna is having a wonderful time but is concerned for Elsa's health. She feels she should go home and rest but Elsa declines. She leads Anna to Oaken's shop, where she presents her with one of Oaken's beautiful heavy cloaks. Then noticing her sneezing, Oaken presents them with a bottle of medicine which Anna accepts gratefully, knowing they may need it. Next, Elsa takes Anna to the center of the village, where a children's choir sings for Anna. Back at the courtyard, Kristoff, Sven and Olaf try to keep things under control as more tiny snowmen run in, causing a lot of chaos and trouble for them. When Kristoff spots several little snowmen climbing up to the cake, he grabs Olaf's head like a bowling ball and takes aim. Olaf's head rolls into the snowmen, knocking them away from the cake. Suddenly, the little snowmen knock down Kristoff's banner. Olaf manages to rehang the letters but it isn't quite the same as before. Meanwhile, Elsa leads Anna to their last stop, where at the top of the clock tower was her last gift. Anna's arms are now overloaded with presents and Elsa's cold is getting worse. Anna insists that Elsa needs to rest, but she doesn't listen. Already she is feeling feverish as she climbs the stairs to the top of the tower till finally she loses her balance. Anna drops her gifts and rushes to catch her. She notices Elsa is burning up with a fever and needs to get into bed, which Elsa finally agrees to. As Anna escorts her home, Elsa feels she ruined her perfect birthday but Anna tells her she hasn't. Then as they enter the castle gates, Anna is surprised by Kristoff, Sven, Olaf and the hundreds of little snowmen who present her with her birthday cake and a special birthday song. Caught up in the excitement of the song, Kristoff sings loudest of all and bursts out \"I love you, Baby!\", becoming very embarrassed with Anna grinning at him happily. Though tired, Elsa insists on blowing the Birthday Horn, and sneezes into it, launching a giant snowball all the way to the Southern Isles, where it hits Hans as he is shoveling manure at the royal stables. Afterwards, Anna helps Elsa into bed and thanks her for a great birthday and giving her the best present she could ever have; Elsa letting her take care of her. High on the North Mountain where stands the ice palace, Marshmallow is visited by Kristoff, Sven and Olaf who present to him a parade of the little snowmen who would now be living with him. By: DisneyWiki",
      "writers": [
         "Chris Buck",
         "Jennifer Lee"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4007502/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjM3ODU1NTk3NV5BMl5BanBnXkFtZTgwNjYzNzUwNjE@._V1_SY317_CR104,0,214,317_AL_.jpg",
      "actors": ["Stars: Kristen Bell, Idina Menzel, Jonathan Groff | See full cast and crew »"],
      "reviews": [
         "What's the point of this? It's not long enough to have any kind of real story so you wind up with an unnecessary short that just serves as a reminder that there was this movie a couple of years ago that had these characters people liked. I mean the whole thing is basically one song stretched over a thin plot about a birthday party for Anna. That's it. It doesn't feel like they had this amazing idea for a short in mind but that they just wanted to keep the Frozen brand alive while they worked on a feature-length sequel. Maybe I'm wrong about the motivation but the whole thing just seems pointless beyond the commercial reasons. Look, I'm not saying it's a bad cartoon. It's fine for what it is but it really makes you appreciate the animated theatrical shorts from decades ago when people put effort into crafting a quality cartoon with a limited running time.",
         "It's Anna's birthday and Elsa is determined to make it a \"perfect day\" in order to make up for all of the birthdays she's missed in the past. While she takes her sister on a treasure hunt for presents around town (bumping into some familiar faces), Kristoff is left in charge of guarding the decorations. All seems well, until Elsa's cold starts to cause havoc; let's just say that when a Snow Queen sneezes, there's a high chance that's she'll end up polluting the area with extremely hyperactive \"snow babies\". Will the day be ruined, or will Kristoff and Olaf manage to keep them in tow? \"Frozen Fever\" is colourful and fun, packed with stunning animation and humour to keep both children and adults intrigued. It offers numerous nods towards the original movie (including one \"Let it Go\" pun to make you giggle) and a catchy song that will surely stay in your head for days. Be warned \"Frozen\" fans: \"Frozen Fever\" may just get you even more hooked than you were before! A solid 10/10",
         "Disney's 2013 film \"Frozen\" is truly a milestone in movie history. It became the highest-grossing animated film of all time, with over USD 1.2 billion box office revenue. It's also the first female- directed film to reach the billion dollar mark, thanks to Jennifer Lee. Now that if you miss to see the phenomenon in theaters, now is the chance to catch up. The short film centers on Elsa's preparation to Anna's birthday, with help from Kristoff, Sven, and Olaf. It's funny and heartwarming. It's probably 8-10 minutes long only, and you'll beg for more. \"Making Today A Perfect Day\" is treated as the successor to the YOLO song \"Let It Go\". It's catchy and good, and consistent to the aura of the Disney Princess franchise. Expect some nice surprise at the last 2 minutes! It might be important for the upcoming full-length sequel. Franchise movies thrive because audiences connect with characters. Even I myself experience it. \"Frozen 2\" is coming for sure, and it's too awesome to miss.",
         "First of all there are a lot of easily pleased people on here. stop calling this a movie or film because it is neither, it is a short animated \"Clip\", nothing more, thinking it is anything other than that only shows how deluded most people are, My Child was left with \" was that it\", there wasn't enough time for it to grab any attention and served only as a means to give frozen attention it has otherwise lost. Frozen Fever lacks any sort of real story telling and falls short when attempting to get you interested, from an un-catchy tune to an ending leaving you thinking, didn't that thing fall of a cliff in the first one, now it's friendly.",
         "I never really go t the buzz about Frozen I think Disney has done much better before, maybe it had more merchandise for children to obsess about I don't really know. I preferred Tangled and other Disney films, I Think Frozen is extremely overrated and Frozen Fever even more so it is just a song and i think that the way the fans obsessed about Frozen Fever coming out they could have made something better. I only watched Frozen fever because it was forced upon me at the beginning of Cinderella. I think that people expect a lot from Frozen and Frozen Fever but my advice is not to expect it to be amazing. I went in watch Frozen and Frozen Fever with an open mind but I was disappointed I expected the film and its spin off short to be a lot better. So again I am disappointed.",
         "After 2 years of original movie ,Disney and the directors of Frozen make a short (which i like to call it Movie episode special video)to show as what happen after when Elsa learn to control her powers. I was really excited to see this short when it first come out ,even this short it was about Elsa tried to give Anna the best celebration for her Birthday ever. I was expecting to see the sequel of Frozen this year but what to end up it wasn't bad at all. So let's have a look Story: Well is what i say earlier is about Elsa tried to give Anna the best celebration for her Birthday ever but something goes wrong and by the end everything is fine. As you probably know is Birthday Episode (sort of). The story is little weak because of the cliché (the main character tried he best to make it perfect but something goes wrong and it is in chaos but by the end everything is fine ) Characters: All the Characters are the same except Elsa it has changed before it was the quite and far away character because it was afraid to hurt someone with her power and now is happy, it enjoy what he doing and it has really good relationship with her sister Anna. What a really love of this short is the relationship between with the sisters. Animation: The Animation is a little better of the movie(not much)for example the girls new dresses look really beautiful and the little tiny snowman's Songs : The New Songs by Idina Menzel are really good but not as Awesome & Catchy as let it go & love is a open door ,but the new songs of this short they are really Good,Heartwarming and Catchy. My Favorite songs of this short is Touch of Ice. Overall this short is really Heartwarming ,Charming and really enjoyable to watch it ,is still on Theaters with the live-action remake Cinderella (2015) go ahead and watch you are not going to be disappointing especially if you are a fan,big or huge fan of the frozen movie. I like the short really much and i am clad to see it ,the strongest point of this short is the relationship between with the sisters. The Only problem i have of this short (is not so big problem for me) the story is a little weak because of the cliché of a Birthday Episode (you know the main character tried he best to make it perfect but something goes wrong and it is in chaos but by the end everything is fine) i give this short B+ 4/5 8/10 81/100 and 4 stars Thanks you Disney and as for the squeal of Frozen i am really excited to see it when it come out i want more of the relationship between with the sisters,what new adventures will come for are heroes and a new and a really good villain (because Prince Hans as a villain is awful)",
         "Preceding \"Cinderella\" in its theatrical release is \"Frozen Fever,\" a short film revolving around the characters from the hit Disney film \"Frozen.\" The short involves Elsa (voiced by Idina Menzel) and her friends Hans, Sven the moose, and Olaf the snowman (Josh Gad) preparing a surprise party for her younger sister Anna (Kristen Bell). Elsa, however, has a cold, where every sneeze produces several tiny little snowmen, sort of resembling Olaf, but she persists on, taking her sister through all of the little decorative zones she has set up for her before taking her to the final party. The short reinforces my believe that the \"Frozen\" characters are best in small doses, and I only wish now that instead of the \"Frozen 2\" we all knew was coming, we'd see these characters populate several, extremely fun shorts like this.",
         "Frozen Fever is the short animation special made for fans of Frozen and it kind of serves as a sequel to the movie. However it is an short film to hold over fans of Frozen. What makes the film works is that Kristen Bell, Idina Menzel, Josh Gad, and Jonathan Groff all return to reprises their respected roles as Anna, Elsa, Olaf and Kristoff. So it will bring some special meaning to the fans to get the original cast together for this short film. The plot of the film is that It's Anna's birthday and Elsa wants to make this a special day for her sister unfortunately Elsa has a cold but she is determent not to let that stop her from making Anna's Birthday special. The song \"Making Today A Perfect Day\" is the main song of the film and it is very catchy and original to boot. They pick a strong song for the film. Animation for this film is superb as in the first film very much attention to detail for the characters as well as the snow effects. Voice acting very interesting from the start as the cast show us why we fell in love with the characters in the first place. Plus with Jennifer Lee and Chris Buck return to direct the movie and once again deliver on the film so nice. The film is just all together fun for all ages if you love the first movie you will love this special short animation film, the film feature amazing artwork, superb voice acting, humor plus nice nods to the first film. I give Frozen Fever an 9 out of 10",
         "I really enjoyed the movie \"Frozen\", so I was looking forward to this short film for a while. And while I was not totally won over by it, I was not disappointed either. The story is basically Elsa preparing the perfect birthday for her sister Anna with the help of all their friends from the feature film. And also the not-so friends appear again in this film, so that you get basically all the important characters from the film, which is always nice, even if it is just for a very short moment like the sauna owner. There is a reference to the famous song from the film as well (check my title) and in general there is at least as much singing than talking in this movie, maybe almost a bit too much for my taste. These 8 minutes have some decent comedic moments and the drama about Elsa's cold is nicely chosen, but not too severe for such a short film. What I liked most about it are all the tiny snowmen coming out of Elsa's mouth. I think it's inevitable that there will be a second \"Frozen\" film at some point and I hope the include them there as well. And Olaf's comment about not being able to read or spell was so random and pretty great too. So yeah, it's not a must-see (as the full feature film), but a nice little addition for everybody who enjoyed the movie. Recommended.",
         "Elsa is preparing for Anna's birthday, but a cold sends a few things awry. \"Frozen Fever\" is a short opportunity for the characters to strut their stuff, especially Olaf. I understand that \"Frozen 2\" is currently planned, but I don't know how they would continue the story. I think that any continuation would have to come in short snippets like this one. Both Elsa and Anna have brought a more complex dimension to the world of Disney princesses. In the end, I found this to be a good short. The cast of \"Frozen\" returns to voice the characters and gives them real vivacity. You'll probably enjoy it. John Travolta is never going to live down that mispronunciation of Idina Menzel's name."
      ],
      "genres": [
         "Animation",
         "Short",
         "Adventure",
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": [
         "Walt Disney Animation Studios",
         "Walt Disney Pictures"
      ],
      "summaries": [
         "It's Anna's birthday and Elsa plans to throw her the perfect surprise party with the help of Kristoff and Olaf. However, after planning the huge party and as Anna is being led on a \"party treasure hunt,\" Elsa finds that she has caught a cold. She starts sneezing and produces a group of small, cute snow people, much like Olaf, with each sneeze. After some near-misses, a very exhausted Elsa finally makes it with Anna to the courtyard where the party has been arranged. It is a big hit, and at last Anna manages to convince Elsa into letting her to lead her to bed and take care of her. Meanwhile, Olaf has taken the tiny snow creatures under his wing and takes them to Elsa's ice castle with the help of Kristoff.",
         "On Anna's birthday, Elsa and Kristoff are determined to give her the best celebration ever, but Elsa's icy powers may put more than just the party at risk."
      ],
      "budget": 0
   },
   "movielensId": 130075,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-03-09",
      "dvdReleaseDate": null,
      "directors": [
         "Chris Buck",
         "Jennifer Lee"
      ],
      "runtime": 8,
      "movieId": 130075,
      "title": "Frozen Fever",
      "mpaa": "G",
      "actors": [
         "Kristen Bell",
         "Idina Menzel",
         "Jonathan Groff",
         "Josh Gad",
         "Chris Williams",
         "Paul Briggs"
      ],
      "imdbMovieId": "4007502",
      "originalTitle": "Frozen Fever",
      "genres": [
         "Adventure",
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["bQRLVxZHKPs"],
      "plotSummary": "On Anna's birthday, Elsa and Kristoff are determined to give her the best celebration ever, but Elsa's icy powers may put more than just the party at risk.",
      "tmdbMovieId": 326359,
      "avgRating": 3.17489,
      "releaseYear": "2015",
      "numRatings": 223,
      "posterPath": "/lKJiVPzsAO9IJ4LKWXZ8vkR2bg4.jpg"
   }
}