{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "flying",
            "id": 334
         },
         {
            "name": "magic",
            "id": 2343
         },
         {
            "name": "fairy tale",
            "id": 3205
         },
         {
            "name": "peter pan",
            "id": 4332
         },
         {
            "name": "mermaid",
            "id": 5938
         },
         {
            "name": "pirate",
            "id": 12988
         },
         {
            "name": "fantasy world",
            "id": 170362
         }
      ],
      "imdb_id": "tt3332064",
      "video": false,
      "title": "Pan",
      "recommendations": [
         257445,
         290595,
         274854,
         241259,
         10601,
         68737,
         224141,
         150689,
         166424,
         159824,
         181533,
         76285,
         228066,
         257344,
         205584,
         205775,
         158852,
         294272,
         76757,
         105864
      ],
      "backdrop_path": "/vvlm7EsLFXCsibshcnnswa9S6ki.jpg",
      "revenue": 128388320,
      "reviews": [
         {
            "author": "Frank Ochieng",
            "id": "561b0975c3a3685101002082",
            "content": "As likened to an innocuous fairy tale rash, the movie mythology surrounding J.M. Barrie’s classical kiddie character “Peter Pan” comes and goes when it pleases. Naturally there have been several big screen interpretations to outlast one’s reserved stash of pixie dust to fling around. From perhaps the best known animated film adaptation of Walt Disney’s nostalgically revered version to the surprisingly big-budgeted Steven Spielberg-directed spectacle dud Hook with a high-caliber cast the legend of “The Boy That Never Grew Up” seems to spark the challenge of presenting yet another spin on Barrie’s iconic treasured tyke.\r\n\r\nIn director Joe Wright’s sci-fi fantasy action-adventure Pan the familiar factors of Barrie’s magical Boy Wonder are evident and should serve as a mild and manufactured revisit to the “Peter Pan” folklore for children of all ages. However, the whimsical aspect of Pan was dubiously overshadowed, overproduced yet curiously understated in its ability to convey a storytelling moment that did not seem laborious. Consequently, Pan feels mechanical and never quite settles in with any sense of breezy charm or youthful balance of wonderment. Instead, the audience is left wondering about the uniqueness and distinctive approach to an already ubiquitous serving of Barrie’s celebrated literary lad. Despite the vibrant visuals and the given big screen blueprint for “Peter Pan’s” endearing legacy Wright’s toothless tale of flashy action and adventure may just prove to be another proverbial flash in the Pan. \r\n\r\nClearly, there is no rhyme or rhythm to tamper with the built-in concept of what the majestic make-up for “Peter Pan” should be conceived in the minds of generations that were subjected to Barrie’s boundless boy. Still, Wright and Jason Fuchs fail to capture any fresh imagination or intrigue about the puppy dog-eyed youngster’s on-screen by-the-dots adventures. This pumped-up project is pedestrian at best and nothing more than another sparkled rung in the “Peter Pan” ladder of box office hits-and-misses. The casting for Pan is decent enough but the shoddy material they are left to elevate with their included presence is wasted in a stillborn fantasy odyssey that cannot overcome its own creative indifference.\r\n\r\nPan seeks to start out with its own embedded twist by delivering this narrative as a prequel set in 1940’s London. Here, we are introduced to 12-year old Peter (Levi Miller) whose disillusionment continues to spiral while staying at the chaotic Catholic orphanage he was unceremoniously dumped off courtesy of his desperate mother (Amanda Seyfried). Nevertheless, Peter maintains some semblance of hope that his mother will soon return to fetch him and all should solve whatever abandonment issues he has at hand.\r\n\r\nSoon, Peter and his fellow orphanage buddies will succumb to the clutches of Blackbeard the Pirate (Hugh Jackman). Evidently bad boy Blackbeard had been a notorious busy beaver by sadistically kidnapping working class children and shipping them off to his Neverland mines to toil there. However, Blackbeard and his bunch cannot be too bad to tolerate since they welcome out-of-the-blue snappy sing-a-longs to such noteworthy tunes as Nirvana’s “Smells Like Teen Spirit” and the Romones’ “Biltzkrieg Bop”. Huh? Of course this impromptu musical sequence is not the only thing that seems curiously out of place in the disjointed Pan. \r\n\r\nOkay...so Hugh Jackman has both a black beard and a black heart in PAN. How about a blackboard to erase this ill-conceived ode to the J.M. Barrie treasured tyke?\r\nOkay…so Hugh Jackman has both a black beard and a black heart in PAN. How about a blackboard to erase this ill-conceived ode to the J.M. Barrie treasured tyke?\r\nIt is not long before the plagued Peter meets and becomes attached to a hustling drifter named James Hook (Garrett Hedlund). Yes folks…it appears that Star Wars comparisons are in order here as Peter’s Luke Skywalker teams with shifty Hook’s Han Solo to defeat the devilish Blackbeard’s Darth Vader. And you might want to ask who is the Princess Leia in this disguised Star Wars premise amid the mines and high seas? Well, in this case Princess Leia is in the form of Pan’s Tiger Lily (Rooney Mara). Thus, the gang assembles together in an attempt to thwart the iron fist of Darth Vader…er, the diabolical Blackbeard. The excitable exploits of the crew coming together to defeat the pesky pirate is meshed together with the flashy flourishes of random 3-D special effects, the vitality of color and scope and playful variations of well-known “Peter Pan” personalities. Hence, all the festive and feisty flexing that Pan demonstrates still cannot compensate for a lackluster execution of Wright’s anemic installment that botches a ready-made backstory for “Peter Pan” enthusiasts.\r\n\r\nAs Peter, Miller shows some solid and impish promise as the boy searching for self-discovery in a bizarre surrounding of despair and disappointment. Jackman’s over-the-top villainous Blackbeard is simply passable but nothing really worth hanging your hat on. Jackman’s plotting pirate will not make anyone dismiss Johnny Depp’s Captain Jack Sparrow from the Pirates of the Caribbean movies anytime soon. The added elements in supporting players such as Hedlund’s Hook and Mara’s Tiger Lily (not to mention the Lost Boys) feel synthetic and arbitrary–something not very encouraging as these characterizations are essential to the whole “Peter Pan” universe.\r\n\r\nUnfortunately for Pan one might end up saying never mind to the boisterous yet aimless shenanigans situated in Neverland.\r\n\r\nPan (2015)\r\n\r\nWarner Bros.\r\n\r\n1 hr. 51 mins.\r\n\r\nStarring: Levi Miller, Hugh Jackman, Garrett Hedlund, Rooney Mara, Amanda Seyfried\r\n\r\nDirected by: Joe Wright\r\n\r\nMPAA Rating: PG\r\n\r\nGenre: Sci-Fi Fantasy and Adventure\r\n\r\nCritic’s rating: ** stars (out of 4 stars)\r\n\r\n\r\n",
            "url": "https://www.themoviedb.org/review/561b0975c3a3685101002082"
         },
         {
            "author": "Reno",
            "id": "5697a80f92514154c90023ee",
            "content": "> Its when Peter stepped into the Neverland for the first time.\r\n\r\nUsually everyone loved growing up watching the various film adaptations of original work by JM Barrie's a century old creation, 'Peter Pan'. There are plenty of unofficial prequels and sequels were also made and met success. Yet this prequel with high budget and modern technology, but not a Disney film, generated some expectations with stars like Hugh Jackman and Rooney Mara in it.\r\n\r\nThe box office was not as expected, and the movie was also just above average, but I liked the performances and visuals. The story is about an orphan Peter who becomes a Pan, a leader to 'the lost boys'. The opening line goes like this: 'Sometimes friends begin as enemies and enemies as friends' and that's what the rest of the movie evolves.\r\n\r\nI don't think I liked this story. In all the prequels, I loved the Nick Willing's 'Neverland' who is a master of prequels to all the greatest fairytales. I disappointed with this only because of lack of the depth in narration, short storyline and quick scenes, other than that it was not a bad flick to me. The main relief was, it was not like the recent 'Alice in Wonderland' style movie with the weird costumes, makeups and the character physiques.\r\n\r\nDespite all the negative feedback for this flick, I feel it won't hurt for a one time watch. My eye is now on its sequel, because before the Wendy's introduction there's another story is to be told and that is between Peter and Hook. But now it's on doubt over the result of this movie. Anyway, I'm on for it and hope it only gets better than the original.\r\n\r\n6/10",
            "url": "https://www.themoviedb.org/review/5697a80f92514154c90023ee"
         },
         {
            "author": "Per Gunnar Jonsson",
            "id": "58bfc3f3c3a368695900478a",
            "content": "I found this to be a quite enjoyable family movie derived from the Peter Pan story we all love. I am not really sure why it holds a fairly mediocre rating on most rating sites. It is undeserved as far as I am concerned.\r\n\r\nThe movie is a prequel which tells the story of how Peter became Peter Pan. I think the story is fairly well done and allows for both adventure and humor.\r\n\r\nThe characters are pretty good although I found Peter Pan to actually be the weakest of them. Hook and Tiger Lily not to mention Blackbeard stole quite a lot of my attention. Peter Pan is not bad just a little…bland.\r\n\r\nThe movie is darker and more real than other Peter Pan movies. Blackbeard is a rather nasty villain and there are certainly more danger for the good guys in this movie. People do not just get nocked down and come back, they really die.\r\n\r\nThe special effects are not bad. I quite liked the pixie swarms at the end of the movie. Also, unlike what some reviewers state Peter Pan does fly in the movie. I can only assume that those who state that he does not never bothered to see the movie to the end. Do not review a movie if you cannot be bothered to finish it for Christ sake!\r\n\r\nThe movie leaves a bit of a whole between the end of this story and the beginning of the traditional Peter Pan story. What happened to make Peter and Hook become enemies and what is the story between Hook and the crocodile for instance? I certainly would not mind a second movie about that.",
            "url": "https://www.themoviedb.org/review/58bfc3f3c3a368695900478a"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Peter Pan",
               "gender": 2,
               "credit_id": "535a8d90c3a3683091000128",
               "name": "Levi Miller",
               "profile_path": "/n7yuMduWZpBuKHjW25X9G2miTKl.jpg",
               "id": 1313583,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "James Hook",
               "gender": 2,
               "credit_id": "535a8d71c3a3683099000113",
               "name": "Garrett Hedlund",
               "profile_path": "/Av3XDrrg78sY1U8dcyp48BS9n8w.jpg",
               "id": 9828,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Blackbeard",
               "gender": 2,
               "credit_id": "535a8d5dc3a36830a0000121",
               "name": "Hugh Jackman",
               "profile_path": "/dFbNlPpiEPupTAlNVNh5vrxBU1h.jpg",
               "id": 6968,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Tiger Lily",
               "gender": 1,
               "credit_id": "535a8d53c3a36830a900012a",
               "name": "Rooney Mara",
               "profile_path": "/pmVGHVjrraSAPHaB9LlMqMrPJp8.jpg",
               "id": 108916,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mary",
               "gender": 1,
               "credit_id": "535a8d65c3a36830b9000146",
               "name": "Amanda Seyfried",
               "profile_path": "/rkMBMJyRekUnZf59ipVRrtw74xk.jpg",
               "id": 71070,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Bishop",
               "gender": 2,
               "credit_id": "535a8d78c3a36830a900012c",
               "name": "Nonso Anozie",
               "profile_path": "/zNCiBHzoh8c8TB2jycuTJn7kcIo.jpg",
               "id": 43547,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mother Barnabas",
               "gender": 1,
               "credit_id": "535a8d87c3a36830a900012e",
               "name": "Kathy Burke",
               "profile_path": "/vqCHCywlp7HfoKBW6ZzCuQmnJx9.jpg",
               "id": 37759,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Sam Smiegel",
               "gender": 2,
               "credit_id": "5623d76cc3a3680e1600d978",
               "name": "Adeel Akhtar",
               "profile_path": "/nNdjhe4t5CSqcFGCa7ERe40OW2o.jpg",
               "id": 81840,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mermaid",
               "gender": 1,
               "credit_id": "5476333a925141407a002a1a",
               "name": "Cara Delevingne",
               "profile_path": "/lEIFRIR8EohwOVe7PQu4zvIl850.jpg",
               "id": 1289968,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Mutti Voosht",
               "gender": 2,
               "credit_id": "547e5242c3a3681428000003",
               "name": "Paul Kaye",
               "profile_path": "/hQHptsWpzIDtgHRXEn05CzIdY7E.jpg",
               "id": 71281,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Commander",
               "gender": 0,
               "credit_id": "547e52519251411b36000006",
               "name": "Emerald Fennell",
               "profile_path": "/y1zDZkGaYrsjUDzUlQth5PdMCkT.jpg",
               "id": 1252934,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Nibs",
               "gender": 2,
               "credit_id": "5623d7c1c3a3680e2000fe18",
               "name": "Lewis MacDougall",
               "profile_path": "/zoL2HijrWvmrVoym1U2KGl0Dboq.jpg",
               "id": 1523921,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Kwahu",
               "gender": 0,
               "credit_id": "5623d81692514127d40035ca",
               "name": "Tae-joo Na",
               "profile_path": "/iQoIRX7esBSxHy9HoFJyzlFgAGK.jpg",
               "id": 1097451,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Chief",
               "gender": 0,
               "credit_id": "5623d850c3a3680e0e00f7a4",
               "name": "Jack Charles",
               "profile_path": "/cOXtrCearOK4f6PX90a0GbSyNGJ.jpg",
               "id": 1301823,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Steps",
               "gender": 2,
               "credit_id": "5623d881c3a3680e1000e6bb",
               "name": "Bronson Webb",
               "profile_path": "/oBADYTZzjZI2wAhgnf0ZeKy9q3T.jpg",
               "id": 75076,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Murray",
               "gender": 0,
               "credit_id": "562aa8f69251414006001551",
               "name": "Kurt Egyiawan",
               "profile_path": "/nU0Btc6ipZlSFzt7720AJd82AbO.jpg",
               "id": 1526130,
               "order": 15
            },
            {
               "cast_id": 28,
               "character": "Dobkin",
               "gender": 2,
               "credit_id": "562aa91a9251414006001559",
               "name": "Jack Lowden",
               "profile_path": "/fKfaubGWh4QnupDAQ0K2lWBjJYX.jpg",
               "id": 1334638,
               "order": 16
            },
            {
               "cast_id": 29,
               "character": "Lofty",
               "gender": 0,
               "credit_id": "567aa405c3a3685bd20025b7",
               "name": "Jimmy Vee",
               "profile_path": "/uut9Tml9CIVMlsZdT29OMj4412f.jpg",
               "id": 1214513,
               "order": 17
            },
            {
               "cast_id": 43,
               "character": "Robbins",
               "gender": 0,
               "credit_id": "58ef4e2e925141424100a9e2",
               "name": "Aaron Monaghan",
               "profile_path": "/nzdFn5UlE5M7a8xbWGxjmfld5SI.jpg",
               "id": 210061,
               "order": 18
            },
            {
               "cast_id": 45,
               "character": "Sister Thomas",
               "gender": 0,
               "credit_id": "5a65e9c5c3a3687f6e038717",
               "name": "Ami Metcalf",
               "profile_path": "/yxO2oeTAKk6j5LNipOMJZDCQ5VB.jpg",
               "id": 1473990,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "535a8d33c3a36830b0000112",
               "name": "Joe Wright",
               "profile_path": "/loVZhy4uSe5G8U0fkRA6naraLLG.jpg",
               "id": 36588,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "535a8d3ec3a36830b9000140",
               "name": "J.M. Barrie",
               "profile_path": "/1j5F4WZ62hVkZhfXW9s32WDCPFG.jpg",
               "id": 14687,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "535a8d47c3a36830b9000143",
               "name": "Jason Fuchs",
               "profile_path": "/3N0WVhp5knzY6QaNKgDc2X54E1E.jpg",
               "id": 131947,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "548227e89251416e81006ac0",
               "name": "Greg Berlanti",
               "profile_path": "/AbocIYSo4KXx7nT6lz2dj3qMD8H.jpg",
               "id": 88967,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5482280fc3a3684afd002089",
               "name": "Sarah Schechter",
               "profile_path": null,
               "id": 1395152,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5482285e9251416e7b0064a7",
               "name": "John Mathieson",
               "profile_path": null,
               "id": 943,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5482286ac3a3685c0e000ad3",
               "name": "Seamus McGarvey",
               "profile_path": "/yXEsxEMHlMDemBy8JrHZFAmd3uD.jpg",
               "id": 3285,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "548d8d7a92514122f9004464",
               "name": "Paul Webster",
               "profile_path": "/fze6uF1oCdDYJFA5tbVhKX9nwW3.jpg",
               "id": 21378,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "573739ad92514115a1000593",
               "name": "James Bellamy",
               "profile_path": null,
               "id": 1337419,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 2,
               "credit_id": "573739c6925141136e003eb7",
               "name": "Jason Ruder",
               "profile_path": null,
               "id": 1425395,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "573739d3c3a36805ab0005c6",
               "name": "Thomas A. Carlson",
               "profile_path": null,
               "id": 1404326,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 2,
               "credit_id": "573739ecc3a3680516000681",
               "name": "John Powell",
               "profile_path": "/fFRYoiZxBtP4Gs0CAphU7F5mDk.jpg",
               "id": 11098,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "573739f8925141136e003ebe",
               "name": "Aline Bonetto",
               "profile_path": null,
               "id": 13839,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "57373a28925141136e003ec3",
               "name": "Jina Jay",
               "profile_path": "/rMuj07hjZnT0zMC1kiBOs6IWCdO.jpg",
               "id": 474,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "57373a2fc3a36805ab0005dc",
               "name": "Dixie Chassay",
               "profile_path": null,
               "id": 1108835,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "57373a3dc3a3683fa3000d67",
               "name": "Zoe Morgan",
               "profile_path": null,
               "id": 1427849,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "57373a5cc3a36823dc003697",
               "name": "Paul Tothill",
               "profile_path": null,
               "id": 36590,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "57373a67c3a3687e1a004182",
               "name": "William Hoy",
               "profile_path": null,
               "id": 2122,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "57373a79925141155f000613",
               "name": "Jacqueline Durran",
               "profile_path": "/8BzF1gUzKRiZKjjoQm2I50ALDSq.jpg",
               "id": 36591,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57373aa59251417b3a00313c",
               "name": "Mark Holt",
               "profile_path": null,
               "id": 1032067,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57ebed11c3a36813e900087d",
               "name": "Chris Murphy",
               "profile_path": null,
               "id": 1685996,
               "department": "Sound",
               "job": "Boom Operator"
            },
            {
               "gender": 2,
               "credit_id": "5a2f84e5c3a3680b8d16fb1b",
               "name": "Liang Yang",
               "profile_path": "/z6UgXBqpbrrwikfJkeFoSvFUzqu.jpg",
               "id": 1645047,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "5a7b5bd09251411c5d00d338",
               "name": "Tim Lewis",
               "profile_path": null,
               "id": 89320,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 14.778052,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 266647,
      "vote_count": 1211,
      "budget": 150000000,
      "overview": "Living a bleak existence at a London orphanage, 12-year-old Peter finds himself whisked away to the fantastical world of Neverland. Adventure awaits as he meets new friend James Hook and the warrior Tiger Lily. They must band together to save Neverland from the ruthless pirate Blackbeard. Along the way, the rebellious and mischievous boy discovers his true destiny, becoming the hero forever known as Peter Pan.",
      "similar": [
         10693,
         34584,
         411,
         10882,
         37430,
         671,
         767,
         808,
         809,
         290595,
         224141,
         38757,
         68728,
         44683,
         10515,
         4523,
         14442,
         2312,
         1865,
         1417
      ],
      "original_title": "Pan",
      "runtime": 111,
      "poster_path": "/uflLJBg5iVWaPpzc4Qm54HNoGYd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Moving Picture Company",
            "id": 20478,
            "origin_country": "GB"
         },
         {
            "logo_path": "/3e294jszfE6cE8TOogmj0zNd6pL.png",
            "name": "Berlanti Productions",
            "id": 27711,
            "origin_country": "US"
         },
         {
            "logo_path": "/wzKxIeQKlMP0y5CaAw25MD6EQmf.png",
            "name": "RatPac-Dune Entertainment",
            "id": 41624,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2015-09-24",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Every legend has a beginning.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joe Wright"],
      "runtime": 111,
      "synopsis": "In the opening scene, a young woman named Mary (Amanda Seyfried) brings her baby to the steps of the Lambert Home For Boys in London. She leaves the boy with a note and a necklace of a pan flute. Mary kisses her baby, Peter, and tells him she loves him before leaving. 12 years later. Peter (Levi Miller) is still living at the Lambert Home, and he has only one friend, Nibs (Lewis MacDougall). Their time is made miserable by the cruel nun Mother Barnabas (Kathy Burke). Peter figures out that Barnabas is hoarding extra food for herself, so he and Nibs break into her office and uncover her stash of extra food and coins. The boys go into her private records and find Peter's file, which contains a letter from Mary that reaffirms her love for her son and says they will see each other again, in this world or another. While the boys sleep at night, some are snatched up into the air by men coming down on tethers. They were summoned by Barnabas, who raised a pirate flag at the top of the orphanage. Peter sees Nibs being grabbed, so he runs to save his friend. Peter ends up being taken after Barnabas kicks him into the path of one of the pirates. The boys are out on the ship, but Nibs jumps off and lands on the roof. As the ship flies toward the sky, Royal Army planes fly after the ship and shoot at it. The planes retreat once the ship rises above the clouds. Peter ties himself to the ship to keep from falling out. He floats through space and touches Saturn before getting yanked back to the ship. It flies all the way to Neverland. There, the boys are brought before a large quarry where the workers are singing \"Smells Like Teen Spirit\". Atop another floating ship emerges the dreaded pirate Blackbeard (Hugh Jackman). He tells the boys they are digging for fairy dust in the mines. While working, Peter meets James Hook (Garrett Hedlund), an older man and fellow slave worker that's been there as long as he can remember, and that's why he's grumpy and disillusioned. Peter then finds a rock of fairy dust that an older man swipes from him. Peter argues with the man and insults his cohorts, leading to Blackbeard making Peter walk the plank along with two other boys that misbehaved. Blackbeard kicks Peter off the plank, but as he falls, Peter suddenly starts flying, to everyone's surprise, until he drops to the ground. Peter wakes up in a room in Blackbeard's ship. The pirate walks in and tells Peter of a prophet that states that a boy who can fly will fight Blackbeard and kill him. Peter says he doesn't believe in bedtime stories. Hook gets Peter and his accomplice Mr. Smee (Adeel Akhtar) to escape and try to make their way to one of Blackbeard's boats, on the condition that Hook helps Peter find his mother. They ride a cart up to the floating boats, only to get pulled back by Blackbeard's right hand man Bishop (Nonso Anozie). Peter cuts the wire and sends himself, Hook, and Smee toward one of the boats. The three ride the boat into the forest to find the natives. They are caught by a group of the natives, led by Princess Tiger Lily (Rooney Mara). Hook and Smee are almost executed until the Chief (Jack Charles) notices the pan flute around Peter's neck. Because the pan is the symbol of their tribe, the natives bow to Peter. Tiger Lily explains to Peter that his mother fell in love with the fairy prince, which made Blackbeard jealous, though it also means that Peter is part fairy. The natives helped bring Mary to the fairy kingdom to protect her, so that's where Peter can find her. Now, they just want to prove that Peter really is her son, so he needs to fly. However, Peter is unable to recreate the same flight as before, causing him to lose hope. Blackbeard and his men attack the natives after Smee cowardly gives away the location of the heroes. The pirates battle the natives, and Blackbeard ends up killing the Chief. He finds Peter and reveals that he killed Mary. Peter escapes with Hook and Tiger Lily. The three head toward the fairy kingdom on a raft. Peter is devastated to learn that Tiger Lily lied to him about his mother. Suddenly, a large crocodile attacks the group. Peter falls into the water and is dragged to the bottom by the crocodile, until a trio of mermaids (all played by Cara Delevignge) send the croc away and bring Peter back up to the surface. Peter then has a vision of his mother as a warrior, leading the natives and fairies to safety from Blackbeard. He sees Mary fighting Blackbeard until the pirate ran her through with his sword, and he screamed in regret and sorrow. Later, Hook leaves the two because he doesn't want to be there when they lose the battle. Peter and Tiger Lily locate the fairy kingdom, but unfortunately, Blackbeard had followed them. He takes the pan necklace from Peter and uses it as the key to enter the fairy kingdom. He ties the heroes to the ship as they enter. The fairies fly around the good guys, and Peter befriends one such fairy named Tinker Bell. The heroes break free and fight the pirates, with Hook returning on his own ship to join the battle. The three fight the pirates, with Hook taking on Bishop while Tiger Lily fights Blackbeard. Smee escapes on a boat. Hook's ship tilts over, causing Bishop to fall to his death in the abyss, while Hook hangs on. Realizing he won't make it, he lets go. Blackbeard taunts Peter until the boy jumps and flies to rescue Hook. After doing so, the fairies help fight the pirates, sending them off the ships to their doom. The fairies then swarm all over Blackbeard and cause his ship to crash into a wall, plunging it into the abyss, taking Blackbeard with it. A vision of Mary appears to Peter. He still doesn't believe he is the hero that was prophecized, but his mother disagrees and restates her love for her son, calling him her little \"Peter Pan.\" As she disappears, Tiger Lily hugs Peter. The heroes return to London on Hook's new ship, the Jolly Roger, to gather Nibs and the rest of the orphaned boys to become the new Lost Boys, to the anger of Barnabas. As they fly back to Neverland, Peter asks Hook if they'll always be friends. Hook responds: \"Sure. What could go wrong?\"",
      "writers": [
         "Jason Fuchs",
         "J.M. Barrie"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3332064/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMzk2MDg5MDczMl5BMl5BanBnXkFtZTgwNTE2NjYyNjE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Levi Miller",
         "Hugh Jackman",
         "Garrett Hedlund"
      ],
      "reviews": [
         "Pan is one of those films where it's hard to pinpoint what is wrong because the answer is basically everything. I'm confused as to how they managed to turn such a simple story into such a convoluted mess. At his core, Peter Pan is just a boy who escapes to a magical fantasy land because he doesn't want to grow up. In Neverland he leads a crew of similarly disenfranchised kids, plays games with Indians, swims with mermaids, and fights pirates. Simple right? Well not according to Joe Wright and the producers of this film. For some reason they felt the need to cram in every single cliché possible in order to 'modernize' the story despite the fact that the themes in Barrie's stories were already timeless. Levi Miller stumbles here and there but he was well cast as Peter. However the script doesn't support the role. At certain points he becomes secondary in his own story. His desires don't move the plot forward and after the first 20 minutes he has very little to do except \"learn how to fly\". We never seem him turn into the character we know as Peter Pan except for the fact that *spoilers* he flies at the end. And don't even get me started on 'The Chosen One' thing. Tiger Lily, played by Rooney Mara, is bland, and I'm not talking about the color of her skin. She's your typical warrior princess and for some reason they try to set up a possible romance between her and Hook. She's basically around to be walking talking exposition. Jackman also does a good job, but his character, Blackbeard, isn't interesting. His motivations are paper thin. He wants to mine some fairy dust in order to live forever which doesn't even make sense because Neverland supposed to be a place where people don't age. Blackbeard is just shoehorned in there so they could have a villain other than Hook. This brings me to one of the most pointless things in the film: Hook being Peter's ally. It doesn't amount to anything. You never get a sense of conflict between the two. You keep waiting for a point when Hook is going to betray Peter but it never happens. You want to see that scene where Peter cuts off his hand and feeds it to the crock, but it never happens. Hook's only motivation in this film is to escape and go home. He doesn't seem like he could turn into the devious Captain we know. At the end of the film, Hook and Pan are still friends and they just hint at a possible conflict in the sequel with a throw away line. Also, if you're a kid and this is your introduction to the character of Hook the 'twist' will go right over your head. And why is Hook American? Who made this decision? Another problem with Pan is the over-use and reliance of CGI. It looks fake, especially Peter's flying. Peter Pan was better animated in 1953, not in terms of graphical fidelity, but in motion. He had weight, he had grace, and he was agile. In Pan he just kind of floats like he's being dragged by a mouse cursor. When you stretch the rules of reality too far it becomes unbelievable even in a world like Neverland. You have to have rules. In Pan there are flying pirate ships. Why? How do they fly? It's never explained. The ships can fly both in the real world and Neverland. There is no consistency. I'm giving this film a 1 out of 10 because they squandered so much potential. The source material is so rich and this is the best they could come up with? I think a live action Peter Pan film could be successful but if they ignore the themes that make the story interesting in the first place it just won't resonate with the audience.",
         "If there was a more awkward movie than Pan released in the last few years I'd certainly like to know about it as Joe Wright's big budgeted wannabe franchise starter is a lavishly coloured and extravagant picture that lacks knowledge of what it actually wants to be or who in fact it's aimed at and judging by the films flopping at the box office the world over, it seems as though audiences too struggled to figure out who should be watching this revamping of J.M Barrie's classic material or why they should be watching it. Tonally all over the place and with a story that seems to meander about the motions until a highly lacking finale and lack of answers regarding certain story questions (a glaring one being how Hook and Pan in fact become enemies as they are adventures together here), for the first time in his quietly impressive directing career Wright seems completely lost within his narrative and fails to liven up proceedings despite throwing every known colour onto the screen, plopping in Nirvana songs and letting many of his actors ham it up to level 11 to try and cover up the fact Pan's story is actually rather dull in a world that should be anything but. Our Pan here is played by newcomer Levi Miller and the poor young performer labours in his first major turn injecting Peter with neither the charm, smarts nor emotion that was needed for the role. When you consider however how his cast alongside a horribly miscast double act of Garrett Hedlund (who continues to frustrate as a lead actor) and the beyond bad Rooney Mara, the child performer didn't really stand much of a chance. The films only saving grace acting wise is Hugh Jackman who has a blast playing Blackbeard the fearsome pirate who will stop at nothing to collect that sought after pixie dust but while he has fun it still doesn't make a whole lot of sense having Blackbeard in this beloved tale. Whilst normally it would not be something called out for by the masses it would've actually been nice for Pan to stick more closely to the original Peter Pan story that has enchanted readers and viewers for decades upon decades and while its commendable for a big budget film to take such a risk on a new take on a well-trod property, Pan is a stinging reminder of what can go wrong when money is thrown all over the place and scripts seem doctored to tick off as many set piece wish lists as possible and for the first time in his career Joe Wright has crafted an almost irredeemably bad piece of cinematic entertainment. All those seeking a Peter Pan fix are much better off seeking out a copy of Disney's beloved animated take or even the similarly styled Steven Spielberg event Hook. 1 ½ awkwardly used Nirvana song out of 5",
         "Pan bears a lot of similarities to other adventure films, family animation and even role-playing games. It packs myriad of visual antics across the journey of self-discovery. However, it's also painfully one dimensional and predictable, using the \"chosen one\" plot to a fault. While it's admittedly aesthetically pleasing, this is not the innovative origin story it's advertised to be. In a world tormented by pirates, one child must discover his destiny. You've seen this before. Some angles have been changed, but this is typical Peter's adventure to Neverland. It's so overused, one might find half the script in Final Fantasy games. Not to mention it's riddled with fantasy genre cliché and uninspiring romance subplot. To their credit, the actors do a fine job. Hugh Jackman as Blackbeard is a good antagonist, he looks the part by carrying the character with ominous charisma, either it's by his flamboyant dialogues or even timely singing. He can appear funny yet still threatening. Well, as threatening as a villain in family flick can be. While Blackbeard looks fit for Hook's replacement, Hook himself is played by Garrett Hedlund, who ironically tries too hard to be young Hugh Jackman. His delivery is forced to create a suave persona, but most of the times he just looks out of place. Levi Miller as Peter handles himself pretty well. The story focuses heavily on this boy's fate, and although he can seem rough at some scenes, he brings a commendable performance as the lead. Graphical prowess plays important role, almost too much, and on its better parts Pan definitely has the stylish charm of fantasy vista. Setting is filled with colorful designs and details, although CGI takes the helm on most cases. Its soundtracks are splendid, it simply doesn't let go. From subtle chimes, loud symphony and even shanty version of popular songs, the audio is brilliant. Pan would've been great if it didn't copy so many elements from other movies. In nearly every scene, there's a hint of Pirates of Caribbean, Mad Max and multitude of classic Disney flicks. The straightforward plot doesn't help either, it's tedious to see the predictable developments ahead. Ancient prophecies, letter from the past and hidden power manifestation are tired gimmicks. Please, you know he's gonna fly at some point. For a movie that looks so appealing, Pan never really takes flight. One might find happy thoughts on the visual and songs, but the CGI charm and adventure gimmicks will not last through its boring plot.",
         "I took my nephew and niece to see this movie this past week, and one thing was clearly noticeable. The movie is a bit to overwhelming for small kids. However, if you don't go to this movie to see a funny and uplifting 'Hook' remake, but instead go to see a more deep and thrilling retelling of a childhood tale, you will be most pleasantly surprised. The movie, from this point of view, is fantastic. I feel bad that it has received such harsh reviews from parents that apparently took their small kids to a movie without first at least watching the trailer. Its a bit darker then its predecessors, but is clearly shown that way through the trailer. Let me put it this way, if the trailer looks like a movie you want to see, you will not be disappointed here.",
         "Pan is a 2015 British-American fantasy adventure film directed by Joe Wright and written by Jason Fuchs, and a prequel to Scottish author J. M. Barrie's Peter Pan story, first staged in 1904. It stars Hugh Jackman, Garrett Hedlund, Rooney Mara, and Levi Miller as the title character. It is an invented origin story depicting the origins of Peter Pan and Captain Hook. The film had its world premiere in London on September 20, 2015. Plot Of The Movie: The story of an orphan named Peter Pan (Levi Miller) who is spirited away to the magical Neverland. There, he finds the fun and dangers in this world where he meets James Hook (Garrett Hedlund) and helps to fight the evil pirate Blackbeard (Hugh Jackman). Truly an excellent family movie.",
         "When this was first announced they sold it as being different and man the tone of the early trailers just really made me feel like they were going to go deep and abstract. The trailer song made me shiver. My dumb ass thought it might even be something like \"The adventures of Baron Munchausen\" full of metaphors and abstractions like \"What dreams may come\". Like it was going tell a more emotional story about the relationship of the main actors. Nope boring run of the mill peter pan adaptation with a couple characters swapped to claim uniqueness. Damn I just rewatched the first trailer and it totally sold me on a different story. What makes matters worse is the world is very well designed and there's several hints at what could have been a really trippy adventure, but for some reason they went incredibly cheap on the CGI which in several spots is just unbearably bad. The story doesn't really make any sense. \"chosen one\"? For what? and what exactly does he provide? He can control fairies? but the fairies were perfectly capable of throwing a couple pirates around. The relationship between Blackbeard and his mother was really dumb and illogical, there's so much more they could have done with that. In general it just felt crap and plodded along and then just rolled over at the end. Man I'm just so angry. I would have killed to have Terry Gilliam to do this, or David fincher, Darren Aronofsky. It sucks because Hugh Jackman was wasted. Thats the one thing they got right. The design and portrayal of Blackbeard was cool, but his story was so Blasé. I liked the inclusion of modern music but instead of making it a theme with a story nope you get one cool song and then generic music for the rest of the film.(I know there was another one but it sucked) Damn you Warner Bros for greenlighting this garbage. Im giving this a 1/10 because of how insultingly wasteful they were with such a great idea. I've seen better execution of concepts like this out of 50k indie movies. When we talk about twist of fairy tale concepts I have to give the nod to Maleficent. Again the trailer was chilling and though the movie had innumerable flaws it was the mature emotional experience we were looking for. Guess now were just going to have to wait for the Fables trilogy they'll inevitably screw up.",
         "Went to this movie without knowing Hugh Jackman was the black-beard.The best Pan i had ever seen in my life,Hugh Jackman outstanding!.Great movie and must watch.i hope there will be any sequel. Living a bleak existence at a London orphanage, 12-year-old Peter (Levi Miller) finds himself whisked away to the fantastical world of Neverland. Adventure awaits as he meets new friend James Hook (Garrett Hedlund) and the warrior Tiger Lily (Rooney Mara). They must band together to save Neverland from the ruthless pirate Blackbeard (Hugh Jackman). Along the way, the rebellious and mischievous boy discovers his true destiny, becoming the hero forever known as Peter Pan.",
         "Absolutely fantastic movie, DO NOT READ THE NEGATIVE REVIEWS, COMPLETE LIES!!!!! I'm so glad I didn't read them before watching this movie, what a sin critics are unfairly slamming this masterpiece, they'll eat crow once audiences have a chance to see it for themselves. After watching it, I was so moved that I wanted to read all the rave reviews online, only to be irked by the negativity surrounding this beautiful epic. I am so annoyed that you are reading my first review ever posted on here. This story is so cool, I've always wondered about how Peter Pan came to be, and the storyline is truly magical. Bravo to the writers who completely nailed it! And the kid who plays Peter was absolutely PHENOMENAL, where did they find him? What a talent. Rooney Mara was the perfect Tiger Lily. I will say the only \"meh\" thing was a CERTAIN actor's campy accent (you'll know exactly who I'm talking about once he appears, I don't want to ruin it) but it's not THAT big a deal and it kind of grows on you as the movie progresses. Other than that, this movie is completely EPIC!! Hands down one of the best children's movies made in decades..my kids were blown away. Shame on the people bashing it - my guess is there must some hidden Hollywood agenda going on here because this movie rocks! Go see it with your kids, you will all be in tears!!!",
         "Pan has all the foundation to make a fantastic prequel for the Peter Pan story, sadly the foundation doesn't have much on it and what's there is shaky. The main issue I had with this film is that it seemed like it couldn't make up it's mind on whether it wanted to cater to children with goofy and antic like behavior from the characters, or offer up serious and gritty story telling for the adults. It flip flops from one to the other from scene to scene and it's very noticeable. The incredibly cringe-worthy use of \"Smells Like Teen Spirit\" in the Neverland introduction scene represents my point the best. I wondered all throughout the movie why they had given James Hook an American Accent, I have seen other reviews say that it seemed like the Director/Writer wanted Garret Hedlund to channel some Indiana Jones for this role. They are right, but I am baffled as to why the Production wanted him too. It makes no sense for what we know he will eventually become. This movie isn't ALL bad, however. Levi Miller as Pan is a lot better than I ever expected him to be, the kid has some talent and it's going to be interesting to see how he develops as an actor if he sticks with it. Rooney Mara puts in a great effort as Tiger Lily too. Hugh Jackman tries REALLY hard to lift this movie. He is easily the top performance with his Blackbeard and it was easy to see that he enjoyed the freedom of the character. In fact, they should get Jackman to play Hook in the next movie. He'd be brilliant. Shout out to Adeel Akhtar as Mr. Smee. Outside of Jackman he gets the most laughs in the film and was a great casting choice. If you have kids then take them to see it, they will like it but be prepared because you probably won't.",
         "It's WWII London. Peter (Levi Miller) was left by his mother on the doorstep of the Home for Boys and he's still waiting for her to return. Kids have been disappearing. One night, pirates come to take Peter and his friends away. Pirate leader Blackbeard (Hugh Jackman) has enslaved the boys to mine Pixum, fairy dust, and looking to wipe out all fairies. Peter is made to walk the plank and discovers that he is able to fly. He escapes from Blackbeard with the help of James Hook (Garrett Hedlund) and Smiegel. They are captured by Tiger Lily (Rooney Mara). Recognizing the pan necklace from his mother, she reveals that Peter's mother is Blackbeard's possession Mary. She had fallen in love with the fairy prince and he is the child of their love. I really like the start of this movie. Peter Pan is brash, mischievous and heroic. I even like transferring the story to WWII which allows for a fun dogfight in the skies of London. Then the movie goes to Neverland and the problems start to pile up. I also like the wild colorful action extravaganza. It does get repetitive during the climatic action scene but the exuberance fits Neverland. For some reason, the story forces Peter to turn into a self-doubting taciturn. The flying story really hurts Peter's character development. He turns into non-Peter Pan and not even the same character from the first act. Blackbeard is a black-feathered peacock. He's not scary enough. Garrett Hedlund is not flamboyant enough to be Hook. Rooney Mara is perfectly fine as an action heroine but her pale white skin is really distracting. They may as well paint her face as some kind of warpaint like the Maori war paint. Her pale skin is too old Hollywood. I can see a wild Peter Pan movie being made here but the little problems overwhelm it.",
         "Pan is the best movie I have seen in a while. Although it is based on the story of Peter Pan, the story is original. It tells the story of how Peter Pan came to be, a sort of back story. It is the tale of Peter in search of his mother whom he has never met. His search takes him from the ordinary world to the stunningly beautiful Neverland. The cast is great and do a great job. Hugh Jackman is not even recognizable as Blackbeard the pirate. Wow is Rooney Mara beautiful as Tiger Lily. The story flows very well and is worth seeing in 3D on the big screen. It is a very fun movie to watch and worth seeing a second time. Once again the critics are wrong.",
         "This is an excellent movie for the family. They truly did an outstanding job creating a fresh way to present Peter Pan. This movie is a prequel that I feel definitely did an outstanding job filling in the questions we have about the loved character Peter Pan. The visual effects and design were amazing, in my opinion the movie looked as good as Avatar. The Movie was fun for everyone. It was adult enough in ways to keep parents from passing out and drooling on themselves; and light hearted enough to keep from being to violent to take your children to watch. They had an excellent idea for the fight scenes that I feel most of everyone will enjoy.",
         "Upon seeing the trailer I was hesitant that it might be good but I decided to give it a shot and watched it during its premiere. And boy, was I surprised! I absolutely loved the simple things that foreshadow the events of the actual story: James Hook using a hook in the mining scene, the ticktock of the bomb that he placed to set Peter free, Tiger Lily scaring Hook with the crocodile and many more. I have to give credit to the writer with his different take on the Peter Pan story. Also, the friendship between Hook and Peter was great, they got each other's backs, with Hook saving Peter and vice-versa, kinda sad that they'll eventually end up as enemies since this movie established that relationship. Everyone was right for the role, Hugh Jackman was amazing as the villain, how he looked here made me forget that he is Wolverine. Rooney Mara was dashing in her Tiger Lily role and performed well even though she was Caucasian in contrast to the natives. Garrett Hedlund played this cocky, playboy-type, off-character Hook who always provides the laughable comebacks. Levi Miller was great as Peter, that dude's going places. Although, I have to note the lack of battle between Peter and Blackbeard, since the prophecy stated that the former will defeat the latter. They should have put at least a short duel between the two because that'd be amazing. All in all, I thoroughly enjoyed the film, I don't care what the Rotten Tomatoes rating or critics say!",
         "How dumb do you have to be to misunderstand a movie like Pan? Because this movie has generated some of the dumbest review comments I've ever seen. \"There's no Wendy.\" Because this is a PREquel. Look up \"pre\" in a dictionary. \"It's dark.\" All fairy tales are, and their modern imitations like Peter Pan or Pinocchio have to be, too, to remain true to the genre. Fairy tales originated in a time when meeting wolves and bears in the woods was all too likely, and they weren't cute and anthropomorphic, either. And the original Grimm stories, unlike their sanitized modern retellings, carried the clear message that Awful Things happen to Naughty Children Who Don't Obey The Rules. The prize comment was someone complaining that a flying pirate ship over WWII London was unrealistic. So name some historical periods when it WAS realistic. Overall it's a satisfying action story, and wholly undeserving of the scorn some reviewers have dumped on it. The weakest links are Garrett Hedlund as Hook (still a good guy at this point) and Rooney Mara as Tiger Lily. Hedlund tries to be Harrison Ford, complete with Indiana Jones' hat and Han Solo's flying off to save his own skin but coming back to save the day, but he just doesn't have charisma. Neither does Tiger Lily, who's pretty but bland, and goes through life with a deer in the headlights expression. They're both stiff and lifeless.",
         "'ve never hyped myself up for a movie more than Pan. I saw the trailer the day it came out and watched every trailer since then. Well now I've had my chance to watch it... And well... The best part of the movie was the credits. The music is catchy... That's about it. The animation and graphical affects were alright I guess. And some parts of the story weren't too bad. However the amount of plot holes made me want to cry, the relationship between Hook and Tiger lily, and Hook and Pan, and Pan and Tiger Lily, and all of them with Blackbeard was poor. The best character in it was Smeeh, but that was only in the first half of the movie, so anything past that first half for him was garbage. When I sat down and started watching it, I was disappointed by the beginning, but I sat through it anyway, in hopes that the second half would be phenomenal... And I can confirm it really wasn't. Nothing in the film made any sense. Nothing was ever explored or explained. Nothing was ever adopted on to get the main characters into their positions before we get to the Peter Pan that everyone knows where it is Pan vs Hook. There was none of that. Hooks accent... Hooks freaking accent... Oh my god. It sounded so fake it was painful. I hate writing this review, but I can honestly say I don't think I've been more disappointed in the film... Whoever made the trailers deserves the biggest pay rise ever, because the trailers did look amazing, the trailer soundtrack was amazing. The movie did not look amazing, the soundtrack was also not amazing... That's another thing, WHY WAS THE FILM A MUSICAL?! I didn't sit down to watch this so I could watch Blackbeard sing songs that hadn't been invented yet. Because I think three songs were in this film and every time I heard one, I was more tempted to turn it off. Like I said, the graphics were good, the story telling wasn't that bad and costume design was also pretty good and sets and stuff. But the film as a whole makes me final thoughts 5/10",
         "I really, really liked it. It was so refreshing and well produced. Tiger Lily shouldn't be Rooney Mara, I agree, but somehow she made me forget that the princess is a Native girl. I think Rooney did an amazing job and I understand her emotionless face as the way Tiger Lily found to look tough. Garrett was also brilliant and I think the script brought a happier Hook and yeah it was off character, but I think it made the movie lighter. I really like the fact that Hook and Pan were friends. It's a cool new view of their relationship. Hugh Jackman was just fantastic in his role. I didn't even recognize him and it was a surprise read his name in the credits. He made such a good villain, the kind you love-hate because he's mean as hell, but also funny and smart. It was one of the best part of the movie, no doubts. Levi Miller is a really good actor and who doesn't agree, didn't watch a lot of movies with kids as the star. It's hard to find kids that don't look too forced or too young to be acting. He's in a spotlight along with Dakota Fanning, Abigail Breslin and Freddie Highmore. Miller's Pan was so likable that I just want to pinch his cheeks forever. I loved how the character was growing alongside with the movie and in the end, the cheeky Pan was so amazing to see and hear. I really loved Levi acting and I think he's gonna be huge! Smee was so so good that I don't have words. It's like he jumped out of the book right into the movie. Really loved Adeel Akhtar. The effects were amazing just as the rest of the movie. The photography was perfect. The colors, the scenarios, everything. The soundtrack was really good to listen and I think it worked really well in the movie. The script was really well developed and I really wish there was a book about this version of the story. People who didn't like the movie must be one of those people who can't stand movies that isn't about deep thoughts and philosophy. I think Pan is a movie really cute and well done. Good acting, good script, good timing. I really want to watch more movies like this in the next years. Amazing.",
         "Look, I like Peter Pan. It's always been one of my favorite stories. I've got a super cute picture of me at Halloween of my kindergarten year in my award-winning \"most original\" Peter Pan costume. So while I realize that there's a lot of things that are problematic about the book, I still think there's incredible value in a story that suggest to children that viewing their own inevitable deaths as \"an awfully big adventure.\" If you are not a person who appreciates Peter Pan, don't go see the film. It's not like Hook, Robin Williams isn't there to charm you despite yourself. Pan is a damn fine reimagining of the story you already love. It's visually stunning and occasionally bizarre, surreal like the best dreams. The soundtrack was great, and I liked the 3D effects, although I noticed my friend occasionally having some trouble with them. I was pretty pleased with the acting. Levi Miller was engaging and believable. Rooney Mara was one bad-ass young lady. Hugh Jackman was his own insane pirate - not anyone else's. And Garrett Hedlund seemed aware that he was not Dustin Hoffman or Cyril Ritchard and took his character in a very different. I was also pretty pleased with the way the movie handled the whole issue of \"Indians!\" Basically, they weren't presented as Indians at all, just a really interesting tribe of people. There were certainly cultural elements, but the visual was way more \"raver\" than anything else. I feel like I should probably come up with some strong conclusion here, like the value of friendship, or whatever, but honestly, if you are a fan of the whole thing, you should go. If you aren't, you're a cynical jerk and I probably didn't like you anyway. TLDR: Up yours, hater critics.",
         "Spoilers: I mention the 1960 Peter Pan, Barney's Christmas, the Chronicles of Narnia, the Oz Books, Alice in Wonderland, and Harry Potter. This movie tells me movies are getting better and better, and I like movies of this dynamic. What drew me in was Tiger Lily and probably Blackbeard. Peter was such a good actor and such a sweet boy. He actually began to look like Peter Pan, which reminds me of the 1960 version with the lady playing Peter. I remember Wendy was good in that one, too. I used to watch it at my aunt's and have seen it at school a few times for music. I also used to watch Barney's Christmas, which reminds me of that version of Peter Pan; I actually loved Barney until kids in school said it wasn't cool again and I finally seemed older. My favorite was after I came back from the bathroom (had to go twice tho it was so short) and saw Blackbeard together with Sam Smiegel. The dynamic of their acting was so good. I 1st connected with the character of Sam Smiegel. Then, I grew to find Blackbeard acted well, except of course that he killed Peter Pan's mother. If he didn't murder, I'd like him. I liked him as an actor. I figure they dumped his character as a murderer and made him a warrior. His mother was an innocent maiden or something. It's sad to say I liked Blackbeard and Sam Smiegel over all the others. Tiger Lily made this movie.. a movie. She is so beautiful and sound. She is an excellent actress. She was flawless and the best. She is a beautiful young girl. She's a wonderful budding actress. As a person, I think she is very kind, good, and cool, very deserving. I'd like to see her now next to other stars, like Chloe Grace Moretz, Bella Thorne, and the girls from Pitch Perfect 2. I don't know what would happen if she acted for Tim Burton, but he sounds like a tough director, maybe wants actors to be more independent to let their creativity out and make creative choices. I rate this a 10/10. It contributed so much intelligence to the world with the cool acting. I really truly like it and hope others found themselves in it, too, and look forward to more movies as good as this in certain ways. I read a review that said it didn't really cover much fantasy, and I'm beginning to think a lot of people agreed. Fantasies like the Chronicles of Narnia, the Oz Books, Alice in Wonderland, and Harry Potter provide more magical ideas. It's hard to say I'd watch this again on my own, Pan, tho I loved it so much. I go to the movies about every week, tho. I'm sure you could really get into this. You'd have to do a lotta work if no one else is as into it, like posting on the board. A lotta people were fans of things like Pirates of the Caribbean and Star Wars. ..I used to do this for Sweeney Todd, watch it a lot. It's a lotta work to make a movie, a good movie. I was hoping for more things like Charlie and the Chocolate Factory, like from Tim Burton since he does so much and you should always be moving up, knocking all the pins down, eventually, and getting there. I don't know who'd argue this popular belief that supposedly everyone loves. So, Pan is a good new classic work of art.",
         "We (1 adult + 3 x 12 year olds) absolutely loved this. Let me start by saying I am a fan of The Pan, and so was worried before seeing this that it would not come up to scratch. So we were lucky enough to win tickets of the preview, and I have to say I loved it. It was a film full of adventure and goes along at a cracking pace. There is not much back story or character development but the Pan universe is not supposed to be \"Tolkien Deep\". There is enough reference to JM Barrie's classic play and the iconic lines that we all know and love. The casting was good, the portrayal of the iconic characters was excellent. Ignore the negative reviews, leave the grumpy adult at the door and enjoy. NB: we saw this in 3D , and it was exceptionally good use of 3D visuals, I've seen a lot of 3D films (have 3D TV setup at home too) and rate this very highly for effects, I actually jumped/ducked on quite a few occasions!",
         "I saw this last night in a 3D theater. I was not expecting to like it, I was going more for the kids because they wanted to see it. I LOVED it. I have been very disappointed in 3D movies lately and this movie brought back my hope in quality 3D. I am beside myself on the reviews...... I really enjoyed it and would actually like to go see it again. I just wonder if it's going to be as good without the 3D effects. The story is really good. I love seeing Pan and Hook as friends and the story behind the story. Great acting from all actors. I fell in love with Tiger Lily. I hope to see a story of how they become enemies. I highly suggest giving it a chance.",
         "When Mom and I decided to go to the movies last night I thought we might to go \"The Walk\". Instead we saw \"Pan\". To get me ready we watched \"Hook\", and few other earlier \"Peter Pan\" movies. I didn't understand why they needed to make a new one but this story was different. The other \"Peter Pan\" movies deal with The Darling family. This one featured Peter. The movie started out with Peter as a baby then moved into his transition of becoming an enchanted boy who could fly. Usually the bad guy in these movies was \"Captain Hook\" but in this movie Garrett Hedlund played Hook and trust me he was not bad at all. Rooney Mara was great as \"Tiger Lilly.\" Hugh Jackman played \"Blackbeard\". I am not used to seeing him looking that ugly but he was good. Levi Miller did a great job as \"Peter Pan\". When you see these movies you don't realized that the actors are not reacting to anything initially. All of the creatures are put in later. THe special effects were beautiful. I loved all of the fairies. I also loved how the movie moved from an cold, sad London of WW2 to Neverland. It was great. This movie is rated PG and has a good story so if you want to take your family out for a cinematic treat this weekend. I think \"Pan\" would be a good choice!",
         "Brace yourself to be blown away! But prepare yourself: it's a Joe Wright movie, so it's so different and perfectly magical, it will change your previous knowledge of who Pan truly is. If you are going to watch this movie you must know it's not a remake of Peter Pan, this is a story about who Peter Pan actually is, how he became \"the Boy Who Wouldn't Grow Up\" and how Hook became Captain Hook and who princess Tiger Lily is. It's amazingly beautiful and the soundtrack is phenomenal! My husband and I absolutely loved it. All I want by this point is part 2! I want Joe's version of how Wendy Darling enters the story.",
         "WHAT A MOVIE! I ONLY DIDN'T GIVE IT A 10, BECAUSE THE \"BAD\" IN THE MOVIE, ARE GOOD THINGS THAT COULD HAVE BEEN BETTER!Is hard not to compare with the first chronicles of Marnia movie and i really don't know why, but there are several similarities.Hugh Jackman is obviously sensational, Rooney Mara too, and she will shut the people who signed that ridiculous petition to change actress, Garrett Hedlund is good too, many people have denied that, but the character, in the way he is in the movie, it did get well played by Garrett, And the boy they have chosen to play Pan, Levi Miller, THEY COULD NOT HAVE CHOSEN ANY BETTER! He just rocked, is amazing how good he can act being that young. He was my first concern about the movie because the main acting is the most crucial, and it would be a kid, and is hard to find a kid acting good, so this was a crucial point that would be hard to make work, and they did, Levi Miller was just amazing, i think he can be the next DiCaprio, after all, looks like a young version of him, A LOT, jUS HOPE HE DOESN'T GET TO BE THE NEXT DICAPRIO BECAUSE....Oscar. Do i need to say any more? He also (last time i talk about his acting, u must be like \"yeah we get it, the kid is good\") rocks in the scenes which he's tied up and black beard is killing all the fairies, he cries and yells, ILL DO ANYTHING JUST STOP!! ANYTHIIING!! AMAZING! and when he meets his mom, cries, and show a perfect mixed expression of sadness, happiness, and satisfaction! this boy just...wow! Now i don't understand the reason of so much hate, there are critics that complain about the lack of magic and wonder in Neverland. What?! mermaids crocodiles, giant floating water balls, a \"space\" before Neverland, skeletal birds, the fairy kingdom, how is it without magic? And they also complain about the nirvana scene that doesn't make sense but....THE MOVIE DOESN'T MAKE ANY SENSE! U CAN SAY THE SCENE WAS BAD, BUT COMPLAIN BECAUSE DOESN'T MAKE ANY SENSE, COMPLAIN ABOUT THE WHOLE MOVIE THEN, WHAT THE HECK MAKES SENSE IN THIS MOVIE? I feel deeply sorry for the people who worked in this movie that i loved, and i have seen how hard they tried (i have came along with the news of this movie's production since December of 2013 when it was announced)and see how hard they worked, to get these reviews of the movie that i personally loved, made me feel kinda sad 4 them, also for Levi Miller, to know that his first major movie, that made him cry when knew he was gonna be a part of it, being so criticized, at least almost ALL the reviews are loving him as an actor, and trust me, this boy is gonna steal every1's heart!Lets see how he's gonna handle it",
         "I admit, Peter Pan is one of those stories that just draws the child in me to it. Who doesn't want to learn to fly, be friends with pixies, or never grow up and have all the anxieties of life? And whenever a new Peter Pan story is made into a film, I generally wind up seeing it. At last count I've seen Disney's animated Peter Pan and Return to Neverland, Mary Martin's Peter Pan, Cathy Rigby as Peter Pan, Hook, Peter Pan (2003), Peter Pan Live!, and now Pan and read Peter Pan in Kensington Gardens, Peter Pan and Wendy, Peter Pan in Scarlet, and Capt. Hook. So you might say I am an old hand at this... Pan is a lively, different take on the tradition of Peter Pan...not quite as bizarre or hilarious as Hook and not as accurate to the original story as Peter Pan from '03. But what I know from having read about Mr. Barrie's life was that he edited Peter Pan numerous times when it was on stage and was always looking for a way to liven things up...so this Pan keeps with that tradition! It is a fun, rollicking adventure about a boy with a destiny, a savvy yet heartfelt pirate tag-a-long, and a warrior-princess...all battling the despotic Captain Blackbeard. SPOILERS AFTER THIS: There is something absolutely charming about this version of Hook who is given the full emotional treatment of a person with an actual past, not just a guy missing a hand who wants revenge. Mr. Hedlund was the ideal casting choice because he can be gruff and still very likable. And for all the complaints about Tiger Lily NOT being cast as Native America, might I suggest an alternative view for this? There is no way to give viewers a 100% authentic, First-Nations approved version of Tiger Lily. Why? Because the way Barrie wrote them was racist and you cannot escape from it...ever. But if you decide to make them Native-Neverlanders instead you remove what could be insulting by making them a new group of people that has no connections on earth. Instead, the Native-Neverlanders were a beautiful, eclectic tribe of people living in the trees like wood-elves (!) in bright tents and clothing, with skilled warriors and artisans. There was never a moment of disrespect to other cultures that I found and it this movie set apart from the others. Rooney Mara was a solid choice for Tiger Lily, enjoyable, spunky and given some really cool fighting scenes. Blackbeard is a great villain with a purpose and Hugh Jackman was remarkable in the role, per the usual. His clothing and hair was flamboyant but not out of place in a world that is rather flamboyant and imaginative...and yes, he can be cruel and vicious. This is not a film for little wee-uns, as Blackbeard does kill children (implied, no impact seen). And Peter Pan himself is a pretty brilliant marvel. Zachary is a newcomer but a fine young actor, quite likable and holds an impressive array of emotions. Peter is his usual self, albeit in a slightly different story, marked by determination and ability to lead. Unfortunately, this story did kill a little of the child-like wonder and glee Peter usually has but then...so did the film Hook. I am giving it 8 out of 10 stars because the casting is very solid, character development is good, setting is spectacular, and plot is mostly sound. The only things I didn't like were the sorta Oliver Twist beginning (with mean nuns, which has been done to death, folks) and the plot hole of what happens to all those men and boys in the mine? Did Peter just leave them there or did he return them home? You decide. But I recommend it wholeheartedly, just beware that it can be a bit scary and some smaller children may not do so well. On the scale of favorite Peter Pan films, it ranks just behind Cathy Rigby as Peter Pan and Hook, which isn't bad at all! It keeps Barrie's fun story alive for a new generation...until the next one is made! See you at the movies!",
         "This is without a doubt the most enjoyable pan movie I have come across. I have just reached home from the cinema, and want to go back so I can watch it all over again. I was able to watch this film in 3D boy did it stimulate my acrophobia,there was some view and angles from some amazing heights that I literally held my breath at times, The film had some truly amazing sets,and scenery with a melody of vibrant colors and musicality from you entered into Neverland, with the aforementioned heights and the displays of camera movements to fully embrace the dreamy state of it all was beautifully done It was great to see this rendition of Peter pan answering such questions as,why Pan is able to fly? and why he has so much confidence? Pan ended with you (me) wanting more, needing to find out what happened between Pan and Hook. It has everything you want in a family movie. The only down side in my opinion (not the strange songs that didn't seem to fit because I did sing along in the cinema), but the natives? who actually looked like a bunch of kidnapped Londoners who escaped and put on colorful native clothing.... They didn't look native at all. I need it to do better, because ... I need Pan 2."
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "RatPac-Dune Entertainment",
         "Berlanti Productions"
      ],
      "summaries": ["Twelve-year-old orphan Peter is spirited away to the magical world of Neverland, where he finds both fun and danger, and ultimately discovers his destiny -- to become the hero who will be for ever known as Peter Pan."],
      "budget": 150000000
   },
   "movielensId": 130450,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-09-24",
      "dvdReleaseDate": null,
      "directors": ["Joe Wright"],
      "runtime": 111,
      "movieId": 130450,
      "title": "Pan",
      "mpaa": "PG",
      "actors": [
         "Levi Miller",
         "Garrett Hedlund",
         "Hugh Jackman",
         "Rooney Mara",
         "Amanda Seyfried",
         "Nonso Anozie",
         "Kathy Burke",
         "Adeel Akhtar",
         "Cara Delevingne",
         "Paul Kaye",
         "Emerald Fennell",
         "Lewis MacDougall",
         "Tae-joo Na",
         "Jack Charles",
         "Bronson Webb",
         "Kurt Egyiawan",
         "Jack Lowden",
         "Jimmy Vee",
         "Aaron Monaghan",
         "Ami Metcalf"
      ],
      "imdbMovieId": "3332064",
      "originalTitle": "Pan",
      "genres": [
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": [
         "tjW1mKwNUSo",
         "Y1wRv8vTpxo"
      ],
      "plotSummary": "Living a bleak existence at a London orphanage, 12-year-old Peter finds himself whisked away to the fantastical world of Neverland. Adventure awaits as he meets new friend James Hook and the warrior Tiger Lily. They must band together to save Neverland from the ruthless pirate Blackbeard. Along the way, the rebellious and mischievous boy discovers his true destiny, becoming the hero forever known as Peter Pan.",
      "tmdbMovieId": 266647,
      "avgRating": 2.80744,
      "releaseYear": "2015",
      "numRatings": 309,
      "posterPath": "/uflLJBg5iVWaPpzc4Qm54HNoGYd.jpg"
   }
}