{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "queen",
            "id": 2011
         },
         {
            "name": "sleep",
            "id": 2116
         },
         {
            "name": "magic",
            "id": 2343
         },
         {
            "name": "fairy",
            "id": 2710
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "princess",
            "id": 7376
         },
         {
            "name": "curse",
            "id": 10541
         },
         {
            "name": "king",
            "id": 13084
         }
      ],
      "imdb_id": "tt0093993",
      "video": false,
      "title": "Sleeping Beauty",
      "recommendations": [
         66176,
         66597,
         41257,
         64382
      ],
      "backdrop_path": "/ayfw25s0tKUJOfhkuCuAbzfCIPc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Rosebud",
               "gender": 1,
               "credit_id": "52fe4846c3a368484e0f0c15",
               "name": "Tahnee Welch",
               "profile_path": "/2ukOU34TyotPuy8sYNMW4w1kOcX.jpg",
               "id": 194670,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Elf",
               "gender": 2,
               "credit_id": "52fe4846c3a368484e0f0c19",
               "name": "Kenny Baker",
               "profile_path": "/sdd9rgifNF9C51RejG7sUGU8Bka.jpg",
               "id": 130,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Queen",
               "gender": 1,
               "credit_id": "52fe4846c3a368484e0f0c1d",
               "name": "Morgan Fairchild",
               "profile_path": "/v0Fyz7tpk6M9DDrQWVkFh3TL75x.jpg",
               "id": 14990,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "King",
               "gender": 2,
               "credit_id": "52fe4846c3a368484e0f0c21",
               "name": "David Holliday",
               "profile_path": "/5HKdNxvqRgHT4Jr4tJzL6HkddKU.jpg",
               "id": 198864,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Prince",
               "gender": 0,
               "credit_id": "52fe4846c3a368484e0f0c25",
               "name": "Nicholas Clay",
               "profile_path": "/eDIODqU43pWCTBwfyLa9GUOfuHO.jpg",
               "id": 31196,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Count",
               "gender": 2,
               "credit_id": "54db117cc3a3682f24000d20",
               "name": "Jonny Phillips",
               "profile_path": "/9d7aKSqfqXHWaETmTKifetsekDa.jpg",
               "id": 8547,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Red Fairy",
               "gender": 1,
               "credit_id": "54db120192514161950011e3",
               "name": "Sylvia Miles",
               "profile_path": "/osHOZQ4Mu9xyNDT79fgeSgJeLlH.jpg",
               "id": 19335,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "White Fairy",
               "gender": 1,
               "credit_id": "54db120ec3a368122d001227",
               "name": "Jane Wiedlin",
               "profile_path": "/pSOpeLUyNcZkbGWtICGh0nG0dWa.jpg",
               "id": 35157,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4846c3a368484e0f0c0b",
               "name": "David Irving",
               "profile_path": null,
               "id": 147594,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4846c3a368484e0f0c11",
               "name": "Michael Berz",
               "profile_path": null,
               "id": 228794,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 2.168879,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 71750,
      "vote_count": 6,
      "budget": 0,
      "overview": "Feature-length, live-action musical version of the classic fairy tale by Charles Perrault.",
      "similar": [
         10882,
         224141,
         809,
         808,
         1417,
         11224,
         109445,
         321612,
         38757,
         14128,
         16119,
         4523,
         14442,
         5393,
         812,
         10020,
         58595,
         150689,
         86130,
         44683
      ],
      "original_title": "Sleeping Beauty",
      "runtime": 90,
      "poster_path": "/36PAtkKgBJ7KSiLi8mC9yXL6CH4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1987-06-12",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Irving"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Michael Berz"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093993/",
      "coverLink": null,
      "actors": [
         "Tahnee Welch",
         "Kenny Baker",
         "Morgan Fairchild"
      ],
      "reviews": [
         "Cannon Movie Tales are film adaptations of classic stories which were made in the late 1980s. Because the first, \"Rumpelstiltskin\" received mostly mediocre reviews (though it wasn't bad) the rest were never released theatrically, debuting on video instead. \"Sleeping Beauty\" is one of the lesser ones. It was directed by David Irving , who also directed \"Rumpelstiltskin\" and the worst one, \"The Emperor's New Clothes\". The script meanders all over the place, introducing two \"Elves\"(who stop the story dead in it's tracks every time they appear) and a silly subplot involving the lack of available spindles which only serves to introduce a tacky and irrelevant \"production number\" which is, by far, the worst of all the songs. The acting, by Morgan Fairchild (the Queen) and Tahnee (daughter of Raquel) Welch, is bland to the point of somnambulence. Only Sylvia Miles, as the Evil Fairy makes much of an impression, and she has only a few scenes. Most of the singing voices are dubbed, including Fairchild and Welch, who can't possibly have had a worse singing voice than the off-key substitute (Linda Lopresti) used for her songs, (or CAN she?) The sets and costumes evoke the proper mood,which, unfortunately, the script and direction consistently undermine. Producer Menahem Golen reportedly loved fairy tales, so how could he let them get away with this? It is watchable, but what a disappointment.",
         "I recorded this for my 9 y-o daughter so she could watch it. She hasn't moved from watching it ....about an hour ago! The cast is good. There isn't a whole lot of dialog. The music is synthesized (not a true orchestral soundtrack) So...if that bothers you, like it does me....be forewarned. The songs are mediocre at best. If you have a musical \"ear\", the songs (and the singing) will sometimes make you cringe. On the up-side, the scenes are beautifully shot. Very colorful and the costumes are wonderful. However, like I said....it's a good movie for the little ones.",
         "Elf (Kenny Baker) is told by his master to do some good for the kingdom. He decides to give a gift to the Queen (Morgan Fairchild). The Queen asks for a child and the Elf collects ingredients for a magic potion. The King throws a party for the new princess Rosebud and invites all nine fairies. However, they only have eight golden plates. The King invites everybody except for the Fairy of Red. She takes offense and curses the princess. At 16, Princess Rosebud (Tahnee Welch) will get prick by a spindle to kill her. The White Fairy is able to modify the curse to put her to sleep for 100 years until she's awaken by a prince. To stop the curse, the King decrees all spinning wheels to be destroyed. This is a Golan-Globus production which means saving money is key. The sets look good enough. It is definitely not top level. The story is told in a very flat manner. The actors are professional but they aren't used well. The movie has no flow. It may be better served to get rid of the elfs and concentrate more on either the Queen or Rosebud.",
         "Cannon Movie Tales tackles Sleeping Beauty, with Raquel Welch's daughter Tahnee in the title role. I think this might be her biggest part outside of the Cocoon movies, where all she had to do was look good. That's saying something since she doesn't show up in this until about the halfway point. Before that, it's all set up with her parents and elves and fairies and singing. Directed by David Irving (brother of Amy), the rest of the cast includes Morgan Fairchild as Sleeping Beauty...err, Rosebud's mother the Queen, David Holliday as the King, Jane Wiedlin and Sylvia Miles as good and bad fairies respectively, Kenny Baker and Shaike Ophir as elves, and Nicholas Clay as the Prince who awakens her with a kiss. Yes, Sleeping Beauty's name is not Aurora here but Rosebud. I prefer that since it allows me to view the ending to Citizen Kane in a whole new light. For the most part, I enjoyed this. It's not perfect, of course, and it doesn't compare to the animated Disney classic. It's not even the best of the Cannon Movie Tales series. But thankfully it's also not the worst. As with the others, the biggest issue (besides the low budget that means we have cheap sets and costumes and special effects) is that they take a short story and stretch it to the breaking point. The best part of the movie are the really cheesy songs, many of which are (unintentionally?) funny. The song about ripped pants (I kid you not) had me rolling. The cast does a fine job. Most of them are playing it up like they are in a kids movie. It's not very good but it's worth a look for a variety of reasons, not the least of which are the corny songs.",
         "a flat version, nice for good intentions, conventional at all, interesting, maybe, only for the performance of Kenny Baker. but it is not surprising. because it is not easy to give the right nuances of the fairy tale with a modest budget. and this does this version comfortable because it has one duty - to remind, with few small innovations, the universe of the text of Charles Perrault. nothing more. and, having this as start point, it is almost unfair to have great expectations. each actor does a reasonable work, the Charming Prince is not the most inspired choice, Tahnee Welch is a nice Rosebud and the White Fairy an admirable example of kitsch. but this is it. so, nothing unexpected.",
         "There's a very good reason why I decided to make this a 10. This has to be the worst movie I have ever seen. From the costumes, to the acting and even the singing, it was horrible. I loved every single second of it. The fact that Morgan Fairchild is in this and does a terrible job just makes it better. I like to think of myself as a connoisseur of Sleeping Beauty movies, and I've loved every single one of them. This one is absolutely no exception. If you love really bad movies as much as I do,this is the one for you. I did find it interesting that they took a turn from the well known versions of Sleeping Beauty and added an elf. However, the fact that they've used nine fairies as opposed to 4 is more in line with the written adaptation. So, in conclusion, two very enthusiastic thumbs up.",
         "On the most part, while with their flaws and some are better than others, the Cannon Movie Tales films are worth a viewing. Sleeping Beauty is not one of the best like Hansel and Gretel and Beauty and the Beast, if anything it is a lesser effort, but even with its faults it's more watchable than The Emperor's New Clothes. Sleeping Beauty's strengths are a good deal. Apart from some ropey special effects and less than elegant costumes for some of the human characters, this is one of the better-looking Cannon Movie Tale films and certainly could have looked far worse for low-budget. It's beautifully photographed, with a simply colourful rustic look, the sets are some of the most lavish of any of Cannon's films, the film is nicely lit and not as dim and faded as some of Cannon's other films, and the fairy costuming and make-up are appropriate and colourful as well as more imaginative than most of Cannon's costume designs. Loved the use of the Waltz from the Sleeping Beauty ballet and the slow motion fairy dance choreography accompanying it really enchants and is not tacky at all. The crucial christening scene is well written, and has the right amount of simple charm and nail-biting tension. The cast are hit-and-miss, but the good performances belong to Jane Wiedlin's alluring and sympathetic White Fairy, Kenny Baker's amusing Elf and especially Sylvia Miles' genuinely scary and gleefully played Red Fairy. Was mixed however on the music and Nicholas Clay's Prince. The incidental score has the right amount of whimsy, but has more of a synthesised 80s sound than the rest of the Cannon Movie Tale films which struck me as odd. The songs are pleasant in melody (especially All in Sleep and Slumber) and aren't too distracting, but they are not one of Cannon's most memorable song scores either and a few contain some corny lyric writing, like the pretty tacky Spin Spin Spin. Clay does bring some charm to the Prince, but his screen time is limited and the character not that interesting so he is a little bland too. There are some misses in the cast however, Morgan Fairchild is a blank as the Queen, David Holliday overacts and mugs his way through his role and in particular Tahnee Welch's acting in the title role is more reminiscent of sleep-walking. The script and the story are very meandering, the details of the fairy tale are all here but not always with the magic, charm and tension needed, apart from some well-done scenes like the christening. On top of this however, the film is padded out with numerous other scenes that hold very little relevance to the story. This is particularly true with the Elves, their scenes have tiresome humour, feel out of place and just grind the film to a halt. The spindles subplot is not quite as bad, but gets rather silly. Pacing is erratic, the actual fairy tale feeling hurried and the padding drawn out. All in all, decent but a lesser Cannon Movie Tale and not as enchanting as it could have been. 6/10 Bethany Cox",
         "Really good.The opening 10 min are wonderful,but drags untill Fairy Red shows up and then it is pure fun.Kids will love it.I saw it on the Disney Channel in 95 or whenever it was last shown(It was a long time ago).The film has great songs and costumes my fav is either\"Dare Me\",\"Our clothes are worn and tattered\",or\"How Good It Is\".Buy it now.You won't be dissapointed.",
         "Now I can't imagine Kitty from \"Cocoon\" as being Rosebud anymore, she just barely seems like the same woman... but this is a pretty good film. I loved it as a kid, and the Red Fairy ... needless to say... scared the bejeezus out of me. The prince in the end has such a small role that it's pathetic -- but I love the little people. This version I dislike the most out of the Cannon Tales as an adult, but I still adored them as a child.",
         "This movie is so sweet and cute at the same time. You are always watching the film. It's a re-telling of the famous story, Sleeping Beauty. There's a little dwarf that summarizes some of the movie and he is well known for the voice of R2-D2 in the Star Wars movies. Tahnee Welch plays Princess Rosebud, she is the daughter of Raquel Welch and is known for her roll in Cocoon 2. The movie is the best of all the Sleeping Beauty movies I've ever seen. This movie is for all ages, I recommend that you rent or buy this movie. It is delightful at any time of the year."
      ],
      "genres": [
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": ["Golan-Globus Productions"],
      "summaries": [
         "An elf gives a queen a magic spell for the baby she always wanted. But an evil curse is placed over her daughter, Rosebud, which results in the king demanding that all the spindles in the kingdom be destroyed. As Rosebud grows into a naive yet pretty young woman, she wonders why no one in the kingdom ever has new cloth. She convinces her parents to go on a journey to a neighboring kingdom, not knowing what awaits her as soon as the king and queen are gone.",
         "Feature-length, live-action musical version of the classic fairy tale by Charles Perrault."
      ],
      "budget": 0
   },
   "movielensId": 130800,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-06-12",
      "dvdReleaseDate": null,
      "directors": ["David Irving"],
      "runtime": 90,
      "movieId": 130800,
      "title": "Sleeping Beauty",
      "mpaa": "",
      "actors": [
         "Tahnee Welch",
         "Kenny Baker",
         "Morgan Fairchild",
         "David Holliday",
         "Nicholas Clay",
         "Jonny Phillips",
         "Sylvia Miles",
         "Jane Wiedlin"
      ],
      "imdbMovieId": "0093993",
      "originalTitle": "Sleeping Beauty",
      "genres": [
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Feature-length, live-action musical version of the classic fairy tale by Charles Perrault.",
      "tmdbMovieId": 71750,
      "avgRating": 3.125,
      "releaseYear": "1987",
      "numRatings": 4,
      "posterPath": "/36PAtkKgBJ7KSiLi8mC9yXL6CH4.jpg"
   }
}