{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1510726",
      "video": false,
      "title": "The Woman with the 5 Elephants",
      "recommendations": [],
      "backdrop_path": "/uYtu3tWpPBXEBv4aSyhBcIY3vKL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Svetlana Geier",
               "gender": 0,
               "credit_id": "546a592122136e68da003934",
               "name": "Svetlana Geier",
               "profile_path": null,
               "id": 1386430,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Anna Götte",
               "gender": 0,
               "credit_id": "546a592eeaeb81210d000d0d",
               "name": "Anna Götte",
               "profile_path": null,
               "id": 1386431,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Hannelore Hagen",
               "gender": 0,
               "credit_id": "546a593aeaeb816b58003c6f",
               "name": "Hannelore Hagen",
               "profile_path": null,
               "id": 1386432,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jürgen Klodt",
               "gender": 0,
               "credit_id": "546a5947eaeb817d3e000140",
               "name": "Jürgen Klodt",
               "profile_path": null,
               "id": 1386433,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Johannes Geier (Archive Footage)",
               "gender": 0,
               "credit_id": "546a595aeaeb816b58003c75",
               "name": "Johannes Geier",
               "profile_path": null,
               "id": 1386434,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Fyodor Ivanovich Mikhaylov (Archive Footage)",
               "gender": 0,
               "credit_id": "546a598ceaeb816b4b003d7e",
               "name": "Fyodor Ivanovich Mikhaylov",
               "profile_path": null,
               "id": 1386435,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Sofiya Nikolaevna Mikhaylova (Archive Footage)",
               "gender": 0,
               "credit_id": "546a5995eaeb8120f9000286",
               "name": "Sofiya Nikolaevna Mikhaylova",
               "profile_path": null,
               "id": 1386436,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4a019251416c910c011d",
            "name": "Vadim Jendreyko",
            "profile_path": null,
            "id": 1278717,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.216797,
      "production_countries": [{
         "iso_3166_1": "CH",
         "name": "Switzerland"
      }],
      "id": 88744,
      "vote_count": 3,
      "budget": 0,
      "overview": "Documentary about Svetlana Geier, a Ukranian who has translated the great works of Dostoyevsky into German. First her father ends up in one of Stalin's prison camps, then young Svetlana herself experiences the German invasion. In order to survive she learns German at home in Kiev. She is good and gets work as a translator before ending up in a German camp in 1943. Now, 65 years later, she is a renowned translator who in her twilight years has translated the great works of Dostoevsky. For the first time in all these years, she returns to Kiev together with her granddaughter.",
      "similar": [],
      "original_title": "Die Frau mit den 5 Elefanten",
      "runtime": 93,
      "poster_path": "/vv08mQABB7tOvtxPrMsfObcxbjA.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "3Sat",
            "id": 8134,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Schweizer Fernsehen",
            "id": 1927,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Zweites Deutsches Fernsehen (ZDF)",
            "id": 4606,
            "origin_country": ""
         }
      ],
      "release_date": "2010-01-09",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.5elefanten.ch/Intro",
      "status": "Released"
   },
   "imdb": {
      "country": "Switzerland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vadim Jendreyko"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Vadim Jendreyko"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt1510726/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BODMzNzMxYTktMzE5Yi00NjVkLWIyNTktMjUwNjI0Yjk4ZWM3XkEyXkFqcGdeQXVyNjAyMzkzMzM@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "Svetlana Geier",
         "Anna Götte",
         "Hannelore Hagen"
      ],
      "reviews": [
         "Thumbs up for 87-year-old Swetlana Geier - an astonishing woman with a hard life who never gave up. This documentary shows Swetlana Geier, born in Ukraine in 1923, who very early started to learn German because her mother said this would be her \"dowry\". Her father was sent to prison by Stalin's police and came home after 18 months, health and spirit broken by torture; he died a mere six months after his release. When the German troops arrived they were hailed as rescuers from Stalin - no-one had taken the news about concentration camps seriously. Unfortunately the Nazi soldiers rounded up most of Kiev's Jews and shot them at Babicar. Swetlana gets a job as a translator with a German soldier, and her mother works as a maid. Because of Swetlana's exceptional intelligence and language skills she is protected by the Germans and even manages to get a German \"foreigner's passport\" and is allowed to move to Freiburg and study there. She has worked as a translator and university teacher ever since, and even though she is now old and has a hunch, she still works every day, reading Dostoyevski's books and translating them. She calls them \"the five elephants\" because they are so heavy - difficult to understand, because you always see something new, which is a hallmark of excellent literature; and difficult to lift because the books are so big. Throughout the film she talks about literature and translation, and this might sound very dull, but it is very exciting, thrilling and touching. She compares sewing and lace-making and other household chores to writing and translating. With her granddaughter she returns to Kiev to visit the places where she once lived and tells the story of her life. Her mind is still very young, and you can see her working with Ms Hagen, a friend who types her translations, and Mr Klodt who proof-reads everything and argues about every word. This shows how difficult the translation process is if you really want to show the complexity of the original text - it is not something everyone can do (even though a lot of people say so). She has re-translated \"Crime and Punishment\" giving it a new title, \"Verbrechen und Strafe\" (crime and punishment) instead of \"Schuld und Sühne\" - guilt and atonement, thus moving the stress from the moral to the technical level. Even after her son has died after a work accident she does not lose her sense of humour and irony or working spirit - she will probably continue translating and enjoying literature until she drops dead. Let's hope she will still be alive and kicking for a very long time.",
         "Svetlana Geier, the protagonist of this documentary, is known for her praised re-interpretations of dostojevskys books from Russian to German. Thus she has very interesting things to say about language, literature and life. Moreover, growing up in Kiev she witnessed, how her family and friends fell victim to the stalinist purge and the German occupation, while she herself was one of the very few eastern europeans actually being promoted by the Nazi regime with a scholarship in Germany. Unfortunately, this great material is presented in an unstructured an ill-paced manner. The only narrative frame is the historic one of the 30s and 40s. Everything else is shown in an arbitrary order. This is tolerable as long as the material is interesting enough to carry itself. But what's really annoying is the passages, where we see here speaking in Russian to an ukrainian audience. Without subtitles. For minutes. Or we see here looking out of a train's or a taxi's window an speaking to herself in Russian. Without explanation or translation. For minutes. These parts, in total at least 30 minutes, convey hardly any information. In addition, the director very often fails finding pictures which would illustrate the narrated appropriately. So if this documentary was re-edited, brought into a coherent shape and freed of all the superfluous crap, it would be quite a good one.",
         "\"Die Frau mit den 5 Elefanten\" or \"The Woman with the 5 Elephants\" is a German/Swiss documentary movie from 2009, so this one has its 10th anniversary next year. Thanks to the awards recognition it received, it is until now probably still the most known work by writer and director Vadim Jendreyko. And thanks to his own background as well as due to the protagonist's background (in terms of both nationality and profession), there are several parts in Russian in here, even if the central language is still German. It runs for slightly over 1.5 hours, including credits and the focus here is on Svetlana Geier, who tells us about her life during the German invasion during World War II, but also about a lot that happened later to her. Sadly she died shortly after this film was made, but she was at a pretty old age already in here. So these are the basics and as it felt pretty generic for a documentary on the subject that it is about, there are informative moments and sequences nonetheless. I personally preferred the old footage from back in the day and the recordings with a lot of snow to be seen. Both, especially the former, could have been more frequent in the first 45 minutes of the film I would say, but it is still not bad by any means, just an attempt by me to describe why I enjoyed the second half more than the parts early on. As for Geier herself I guess her life was interesting enough and significant enough to justify a documentary movie being made about her, especially her earlier years, and the success speaks for itself in terms of ratings and receptions. If you take a look at the subject, then you should be able yourself to decide whether this is a movie you want to see. The subject is definitely not for everybody, but it can be a pretty rewarding watch if it appeals to you, maybe even more rewarding than it was for me who would describe the overall outcome as good, but not great. Still I give this one a thumbs-up all in all and I definitely think it is worth checking out. One final note: Don't be fooled by the animals in the title, the elephants in the room because this is at no point a nature documentary, so if you are looking for that, go for something else instead. That's all folks."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "3sat",
         "Filmtank",
         "Mira Film"
      ],
      "summaries": ["First her father ends up in one of Stalin's prison camps, then young Svetlana herself experiences the German invasion. In order to survive she learns German at home in Kiev. She is good and gets work as a translator before ending up in a German camp in 1943. Now, 65 years later, she is a renowned translator who in her twilight years has translated the great works of Dostoevsky. For the first time in all these years, she returns to Kiev together with her granddaughter."],
      "budget": 0
   },
   "movielensId": 132138,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "2010-01-09",
      "dvdReleaseDate": null,
      "directors": ["Vadim Jendreyko"],
      "runtime": 93,
      "movieId": 132138,
      "title": "The Woman with the 5 Elephants",
      "mpaa": null,
      "actors": [
         "Svetlana Geier",
         "Anna Götte",
         "Hannelore Hagen",
         "Jürgen Klodt",
         "Johannes Geier",
         "Fyodor Ivanovich Mikhaylov",
         "Sofiya Nikolaevna Mikhaylova"
      ],
      "imdbMovieId": "1510726",
      "originalTitle": "Die Frau mit den 5 Elefanten",
      "genres": [
         "Documentary",
         "Foreign"
      ],
      "youtubeTrailerIds": ["JEPF-b7F3ZE"],
      "plotSummary": "Documentary about Svetlana Geier, a Ukranian who has translated the great works of Dostoyevsky into German. First her father ends up in one of Stalin's prison camps, then young Svetlana herself experiences the German invasion. In order to survive she learns German at home in Kiev. She is good and gets work as a translator before ending up in a German camp in 1943. Now, 65 years later, she is a renowned translator who in her twilight years has translated the great works of Dostoevsky. For the first time in all these years, she returns to Kiev together with her granddaughter.",
      "tmdbMovieId": 88744,
      "avgRating": 4,
      "releaseYear": "2010",
      "numRatings": 1,
      "posterPath": "/vv08mQABB7tOvtxPrMsfObcxbjA.jpg"
   }
}