{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "decapitation",
            "id": 11181
         },
         {
            "name": "rite",
            "id": 170339
         }
      ],
      "imdb_id": "tt1227789",
      "video": false,
      "title": "Rites of Spring",
      "recommendations": [
         73963,
         101791,
         147879,
         209780,
         120854,
         107227,
         250802,
         108147,
         110372,
         176079,
         87680,
         78369,
         71112,
         17886,
         166902,
         47891,
         124054,
         28533,
         32862,
         25151
      ],
      "backdrop_path": "/k0I7uNjW344CtlAJWjDYuiCZ5wz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Amy",
               "gender": 1,
               "credit_id": "52fe48fb9251416c750b9a41",
               "name": "Katherine Randolph",
               "profile_path": "/gZrVRLrRl7VUyQBhiCLpmdQ5OjH.jpg",
               "id": 557545,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Rachel Adams",
               "gender": 1,
               "credit_id": "52fe48fb9251416c750b9a45",
               "name": "Anessa Ramsey",
               "profile_path": "/4spbX2OQTg39uICf5nBBQKIo4ko.jpg",
               "id": 74131,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ben Geringer",
               "gender": 2,
               "credit_id": "52fe48fb9251416c750b9a49",
               "name": "AJ Bowen",
               "profile_path": "/zsWWKKt0p69mRRgjXGysMpTSQQn.jpg",
               "id": 74133,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Alyssa Miller",
               "gender": 0,
               "credit_id": "52fe48fb9251416c750b9a4d",
               "name": "Hannah Bryan",
               "profile_path": null,
               "id": 1070834,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48fb9251416c750b9a37",
               "name": "Padraig Reynolds",
               "profile_path": null,
               "id": 1070831,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48fb9251416c750b9a53",
               "name": "Wes Benton",
               "profile_path": null,
               "id": 1206665,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48fb9251416c750b9a59",
               "name": "E. Thompson",
               "profile_path": null,
               "id": 1206667,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48fb9251416c750b9a5f",
               "name": "Cher Foley",
               "profile_path": null,
               "id": 1206668,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe48fb9251416c750b9a65",
               "name": "Carl Herse",
               "profile_path": null,
               "id": 1098776,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe48fb9251416c750b9a6b",
               "name": "Holly Amber Church",
               "profile_path": null,
               "id": 1206669,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe48fb9251416c750b9a71",
               "name": "Kerrie Kordowski",
               "profile_path": null,
               "id": 966983,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57711ff79251414ce20004db",
               "name": "Padraig Reynolds",
               "profile_path": null,
               "id": 1070831,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.726753,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 92397,
      "vote_count": 25,
      "budget": 0,
      "overview": "A ransom scheme turns into a nightmare for a group of kidnappers who become victims of a horrifying secret that must be paid every spring.",
      "similar": [
         7191,
         275,
         2163,
         124905,
         5876,
         588,
         562,
         433808,
         39256,
         339530,
         46261,
         4771,
         585,
         293167,
         339967,
         193893,
         984,
         334536,
         398175,
         6312
      ],
      "original_title": "Rites of Spring",
      "runtime": 81,
      "poster_path": "/8KRLhKCMNzNtTnBnKxFneMHJjMW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "White Rock Lake Productions",
         "id": 6571,
         "origin_country": ""
      }],
      "release_date": "2011-01-01",
      "vote_average": 4.2,
      "belongs_to_collection": null,
      "tagline": "Fear has a season",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Padraig Reynolds"],
      "runtime": 80,
      "synopsis": null,
      "writers": ["Padraig Reynolds"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1227789/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQxNjYwNzgxMF5BMl5BanBnXkFtZTcwNDUzMTgwOA@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "AJ Bowen",
         "Anessa Ramsey",
         "Sonny Marinelli"
      ],
      "reviews": [
         "A ransom scheme turns into a nightmare for a group of kidnappers who become victims of a horrifying secret that must be paid every spring. Horror fans will instantly recognize AJ Bowen, the current independent horror go-to actor. Beyond that, many faces appear on screen that we may never see again. There is particularly terrible acting from the father character, which might take some viewers out of the movie. This might appeal to some people, but it never seems to quite capture what it was going for. While it starts as a kidnapping film, it turns into something like a poor man's \"Jeepers Creepers\". And even then, there is an undercurrent that is not far removed from \"It\". At no point does anything seem quite original enough to merit respect.",
         "An opening title card for \"Rites of Spring\" tells us that five teenage girls went missing on the first day of spring in 1984, and that a string of other young girls went missing the following year, again on the first day of spring, and that these disappearances continued annually for the next twenty-four years. We're never told what state this happened in, although the film is littered with shots of cornfields, dilapidated barns, and rusty water towers, so it's obviously somewhere in the Midwest, maybe Iowa or Wisconsin. Because of a passing cop car, we do know that the name of the town is, ironically, Hope Springs. But never mind; the important thing is that none of the bodies were ever recovered. How ominous. This could, perhaps, play into the cliché of passing off a horror movie as a dramatization of an actual incident. We'll never know, of course, since the words \"inspired by true events\" weren't used in the ads. The futility of applying logic to a movie like this is not lost on me, but I'm forced to wonder about the population of Hope Springs. Given twenty-four consecutive years of disappearances on the same day, you'd think someone somewhere would have noticed a pattern beginning to form, and therefore would have been motivated to hightail it out of there. At the very least, you'd think all the parents would have the decency to send their young daughters away for their own protection. But no; not only is Hope Springs still a thriving community, it also seems as if no one is aware of what has been happening all these years. The opening scene, in which two twentysomething women leave a bar after midnight and are immediately kidnapped by a hooded man with a chloroform-soaked rag, makes this abundantly clear. So too does a scene in which two people enter an old house and discover a hidden room with dozens of pictures and newspaper clippings pinned to the wall. At this point, the film splits into two plot lines. In one, the two kidnapped women (Anessa Ramsey and Hannah Bryan) awaken to find themselves hanging by their wrists in a dusty old barn. Their kidnapper, an old man known only as The Stranger (Marco St. John), enters the room and asks one of them if she's clean. He then collects samples of their blood and tosses them into a pit, at which point some ... some creature stirs out of a slumber. Later on, The Stranger cuts all the clothes off of one of the girls, covers her head with a goat mask, and gives her a sponge bath. How boring that his use of the word \"clean\" was literal. In between these moments, the two women cry, scream, hyperventilate, ask each other what's happening to them, and make promises that one will not leave the other behind. We also see The Stranger praying in a room decorated with toy horses and using a goat's skull to pay homage in front of a vast cornfield. In the other plot line, a young man named Ben (A.J. Bowen) is drawn into a scheme to extort money from a wealthy businessman named Ryan Hayden (James Bartz). The mastermind, Paul (Sonny Marinelli), is cold and ruthless, whereas Ben clearly does not have the temperament for this kind of thing. Regardless, they succeed in killing Hayden's wife and kidnapping his daughter, Kelly (Skylar Page Burke), although there's the unexpected addition of Kelly's babysitter, who saw Paul's face. They take Kelly to a conveniently abandoned factory and begin making their demands for $2 million in unmarked, unprocessed tens and twenties. Sent to pick up the money is Ben's brother, Tommy (Andrew Breland). Little does anyone know that Hayden is the not the kind of man you want to screw with. For the first half of the film, we're struggling to figure out how these two stories are connected. When all is made clear, we're more infuriated than satisfied. That's because, in spite of the history certain characters share, which decency prevents me from revealing, writer/director Padraig Reynolds either didn't realize or didn't care that he made two completely different movies. Their convergence in the final act is actually one step below a contrivance; it literally seems as if scenes from a crime thriller and a slasher/creature feature were spliced together in the editing room with only the hope that a cohesive storyline would somehow emerge. Ed Wood turned that level of artistic incompetence into an endearing form of camp. A viewing or two of \"Glen or Glenda\" might actually do Reynolds some good. The Internet Movie Database dubs the main antagonist Creature, although the end credits refer to him as Worm Face, and indeed, select close-up shots reveal a head with worms crawling on it. We don't really know what the hell he is; he has the proportions of a regular albeit tall man, although his face is anything but human, and miraculously, I could tell this despite the fact that his head was wrapped in some kind of cloth. We do know that his weapon of choice is a sickle blade attached to a long stick, and there will be many scenes near the end of him chasing people, not just though the abandoned factory but also through cornfields, which is only appropriate. The final scene of \"Rites of Springs\" is immensely unsatisfying, not only because of the caviler attitude with which Reynolds regards loose ends but also because of a post credit scene that amounts to overkill. This is such a poor effort. How could it have earned a theatrical release? -- Chris Pandolfi (www.atatheaternearyou.net)",
         "Low budget slasher, that copies most of it's ideas from Jeepers creepers 1 & 2. It takes at least 20 minutes to even get going (and by that I mean for something.. hell anything interesting to happen!) I watched this film because of the reviews on IMDb which said said the gore was cool.. Where? when? Two badly done fake blood splatters and one comical rubber finger slice later any hope I had Rites of Spring being any better than a bad student film project left. Better films (..as in the plot, acting or effects) in this genre are.. Husk [2011] Triangle [2009] Summers Blood [2009] The Collector [2009] Amusement [2008} Kill Theory [2009].. If you haven't seen one those films I suggest you do over Rites of Spring. Even the ending sucked big time. Avoid!",
         "*SPOILERS FOLLOW!* *THIS MOVIE SUCKS!* *THAT'S THE SPOILER!* A lot of the reviews I've read here have made a big deal about the fact that this movie is about two seemingly utterly different plot lines that converge and WACKINESS ENSUES!...or I guess it's supposed to be terror ensuing. Not sure. Not sure the filmmakers knew either. I don't know where these reviewers are coming from, but seriously...two seemingly disparaging plot lines coming together in unexpected ways is old hat in the real world that I live in and it's nothing worth popping a monocle out over. Real talk. If you don't immediately see the connection between the two WILDLY DIFFERENT plots five minutes into this movie...you are officially not the brightest crayon in the box. Honestly, you don't even make burnt umber. Sorry. This is a dumb movie that doesn't know where it wants to go. The few bright points it has, that being the occasional brilliant and believable performance of AJ Bowen, are either killed off with no explanation or killed off in a very tired manner. Also with no explanation. And that's honestly its worst sin. There's no given reason for anything. No given reason why the monster exists,no given reason why one man is trying to stop it from awakening, no given reason why stopping it from awakening requires him to do the disgusting things we see him do. This movie could be tag-lined \"Crying and Moaning 'Why Are You Doing This??'\" and no answer will apparently ever be given. Horror fans aren't idiots and honestly, when you prove that you can do better, we deserve to actually see it. I give it eight gorilla anuses out of ten. And I'm being generous.",
         "If Jason Voorhees (Friday the 13th) and The Creeper (Jeepers Creepers) were to have a baby, Wormface would be the result. It's a low-budget slasher/creature movie that didn't knock my socks off, but didn't leave me gagging either...Well, not too much. If you're not too anal retentive about your horror movies, the film in itself is not as bad as the others I've seen where I wanted to pour bleach in my eyes after seeing the first 5 minutes, sometimes less. You just have to understand that this movie is not up to par with the great horror classics. It's unoriginal, cliché-ridden and there are numerous flaws as you go along. However, the actors are good and the cinematography is not bad either. Their shots of the corn field reminded me of Husk, which is an excellent film, by the way. The ending would probably leave you scratching your head, thinking WTF just happened. There are some loose ends left in the story that attempted to add some mystery, but failed. In short, it's like an appetizer film that would be good to watch on a lazy night. It's watchable, if your expectations are not that high.",
         "Opening inter-titles: high school senior young women go missing, year after year, since 1984. The film has already jumped the shark. That sort of thing would have been stopped in well under 30 years. Alyssa and Rachel leave a bar late at night. Rachel is conflicted about having made a mistake at work. Alyssa tells her to let someone else take the fall for it. Their car starts, eventually, but they immediately get a flat. Then they get abducted, taken to a barn, and strung up by their wrists by The Stranger. The Stranger does whatever the monster in the cellar needs. In a parallel thread, Ben and Paul kidnap Kelly, the daughter of Ryan, the principal employer in the area, and Jessica, Kelly's nanny. They demand 2 million USD in 2 hours. The kidnapping rolls forward on schedule, more or less. Tommy picks up the money, but he also picks up Kelly's father Ryan. Rachel gets free, then tries to help Alyssa, who is already dead by decapitation. Rachel escapes and runs; she goes to the place where the kidnappers are. The two plot threads come together. Ryan has Jessica freed, but Jessica is in league with Paul. Jessica shoots Ryan, and Paul informs the rest of them that he and Jessica are taking the 2 million. Then he kills Tommy. Ben and Amy are left defenseless against these two. Meanwhile, Rachel and the monstrous killer are racing toward the kidnappers. No one listens to her, of course. The monster decapitates Jessica. In the middle of all this, young Kelly breaks free and escapes. Ben has an opportunity to end all this by killing Paul, but of course he does not have the courage. Paul takes Rachel hostage and leaves. Rachel keeps insisting they have to clear out. The monster kills Paul, and takes another head. Ben, Amy, Rachel, and the monster are left. Ben and Amy go looking for a telephone, only to find the house of The Stranger. Amy's probably out of luck, but when The Stranger starts to carve up Ben, Rachel hammers The Stranger. The find Amy strung up on a cross, but the monster kills her. Ben throws Rachel his keys, then the monster does in Ben. Amy finds the car, travels down the road a bit, seems to find some help, but the one who could have aided her turns out the lights. -----Scores----- Cinematography: 0/10 Camera shake. Way out of focus intervals. I liked the 2.35 aspect ratio, which sometimes means that excellent cinematography is on the way. Not here, not at all. More camera shake. Amateurish framing mistakes, inside-outside light level mistakes, ridiculous fades to totally out of focus blurs on the entire screen. Sound: 7/10 Best part of the film. Acting: 4/10 OK, given the script. Screenplay: 0/10 Corn plants that are 7 or 8 feet tall, with full ears, on March 21? Perhaps not. New abductions every year for close to thirty years with no solution? I don't think so. The monster had minutes of opportunity to do in Rachel. He usually killed his victims in one strike. What was the weird nest in the cellar? Not answered. Was this a crime movie? Not a very good one. Was it a horror movie? Not a convincing one or a scary one.",
         "It starts out bad and ends even worse. The acting was horrible save for Anessa Ramsey and AJ Bowen. Ramsey does a great job at imitating a scream queen, but is limited by poor writing and directing. Bowen, who was terrific in The Signal, also falls prey to the writing and directing, so much so that he isn't even given an opportunity to act. Everyone else was pretty bad. Painfully bad. Like, you'd wince when they said their lines. All of the characters did completely unrealistic things throughout the movie. If it wasn't the two girls at the beginning not noticing the guy behind them in the parking lot, then it was the girl at the end speeding away from the monster, only to pull over a few miles down the road. Also, how the hell did he catch up so fast? Oh the 'monster'. This has got to be one of the worst monsters I've seen in quite a long time. Some guy wrapped up like the mummy wearing a mask? He's supposed to be some sort of supernatural creature who feeds on blood and...heads? Where did it come from? Why does such a creature exist? No information or background is given at all on the monster. It's called horror 101. Every monster needs a back story. Speaking of back stories, NONE of the characters had them. Well, just the poor slob with the hot girlfriend who got fired from his job. There was no motivation for most of these characters. There were just there and that's it. Some of them were even throwaway characters, (younger brother of the slob, older sister of he kidnap victim, the mother of the kidnap victim). The plot twist? Huh? You can't have a plot twist without explaining why the character did what they did. Case in point: the older daughter was young, very good looking and rich to boot. Yet, she hooks up with an old, ugly broke guy who would obviously kill his own Mother without a second thought. Not only that but she kills her own Father? Why would she do all of this? For a lousy 2 million? Was she abused? A drug addict? I guess it's a mystery. The main plot is...well there really isn't one. Basically a monster kills everyone in it's path and we hope that the girl either stops him for good or gets away. Here's the part that makes absolutely NO SENSE: The old man is killing girls to feed the creature so the...creature...doesn't...kill girls himself? Huh? In the end, she cuts the monster with his axe and he bleeds all over, then she runs on foot covered head to toe in blood, down the road as the sun begins to rise, which is a direct ripoff of Texas Chainsaw Massacre. The screen goes black. Did the monster get back up? Did she get away? Seriously, who cares? EDIT: IMDb should require people to post only from their Facebook profiles because a few of these 'reviews' are obviously people associated with the film.",
         "Two girls are kidnapped in the parking lot of a bar by unknown assailants. They are taken to a farmhouse in the middle of nowhere and strung up as sacrifice to a local deity that comes out in the spring. One escapes, stumbling onto a group of kidnappers right in the middle of a ransom plot gone wrong, and about to be made worse when a large, ugly beast out of a Party City costume log comes after them. \"Rites of Spring\" is your definitive mediocre, boring slasher trying to be an homage to classic seventies horror. It's not bad, and those that say it is bad clearly haven't ever seen the films this is trying to remake. No horror slasher is good. Some are simply more exciting than others. This is not one of those films. Our heroes are nonplussed actors who are not very good at what they do. But they represent the film in that they are not bad. Perhaps it is because the script has about as much life as a decorative plastic rock made to cover up blemishes in one's lawn. It's not ever particularly interesting. But it's not bad. \"Rites of Spring\" is not a bad film. But it's not a good one.",
         "I'm not sure what the worst thing is about this low budget horror yarn, the script or the directing. The script, I think, although the direction is pretty poor and uninteresting. The problem with RITES OF SPRING is that it's all so predictable, and it has less going on than even the likes of a WRONG TURN sequel. The story tells of a kidnapping gone wrong, as a group of kidnappers attempt to take a rich man's daughter in return for a big ransom. A second storyline sees a couple of young women kidnapped by a creepy old farmer, where they are to become lunch for something terrible living in the basement. Eventually the two plot strands combine in the most predictable way imaginable. There's very little going on here and nothing we haven't seen before. The shocks and twists are very well telegraphed and of the type we've seen countless times. The characters are thinly drawn and the performances completely forgettable. All this has going for it is some half-decent make-up and some okay gore effects, but that's hardly a reason to keep you going; this is barely watchable.",
         "This incredibly low budget horror movie has no clue what it wants to be. It is a home invasion movie, then a kidnap movie, then a serial killer movie, then a killer hillbilly movie, and the worst part is that it does all of these equally bad. The acting is terrible across the board, the story is laughable, the direction is all over the place, like it was filmed by a 10 year old that was using all the new features on his camera phone, which it was probably shot on. I understand that this was a bad movie and it knows it, but that does not change the fact the it is awful on every level, well, except maybe for the poster, which was interesting enough to catch my eye and got me to watch this waste of time movie. 1.5 Beards Out Of 5",
         "This film was actually a good surprise. It is best described as a Slasher movie with lots blood and gore, and some good kill scenes. Although we've seen stories like this before, this was actually not as bad as I've heard in some other reviews. It rolls along nicely and keeps you interested as the kills add up. I liked how there were two plots in a way in the first stanza of the film, then they join up in the last part of the movie. But they are linked more than you know. Like I said I was pleasantly surprised by this slasher as it was better than what I've heard (and seen) lately. So I give this movie a 7 out of 10. Not bad.",
         "Directed by Padraig Reynolds on his feature film debut, Rites of Spring stars AJ Bowen, Anessa Ramsey, Sonny Marinelli, Katherine Randolf, Marco St. John, Hannah Bryan, Sarah Pachelli, James Bartz, Shanna Forestall, Skylar Burke, and Andrew Breland. The film opens in a similar vein to movies such as Texas Chainsaw Massacre, with some title cards informing us that back in 1984, several teenagers vanished without a trace. No bodies were ever found. However, no sooner had these unexplained disappearances begun, than they stopped. Until the following year, when the cycle started again. This pattern of disappearances has continued for 24 years. Rites of Spring is a strange film, almost two different movies playing at once that then collide together towards the end. I actually liked this approach, at least they tried something different with it. One plot is about a group of kidnappers who abduct the daughter of a wealthy socialite and hide out in an abandoned school in the middle of the woods. But feelings of guilt soon overtake the kidnappers, dividing the group and putting their entire plan in jeopardy. The evening further spirals out of control when their poorly chosen hideout becomes a hunting ground for a mysterious creature that requires springtime ritualistic sacrifices. The creature is led to the hideout courtesy of the films second running plot. This involves a farmer who has abducted two girls & is keeping them tied up inside his barn, whereupon he tortures them and drains them of some blood. The blood is taken and thrown into a hidden basement/lair for the films creature which at this point we only catch the briefest glimpse of. Eventually one of the girls escapes and manages to reach the school and coincidentally bumps into the hostage situation. The action then gets ramped up as the creature has followed her and now has more victims to pray on. Rites of Spring is very reminiscent of Jeepers Creepers, from the creature down to a chase through some cornfields. Even some sacrificial people on crosses. Then I read that the director was helped out by Victor Salva who directed the Jeepers Creepers films and this influence and help clearly shows. Not in a bad rip-off way either, this film really stands on its on two feet and tries to carve its own niche in the genre. It is a low-budget film, and yet looks way better than I expected it would. The director really did a fine job and delivers a crisp, fun and clever film. Mixing together two genres was a risk but it paid off well here. Acting wise, AJ Bowen as the kidnapper just trying to get some money without hurting anyone and Anessa Ramsey, the girl who escapes the farmers clutches, are the standout performers. The others are a mixed bag, a couple were average at best but overall definitely better acting standards than in most low-budget horror. The creature (or Wormface as he is referred to in the credits) comes across as a mixture of genre bad guys, he certainly looks creepy enough and armed with some tools for slashing and cutting his victims he is a welcome addition to the genre. The director is hoping to make a trilogy based on this creature, so hopefully we will get more back story in the future. There were a few unanswered questions and a scene after the credits so again I look forward to seeing a continuation in this story. Whilst there is some blood and violence, a beheading, limbs chopped off and a few people hacked up, there is nothing to be to squeamish about. Rites of Spring seemed to be going for a stronger story rather than just be gory for the sake of it, and the end result is a decent, suspense filled horror film that I hope people check out when it's released later in the year. For more of my reviews, please check out my blog: http://headinavice.wordpress.com/",
         "This film reminded me of \"From Dusk Til Dawn\" in that it had two different stories - one a crime drama and the other a supernatural horror. However, it failed to reach an interesting level in either category. Simply put, it was weakly executed. Either story would have been OK on its own as a TV movie, and a decent film if pulled off correctly - but, alas, they both left much to be desired. The crime drama had a weak plot, not too believable or well thought out, and the horror was not horrifying nor was it gory. Nothing about this movie will keep you up at night, unless you're a film producer wondering how these people were approved and given a budget of more than $5. The monster is laughable, and the ending was rushed and truly half-cheek.",
         "Now in my headlining title I said \"Not bad for a B-movie\" But I really don't know what a B-movie is anymore with all the garbage that is in the theatres these days, they is far more worse being released than this film. I think this movie has merit as far as this type of genre goes. The acting is very well done, yes the film is clichéd to death and has a reminiscence of From Dusk Till Dawn, in a small way. But what I mean by this statement is that we have the classic storyline of a guy loosing his job and decides to take the big bosses child for ransom, and this whole ordeal is botched by the people involved it doesn't go so well in the end. Well at the end of the film you will understand what I mean by me saying expected and unexpected avenues.... Then we also have the storyline of some hick living out in the middle of nowhere which leads us to both story lines converging into one another. Not bad cinematography at all for the money they had for this small production, the acting was above par with a little bit of twists and turns. I enjoyed watching this film it wasn't that bad as far as these types of films go. I definitely think it is worth a watch and deserves a look, compared to all the remakes and reboots in the theatres's these days it's a good little flick",
         "In the unnamed rural state in which this film is set, people have been going missing fairly regularly, for 24 years. Such a desperate situation seems to have become accepted, because there seems little effort, or counter-measures, put in place to stop this from continuing. Indeed, toward the end, when a very distressed battered young lady pounds on the door of a remote garage and begs for help, the shop assistant ignores her. So it is safe to say the town does not overly keen on helping itself. As for the victims, the usual parade of energetically screaming, manicured pretty young folk are chained up in a farm shed, this time by an old man determined to sacrifice his victims to a monster in the cellar. 'Everything is going to be okay, nothing is going to happen to you,' the daughter or a millionaire is told, just as she is gagged and left in a ramshackle abandoned building. This is story strand number two. A wronged colleague decides to rob his rich employee, and with a small group, sets about kidnapping his daughter for a ransom. The resurrection of the creature 'Wormface' raises the game considerably, breathing life into what is a fairly routine, if earnest, thriller. The placing of this unspecific creature into the unfolding events adds a new urgency and makes the betrayals and counter betrayals between the characters more entertaining. Also, Wormface does the things that 'creatures' do – walks in front of the camera, appears where none of the characters can see him, and always happens to be there and only too pleased to open up a few veins. There's an element of 'Jeepers Creepers' about the scenario, but this tells its own story. As a whole, 'Rites of Spring' features a number of elements we've all seen before (including the occasional lapse of logic by the characters), but is a satisfying meeting of crime thriller and monster-on-the-loose mayhem.",
         "A cool dual story, with good general suspense (featuring spot on pace and increasing intensity), great leads, a couple surprising twists, good creepy use of a minimalist industrial-orchestral score, wide open back country scenery, well-designed old worn-down sets, a nice lil bit o' gore (with great make-up on close-ups), and an edge-of-your-seat ending!! Above all though: RITES OF SPRING showcases simply *OUTSTANDING* cinematography for its budget and the genre in general, without question. The film is at once simply beautifully lit and very creepily shot, and makes great use of hand-held/steadicam camera work. They also did a fine job on the editing, it flows visually very well. A superb first feature by Padraig Reynolds. A great OnDemand catch for suspense lovers. 9/10",
         "I have never written a review on IMDb before but I just had to defend this movie. I am a huge fan of the Slasher sub genre so I was excited to check this out. Yes it may be part crime thriller, but this is a slasher at heart. Good 80s throwback feel and a great killer. Wormface...what else do I need to say? At the end of the day, this is still a post scream slasher flick and it is far from perfect. It may not have enough gore for some. However, I thought there was just enough. Some may not like the genre mash up (and I usually don't) but this one will surprise you. What would you expect from a film like this? If you are looking for a good horror movie, look away. If you are looking for a good ole slasher, look no further, they are hard to come by these days. With that being said, if you are a fan of the genre,this is well worth a watch.",
         "Padraig Reynolds's \"Rites Of Spring\" is one big one hell of a story. Well actually the film is two stories that build as steady dramatic storms before converging into one monstrous maelstrom of a nightmare. The film stars AJ Bowen (House Of The Devil, A Horrible Way To Die), Anessa Ramsey (Footloose, The Signal), Sonny Marilnelli (ER, The Fallen Faithful), Katherine Randolph (Jarhead), and Marco St. John (Treme, Monster) and follows a group of kidnappers looking for a ransom that inadvertently lead themselves into the path of a psychotic some-what supernatural killer unleashed by a farmer's ritual human sacrifice. Yeah I know, that is an epic set up right!. Not only that but of coarse as always a couple of the kidnappers have other plans for the money situation as the story unfolds. But I don't want to give out a definite spoiler moment of the film. For me \"Rites Of Spring\" almost fails by bringing the two stories slowly together. At times you think \"what the f**k- quit changing' up the story\". It is a knee-jerk reaction when watching a film that bounces between story lines alternating scenes from the beginning. This almost makes the interest and build of the film seem pointless and boring. Don't give into any impulse you may have to step away from this film though. It would be a mistake because this film soon lives up to the title and the horror implied within. Just as in life there is no slow set up to a situation you may face or walk into, so to is how this film begins. The story starts as if we were always watching these characters lives with the plot already in motion. It doesn't stop in the steady intense build from the beginning until the final moments with the scene freezes and the credits role. The movie takes place in a small town with little going on. However in this town there just happens to be a family that gives human sacrifice for prosperity of crops in the coming year. A ritual blood offering to a crazed psychotic slasher that may or may not be supernatural. There is no real detail to the origin of the monster in this film. When the lives crash into one another the darkness intensifies and you almost hold your breath in anticipation of what will happen next. There are some pretty intense moments that give fright as they characters are cut down gruesomely one by one. When the action and horror unfolds it is sudden and none stop right up until the last scene. Then the film ends just as quick as it began with no real finish or conclusion. The story or stories as I should say at first seem scattered and confusing but before it can bother you much the plot unfolding on screen seems to hold you long enough for the nightmare to begin. I really enjoyed this film and can't wait for another ritual sacrifice to bring on a new spring. In other words I hope there is a sequel to this movie.",
         "This starts off like a rather poor taste slasher flick with two damsels kidnapped and tortured, one of them shortly being murdered, then branches out into an entirely different type of film and plot, with a group of miscreants invading the home of a wealthy businessman in search of a king's ransom. Then the two meet, and when they do, the film packs a punch, certainly there is an enormous twist when the person who helped set up the home invasion is revealed. What else can be said about the plot? Well, Frankenstein and his monster meet Bonnie and Clyde it may be, but there is no proper resolution, we are never quite sure if there is a true supernatural angle or if the thing in the hole in the ground is entirely human, but this film doesn't deserve the bad reviews it has received. Much of the action takes place in the dark, but considering it was obviously made on a low budget, it doesn't shape up badly when compared with other, far more lavish productions.",
         "Not terrible, actually the 35-40 minutes are pretty interesting and fairly creepy during the horror portions and tense during the crime portions. I have to take serious mark down for having a weak ending (that I think was really meant to imitate Texas Chainsaw Massacre) and some logic issues about how the scenes with the kidnapper in the barn plays out. (Everyone is that close to him, he's assaulting a friend, but no one tries to kick/shove him off? Then he goes down and a dude twice his size doesn't take the opportunity to beat his ass? C'mon now.) That said, it's as fairly solid effort with good atmosphere and is well shot. Worth a view on Netflix or whatnot.",
         "When I was younger, I used to love goreporn, but now slasher films are absolutely boring and too realistic and not to mention overplayed. Add Rites of Spring to the long list of slasher films that doesn't treat violence with dignity, and you have another mindless run-of- the-mill goreporn splooge Fest. The monster is cool, so it has that going for it, but the desperate reaching of the two-plot collision enhances the feebleness of this movie. The only real reason to watch it, is if you enjoy watching one friend made to suffer while her other friend dies. The positive is that wormface is a pretty excellent monster. The effects are nauseating and creepy and it's interesting how harmless he looks. I think it's far-reaching to involve a real- live missing persons with this one though. There are simply too many gimmicks for this to be a good movie. SPOILER. if you like watching beheadings so much, just watch the news.",
         "What start off are the often used pre-credits explaining the disappearance of women over the years in the area to only follow it up with a sequence of two young ladies one night being kidnapped. Where they awake to find themselves hanging from a rope in a barn. Then the story shifts to a group of clueless kidnappers planning a napping. At first I wasn't too sure if the scenes were somehow linked and it this was going to be told through fragmented flashbacks, but as it goes along we find out it's not the case. An old man who we see early on seems to have different intentions for these girls that involve springtime ritualistic sacrifices to a monster so he gets a good harvest from his cornfield, while the kidnappers actually have their eyes on a young daughter of a wealthy socialite. So firstly it moves back and forth, but how these two story threads come to meet, is that the kidnappers chosen hideout happens to be the area where the old man resides with his grim secret. Also there are some other twists in the story, which do seem a touch too convenient, but nonetheless never all distracting. When watching the indie horror \"Rites of Spring\" it was reminding me of a serious take of the British 2008 horror comedy \"The Cottage\" with lashings of \"Jeepers Creepers\" (2001) and \"Malevolence\" (2003). The action starts off quite slow, setting up the situation and trying to give the kidnappers some reasoning where it shows guilt soon overtaking certain participates. The traits, motivations and developments are beyond clichéd and the stupidity of certain actions only highlighted their inability to follow it through, but that's soon all forgotten when they become the hunted. Nothing fresh and simple-minded, but serviceable in its execution. There it becomes a conventional, but primal monster film, as the body count piles up and during the maniac final third the tension picks up with its typical chase format. It can be brutal, vicious and it doesn't hold back (as buckets of blood runs freely), but I didn't think it was as disturbing as it could have been, but it made up for it with its odd surprise or two. The last five minutes would have to be my favourite part of the film though, as it seems to open a real can of worms if there's a lot more going on than you were originally meant to believe. Then the final shot uses the foreground to great effect, having that potent old school touch where its pay-off is sudden but effective in that it leaves you hanging. Writer / director Padraig Reynolds goes for a moody / sullen approach in favour of build-up then anything truly flashy and illustrative, where he makes good use of the isolated backdrop and when he needs to crank it up, he does. The running time is only short, so I didn't find it to lull about. The script ably does the job despite some loose ends (which I don't find the creature's fate one, as I thought its obvious with the sequence that occurs after the credits have finished rolling), but won't set the world alight and the performances (especially AJ Bowen and Anessa Ramsey) are capable enough in delivering the predicaments. While another star the creature design \"worm-face\" is basic, but successful for such a low-budget horror film. It looks like some scarecrow come to life, with ragtag clothing and a decaying face with worms crawling about.",
         "You can take the summary I wrote and have multiple uses for it. But let's take the one that is obvious: You get two movies in the shape of one. Your sentiment will either be \"Great\" or \"Couldn't they have stuck with one idea instead of mixing them together\". The director also told us (at the Frightfest event this was shown), that his friend Victor Salva helped him out from time to time. So if you feel that the mood you get is familiar, than you are onto something. I actually liked the fact that this mixed two things together. And while I don't think it's perfect, I do think that it is very well made. The actors are really good and the gore/tension is good enough.",
         "I wasn't sure what to make of Rites of Spring before I saw it. i think i might have seen an obscure trailer for it at some point, I don't remember hearing a lot of buzz about it, only seeing some very cool artwork for the film. Well I'm pleased to say I was pleasantly surprised. What starts of as a run of mill chiller quickly turns into a sort of creature feature of sorts. As the film opens two young women are taken captive and awake to being prepared by an old man talking about something getting fed. As we move along another group of characters are introduced who kidnap the young daughter of a rich gentleman and his wife. Things go very bad when the crime goes awry and ends up in casualties and they cross paths with one of the women who has escaped their captive. The movie works best as an overlong chase scene for the most part. But it's cinematically engaging in that it builds a nice old fashioned 70's tension not seen in the genre it quite some time. Technically it's a polished film competently made. The lead performance from Anessa Ramsey leaves much to be desired. But a now genre standout AJ Bowen makes another solid mark on his horror resume and he's cute too. As for the main villain of sorts the creature design is mostly uninspired but it moves quickly and doesn't leave you a lot of time considering it. The only downfall of the film is although a nail biting, edge of you seat ride it doesn't build to any sort of explanation or complex storyline. Still for what it is Rites of Spring is a solid, well made slasher film with a nice clean cut finale I very much appreciated."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Ghostrider Entertainment",
         "Vigilante Ent",
         "White Rock Lake Productions"
      ],
      "summaries": [
         "This movie is about Rachel and her friend who are taken by someone while in a car park while changing a tire. They wake up in a strange barn tied up and frightened. They know that things are going to get worse. The reason why they are abducted becomes clear as there is a horrible secret in the town where girls have gone missing each Spring for many years, and this year is no different. Meanwhile a group of kidnappers are plotting to take the child of a prominent business man and his wife. They take the child and go to a farm where they wait to get their ransom. The two groups collide when Rachel escapes but is chased by a stranger wearing a mask of some sort. She runs to the farm where the kidnappers are and all hell breaks loose.",
         "A ransom scheme turns into a nightmare for a group of kidnappers who become victims of a horrifying secret that must be paid every spring."
      ],
      "budget": 0
   },
   "movielensId": 133121,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-01-01",
      "dvdReleaseDate": null,
      "directors": ["Padraig Reynolds"],
      "runtime": 81,
      "movieId": 133121,
      "title": "Rites of Spring",
      "mpaa": "",
      "actors": [
         "Katherine Randolph",
         "Anessa Ramsey",
         "AJ Bowen",
         "Hannah Bryan"
      ],
      "imdbMovieId": "1227789",
      "originalTitle": "Rites of Spring",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["3gp1nAYgG_w"],
      "plotSummary": "A ransom scheme turns into a nightmare for a group of kidnappers who become victims of a horrifying secret that must be paid every spring.",
      "tmdbMovieId": 92397,
      "avgRating": 2.07143,
      "releaseYear": "2011",
      "numRatings": 14,
      "posterPath": "/8KRLhKCMNzNtTnBnKxFneMHJjMW.jpg"
   }
}