{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "mars",
            "id": 839
         },
         {
            "name": "nasa",
            "id": 1432
         },
         {
            "name": "isolation",
            "id": 1533
         },
         {
            "name": "botanist",
            "id": 4003
         },
         {
            "name": "stranded",
            "id": 9743
         },
         {
            "name": "spaceship",
            "id": 9831
         },
         {
            "name": "space",
            "id": 9882
         },
         {
            "name": "engineering",
            "id": 10160
         },
         {
            "name": "survival",
            "id": 10349
         },
         {
            "name": "astronaut",
            "id": 14626
         },
         {
            "name": "science",
            "id": 156810
         },
         {
            "name": "deep space explorer",
            "id": 168603
         },
         {
            "name": "duringcreditsstinger",
            "id": 179431
         },
         {
            "name": "battle for survival",
            "id": 196367
         }
      ],
      "imdb_id": "tt3659388",
      "video": false,
      "title": "The Martian",
      "recommendations": [
         281957,
         296098,
         206647,
         264660,
         177677,
         318846,
         49047,
         102899,
         273481,
         273248,
         140607,
         137113,
         314365,
         253412,
         76341,
         158852,
         198184,
         203801,
         207703,
         194662
      ],
      "backdrop_path": "/sy3e2e4JwdAtd2oZGA2uUilZe8j.jpg",
      "revenue": 630161890,
      "reviews": [
         {
            "author": "Frank Ochieng",
            "id": "5619f70d9251415d3100129c",
            "content": "'The Martian’ is definitely in the creative wheelhouse of filmmaker Ridley Scott whose Science Fiction sensibilities are grounded in colorful futuristic fantasies that tiptoe in grand whimsy.  The veteran auteur responsible for such pop cultural high-minded spectacles in ‘Alien’, ‘Blade Runner’ and even the mixed bag reception of ‘Prometheus’ certainly brings a sophisticated and thought-provoking vibe to the probing aura of ‘The Martian’. As with other Scott-helmed productions, ‘The Martian’ settles nicely in its majestic scope that taps into visual wonderment, humanistic curiosities, technical impishness and the surreal spryness of the SF experience.\r\n\r\nThe exploratory nature of ‘The Martian’ is its own noteworthy mission. Scott arms his frothy planetary odyssey with a sense of thematic inquisitiveness and intelligence while meshing human consciousness and scientific forethought. Clearly, ‘The Martian’ is astutely meditative and one can thankfully block in their memory banks some of Scott’s mediocre misses (anyone care to recall the monumental mishaps in the form of the flimsy ‘The Counselor’ or the unintentional laughfest that was ‘Exodus: Gods And Kings’?). Rightfully so, ‘The Martian’ shares its crafty crater of similarities with other space-place spectacles that resonated with the imagination and innovation such as the Academy Award-winning ‘Gravity’ and the under-rated ‘Interstellar’. \r\n\r\nQuite frankly, ‘The Martian’ is elegantly arresting in its sheer skin for both the character studies and the major plight involved (particularly anchored on the shoulders of star Matt Damon as the contemplative lead) as well as the trademark Scott-induced flourishes that incorporate crisp and cunning visual special effects and a sweeping musical score that invites a transfixing hold on one’s indelible spirit.\r\n\r\n‘The Martian’ is the film adaptation of Andy Weir’s best-selling tome. Scott’s disciplined direction and screenwriter Drew Goddard’s ambitious vision of Weir’s compelling written material seemingly gels in convincing, cerebral fashion. The premise is not wildly original as it revisits the familiar foundation of a lost soul in survival mode trying to take on the treacherous surroundings with philosophical conviction. Nevertheless, this does not make ‘The Martian’ any less formidable in its soul-searching perspective. Scott’s narrative on individualism and isolation with a tremendous technological tilt truly registers with boisterous bounce. Amazingly, Scott has assembled a capable and committed cast that are dedicated to making ‘The Martian’ look resourcefully skillful in its masterful mischievousness. Sure, The Martian’s lengthy running time is staggering but it is compelling enough to invest in its meandering, adventurous narrative.\r\n\r\nThe ultimate nightmare (or perilous predicament…take your choice) has been realised for one stranded space traveler in Mark Watney (Matt Damon). You see…poor astronaut Watney had the misfortune of losing contact with his commander in Melissa Lewis (Jessica Chastain) and the rest of his crew when undergoing a scientific expedition to examine the terrain on Mars. Courtesy of an unexpected freakish storm Watney is separated from his comrades and believed to be dead as a result of the hazardous weather conditions on Mars. Lewis and her associates have no choice but to head back to Earth as searching for Watney may prove to be futile and endanger their lives as well.\r\n\r\nThus, Mark Watney is basically his own forced-upon version of ‘Robinson Crusoe On Mars’. There is no option for Watney but to allow his major survival instincts to kick in while striving for his jeopardised livelihood on the unpredictable and treacherous Red Planet’s jagged landscape. Despite being stuck in hostile territory, Watney must use his background skills as a trained botanist to cultivate the scarce food he must rely on for his unconventional nutrition. The only ‘companion’ that Watney has to relate to rests in the recorded device that captures his harried thoughts through video diaries (at least this is more practical than what Tom Hanks’s ‘Castaway’ character had in his possession with inanimate object best buddy, Wilson the volleyball).\r\n\r\nIn the meanwhile, the devastating news about Mark Watney’s possible death far beyond the reaches of home hits his colleagues understandably hard as tributes start to pour in remembrance of the seemingly dearly departed space pioneer. Soon, there is some measure of hope when NASA officials that include head honchos Teddy Sanders (Jeff Daniels from TV’s ‘The Newsroom’), Vincent Kapoor (the Oscar-nominated Chiwetel Ejiofor from ’12 Years A Slave’) and Mitch Henderson (Sean Bean) find evidence that Watney may be alive and ready to be rescued. Naturally, a sense of urgency is warranted to retrieve the weary astronaut without causing too many public relations waves. This puts press aide Annie Montrose (Kristen Wiig) into damage control mode in particular.\r\n\r\nOkay...so it is not as scenic as Yellowstone National Park but the rocky region in THE MARTIAN still has some unassuming charm, right?\r\nOkay…so it is not as scenic as Yellowstone National Park but the rocky region in THE MARTIAN still has some unassuming charm, right?\r\nImportantly, ‘The Martian’ is clever and carefully conceived because it does not have to rely on the excess baggage to convey its entertainment value in a series of hyperactive and hedonistic happenings. Ridley Scott is soundly methodical in presenting a low-key terrifying tale of loneliness and resiliency and what it takes to handle the pressure of adversity when there is no glimmer of humanity around to reinforce or remind one of such psychological obstacles. The intriguing factor here is the science-friendly serving of intelligence and insight that builds up the audience’s appreciation for the underlying suspense. Interestingly, the conflict approached in ‘The Martian’ is not so much the back-and-forth high-scale struggles of man versus outlandish creature or an over-the-top diabolical deviant out to destroy the world in cartoonish fashion. No, the genuine combative and confrontational war of will is contained in one vulnerable man’s ability to face the unknown grounded in both doubt and determination. Hence, Scott has made a palpable thinking man’s Science Fiction exposition rooted in articulated forethought.\r\n\r\nDamon more than holds his own as the disillusioned botanist/astronaut out on an ominous limb as his doomed odyssey of uncertainty is something that the common viewer can embrace and relate to without question. The perceived opulence in ‘The Martian’ is not contained in the film’s production values per se (Scott has made previous movies with more visual vitality and purpose) but subtly showcased in the concepts of  knowledgeable tidbits concerning food rations, mathematical equations, crucial time tables, planetary probes, NASA-themed procedural techniques and aerodynamics considerations.\r\n\r\nHopefully, ‘The Martian’ is not dismissed as a foreign alien in the minds of ardent movie-going SF enthusiasts looking for a realistic and soulful space-age adventure with a refreshing backbone of scientific curiosity and candidness.\r\n\r\nThe Martian (2015)\r\n\r\n20th Century Fox\r\n\r\n2 hrs. 35 mins.\r\n\r\nStarring: Matt Damon, Jessica Chastain, Jeff Daniels, Kristen Wiig, Michael Pena, Sean Bean, Chiwetel Ejiofor, Kate Mara, Sebastian Stan, Donald Glover and Benedict Wong\r\n\r\nDirected by: Ridley Scott\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Space Adventure/Science and Fantasy\r\n\r\nCritic’s rating: *** 1/2 stars (out of 4 stars)",
            "url": "https://www.themoviedb.org/review/5619f70d9251415d3100129c"
         },
         {
            "author": "Per Gunnar Jonsson",
            "id": "56d97caac3a3682cef01144c",
            "content": "This is a movie that I have to say that I have a bit of a difficulty in rating. Quite honestly I was sorely tempted to remove a star, or even two stars. Why? Because it is full of Hollywood nonsense, scientific errors, it is rather predictable and it did feel a bit like a Apollo 13 rip-off. Why did I not remove those stars? Well, it is rather entertaining even if, at times, I squirmed in my seat.\r\n\r\nThe movie starts of with a somewhat implausible event where a unexpected storm hits the Mars camp which forces the ground crew of the Mars mission to hurry back to the launch vehicle before it tilts over. The launch vehicle gradually tilts a degree at the time. Is it just me finding this strange? Would storms on Mars defy the usual rules of weather dynamics that they would exert a constant pressure which would cause a slow but constant tilt of a construct like that. No gusts, no change in pressure? And why would it gradually tilt at all? Once the force would be enough for the landing struts on one side to leave the ground it would pretty much tilt right away. Okay, I am being picky so lets give that a benefit of a doubt for the time being.\r\n\r\nObviously one guy is lost during the dramatic events. This is equally obviously 100% predictable. The fact that the guy is still alive after the rest of the crew blasted off is obviously also 100% predictable but then, this you should have pretty figured out from the title of the move after all.\r\n\r\nA lot of the rest of the movie is following this guys quest for survival on Mars using the left over equipment at his disposal and the NASA crew on Earth trying to rescue him. Yes the NASA crew on Earth does discover that he is alive which, again, is pretty much predictable. Of course this gave Hollywood the opportunity to add a utterly dislikable political bureaucrat that is pretty much in the movie for one reason and one reason alone…to be dislikable. Personally I just found him tiresome. But then, Americans seems to like these kind of people given the kind of trash that we see being pushed towards the upcoming presidential elections…from both sides!\r\n\r\nThere are a lot of good stuff in the movie. Even though it is rather predictable there are some suspense in it, there are a lot of good scenery, and even though you pretty much knows what is going to happen you do feel like cheering for the hero. Given the script I think a lot of the actors did a rather good job of their roles.\r\n\r\nIf the script writers would have brought on some decent scientific advisors I would say this would have been a great movie but it was frequently goofed up with issues that was just stupid. Like digging down a nuclear reactor a few feet in the ground. What the f… good was that supposed to do? And the constant use of simple plastic and duct tape to seal the environment. Yeah, right. Sure, Mars do have some atmosphere so it is not vacuum we are talking about but then in other scenes they seemed to assume almost zero atmosphere and made quite a bit use of explosive decompression effects.\r\n\r\nOkay, okay I am probably nitpicking quite a bit here but, unlike many Science Fiction movies, this one tries to give an impression of being within the realms of realism and it is just too full of classical Hollywood mishaps for my taste.\r\n\r\nAs I wrote above I still think it is a movie worth watching. It has some suspense, it is well done from a photographic point of view and the actors are doing a decent job. I think 7 out of 10 stars is a fair rating but it should certainly not have more.",
            "url": "https://www.themoviedb.org/review/56d97caac3a3682cef01144c"
         },
         {
            "author": "Andres Gomez",
            "id": "56f08847925141183a000d05",
            "content": "This is a movie following the lead started with Gravity with the human main character fighting for survival in space.\r\n\r\nThe plot has a good combination of suspense, action, humor and drama. Damon performs well and the rest of the cast does a good job and has been well chosen.\r\n\r\nIt is not a magnificent movie but it is good enough to fill a couple of hours of entertainment.",
            "url": "https://www.themoviedb.org/review/56f08847925141183a000d05"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Mark Watney",
               "gender": 2,
               "credit_id": "53e7e85e0e0a266f9a0029aa",
               "name": "Matt Damon",
               "profile_path": "/elSlNgV8xVifsbHpFsqrPGxJToZ.jpg",
               "id": 1892,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Melissa Lewis",
               "gender": 1,
               "credit_id": "5466c78eeaeb8172820008e4",
               "name": "Jessica Chastain",
               "profile_path": "/nkFrkn5NZVGWb4b2X0yIcXezhyt.jpg",
               "id": 83002,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Annie Montrose",
               "gender": 1,
               "credit_id": "5497ab23c3a368054b0009b4",
               "name": "Kristen Wiig",
               "profile_path": "/iqRX3PDxA33zFhSfKTo5BE593G4.jpg",
               "id": 41091,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Teddy Sanders",
               "gender": 2,
               "credit_id": "54a7fe92c3a3680c33001972",
               "name": "Jeff Daniels",
               "profile_path": "/gai03gCu3DxMYxFympt7hUObpI5.jpg",
               "id": 8447,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Rick Martinez",
               "gender": 2,
               "credit_id": "54bad6cc9251411d77006bc3",
               "name": "Michael Peña",
               "profile_path": "/oqlIKSglghuX7kSTalODn71nlOd.jpg",
               "id": 454,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Mitch Henderson",
               "gender": 2,
               "credit_id": "54a7feb3c3a3680c33001977",
               "name": "Sean Bean",
               "profile_path": "/iIxP2IzvcLgr5WaTBD4UfSqaV3q.jpg",
               "id": 48,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Beth Johanssen",
               "gender": 1,
               "credit_id": "54a7fe889251414d6a001b59",
               "name": "Kate Mara",
               "profile_path": "/vK6eOzrFmQNoRyHIP8N5p5Ri4fp.jpg",
               "id": 51072,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Chris Beck",
               "gender": 2,
               "credit_id": "54bad6e49251411d79006a03",
               "name": "Sebastian Stan",
               "profile_path": "/8MOp9cazWpC4CrGLZnD11A6Dv8c.jpg",
               "id": 60898,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Alex Vogel",
               "gender": 2,
               "credit_id": "547c8ad89251412d70003329",
               "name": "Aksel Hennie",
               "profile_path": "/rvSQX11ZSLRngoj9ZaiBxLV0Omg.jpg",
               "id": 76547,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Venkat Kapoor",
               "gender": 2,
               "credit_id": "54bad6fec3a3686c61006835",
               "name": "Chiwetel Ejiofor",
               "profile_path": "/fwaEgwYJdzGyBmGcHiH13vobQii.jpg",
               "id": 5294,
               "order": 9
            },
            {
               "cast_id": 74,
               "character": "Bruce Ng",
               "gender": 2,
               "credit_id": "562a9fc3c3a3681b59002c0b",
               "name": "Benedict Wong",
               "profile_path": "/iBzJ8s7GqgtRfGH3q0Ep5OKnaGf.jpg",
               "id": 30082,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Mindy Park",
               "gender": 1,
               "credit_id": "54bad71392514148bd00413d",
               "name": "Mackenzie Davis",
               "profile_path": "/8DuT6iwIxwEPZL8UqxnUQnUH3Bf.jpg",
               "id": 1110405,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Rich Purnell",
               "gender": 2,
               "credit_id": "54bad6b792514136350018fe",
               "name": "Donald Glover",
               "profile_path": "/36o5mpbQVdxOf9kUxWw7SllOuk.jpg",
               "id": 119589,
               "order": 12
            },
            {
               "cast_id": 55,
               "character": "Tim Grimes",
               "gender": 2,
               "credit_id": "55f559f492514103b6000e7e",
               "name": "Nick Mohammed",
               "profile_path": "/p66VhF2LtIQjxMtgGiYFntlpbtu.jpg",
               "id": 1509615,
               "order": 13
            },
            {
               "cast_id": 142,
               "character": "Zhu Tao",
               "gender": 1,
               "credit_id": "56805f67c3a36828f5003b36",
               "name": "Chen Shu",
               "profile_path": "/lWoKfoCZbRzFV8eb1WrhM7dl2jR.jpg",
               "id": 1076049,
               "order": 14
            },
            {
               "cast_id": 147,
               "character": "Guo Ming",
               "gender": 2,
               "credit_id": "568064a09251417ddd00e4c7",
               "name": "Eddy Ko",
               "profile_path": "/gezpiGi74FTOFns3JcgyvMH2owR.jpg",
               "id": 612216,
               "order": 16
            },
            {
               "cast_id": 143,
               "character": "Mike Watkins",
               "gender": 2,
               "credit_id": "56805fc69251412e5200c1ce",
               "name": "Enzo Cilenti",
               "profile_path": "/lGFHPUsOlAnncpZLfdFXCGq2nji.jpg",
               "id": 91494,
               "order": 17
            },
            {
               "cast_id": 48,
               "character": "Brendan Hatch",
               "gender": 2,
               "credit_id": "55f559f2c3a36871ec005984",
               "name": "Jonathan Aris",
               "profile_path": "/46T3x7CePc22Z5KvkR4OulmVORU.jpg",
               "id": 28477,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Jack",
               "gender": 2,
               "credit_id": "54bad763c3a3681411003c50",
               "name": "Gruffudd Glyn",
               "profile_path": "/p7vTiX2TKxS3ovAsZo2b1WfFBQD.jpg",
               "id": 1414711,
               "order": 19
            },
            {
               "cast_id": 21,
               "character": "Ryoko",
               "gender": 1,
               "credit_id": "54bad73ac3a368145e004389",
               "name": "Naomi Scott",
               "profile_path": "/d140yTWCle6rYUGE9GIVZVPaPng.jpg",
               "id": 240724,
               "order": 20
            },
            {
               "cast_id": 144,
               "character": "U.S. President",
               "gender": 2,
               "credit_id": "5680605ec3a368607500c5d1",
               "name": "Geoffrey Thomas",
               "profile_path": null,
               "id": 1554488,
               "order": 21
            },
            {
               "cast_id": 145,
               "character": "Chinese Flight Director",
               "gender": 0,
               "credit_id": "56806074c3a3684be300e7bd",
               "name": "Yang Haiwen",
               "profile_path": null,
               "id": 1554489,
               "order": 22
            },
            {
               "cast_id": 146,
               "character": "Wen Jiang",
               "gender": 0,
               "credit_id": "56806087c3a3684be300e7cc",
               "name": "Narantsogt Tsogtsaikhan",
               "profile_path": null,
               "id": 1554490,
               "order": 23
            },
            {
               "cast_id": 54,
               "character": "Timer Controller",
               "gender": 2,
               "credit_id": "55f559f4c3a3686d270053bb",
               "name": "Brian Caspe",
               "profile_path": "/1fDVsCwZOwp97Pdl7q743seHCMP.jpg",
               "id": 25730,
               "order": 24
            },
            {
               "cast_id": 50,
               "character": "Launch Control",
               "gender": 1,
               "credit_id": "55f559f3c3a3680a0d006319",
               "name": "Szonja Oroszlán",
               "profile_path": "/3JMcpdegJAmDc5gNYse9E5hOPFa.jpg",
               "id": 82363,
               "order": 25
            },
            {
               "cast_id": 53,
               "character": "Guidance",
               "gender": 0,
               "credit_id": "55f559f4c3a3680a0d00631b",
               "name": "Mark O'Neal",
               "profile_path": "/tr9k5xH0uzc5FIKj3TiKhxPzX6g.jpg",
               "id": 1297390,
               "order": 26
            },
            {
               "cast_id": 52,
               "character": "Reporter 2",
               "gender": 1,
               "credit_id": "55f559f39251415ca00011c3",
               "name": "Karen Gagnon",
               "profile_path": "/3C63C9rve1LQMjWtJM4Sg7KhsO.jpg",
               "id": 1509614,
               "order": 27
            },
            {
               "cast_id": 22,
               "character": "Blair",
               "gender": 1,
               "credit_id": "54bad747c3a3684046001c35",
               "name": "Lili Bordán",
               "profile_path": "/qVH18DCJnqYc3lntCHBfoJ9A69x.jpg",
               "id": 1378657,
               "order": 28
            },
            {
               "cast_id": 51,
               "character": "Reporter 1",
               "gender": 1,
               "credit_id": "55f559f3c3a36871ec005988",
               "name": "Nikolett Barabas",
               "profile_path": "/ro7SsYNPEZfPjWPJAxTIrCoThEt.jpg",
               "id": 1509613,
               "order": 29
            },
            {
               "cast_id": 49,
               "character": "Police Woman",
               "gender": 1,
               "credit_id": "55f559f39251413cab000166",
               "name": "Dilyana Bouklieva",
               "profile_path": "/qHRXVqpzPiIcdiWigFKw7HyUL27.jpg",
               "id": 1394333,
               "order": 30
            },
            {
               "cast_id": 57,
               "character": "Nasa Staff Member",
               "gender": 2,
               "credit_id": "55f559f5c3a3686cfd0059bf",
               "name": "Björn Freiberg",
               "profile_path": null,
               "id": 1509617,
               "order": 31
            },
            {
               "cast_id": 56,
               "character": "Pathfinder developer",
               "gender": 2,
               "credit_id": "55f559f59251415ca00011c8",
               "name": "James Fred Harkins Jr.",
               "profile_path": null,
               "id": 1509616,
               "order": 32
            },
            {
               "cast_id": 47,
               "character": "NASA psychologist",
               "gender": 2,
               "credit_id": "55f559f292514140d70008ba",
               "name": "Sam Spruell",
               "profile_path": "/ksZuHMo5c5CqFTbGIb8Rk6e44bP.jpg",
               "id": 55585,
               "order": 33
            },
            {
               "cast_id": 153,
               "character": "Satcon",
               "gender": 0,
               "credit_id": "584bb190c3a368398b008482",
               "name": "Matt Devere",
               "profile_path": "/mtp0cfPOGZG2aLEw0N6RuJFYA6j.jpg",
               "id": 25445,
               "order": 34
            },
            {
               "cast_id": 154,
               "character": "Launcher Interface",
               "gender": 0,
               "credit_id": "584bb1dfc3a3683975007b27",
               "name": "Mike Kelly",
               "profile_path": null,
               "id": 1720669,
               "order": 35
            },
            {
               "cast_id": 155,
               "character": "Capcom",
               "gender": 0,
               "credit_id": "584bb24e92514133ad007e14",
               "name": "Greg De Cuir",
               "profile_path": null,
               "id": 1102409,
               "order": 36
            },
            {
               "cast_id": 156,
               "character": "Telemetry",
               "gender": 2,
               "credit_id": "584bb43892514133b1008470",
               "name": "Peter Linka",
               "profile_path": "/rdkzkn0onbjIxqQrOHZBPkVrv5l.jpg",
               "id": 146123,
               "order": 37
            },
            {
               "cast_id": 157,
               "character": "Comms",
               "gender": 0,
               "credit_id": "584bb4d0c3a368397a008702",
               "name": "Declan Hannigan",
               "profile_path": "/h4ngh7xvyRIwTT18g6En7xGwyHo.jpg",
               "id": 1508585,
               "order": 38
            },
            {
               "cast_id": 158,
               "character": "NASA Break Room Worker",
               "gender": 0,
               "credit_id": "584bb53ec3a36839720086c2",
               "name": "Peter Schueller",
               "profile_path": null,
               "id": 1676636,
               "order": 39
            },
            {
               "cast_id": 159,
               "character": "Vincent's Secretary",
               "gender": 0,
               "credit_id": "584bb574c3a36839720086e4",
               "name": "Waleska Latorre",
               "profile_path": null,
               "id": 1691280,
               "order": 40
            },
            {
               "cast_id": 160,
               "character": "CNN Reporter",
               "gender": 0,
               "credit_id": "584bb5b692514133b30086d2",
               "name": "Frederik Pleitgen",
               "profile_path": null,
               "id": 1720670,
               "order": 41
            },
            {
               "cast_id": 161,
               "character": "Robert Lewis",
               "gender": 0,
               "credit_id": "584bb6c492514133ab00813b",
               "name": "Charlie Gardner",
               "profile_path": "/7XCnHxpinxZvYvKyPah5Z5hAtrA.jpg",
               "id": 1720671,
               "order": 42
            },
            {
               "cast_id": 162,
               "character": "Vogel's Wife",
               "gender": 1,
               "credit_id": "584bc70492514133bd008935",
               "name": "Nóra Lili Hörich",
               "profile_path": "/dbON3leYJ0dZSfiDxBjdifN5dpw.jpg",
               "id": 1390710,
               "order": 43
            },
            {
               "cast_id": 163,
               "character": "Marissa Martinez",
               "gender": 0,
               "credit_id": "584bc74492514133b6008f8d",
               "name": "Kamilla Fátyol",
               "profile_path": null,
               "id": 1439028,
               "order": 44
            },
            {
               "cast_id": 164,
               "character": "Chinese Translator",
               "gender": 0,
               "credit_id": "584bc7f2c3a3683982008952",
               "name": "Yang Liu",
               "profile_path": null,
               "id": 110508,
               "order": 45
            },
            {
               "cast_id": 165,
               "character": "JPL Store Man",
               "gender": 2,
               "credit_id": "584bc94e92514133ad008b37",
               "name": "Richard Rifkin",
               "profile_path": null,
               "id": 25440,
               "order": 46
            },
            {
               "cast_id": 166,
               "character": "JPL White Room Worker",
               "gender": 0,
               "credit_id": "584bca2692514133a80086f6",
               "name": "Nicholas Wittman",
               "profile_path": "/qIP9Y8pZCoXDKRLe9VNqx0ZQ8qu.jpg",
               "id": 1700678,
               "order": 47
            },
            {
               "cast_id": 167,
               "character": "JPL Pathfinder Team",
               "gender": 0,
               "credit_id": "584bcb0992514133b3009444",
               "name": "Ben O'Brien",
               "profile_path": null,
               "id": 1418518,
               "order": 48
            },
            {
               "cast_id": 168,
               "character": "JPL Pathfinder Team",
               "gender": 2,
               "credit_id": "584bcbd4c3a368398b0093de",
               "name": "Scott Alexander Young",
               "profile_path": "/eNakeD0gL8FxKZpRZkioVOrHMxu.jpg",
               "id": 1365662,
               "order": 49
            },
            {
               "cast_id": 169,
               "character": "JPL Pathfinder Team",
               "gender": 0,
               "credit_id": "584bcc56c3a368397a0095c3",
               "name": "Jason Ryan",
               "profile_path": null,
               "id": 1720680,
               "order": 50
            },
            {
               "cast_id": 170,
               "character": "JPL Pathfinder Team",
               "gender": 0,
               "credit_id": "584bcccbc3a3683975008a7e",
               "name": "James Dougherty",
               "profile_path": null,
               "id": 1720681,
               "order": 51
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5607a946c3a3681218003eef",
               "name": "John Marzano",
               "profile_path": null,
               "id": 1404244,
               "department": "Camera",
               "job": "Helicopter Camera"
            },
            {
               "gender": 2,
               "credit_id": "53e851a8c3a368398a0031eb",
               "name": "Simon Kinberg",
               "profile_path": "/yXlDADc2rLEMLTFZAw9irqXMq2J.jpg",
               "id": 11092,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53e88b1ac3a368399f0035c5",
               "name": "Ridley Scott",
               "profile_path": "/oTAL0z0vsjipCruxXUsDUIieuhk.jpg",
               "id": 578,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53e89181c3a368398a003628",
               "name": "Drew Goddard",
               "profile_path": "/j5Le3QQljdGJ3kPAcjAZr9V4QUC.jpg",
               "id": 47506,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "53e8945f0e0a266f9d003ed9",
               "name": "Andy Weir",
               "profile_path": null,
               "id": 1352085,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "554b7164c3a3685e63001f32",
               "name": "Ridley Scott",
               "profile_path": "/oTAL0z0vsjipCruxXUsDUIieuhk.jpg",
               "id": 578,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5607aa5ec3a3681205004246",
               "name": "Rachael Tate",
               "profile_path": null,
               "id": 1459875,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 2,
               "credit_id": "554b713592514104590013fe",
               "name": "Mark Huffam",
               "profile_path": null,
               "id": 8401,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "554b714dc3a3685e5800211c",
               "name": "Michael Schaefer",
               "profile_path": null,
               "id": 22498,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "554b717a92514146a5001fd1",
               "name": "Aditya Sood",
               "profile_path": null,
               "id": 1320090,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "554b71bfc3a3685e63001f48",
               "name": "Pietro Scalia",
               "profile_path": "/kcQTeWNVqDg0h1jzthF21TxRB9U.jpg",
               "id": 950,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "554b71d2c3a3685e63001f4e",
               "name": "Nina Gold",
               "profile_path": "/kljYhRvTAqQfX198mjz0ITP0hFM.jpg",
               "id": 16363,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "554b71e6c3a3685e4e001f37",
               "name": "Carmen Cuba",
               "profile_path": "/c6zX0b29FimnAQ6nkisWxYsCHvE.jpg",
               "id": 51922,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "554b71f7c3a3685e5b001e5e",
               "name": "Zsolt Csutak",
               "profile_path": null,
               "id": 49670,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "554b721dc3a3685e63001f57",
               "name": "Arthur Max",
               "profile_path": null,
               "id": 944,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "554b7247c3a3685e5b001e6e",
               "name": "Robert Cowper",
               "profile_path": null,
               "id": 23453,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "554b726c925141469c001f2b",
               "name": "Mónika Esztán",
               "profile_path": null,
               "id": 968805,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "554b727dc3a3685e4c0021e3",
               "name": "Phil Sims",
               "profile_path": null,
               "id": 1334420,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "554b7290c3a3685e5b001e77",
               "name": "Stefan Speth",
               "profile_path": null,
               "id": 1411329,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "554b72a292514103d2001478",
               "name": "Matt Wynne",
               "profile_path": null,
               "id": 1299326,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "554b72cbc3a3685e58002146",
               "name": "Celia Bobak",
               "profile_path": null,
               "id": 957666,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "554b72e49251414694001d80",
               "name": "Zoltán Horváth",
               "profile_path": null,
               "id": 1177771,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "554b72f89251410459001430",
               "name": "Janty Yates",
               "profile_path": "/ixu9JLzHeHV8QrGXldMe4nxJ1ON.jpg",
               "id": 946,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5592552692514152d2000388",
               "name": "Tony Lewis",
               "profile_path": null,
               "id": 1338287,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 2,
               "credit_id": "5607a7e19251413050003e2c",
               "name": "Dariusz Wolski",
               "profile_path": "/4LD7NmEu1JV7TLLOsG6VJzhvz0t.jpg",
               "id": 120,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5607a8a9c3a368120d00415f",
               "name": "László Bille",
               "profile_path": null,
               "id": 1399639,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "5607a8c59251413050003e4a",
               "name": "Imre Juhasz",
               "profile_path": null,
               "id": 1458446,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "5607a8db925141290e00022b",
               "name": "Daniele Massaccesi",
               "profile_path": null,
               "id": 8673,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 2,
               "credit_id": "5607a905925141305e003e84",
               "name": "Mark Patten",
               "profile_path": null,
               "id": 1494566,
               "department": "Crew",
               "job": "Second Unit Cinematographer"
            },
            {
               "gender": 0,
               "credit_id": "5607a986c3a36812070042a9",
               "name": "Peter Mountain",
               "profile_path": null,
               "id": 1393883,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 2,
               "credit_id": "5607a9ebc3a368120d004197",
               "name": "Paul Carlin",
               "profile_path": null,
               "id": 32806,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "5607aa0dc3a3681211004754",
               "name": "Todd Kleparski",
               "profile_path": null,
               "id": 1409305,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "5607aa51c3a3681205004240",
               "name": "Rachael Tate",
               "profile_path": null,
               "id": 1459875,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 0,
               "credit_id": "5607aaa6925141305e003ead",
               "name": "Sarah Robinson",
               "profile_path": null,
               "id": 1334493,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5607aac5c3a3681218003f1b",
               "name": "Gábor Homonnay",
               "profile_path": null,
               "id": 1515573,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566ed5afc3a3683f5600f17b",
               "name": "Zsofia Laczko",
               "profile_path": null,
               "id": 1533496,
               "department": "Costume & Make-Up",
               "job": "Seamstress"
            },
            {
               "gender": 0,
               "credit_id": "566ed5e4c3a3683f5600f17f",
               "name": "Tina Earnshaw",
               "profile_path": null,
               "id": 1414090,
               "department": "Costume & Make-Up",
               "job": "Hair Designer"
            },
            {
               "gender": 0,
               "credit_id": "566ed7a5c3a36834c100f3bc",
               "name": "Dale Newton",
               "profile_path": null,
               "id": 1548954,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "570bdae9c3a36802a90004b5",
               "name": "Marc Homes",
               "profile_path": null,
               "id": 1327141,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 2,
               "credit_id": "566ecef7c3a368264700f36e",
               "name": "Jason Knox-Johnston",
               "profile_path": null,
               "id": 962164,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "566ecf0a92514169e200f91b",
               "name": "László Rajk",
               "profile_path": null,
               "id": 1548936,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "566ecf40c3a36836b40120df",
               "name": "Éva Zöld",
               "profile_path": null,
               "id": 1392588,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "566ed060c3a36833b600ed58",
               "name": "Norbert Alte Fieszl",
               "profile_path": null,
               "id": 1548937,
               "department": "Crew",
               "job": "Carpenter"
            },
            {
               "gender": 0,
               "credit_id": "566ed0739251415ec500f5fe",
               "name": "Zoltán Harányi",
               "profile_path": null,
               "id": 1548938,
               "department": "Crew",
               "job": "Carpenter"
            },
            {
               "gender": 0,
               "credit_id": "566ed095c3a3683f5600f0ca",
               "name": "Noel Cowell",
               "profile_path": null,
               "id": 1398913,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 1,
               "credit_id": "566ed0cc92514169e200f958",
               "name": "Shira Hockman",
               "profile_path": "/rKghUGsMvpurWWsADc89uom5mPI.jpg",
               "id": 1518764,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "566ed119925141664f00f57c",
               "name": "Rhys Ifan",
               "profile_path": null,
               "id": 1548939,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "566ed135c3a368535a0108bc",
               "name": "Will Newton",
               "profile_path": null,
               "id": 1548940,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "566ed149c3a3682e9800f03e",
               "name": "Annamária Orosz",
               "profile_path": null,
               "id": 1392589,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "566ed15c92514169e200f965",
               "name": "Gergely Rieger",
               "profile_path": null,
               "id": 1548941,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "566ed174c3a3683f5600f0e7",
               "name": "Matt Sims",
               "profile_path": null,
               "id": 1388860,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "566ed300c3a368264700f402",
               "name": "David Butterworth",
               "profile_path": null,
               "id": 1548942,
               "department": "Sound",
               "job": "Orchestrator"
            },
            {
               "gender": 0,
               "credit_id": "566ed323925141664f00f5ca",
               "name": "Alastair King",
               "profile_path": null,
               "id": 1544377,
               "department": "Sound",
               "job": "Orchestrator"
            },
            {
               "gender": 0,
               "credit_id": "566ed367c3a368535a01090c",
               "name": "Andrea King",
               "profile_path": null,
               "id": 1398918,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "566ed37fc3a3683f5600f120",
               "name": "Jack Stew",
               "profile_path": null,
               "id": 1393300,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "566ed392c3a36833b600edcf",
               "name": "Adam Mendez",
               "profile_path": null,
               "id": 1548943,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "566ed3ac9251412dbc00a4de",
               "name": "Hugo Adams",
               "profile_path": null,
               "id": 40815,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "566ed3c5c3a36836b401214d",
               "name": "Michael Fentum",
               "profile_path": null,
               "id": 1335556,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "566ed3dfc3a3680e7300b1da",
               "name": "Oliver Tarney",
               "profile_path": null,
               "id": 1408373,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "566ed400c3a368535a010921",
               "name": "James Harrison",
               "profile_path": null,
               "id": 16683,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "566ed41b92514125d300a68f",
               "name": "Paul Massey",
               "profile_path": null,
               "id": 113073,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "566ed43592514125d300a695",
               "name": "Tim Maxwell",
               "profile_path": null,
               "id": 1548945,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "566ed44c9251415001009a96",
               "name": "Oliver Tarney",
               "profile_path": null,
               "id": 1408373,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 1,
               "credit_id": "566ed4ae925141738300e8aa",
               "name": "Wittney Horton",
               "profile_path": null,
               "id": 1538204,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "566ed4d5c3a3682e9800f0ce",
               "name": "Theo Park",
               "profile_path": null,
               "id": 1300064,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "566ed50bc3a36834c100f34e",
               "name": "Bea Merkovits",
               "profile_path": null,
               "id": 1548948,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "566ed52ec3a3682e9800f0da",
               "name": "Michael Mooney",
               "profile_path": null,
               "id": 1285933,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "566ed562c3a36836b4012187",
               "name": "Richard Sale",
               "profile_path": null,
               "id": 1354914,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "566ed603c3a3683f5600f186",
               "name": "Maralyn Sherman",
               "profile_path": null,
               "id": 1411067,
               "department": "Costume & Make-Up",
               "job": "Key Hair Stylist"
            },
            {
               "gender": 0,
               "credit_id": "566ed61dc3a368535a010982",
               "name": "Tina Earnshaw",
               "profile_path": null,
               "id": 1414090,
               "department": "Costume & Make-Up",
               "job": "Makeup Designer"
            },
            {
               "gender": 0,
               "credit_id": "566ed63992514125d300a6f4",
               "name": "Jana Carboni",
               "profile_path": null,
               "id": 25060,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "566ed656925141738300e8e7",
               "name": "Móni Csomós",
               "profile_path": null,
               "id": 1548952,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "566ed66992514173ff013772",
               "name": "Rita Balla",
               "profile_path": null,
               "id": 1427822,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "566ed67d92514169e200fa03",
               "name": "Alex Rouse",
               "profile_path": null,
               "id": 1401126,
               "department": "Costume & Make-Up",
               "job": "Wigmaker"
            },
            {
               "gender": 0,
               "credit_id": "566ed6e89251415001009aeb",
               "name": "Péter Behan",
               "profile_path": null,
               "id": 1515635,
               "department": "Crew",
               "job": "Armorer"
            },
            {
               "gender": 0,
               "credit_id": "566ed7149251415ec500f707",
               "name": "Dan Clay",
               "profile_path": null,
               "id": 1548953,
               "department": "Production",
               "job": "Researcher"
            },
            {
               "gender": 0,
               "credit_id": "566ed74bc3a368535a0109bd",
               "name": "Lizzie Pritchard",
               "profile_path": null,
               "id": 1379059,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566ed899c3a36834c100f3e2",
               "name": "Neil Corbould",
               "profile_path": null,
               "id": 6060,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "566ed8b7c3a368264700f4dc",
               "name": "Steven Warner",
               "profile_path": null,
               "id": 1129208,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566ed98d9251415ec500f759",
               "name": "Gourdal Sebastien",
               "profile_path": null,
               "id": 1548957,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566ed9aec3a3680e7300b290",
               "name": "Martin Waters",
               "profile_path": null,
               "id": 1548958,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566ed9d4925141738300e984",
               "name": "Nicolas Hernandez",
               "profile_path": null,
               "id": 1426327,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566ed9ee925141664f00f6c6",
               "name": "Louis Paré",
               "profile_path": null,
               "id": 1548959,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566eda6a92514125d300a795",
               "name": "Mark Carr",
               "profile_path": null,
               "id": 1384371,
               "department": "Visual Effects",
               "job": "VFX Editor"
            },
            {
               "gender": 0,
               "credit_id": "566eda8d925141738300e99f",
               "name": "Fausto Appiolaza",
               "profile_path": null,
               "id": 1548960,
               "department": "Visual Effects",
               "job": "VFX Production Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "566edaad9251415001009b60",
               "name": "James D. Fleming",
               "profile_path": null,
               "id": 1548961,
               "department": "Visual Effects",
               "job": "VFX Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566edae292514169e200faaa",
               "name": "Daniel Matley",
               "profile_path": null,
               "id": 1459902,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "566edafec3a368535a010a46",
               "name": "Barrie Hemsley",
               "profile_path": null,
               "id": 1393323,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "566edb18925141738300e9c3",
               "name": "Clare Heneghan",
               "profile_path": null,
               "id": 1411249,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "566edb32c3a368535a010a52",
               "name": "Priyanka Balasubramanian",
               "profile_path": null,
               "id": 1426846,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "566edb4c92514125d300a7b6",
               "name": "Nina Fallon",
               "profile_path": null,
               "id": 15357,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "566edb74c3a36836b4012233",
               "name": "Clare Norman",
               "profile_path": null,
               "id": 1376804,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "566edb8f92514125d300a7be",
               "name": "Paula Pope",
               "profile_path": null,
               "id": 1400077,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "566edbb39251412dbc00a60a",
               "name": "Richard Stammers",
               "profile_path": null,
               "id": 1384386,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566edbe7c3a368535a010a6b",
               "name": "Justin Cornish",
               "profile_path": null,
               "id": 1419604,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566edbfe92514173ff013829",
               "name": "Brooke Lyndon-Stanford",
               "profile_path": null,
               "id": 1419605,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566edc259251415ec500f7b8",
               "name": "Chris Lawrence",
               "profile_path": null,
               "id": 1461613,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566edc3f92514173ff013831",
               "name": "Mohen Leo",
               "profile_path": null,
               "id": 1386912,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566edc56c3a3682e9800f1f7",
               "name": "Sara Bennett",
               "profile_path": null,
               "id": 1318830,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566edc6e9251415001009b94",
               "name": "Anders Langlands",
               "profile_path": null,
               "id": 1548962,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566edc89c3a36833b600eee7",
               "name": "Tim Ledbury",
               "profile_path": null,
               "id": 1450948,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5697ca69c3a36875fa000032",
               "name": "Krisztián Paluch",
               "profile_path": null,
               "id": 1563261,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "5697ca8dc3a36875fa000041",
               "name": "Julian White",
               "profile_path": null,
               "id": 75117,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 2,
               "credit_id": "5831a80792514162d8023eef",
               "name": "Harry Gregson-Williams",
               "profile_path": "/qyq2ptCxmmRdO9ccuM7RASVsKyT.jpg",
               "id": 5553,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5a2f8530c3a3680b9d15f58f",
               "name": "Liang Yang",
               "profile_path": "/z6UgXBqpbrrwikfJkeFoSvFUzqu.jpg",
               "id": 1645047,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 34.357713,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 286217,
      "vote_count": 9034,
      "budget": 108000000,
      "overview": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive.",
      "similar": [
         568,
         157336,
         95,
         75174,
         395992,
         274870,
         19898,
         9016,
         667,
         686,
         17431,
         49047,
         348,
         595,
         118340,
         101299,
         26388,
         49529,
         126889,
         228161
      ],
      "original_title": "The Martian",
      "runtime": 141,
      "poster_path": "/5aGhaIHYuQbqlHWvWYqMCnj40y2.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/6Ry6uNBaa0IbbSs1XYIgX5DkA9r.png",
            "name": "Scott Free Productions",
            "id": 1645,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mid Atlantic Films",
            "id": 2735,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "International Traders",
            "id": 6408,
            "origin_country": ""
         },
         {
            "logo_path": "/qx9K6bFWJupwde0xQDwOvXkOaL8.png",
            "name": "TSG Entertainment",
            "id": 22213,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Genre Films",
            "id": 28788,
            "origin_country": "US"
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "2015-09-30",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "Bring Him Home",
      "adult": false,
      "homepage": "http://www.foxmovies.com/movies/the-martian",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ridley Scott"],
      "runtime": 144,
      "synopsis": "At the landing site of the shuttle Ares III, Acidalia Planitia, Mars, at a time in the near future, the crew of the Hermes; including Commander Melissa Lewis (Jessica Chastain), botanist Mark Watney (Matt Damon), IT guru Beth Johanssen (Kate Mara), pilot Rick Martinez (Michael Peña), flight surgeon Chris Beck (Sebastian Stan), and navigator and chemist Alex Vogel (Aksel Hennie); are gathering samples before re-entering their living facility, the HAB. The crew learns that a storm is approaching. The storm's intensity and high winds lead Commander Lewis to order a mission abort. Watney argues for waiting it out and brings up the rear as the crew heads toward the MAV (Mars Ascent Vehicle), the ship that will take them back to the orbiting Hermes, in their suits. Heavy winds and sand gusts surround them. A satellite dish breaks off and strikes Watney, knocking him out of sight of the rest of the crew. Lewis tries to guide the others to find Watney, but visibility is very poor and the storm is way too strong for them. They head back into the MAV without Watney and lift off. The pilot, Martinez, is barely able to keep the rocket from tipping over but the launch from the planet is successful. Back on Earth, NASA Director Teddy Sanders (Jeff Daniels) holds a press conference to announce that while the Hermes crew succeeded in leaving Mars, Mark Watney was lost, and he is declared dead. Watney wakes up on Mars on what is Sol 21 (mission day 21) after the storm has passed. His oxygen is depleting rapidly, so he makes his way back to the habitat station. He's been impaled by part of an antenna, which still protrudes from his abdomen; the combination of the antenna and his own blood sealed the suit just enough to keep most of his air from leaking out. Watney pulls the antenna out, uses forceps to fish out a piece that broke off in the wound, then staples the wound shut. He sits down to make a video log, where he outlines the situation: he's alive, but he can't contact Earth or Hermes; it'll be four years before the next manned mission is launched; and with the food supply in the habitat meant for him and the other five crew members, he has almost a year's worth of food, or a little longer if he rations. Therefore, Watney determines that he has to grow three years' worth of food on a planet where nothing grows. Luckily for him, he's a botanist and devises a plan to grow potatoes. At NASA in Houston, Texas, Sanders has just returned from a memorial service for Mark Watney, where he spoke about Watney's dedication to exploration. Mars Mission Director Vincent Kapoor (Chiwetel Ejiofor) talks to Sanders about getting satellite time to locate Watney's body. Sanders refuses on the grounds that the satellite feeds are public and broadcasting pictures of Watney's corpse would be a political and budgetary disaster for NASA. Later, engineer Mindy Park (Mackenzie Davis) meets with Kapoor after she discovers evidence of activity in satellite photos of the Ares III site (low-resolution images apparently taken in a routine fly-by): the solar panels have been cleaned and the rover has moved. They bring in Sanders and Director of Media Relations Annie Montrose (Kristen Wiig) to show them that Watney is still alive. A few sols (Martian days) later, inside the habitat, Watney has planted potatoes using Martian soil and vacuum-sealed packets of the crew's feces as fertilizer (to his disgust). Needing more water for the potato crop, he burns hydrazine rocket fuel; a byproduct of the reaction is water. On his first attempt to ignite the hydrazine, he causes a moderate explosion, singeing his clothing and hair. Watney notes that this explosive tendency is the reason that NASA does not use pure hydrogen. As he continues to work on his food supply, he keeps going with the video logs and decides to use a rover to make it to the Schiaparelli crater that will be the landing site for Ares IV in four years. Since the battery-powered rover can't cover the whole distance, he modifies it, adding solar cells and an extra battery. To conserve battery power, the pod of plutonium used to get the crew to Mars in their original spacecraft serves as a heat source in the cabin. Watney uses the rover to find a Pathfinder probe that stopped transmitting in 1997; he hopes to use it to get in touch with NASA. He digs the old probe out of the sand, spreads its solar panels to charge the batteries, and discovers that it still works. Using hand-written signs for the Pathfinder's camera, he is able to send a message to NASA confirming that he is alive. Kapoor is able to receive the message because he and colleagues at the Jet Propulsion Lab (JPL), who built the Pathfinders, have pulled another Pathfinder out of storage, rounded up the engineers who worked on it, and got it working again. They manage to communicate with Watney, first by panning the Mars Pathfinder's camera to point at 'yes' or 'no' signs when Watney asks if his signal is being received, and then by panning around a hexadecimal clock that Watney has scratched out on the ground around his Pathfinder. NASA uses this system to tell him how to hack the rover's operating system so it can transmit text back to Earth. When Watney, finally able to type his messages chat-style, asks how the Hermes crew took the news that he wasn't dead, Kapoor regretfully tells him that the crew hasn't been told. Watney responds with obscenities (which are broadcast all over the world). Watney's story becomes a worldwide sensation. His communications with NASA are logged, and at the request of PR Director Annie Montrose he uses the Pathfinder's camera to take a spacesuited selfie (in a two-thumbs-up Fonzie pose) which Montrose doesn't like because she can't see his face. Meanwhile, the crew aboard Hermes has spent the last couple of months quietly flying back toward Earth while keeping in touch with their loved ones. The flight director of Ares III, Mitch Henderson (Sean Bean), contacts the crew and informs them that Watney is alive, and that NASA has kept it from them for the last two months so as to not distract them from their mission. The news only makes them angry and guilt-ridden, but Henderson tells them that Watney has stressed repeatedly that it wasn't their fault and they had reason to believe that he was dead. The folks at NASA determine that they can reach Watney by Sol 868. The food he's growing plus the rations in the hab will run out in a bit over 900 days. Sanders frets that the margin of error is too small. Back on Mars, things begin to go bad for Watney when the habitat's worn-out airlock explosively decompresses, throwing the airlock some distance while he's inside it and causing his helmet to crack and leak. He uses duct tape to seal the cracks and stumbles back to the habitat to discover his potato crop frozen and dead. With less food, he now figures he can last only a little more than 300 Sols, or slightly longer if he rations. NASA and JPL work overtime and quickly launch a probe to resupply Watney. To make their launch window they bypass routine inspections, and moments after launching, the probe's trajectory shifts severely and it swerves off course and explodes. Meanwhile in China, two directors from the Chinese National Space Administration, Zhu Tao (Chen Shu) and Guo Ming (Eddy Ko), witness the explosion and discuss helping NASA by offering their classified booster rocket technology to launch a supply craft. Guo Ming asks Zhu Tao why NASA has not already asked for their help and Zhu Tao reminds him that it is a top secret program that NASA would not have any knowledge of. They decide that in the interests of international scientific co-operation, they will contact NASA and offer their booster rocket. Rich Purnell (Donald Glover) an eccentric and absent-minded but brilliant astrodynamicist, devises a plan to accelerate the returning Hermes around Earth, gaining a gravitational boost and sending it back to Mars to get Watney. The Chinese rocket will resupply the Hermes for its extended voyage. Sanders vetoes this plan because it risks the lives of the five Hermes crew members and will extend their mission by hundreds of days, but Henderson secretly sends the plan and Purnell's course calculations to the crew. The crew talks it over; they understand that the surreptitious arrival of the plan means that NASA brass have rejected the idea. They assume that if they go back to Mars, the two military members, Lewis and Martinez, will be court-martialed for mutiny and the three civilians will never be allowed to fly another mission. Lewis calls for a unanimous vote, and they all agree to go back for Watney. Johanssen hacks the Hermes computers to prevent NASA from taking control and they change course, sending a cryptic message to Houston: \"Rich Purnell is a steely-eyed missile man.\" Sanders is angry with Henderson, who he assumes sent the plan to Hermes. Henderson doesn't deny, but will not confirm his actions either. Sanders explains that his priority is for NASA to keep flying, but Congress is very sensitive to public opinion and the bad publicity that would result if Purnell's plan failed would likely reduce NASA's budget for years to come. He asks for Henderson's resignation when the mission is over. Then he's forced to announce that NASA is sending Hermes back to Mars to rescue Watney. Seven months pass on Mars. Watney has lost a lot of weight, has grown a lot of facial hair, and his teeth are rotting. He's started losing hope in his survival and rescue. He records a video log asking Commander Lewis to let his parents know of his fate. He packs up the rover and leaves the Ares III site; having spent 461 sols there; and heads for the Ares IV MAV, which was dropped on Mars well head of the Ares IV mission. It's a 3200-kilometer drive across a trackless and inhospitable Martian landscape. He stops every day for 13 hours to sleep and re-charge the rover's batteries with solar panels. During his excursion, he reasons that Mars is legally international waters; that is, it's subject to the law of the sea because it can't be claimed by any country on Earth. As he has not gotten explicit permission from NASA to take the MAV, and cannot get permission until after taking off, commandeering the MAV will make him a space pirate. He would like to be called \"Captain Blondbeard.\" After the Hermes has swung around Earth and collected the supplies, they travel back to Mars. NASA and the rest of the world watch with anticipation; with 12 minutes' delay, no one on Earth can help by radio. Watney has to remove 5000 kg of weight from the MAV to make it light enough to reach Hermes' orbit. He jettisons most of the seats, all the navigation and control systems, and replaces the nose-cone airlock, a crucial structural piece, with a tarp. Martinez, flying the MAV by remote control, launches Watney into orbit. The MAV comes up too low to reach the Hermes spaceship. The crew uses a quickly-made sugar and oxygen explosive to blow the front hatch and cause escaping air to slow the huge ship down so they can match speeds and still get to Watney. Lewis herself decides to use the EVA MMA suit with a tether to reach Watney, but she can't get close enough. Watney punctures the finger of his glove to propel himself toward Lewis with the escaping air jet. (\"Like Ironman!\" he says gleefully.) He has very little control, so he misses her. However, he runs into the tether, which his momentum causes to wind around himself and Lewis, and the crew is able to reel them in. Lewis announces to NASA that they have Watney, and people all over the world cheer. (Crowds have gathered in Houston, Times Square, Beijing, and elsewhere, anxiously waiting to hear whether the rescue worked.) The crew hugs Watney and jokes about the stench resulting from his lack of showering for many months. Back on Earth about one year later, Watney begins Day 1 as an instructor to aspiring astronauts. He tells them of his struggle on Mars, confirming that he did in fact grow food using his own shit. He tells them that if things should go south for them, they can either accept their fate or start solving problems, because that's how you survive; by overcoming one problem after another. During the closing credits, we see the characters years later as they watch the launch of Ares V, in which Martinez is the commander. Kapoor, Montrose, Park, and Sanders watch from NASA along with Guo Ming & Zhu Tau. Henderson is retired and golfing with his son. Lewis watches at home with her husband, while Vogel is at home with his family. Beck and Johanssen have gotten married and watch from the hospital with their new baby.",
      "writers": [
         "Drew Goddard",
         "Andy Weir"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3659388/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTc2MTQ3MDA1Nl5BMl5BanBnXkFtZTgwODA3OTI4NjE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Matt Damon",
         "Jessica Chastain",
         "Kristen Wiig"
      ],
      "reviews": [
         "The crew of an American base on Mars are forced to make an emergency departure leaving one crew-member behind presumed dead. But he is alive! Can the stranded astronaut find a way of communicating his plight to those on Earth and survive while he awaits rescue? A fairly standard 'castaway' plot but one which offers many dramatic possibilities. Unfortunately few of these are realised in this pedestrian movie which fails to generate any significant dramatic tension. This is partly because the characterisation is thin but also because the challenges the stranded astronaut faces seem to be so easily overcome. Starvation? Grow potatoes. Punctured space-helmet? Sticky tape. Mars rover vehicle lacking power? Wire up a few solar cells. Communications equipment destroyed? Motor over to a handy Mars lander. We never sense that the 'Martian' (Matt Damon) is in a desperate, mind- and body-sapping struggle against the odds (conveniently he is a botanist). Damon effectively portrays the 'Martian' as a likable guy but the problem is how to fill the two hours of the movie that remain after he is stranded? When a character is alone and unable to communicate it needs something exceptional to keep us glued to the screen. Maybe what's going on back home will do it. Not really because the cast of characters there are verging on cardboard cut-outs. The returning crew? Likewise. And the script is written on the assumption that the audience is a little dumb, e.g. A: It will be 500 Sols (Martian days) before we can rescue him. B: But his food will run out in 300 sols. C: So he'll die before we get there. Indeed! And so may we. The movie has some good FX and the Martian landscape looks convincing. But there's nothing exceptional here to compensate for the lack of an effectively told story. In essence this is an American feel-good fantasy film, celebrating ideals of technical omnipotence, racial harmony, gender equality and international collaboration (with those cool Chinese guys and gals). If only it were so. No wonder the credits rolled to the tune of The O' Jays singing 'Love Train'. School-kids will probably join in! But, to quote Sam Goldwyn, 'Include me out!' (Viewed at the Odeon, Warrington, 06 October 2015)",
         "It's so frustrating when so many people like and praise a movie that really doesn't deserve it. The Martian is such a movie. I had such high hopes for it after all the hype, and after reading reviews by smart critics I usually agree with, but it was such a disappointment. Here's why: Plausibility. Just like Gravity, there are so many non-sensical depictions of the physics of space travel, it makes my head hurt, and I'm not even a physicist. The characters and their actions are pretty implausible too, starting with Damon's chipper attitude about being left alone on a planet 100 million miles from Earth, but certainly not ending there. After realizing he is alone and will be for so long that he will run out of food, he gets the brilliant idea to try to grow his own, which we are supposed to take as a mark of his plucky brilliance. But he's a botanist! What would a botanist be doing on a space mission *except* studying how things grow? And then when an accident causes all his potato plants to die, the brains at NASA (who can't believe he figured a way to grow potatoes in the first place) instantly conclude (and tell us) that since the accident froze all the bacteria in the soil, he won't be able to grow any more. Why not? He still has potatoes to eat, and he still, presumably, shits occasionally, so he has all the ingredients he used the first time. Ugh! My brain hurts! Writing. The script seems written more by market researchers than a screenwriter. Corny little one-liners (\"My balls are frozen!\") appeal to the lowest common denominator in the audience, and the relentlessly happy tone makes being stranded on Mars seem like a big party, complete with disco music (literally). And the dialog!! There's a moment when Jeff Daniels, the head of NASA (whom it is hard to imagine has ever ever taken a science class or piloted anything) talks to the heads of the Chinese Space agency who offer (presumedly--we only hear his end of the conversation) to lend one of their ships to the rescue effort. He says, \"Mmm Hmm. Okay. I see. Thank you.\" (That's what a discussion about loaning spacecraft between two space agencies sounds like.) Then he hangs up the phone, clenches his fists, and says, \"Yes!\" It's like Homer Simpson finding out there is still one donut left. That someone wrote that line is astounding. That the director and actor saw fit to actually shoot it is bewildering. That it survived the editing process and made it into the final cut--well, there should be an investigation. Pacing. It's a movie about being stranded on Mars for months and months. Why does it feel like a comedy by Woody Allen or Edgar Wright? There is never a pause, never a prolonged quiet moment that might begin to capture something of the unbelievable space and loneliness this movie is supposed to be about. Instead, it is a constant rapid fire of dialog and action. Even the scenes where he is communicating with Earth via text happens faster than I usually get with my iPhone and 4G. (NASA technicians mention, at one point, that there is a 25 minute delay between all communications, but the filmmakers hope we forget this two minutes later when all the subsequent conversations happen instantly). Then there is the rest of the crew and their additional unplanned two years of extra time stuck in the spaceship, going all the way BACK to Mars to pick up what they left there. If I have to run back home to get something I forgot, the trip always seems infuriatingly long. But not these cheery space travelers! Another two years in space! No problem! And it takes only two minutes of screen time. Piece of cake! AGH! What a frustrating experience. If you want a sugar-coated popcorn movie that will make you think that if being on stranded on Mars isn't really so bad, why complain about our petty little problems here on Earth? then this movie might be for you. It does for being stranded in space what The Shawshank Redemption does for being in prison. It tries to tell us that it's really not THAT bad after all. It's such a lie, and such a disappointment, all the more so because there are so many serious issues and exciting psychological and scientific aspects about space that could have been explored here.",
         "I am a bit of nerd of this kind of realistic science fiction movies and therefore I had high expectations of this movie. I regret to say I was disappointed. The movie tells the story of how the main character struggles to survive on Mars and how the space agencies work to get them back. But I was missing the emotions, the human touch. The main character never displays any signs of loneliness, despair or fear. He is more like \"oh, looks like I'm stuck on Mars, let's grow potatoes\". He makes a one- off reference to his parents in an electronic communication, but nowhere in the movie is it made clear what his main drive is to want to return to Earth. It appears as nothing ties him there. Maybe the directors wanted to avoid the cliché of the eight months pregnant and terminally ill wife eagerly awaiting her husband's return from a dangerous mission, but even a cliché had been better than nothing. His character is also too flat. The only character trait that is highlighted slightly in the movie is that he may be a bit too smug about himself. Nothing else to make me identify or sympathize with him. To be honest, I couldn't have cared less if he had not survived. The Mars landscape is beautifully rendered en very credible with dust clouds and all. This is the main attraction of the movie. The main problem that there is nothing novel about this movie. There have been better movies for every aspect of the film: Human aspect/psychology of being marooned in a strange place: Cast Away did it so much better; set in space: Matt Damon's role in Interstellar was more credible than his performance here. Space action scenes: Gravity had me on the edge of my seat Ground control scenes: Apollo 13 already set the standard In summary, the movie is a beautiful, but hollow shell.",
         "I can't really believe that I just finished watching a Ridley Scott science fiction movie and feeling this low, this one never felt like anywhere close to any of his classics. This is just nothing but a typical Hollywood s***. Matt did a poor performance as a character who is caught in a life and death situation. He is not scared or emotional but instead he keeps throwing Hollywood typical punch dialogues on your face like an Avenger hero when you are expecting Science. A make-up artist or a sound engineer from the set of \"Big bang theory\" would have written better science script and dialogues. For me there are plenty of \"WTF\" or \"Seriously?\" moments in this movie and I wonder what happened to one of the favorite directors of all time. Also repetitive high five/triumph scenes where we don't feel anything. To brief: Drag, bad drama, insensitive emotional scenes, poor acting, very less science, predictable and not at all funny punch dialogues! Just YIFY it, don't buy!",
         "Boy, I haven't hated a movie this much in a long time. I actually just joined IMDb (I have been a long term viewer) in order to vent this out of my system, and to express my amazement that this terrible, vapid, cliché movie won a Golden Globe and is nominated for the Oscar best movie of the year. What the heck is going on? Are Aliens sucking the brain matter out of us little by little so that we actually think this tripe is not only good, but great? A script a high schooler could have written, bad acting, terrible dialogue, one dimensional characters you don't care about, bad disco music, overly politically correct casting, mistakes in basic \"science\", stupid hap-hap-happy ending where everyone in the world (literally) is jumping, smiling and hugging each other, I could go on and on. This movie was so bad we actually kept watching it, like the morbid curiosity of looking at an auto accident. My favorite line of the movie was when Jeff Daniels said that the Matt Damon character would be fine with his supplies \"as long as nothing goes wrong\". I looked at my husband and said sarcastically \"Gee, I wonder if something is going to go wrong\", and wouldn't you know it, in the very next scene it does. We have sworn off any future Ridley Scott movies, for good. He is obviously in cahoots with the Aliens sucking out all our brain matter.",
         "I was waiting for this movie for a few weeks and was greatly disappointed when I finally watched it. It doesn't matter if the number of potatoes to survive is accurate, if you are using toxic rocket fuel to make water, you do not feel lonely and isolated, and you are not worried about oxygen - you are just having fun - isolated for 300-500 days without anyone or anything else around - the guy seems pretty comfortable and not worried. Impossible to connect with characters. Too many stereotypes. Blatant sales and marketing, actor and story picks for the sake of selling more tickets. I hope I will save my money and time, next movie like this comes out.",
         "I wish I liked this movie more like a lot of moviegoers who are giving it good to even great reviews, but I left the theater with a bitter taste in my mouth I had to write this review to reconcile my feelings. Imagine a movie that takes from the glory of Gravity, Cast Away and Apollo 13 which also tries to be as hilarious and groovy as Guardians of The Galaxy at times but fails? You've got The Martian. The first 1/3 of the movie was quite engaging: An astronaut on Mars expedition team gets left behind after a huge storm because he was assumed dead. But he was alive and we watch him try and utilize every cell of his brains and science savvy to survive until help comes. But once he gets out of initial danger things get all too predictable and over-wrought. Couple of annoyances: 141 mins. About 30 mins too long for the storyline. There were too many mentions of Disco music the commander of the mission left behind to ill effect, unconvincing supporting characters on the Earth who seem to be just reciting a script, and some characters the movie shouldn't have had whatsoever (such as Kristen Wiig). Did Matt Damon do a good job ? I thought so until they showed a body double that didn't even resemble him and from there nothing he did was believable unfortunately. Had Damon actually lost weight without using a body double, I might have gotten more into the movie. But then again, he is no Christian Bale. So I wasn't expecting it but a little weight loss would have made him more convincing. A few good acting jobs came from Michael Pena and Benedict Wong whose characters added to the storytelling instead of subtracting it in the midst of too many unnecessary characters reciting an already weak script.",
         "I don't usually like to give movie reviews - but it was a hot weekend and I figured maybe I'd venture out and see what the culture had to offer. So just how bad was \"The Martian?\" So bad that after an hour I realized I would rather be back in the sweltering 97 degree heat than sitting in an air conditioned theater listening to anymore inane dialog (lines like \"F**k you Mars!\" and \"I'm going to science the S**T out of it!\") In fact it would appear that a prerequisite for going into the space program is at least six months of doing stand up. (BAD stand up.) Why does everyone (and I mean EVERYONE) in the movie sound like one of those guys on \"The Big Bang Theory?\" Snarky and idiotic and always cracking wise. Also: Why did every character, while typing, READ what he's typing out loud? Has anyone ever done this EVER? And what was with all the expository dialog, (the whole script was expository as far as I'm concerned) Throughout the movie Matt Damon talks into a video camera, making a diary and yet he only says things that everyone who would potentially WATCH the video would of course already know, things like: \"Oh yeah, did I tell you? I'm a botanist.\" It's clear he was attempting to speak directly to the viewer and NOT the imaginary audience in the movie itself. This is the laziest kind of writing there is. They don't know how to deliver plot anymore except to dump bowling balls of ham fisted information in your lap; telling you things you've already figured out in the most obvious way possible. That meant that there was absolutely ZERO tension. It was like reading an instruction manual for a microwave oven. \"How do I grow potatoes? Oh look there's some poo.\" (cue the laugh track) And Ridley Scott's direction was as slack as an industrial film. False stakes, false resolutions, false falseness. Now,I know I only managed to make it through the first hour or so; maybe it got really good after that, but I was starting to feel my brain cells beginning to atrophy so it was from a sense of self- preservation that I skedaddled out of there when I did. (And don't get me started on the disco songs and requisite jokes about 'bad musical taste.' It was just more target-market reconstituted nostalgia-bait.) If there is a more unoriginal, un-involving, unbelievable waste of time out there, I haven't seen it. So of course: Line up the Oscars!",
         "This movie can be summed up with one word... vapid. As if Matt Damon's inherently vapid acting weren't bad enough, the makers of this film were so overtly focused on presenting an idyllic reality where no character behaves in any offensive way, to anybody, they produced an un-suspenseful, uninteresting, boring, vapid turd of a story. They fall over themselves to be so certain that no minority demographic is stereotyped that all characters have the sane vapid personality. And in what seems to be some sort of perverse effort to recompense reality, a very transparent hierarchy is followed to be certain that: the Black people are the most clever; the Hispanic people are next most clever; the Asian people are next most clever(carefully not portrayed as exceptionally smart), and of course the women are more clever than the men. Of course the only flawed demographic were older white male authority figures. To me this liberal, philosophical portrayal of what an ideal reality is reveals that they are the true bigots, the haters. They hate the differences that make people interesting. Ethnicity, femininity / masculinity, and their different traits should be loved and celebrated, not shamed, muted, or eliminated. It is the interaction of those differences that create an interesting story, not a vapid one.",
         "This tedious family adventure film is the latest contribution to the popular and well established 'Where Are We Rescuing Matt H. Damon From This Week?' genre. I like Matt H. Damon, I really do. But he's been making it very difficult recently, and this 2+ hour marathon just doesn't help. Damon plays an astronaut accidentally marooned on Mars by a storm that literally could not happen because Mars lacks the necessary atmospheric conditions, where he must somehow survive with nothing but an unlimited supply of electricity, an unlimited supply of water, an entirely self- sufficient artificial habitat, half a dozen spare space suits, multiple land vehicles and probes (all in perfect working order), food supplies intended for half a dozen people, and a large quantity of magical potato seedlings that grow to maturity in just a few days despite a complete absence of soil nutrients. Since the first act establishes that Damon is so well set up he doesn't actually need rescuing, Ridley Scott fabricates a second act 'emergency' in a vain attempt to raise tension (it doesn't). Damon keeps in contact with Earth via a magical transmission technology that provides full HD streaming with no latency whatsoever, allowing him to have real time conversations with NASA headquarters, where everyone does and says whatever they want because there is no chain of command even though it's ostensibly run by Jeff Daniels (played by Jeff Daniels). His fellow astronauts remain hovering above Mars, beaming their own HD stream to NASA by the use of a magical camera that automatically homes in on Damon regardless of where he is on the planet. NASA builds a brand new rocket from scratch in less than 14 days so they can send Damon a fresh load of unlimited supplies. It explodes immediately after takeoff because Ridley Scott still has another hour to fill. Meanwhile Damon accidentally blows up his potatoes. NASA's lone Chinese employee suddenly remembers that his uncle has a private rocket he's never got around to using, so they phone China and ask if NASA can borrow it. The uncle agrees so the Chinese government sends it into space immediately, where it is instead caught by Damon's astronaut colleagues, who nick all the supplies. Meanwhile Damon is travelling to the other side of the planet, where he intends to escape using a previously unsuspected bonus rocket that just happens to be lying around the place in perfect working order. Damon can't carry his unlimited supply of water and only has enough room in his vehicle for a few sandwiches, but by a remarkable stroke of luck it turns out that his body is capable of indefinite peak physical performance despite minimal hydration and a complete lack of nutrition, so that's OK. Also it turns out that the gravity on Mars is exactly the same as Earth's, so he hasn't lost any muscle tone. Damon arrives at the bonus rocket and is told by NASA that it's actually too heavy to lift off the planet despite being designed for that exact purpose (???) The only solution is to remove the nose of the rocket, which is actually easier than it sounds because the entire spacecraft is made of Lego and can be easily disassembled by a single undernourished man with no tools. With the nose of the rocket removed, Damon risks being killed by the extreme physical pressure generated by takeoff. NASA points out that a simple tarpaulin is strong enough to protect him, so he finds a spare one from... somewhere... and straps it on. Damon's fellow astronauts pair their ship with his rocket using Bluetooth, and take over the controls. Damon is almost crushed to a pulp as the rocket leaves Mars, because it turns out that tarpaulin isn't as strong as industrial steel after all. Somebody on the astronauts' ship blows something up because of reasons, and this somehow makes it easier for one of them to rescue Damon, who has jumped out of his rocket and is now flying towards their ship with the aid of a hole in the finger of his space suit and an unlimited supply of pressurised oxygen. NASA is helpfully streaming this heroic rescue to the entire planet using their magical realtime HD stream, because of course they are. Damon and his fellow astronauts arrive home safely just a few hours later, and Damon is rewarded with a free pair of glasses. Henceforth, everyone must call him 'Doctor.' Because doctors have glasses. I rate The Martian at 13.32 on the Haglee Scale, which works out as a mediocre 4/10 on IMDb.",
         "I watched this movie with a friend who has no technical background, and she pronounced it good. I should note that my friend is Canadian, and with the possible exception of Neil Young, Canadians are an innately polite people. Meanwhile, being American, I was laughing internally until I spotted. I also note that I knew the author of the book (when he was a kid) through a workplace and personal friendship with his father. Andy Weir is an incredibly gifted science geek, as is his dad. I therefore know that none of the gross scientific transgressions in the film can be blamed on his ignorance. Andy openly admits to willfully ignoring a few things like the thin Martian atmosphere in the interest of moving the story forward. He correctly understood the impatience of miseducated Americans with annoyances such as basic laws of physics. IOW, he took the movie money and ran, like the smart kid I know him to be. So I would say that any idiotic disregard of science on screen—the use of Visqueen and duct tape to secure a 6 foot hole vacated by (richly ironic) a blown hatch cover against a 50,000 pound pressure gradient, for example—resulted either from production or directorial indifference. The list of anti-Newtonian horrors goes on, and gets funnier, particularly when Matt Damon punctures his space glove and uses the escaping oxygen to propel himself toward his rescuer. Next, I was half expecting the crew of the rescuing spacecraft to line up, bend over, and torch off an ensemble fart to correct a course deviation. In any case, this movie was not intended to portray a real human battle against nature, as was so wonderfully chronicled in Apollo 13. Rather, The Martian was intended to make money by playing on current themes of political correctness and the warm fuzzies of international cooperation, framed by the awesomeness of space. It fails spectacularly even at this wretched goal—not at making money, you understand, but the furtherance of World Peace—placing its bets on star power, flaccid dialogue, dumbass jokes and cheap CGI effects instead of a solid script, good acting and a credible stab at realism. Jeff Daniels as the director of NASA? My God... Watch this movie only if you're looking for something to distract you from doing something more useful, such as expressing the dog's impacted anal glands. Higher emotional content can be found by chopping up an onion.",
         "because I care about the future, I looked forward to this movie. But while i watched it, it was a struggle to make it to the end. I'm very disappointed. Easily i blame the director, but there is a bigger production team who failed. They created a film of shallow, lame, cliché stereotypes with bad developed characters. It's all about the hero. It's not about \"Matt Damon in his best role\". When he's suppose to be funny, it's the worst. Jessica Chastain was brilliant in Interstellar, so now she lights up another successful chapter of imaginary human spaceflight ? Sorry, I much more think of a massive loss of image. If you wish to make future NASA look smart, cute and sexy, do not pick Jeff Daniels as it's director ! Every time 'Teddy' shows up, I expected Jim Carrey dancing to the disco sound. It wasn't even funny once to blame Lewis for her taste of music, and it wasn't funny to blame her again and again. Please, Mister Scott, if you grab one more time into the box of stereotypes and transform actors like Sean Bean, Chiwetel Ejiofor, Jeff Daniels Matt Damon, Jessica Chastain and Michael Peña into fools: retire ! Thank you. P. S. Hold on, you didn't fail on Mackenzie Davis, she made NASA look cute.",
         "Okay, I am also perplexed as to why people have given this terrible movie a favorable review. It seems like all we care about is a big name director and big star, then the movie has instant credibility. There was not one truly memorable moment in this movie. I cannot remember a single word, phrase, exchange of dialogue, or turn of event that left a lasting impression. The only positives were Matt Damon's likability and some decent special effects. For one thing how can this premise be taken ass even remotely plausible? Does anyone think that we would send ship to Mars that is vulnerable to a naturally and regularly occurring storm on Mars? And who would design a ship that is docked so perilously? It was standing up like one of those red/white/blue popsicle rocket treats we used to get from the ice cream man as a kid. Or even more than that it looked like a ship from a 1950's era sci-fi movie. C'mon man, this is a new millennium. Make a ship that is supported as it would be supported on Mars. It should be shorter and more stable, not doomed to tip over like shown in the movie. That one scene lost me for the next 30 minutes. Here are the other things I feel left me wanting with that movie. 1. When the storm struck I didn't know who was left behind. I knew it was the Matt Damon character but I didn't \"know\" him, meaning I had no emotional investment in that character. 2. He was a botanist, how convenient. His character didn't have to transform or change in any way in order to survive; he was the perfect guy to be left behind. 3. And just why were the potatoes going to run out??? They said you have 400 and something days, but never said why. Was it because there were other vital nutrients that would be lacking at that point? 4. If you give me 2 years to figure out how to solve a problem that means my survival, and there's nothing else to do but figure it out, I bet I'l find something too. The dates before his food was going to run out were so far out that I never felt a sense of urgency. You can call Mars \"The Monster\" but it wasn't pursuing the main character, just waiting for him to run out of food. How boring is that??? 5. When was the last time we saw nobody but good guys in a movie? There was nobody to blame, no bad guys anywhere. That was just plain weak. A bad guys doesn't have to be a bad person, just a person who either has too much fear or fears the wrong thing, which causes him/her to make poor choices. Nobody served as a villain in any way. I know from playing sports and working in small and large companies that there's always a person who feels like the bad guy, even unintentionally. This movie, with it's little slice of heaven, was absurd to say the least. For these reasons and other minor reasons I was totally disappointed. My wife liked it and I couldn't understand why. This was the dumbest movie I've seen in a long time. I really wanted to like ti but was terribly disappointed.",
         "I had low expectations of this film, and not to my surprise, my expectations where more then fulfilled. After watching this terrible movie, I looked up the reviews on the Internet and was disappointed that so many reviews of sites and movie-critics where so positive. It felt like I was truly alone on this world. For me, the movie was sh*t, but everyone thinks it was great. Wat is wrong with me. But today, I started reading the reviews of some fellow IMDb- reviewers, and finally I see what is wrong. Only an intelligent person would perceive this movie as cr*p, but since most people are morons, that explains all the positive reviews. I can only perceive this waste of pellicule as a promotion-movie for NASA. They probably want to gear up to get more tax-payer money for their upcoming research to get people to Mars. Believe me, this will be money wasted. People will never walk on Mars, seeing the current situation on this planet. The movie was a travesty, where science and doing the math was used as a continuous red line to explain everything. I really didn't see any math or science in this movie. It was more like a lotto contestant who won every game, against all odds. The astronaut was a botanist. WHAT??? That was the easy part. Planting some potato's in Mars-dust, and fertilize them with sh*t, in a dark environment does not give you a full 100% harvest of potato-plants. Believe me, I have done the math, in earth soil. He was also a doctor, an electronics engineer, a chemist, a programmer, a mechanic, a psychologist and what what more. An astronaut for me, should be a civil engineer, with a specialization in whatever field in science, but certainly NOT a botanist. Unbelievable. And where did he get all of his oxygen? After getting his helmet ruptured and taping it off, he was down to 10% oxygen, but after a few seconds all was back to normal. Heh? If you want more discrepancies, read some more reviews with low stars. This film is full of it. Ridiculous Scott, stop making more movies, you seem to suffer of the self-delusion that you are a Sci-Fi director. Nuff said.",
         "Spoilers below. The worst thing about about this movie was that everything is so hard to believe because it's such nonsense. It doesn't follow basic physic laws. It doesn't take much to get me invested in a movie as a viewer, but this just goes too far. The absolute worst flaw is not even all the fake science, nor I'd it the overuse of disco music or the fact that the astronaut doesn't really get desperate and only makes cheesy jokes... No, it's the fact that China's space program has some secret spaceship which they want to reveal and give up for the eyes of the world to save one unknown American dude. That just doesn't make any sense. First of all, China could care less, also, why give up a rocket on which you've been apparently working in secret, just to send food up to space? And if all this would happen for some strange reason... America responds with 'ok. I see. Thank you'. Hangs up and goes ' yessssssss.' Idiotic.",
         "Wow this was a bad one, I thought Interstellar was painful but this was even worse (I know hard to believe!) My favourite part in the whole movie was when Matt points out that an explosion which occurred in a particular room during an experiment he was conducting was due to (you'll love this!) him exhaling too much oxygen into the room! Correct me if I'm wrong but I'm pretty sure we exhale CO2 and inhale O2. I think even a fifth grader would be able to tell me that. I nearly cried with laughter when I heard him say that line and how he kept a straight face is beyond me, unless he thinks its true of course. This was just the beginning of the lack of believable science in this movie and it was so painful to watch after more and more random unbelievable events started popping up. His one line killed the movie for me, from that point on I was looking for more \"errors\" and they just kept on coming. Anyway to cover the opening sequence with how poor Matt ends up left on Mars to die, well there's a big storm that no one seems coming, they all rush to their landing vehicle to hot tail it back up to their orbiting mothership. Matt gets a whack in the gut with something (which we later find out pierced his suit completely but yet somehow the suit manages to stay pressurised with a hole in it) and decides to pass out. The rest of the crew fly back up to the mothership and, get this, immediately set course for home! They don't stay in orbit for say another 24 hours and recover Matt's body they just leg it back home asap. Odd I thought for a NASA mission to just abandon him and not say bring the body back for his family to bury. When poor Matt wakes up he finds all the communications are down and all his friends gone. And by communications I mean the one satellite dish that was stuck to the habitat roof has blown down in the storm and been completely demolished, but not one of the solar panels outside is damaged, just a bit sandy. Seeing how comms back to Earth would be one of the critical systems would there not be 3 or 4 other methods of calling home, redundancies in case of a disaster? NASA didn't see the point in having any of those backups on this mission to Mars, what could possibly go wrong? Another good one is when he is told to drill and cut a whole in the roof of a perfectly airtight rover and sticky tape a big plastic balloon to the top of it. No reason is given for this yet it happens, I think it's so he can take some more plastic painting sheets with him but I cant be certain. Also wouldn't this drilling and cutting a big hole compromise the pressurisation integrity rendering the vehicle unsafe to drive around in without a space suite on, oh but not for Matt, he happily drives around Mars with no suit on at all with his new plastic sticky taped sunroof fitted trying to work out how far he can get on his batteries while whinging about how he'll never make it to the RV due to lack of power all the while singing along to the stereo with more flood lights turned on than at a football stadium. Um turn some crap off Matt that'll save you some juice. Again another scene in the movie, an airlock somehow gets blown to bits and a big gaping whole is left in the side of the habitat Matt lives in. The solution, a big piece of plastic sheet and more sticky tape, he then repressurises the habitat and somehow his sticky taped plastic painting sheet is able to hold up fine, outside there are wild storms going on (which are visible through a few of the more believable looking pressurised windows) raging away and not one single piece of debris punches through his plastic painting drop sheet or does any damage to his rover or solar panels. The mission to get him home is to send back the craft which ran away and left him in the beginning. NASA didn't tell the crew of the ship for months that he was still alive as they didn't want to hurt their feelings! So the plan to get him back is drive the mothership all the way back to Earth, do some gravity sling shot thing around Earth (sounds like Apollo 13?) rendezvous with a supplies pod (food and movies onboard probably) and fly all the way back to Mars and pick him up as he fires himself into space from a lander (after stripping out all the gear inside, removing the roof and covering it with another plastic painting sheet held on with sticky tape to save weight) already there for the next disastrous mission to Mars NASA has already cooked up. For me this movie just went too far, way beyond what any normal person with a even a tiny grasp of science can cope with. I cannot believe Ridley, NASA and JPL were happy to have their names mentioned let alone their relevant ground breaking departments portrayed with such a lack of any real science. I know it's a SciFi movie but you have to get the basics right and have some kind of explanation for the viewer to be able to buy into the ludicrous things which take place in the movie. Otherwise it just becomes a complete bore to watch and the viewer spends their time looking for more flaws. My opinion, save yourself the money, stay home, get a pizza in & watch Blade Runner on BluRay again :-)",
         "In an era where science-fiction survival tales are becoming a popular occurrence - with 'Interstellar' last year, and 'Gravity' the year before - writer Andy Weir and sci-fi connoisseur Ridley Scott team up to craft a complex tale that is carried by a single character, that character being Mark Watney, played fantastically by Matt Damon (Hollywood's biggest calamity, who requires being rescued... again). As the film tees off, we are instantly given a first-person view of the dangers of Mars and the fight for survival each astronaut is living out each day on the planet's surface, that is until their emergency evacuation - but nope, even Damon couldn't do that right. Abandoned upon the desolate surface of Mars after being presumed dead by his crew, Damon must do all he can to endure the martian environment. One huge thing I admire about this film's plot, is that it doesn't care about the intellectual level of its audience, as the quote above states so well: it'll science the s**t out of them. It's such a complex and well-executed premise that on paper seems nothing more than a impossible feat to pull off. Technically this film is stunning, the cinematography, the CGI, the production design, all utterly gorgeous, and according to the Golden Globes, it's one of the best comedies of recent years too... yeah, sure. Admittedly the tongue-in-cheek humour does add a more fresh appeal to the film, making it a little more unique than previous sci-fi adventures, it piles on layers of thrills, emotional value and complex character development to create one of the finest science fiction films of recent years.",
         "Do not trust any review above 2 stars. I think such users are payed reviewers. I went to watch this \"movie\" not expecting much, but what i get was a total frustration. I'd like to get a refund for the ticked i payed because i felt cheated. The movie is insulting to human intelligence. Totally pointless, superficial and from a scientific point of view, is an insult to every scientist. In addition i hope the NASA will call the production to a courtyard for how they have been represented in the movie. Acting is quite often terrible too, no psychological immersion, all is a joke and with a little montage everything become possible... this movie is a waste of money and time, i want my money back!!! Do not waste money and time over this one! THE SPOILER PART REAT AT YOUR OWN DISCRECTION: Think about : 1- growing potato over a soil not tested fertilized with astronauts \"poo\"... what about bacteria ? What about soil minerals and PH ? ... why he had potatoes in a martian station? (that's a joke) 2- why there is no scientific team studying and calculating ? Just a bunch of guys wandering around saying \"yes\" to the big boss or the minor actor acting like the \"genius\" ?? 3- No information control at the NASA center??? Are you kidding me ??? An astronauts left alone over mars, does a real-time chatting with a \"guy\" (not even a psychologist) and such conversations are real-time public shared !!!! ARE YOU F*****G KIDDIN ME????? 4- sorry i forgot to mention that in such movie radiation are totally ignored, as you will never see the reflecting visor down even in \"free space\" while glancing at sun There are tons of those nonsenses in the movie... i just have time to write down 4, but all the movie is 2 hours of such nonsenses. TO CONCLUDE: this \"movie\" is an insult to the viewer, who liked it does ignore even the basic concepts of science, a terrible superficial plot. This \"movie\" is a scam, a fraud to steal our money. I've been cheated, listen to me and don't be fooled keep you time and money for something better.",
         "I read some of the reviews and decided to review this title myself. That's because I'd like you not to miss this lovely movie. It got some very bad criticism (Reviews&Ratings first page hosts at least 4 reviewers rating this title '1', lowest possible value on IMDb), most of which deals with Physics laws bended to screenwriter's desire. Well I just want to reassure you that even though I am among the nerdiest guys on the Internet, I didn't get annoyed from what I saw. Not once. And if you weren't annoyed by Tom Hanks and his boys killing almost an entire German Division before giving up in 'Save Private Ryan' you won't be annoyed too. It's a movie, not a documentary. And it's a great movie, a classic by all means.",
         "The Martian is a new Ridley Scott classic, featuring his best work in years, the best performance I've ever seen from Matt Damon, an outstanding supporting cast, a surprisingly funny screenplay from Daredevil creator Drew Goddard, and a great narrative that ties the film together beautifully. As expected with Ridley Scott films, the film itself is visually stunning. The landscape of Mars looks absolutely breathtaking, and the scenes aboard the Hermes and back on Earth are just as sharp in detail and scope. The way he chose to make this film made it almost seem like an exceptionally made biopic. Many times during this film, I legitimately believed that Mark Watney was a real, living person that was actually stranded on Mars for many months alone. It's Cast Away meets Apollo 13, and this marriage is crafted beautifully. Matt Damon is absolutely brilliant in this film. He plays Watney with so much optimism that it actually makes the depressing aspect of the film not as depressing for me. However, when he has to put on his dramatic chops in certain scenes, he truly commits to the drama of the situation, and that right there is true Ridley Scott suspense for you. The supporting cast, everyone involved, all do great work as well. Jeff Daniels, Jessica Chastain, particularly Chiwetel Ejiofor. He is one of the best actors working today, and this movie and 12 Years a Slave shows how far he's come. The most surprisingly element about this movie though was the screenplay. The film is hilarious in some parts, in fact I'd argue that it's funnier than most comedies that have come out this year. What makes to movie unique to me was Watney's optimistic point of view. He believes that he isn't going to die on Mars, and this transforms this rather depressing situation into something comical instead. But when you really think about it, this is a very personal film about some people coming together to save somebody. That's it. And in today's world, it's nice to hear an story about people coming together to save one of their own. I have nothing bad to say about The Martian. It's the best film I've seen all year.",
         "Having read the book, and being very impressed, I was looking forward to the movie interpretation. I was not the least bit disappointed. I was hoping this movie would not be an overacted, overproduced and sappy version of the original, and I was pleasantly surprised that the story played out without the overblown extraneous embellishment that Hollywood seems to depend on so often. It was great to see how the screenplay added extra material that was not in the book, and it enhanced the story to make it even better. The characters were interpreted with full respect to the intention of the author, Andy Weir, and nothing was overdone. The pacing and editing of this movie was some of the best I've seen, in fact, some of the one-liners from the book are done so quickly it pushed the story forward relentlessly. One thing that struck me is that everyone seemed to be enjoying themselves, and I think that could be a testament to the originality and uniqueness of the book. I believe anyone who reads the book is captivated and involved with the story from beginning to end, and it's possible this comes across in all phases of the production; the acting, the sets, sound, everything. They all knew they had some great material to work with and ran with it.",
         "Man, I was so disappointed by this movie! Did I have too high expectations? I don't think so. If you have a bunch of actually Hollywood-A-class actors and a director who made \"Blade Runner\" and \"Alien\", you are officially allowed to have expectations! But they all failed terribly in my opinion. I could rant about the bad jokes, the awful soundtrack and the cheesy 3D-renderings - why didn't they manage one single time to make these things, the ship, the rover, actually look big? It all looked like toys! Awful! But my biggest complaint is the terrible storytelling! The movie had zero suspense from beginning to end. It was always, hey we have a problem, let's have a cool dialog/monologue, and then, hey, we'll solve the problem within the next minute - no problem at all! Hey, I got no milk in the fridge, OK I'll get some from the supermarket... That level of depth. I didn't feel for one single minute with the main character and I couldn't have cared less, when he had died in the end. There was at some points emotional music and we all were told, that this and that is dangerous and what not. But I couldn't feel it at all. Just for comparison: \"Gravity\" had me on the edge of the seat and \"Interstellar\" had me hold my breath. Not to mention \"Moon\", \"Blade Runner\" and \"Odyssee\". Wasn't there a time, when Ridley Scott made actually great movies? Do yourself a favor and spend the money on something else. This movie isn't worth it.",
         "This movie is so science-y. You will just love how much it quotes science. Like, you know, real science. And that is why I loved this movie. Science tells us that everything in it is totally possible. Anybody who doesn't like this movie must be anti-science. Because science rules. It's like Neil DeGrasse Tyson and Bill Nye had a love child. And Carl Sagan. But don't just go for all the science. The story is so unique. I know Matt Damon just famously played a brilliant NASA astronaut who got stranded on a planet in the movie Interstellar, and that Jessica Chastain was also in that one, but it is not like Interstellar at all (what was with that weird ending, anyway??). The Martian has its own unique plot centered around a team of brilliant NASA scientists in Houston trying to get their astronauts home after a difficult journey that had to be cut short, but it is not like Apollo 13. Sure, in both movies they don't have enough fuel, and there is an explosion on board, and they have to use this brilliantly hatched scheme to use gravitational pull to propel them. But get this: while Apollo 13 had its astronauts being propelled around the moon, The Martian has them going around Earth! Science says that the earth is way bigger than the moon, which makes this way cooler. Nope, not at all like the entire movie Apollo 13. Oh, and also, there is a great part at the end that made me feel just like I was watching Gravity again. You'll know the part when you see it. But really it is nothing like Gravity. It is so funny through the whole movie when Matt Damon explains everything in minute detail as it happens. Such a brilliant choice by the writer and director. Exposition like that is so scientific because he has to know all those big words in order to explain everything. I can imagine all the anti-science global warming deniers' heads exploding at these parts, but if you're anything like me, you will find yourself nodding along and thinking, \"Yep! I know what he's talking about!\" Example: that moment he had to make his own water and he said, \"Fortunately, I know the recipe. Take hydrogen. Add oxygen. Burn.\" So true! Again, The Martian is a smart, complex movie. Luckily, in another brilliant choice by director Ridley Scott, title cards appear at the beginning of nearly every scene explaining where the action is taking place, and who is taking part in it. I found this extremely helpful, as it was a bit confusing when it would switch from Mars to Earth all the time. Plus, it was extremely gratifying when I would see a new character, and before I even had time to think who the heck is that, lo and behold, his or her name and title would appear to clear away all doubt. Then there's the music: So many familiar tunes! And I've been hearing a lot about perhaps the most quotable line of any movie for years—you know the line—let me just say it because it is so funny: \"I'm gonna have to science the s*** out of this.\" --That is said by Matt Damon's character, Mark Watney, who is literally one of the smartest and most capable men ever. But as you can tell, he isn't all stuffy, you know? He is really funny. Can I just quote some more of his hilarious lines? I couldn't stop laughing the whole way through as he smugly said these things to the audience, I mean his camera: \"Hi, I'm Mark Watney and I'm still alive... obviously.\" \"I don't want to come off as arrogant here, but I'm the greatest botanist on this planet.\" \"Mars will come to fear my botany powers.\" \"So yeah, I'm f***ed.\" \"In your face, Neil Armstrong!\" \"Tell Commander Lewis, disco sucks.\" \"F***!\" \"So\u0085 I blew myself up.\" \"Mark Watney: Space Pirate.\" \"I admit it's fatally dangerous, but I'd get to fly around like Iron Man.\" \"F*** you, Mars.\" \u0085Anyway, he is hilarious as you can tell, and this movie definitely deserves all the praise it is getting for its humor alone. You will just love this. Ten/Ten \"Stars\" (Get it?)"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Twentieth Century Fox",
         "TSG Entertainment",
         "Scott Free Productions"
      ],
      "summaries": [
         "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive. Millions of miles away, NASA and a team of international scientists work tirelessly to bring \"the Martian\" home, while his crewmates concurrently plot a daring, if not impossible, rescue mission. As these stories of incredible bravery unfold, the world comes together to root for Watney's safe return.",
         "During their mission in Mars, a team of astronauts is hit by an unpredicted storm and have to abort their mission and leave for Earth. During the evacuation one of the crew members, Mark Watney, is hit by a projectile due to the storm and is thrown away. The crew is forced to leave him thinking he died due to rupture in his space suit. However Mark survives and now has to find ingenious ways to make it till the next scheduled Mars mission fours years later with the remaining meagre supplies. Being a botanist he manages to cultivate food and survives by scavenging parts of previous missions. NASA soon learns about him and attempts a daring and dangerous mission to bring him back. Will they succeed in bringing him back alive? Only time will tell.",
         "A team of astronauts are on Mars. When a storm hits the team tries to get off the planet but the line gets cut and Mark Watney is blown away. The sensors detect no life signs so they assume Watney is dead. But in actuality his sensor was damaged. He proceeds to the habitat and sets himself up. He knows that it'll be at least three years till the next mission arrives and he has no means to communicate and his supplies will only last a year. So he tries to make more. On Earth the Mars Mission Director wants to mount a mission to bring back Watney's remains so he has the satellites check out the surface of Mars and they discover that Watney is alive. So they have to figure out how to help him. Eventually Watney finds a way to communicate with Earth. And NASA needs to decide whether to tell the crew he's still alive but they're on their way back.",
         "During a storm in Mars, the astronaut Mark Watney is hit by an antenna and presumed dead by his captain and crew that cannot find him. Captain Melissa Lewis seeks him out and decides to departure with her crew. However, he has survived and finds that was left behind short of supplies and without communication to Earth. Mark is botanic and uses his knowledge to plant potatoes in a green house he has prepared. Meanwhile in NASA the scientists find that Mark is alive and try at any cost to bring him back to Earth. Will they succeed?",
         "After a massive storm forces his crew to leave the planet, an astronaut, Mark Watney (played by Matt Damon), is marooned on Mars, and presumed dead. Figuring that it would be at least four years until someone can rescue him, he sets out, though often ingenious means, to survive..",
         "An astronaut becomes stranded on Mars after his team assume him dead, and must rely on his ingenuity to find a way to signal to Earth that he is alive."
      ],
      "budget": 108000000
   },
   "movielensId": 134130,
   "movielens": {
      "languages": [
         "English",
         "普通话"
      ],
      "releaseDate": "2015-09-30",
      "dvdReleaseDate": null,
      "directors": ["Ridley Scott"],
      "runtime": 141,
      "movieId": 134130,
      "title": "The Martian",
      "mpaa": "PG-13",
      "actors": [
         "Matt Damon",
         "Jessica Chastain",
         "Kristen Wiig",
         "Jeff Daniels",
         "Michael Peña",
         "Sean Bean",
         "Kate Mara",
         "Sebastian Stan",
         "Aksel Hennie",
         "Chiwetel Ejiofor",
         "Benedict Wong",
         "Mackenzie Davis",
         "Donald Glover",
         "Nick Mohammed",
         "Chen Shu",
         "Eddy Ko",
         "Enzo Cilenti",
         "Jonathan Aris",
         "Gruffudd Glyn",
         "Naomi Scott",
         "Geoffrey Thomas",
         "Yang Haiwen",
         "Narantsogt Tsogtsaikhan",
         "Brian Caspe",
         "Szonja Oroszlán",
         "Mark O'Neal",
         "Karen Gagnon",
         "Lili Bordán",
         "Nikolett Barabas",
         "Dilyana Bouklieva",
         "Björn Freiberg",
         "James Fred Harkins Jr.",
         "Sam Spruell",
         "Matt Devere",
         "Mike Kelly",
         "Greg De Cuir",
         "Peter Linka",
         "Declan Hannigan",
         "Peter Schueller",
         "Waleska Latorre",
         "Frederik Pleitgen",
         "Charlie Gardner",
         "Nóra Lili Hörich",
         "Kamilla Fátyol",
         "Yang Liu",
         "Richard Rifkin",
         "Nicholas Wittman",
         "Ben O'Brien",
         "Scott Alexander Young",
         "Jason Ryan",
         "James Dougherty"
      ],
      "imdbMovieId": "3659388",
      "originalTitle": "The Martian",
      "genres": [
         "Drama",
         "Adventure",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "Ue4PCI0NamI",
         "ej3ioOneTy8",
         "s0V-kqIe4pw",
         "lcyfDRYKDJM",
         "neBlUgLBE3A"
      ],
      "plotSummary": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive.",
      "tmdbMovieId": 286217,
      "avgRating": 4.04663,
      "releaseYear": "2015",
      "numRatings": 14798,
      "posterPath": "/5aGhaIHYuQbqlHWvWYqMCnj40y2.jpg"
   }
}