{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "cyborg",
            "id": 679
         },
         {
            "name": "android",
            "id": 803
         },
         {
            "name": "future",
            "id": 2964
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "cyberpunk",
            "id": 12190
         }
      ],
      "imdb_id": "tt1260502",
      "video": false,
      "title": "Ghost in the Shell 2.0",
      "recommendations": [
         12140,
         18839,
         18874,
         111224,
         196750,
         9323,
         279254,
         240341,
         212168,
         15137,
         22843,
         14571,
         18491,
         11633,
         11299,
         75629,
         76190,
         26757,
         14572,
         35435
      ],
      "backdrop_path": "/13E2KVe94NiTqCoRWamue6gg322.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Motoko Kusanagi (voice)",
               "gender": 1,
               "credit_id": "52fe45cb9251416c75062b2b",
               "name": "Atsuko Tanaka",
               "profile_path": "/tM2mIRVxO7TehX35cpSbDvgEByq.jpg",
               "id": 34923,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Batou (voice)",
               "gender": 2,
               "credit_id": "52fe45cb9251416c75062b2f",
               "name": "Akio Ohtsuka",
               "profile_path": "/33uwf6AtjtqckGH6kUfr8GGDqJu.jpg",
               "id": 40451,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Togusa (voice)",
               "gender": 2,
               "credit_id": "55df5c7f925141798f000108",
               "name": "Kouichi Yamadera",
               "profile_path": "/m5su8OKD2rZn9XWJfh8aPC403Nz.jpg",
               "id": 20664,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Section 9 Department Chief Aramaki (voice)",
               "gender": 2,
               "credit_id": "535cd77dc3a36830b0003c16",
               "name": "Tamio Ohki",
               "profile_path": "/yRoaWUblTlU98adYjFUNXr9THzv.jpg",
               "id": 12199,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Section 6 Department Chief Nakamura",
               "gender": 2,
               "credit_id": "52fe45cb9251416c75062b3b",
               "name": "Tesshou Genda",
               "profile_path": "/ahCru7z0zyaV6RV1uCP0HBNLRoC.jpg",
               "id": 1681,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45cb9251416c75062b41",
               "name": "Mamoru Oshii",
               "profile_path": "/2MXFEwxLu7gT9vvi5Otx4LQgsvZ.jpg",
               "id": 12180,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45cb9251416c75062b47",
               "name": "Kazunori Ito",
               "profile_path": "/gHLjymYpgHONtxLleogmxt5EVj7.jpg",
               "id": 57302,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45cb9251416c75062b4d",
               "name": "Masamune Shirow",
               "profile_path": null,
               "id": 57303,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.972377,
      "production_countries": [
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 14092,
      "vote_count": 140,
      "budget": 0,
      "overview": "In the year 2029, Section 9, a group of cybernetically enhanced cops, are called in to investigate and stop a highly-wanted hacker known as 'The Puppetmaster'.  Ghost in the Shell 2.0 is a reproduced version of its original 1995 counterpart. Among a numerous enhancements, for the film's 2.0 release, were a number of scenes were overhauled with 3D animation, visual improvements, and soundtrack rerecorded in 6.1 surround sound.",
      "similar": [
         9323,
         2048,
         605,
         604,
         11633,
         296,
         534,
         603,
         19,
         262543,
         157336,
         644,
         335984,
         87101,
         198184,
         23535,
         12140,
         15785,
         10803,
         218
      ],
      "original_title": "攻殻機動隊 2.0",
      "runtime": 85,
      "poster_path": "/ygMORms9SJaW8P5hdXsuFRDW4WV.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": "/rwB6w2aPENQbx756pBWSw44Ouk.png",
         "name": "Production I.G",
         "id": 529,
         "origin_country": "JP"
      }],
      "release_date": "2008-07-12",
      "vote_average": 7.3,
      "belongs_to_collection": {
         "backdrop_path": "/xt0E8CHXzLxEoiPqrjZMRrM4Izi.jpg",
         "name": "Ghost in the Shell Collection",
         "id": 23026,
         "poster_path": "/xEQVBrAd1hWtwCeK39RQ84CRqB7.jpg"
      },
      "tagline": "It Found A Voice... Now It Needs A Body",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mamoru Oshii"],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Shirow Masamune",
         "Kazunori Itô"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt1260502/",
      "coverLink": null,
      "actors": [
         "Atsuko Tanaka",
         "Akio Ôtsuka",
         "Kôichi Yamadera"
      ],
      "reviews": [
         "GITS is one of my favourite films, and one of the first DVD's I bought when the format was new on the scene. After watching Innocence (which looked great), I was quite ready to see something totally awesome in this update. I was wrong. As another comment said, they should have re-done the whole film, instead of a bit here and there. I couldn't enjoy the movie when it kept switching from CGI to cel-shaded animation. Also, considering this was made FOUR years after Innocence, the CGI is awful. Most of the time Motoko looks like a plastic doll. Not cool. The music and sound effects were re-done, sometimes better, most times not. In the original GITS if somebody was getting beaten up, you would hear them scream. In 2.0, a guy gets his ankle broken and doesn't even let out a whisper. Stupid. The main theme song (the choral piece) was re-recorded and it too lost a lot of impact. Don't bother with this. Just watch the original.",
         "The new scenes are nicely executed for the most part, but completely unnecessary. As eye-candy on their own, they're not particularly impressive either. Further, they tend to break the flow of the film, especially when cutting directly from the new CG to the cel-animated original. Clearly, the entire film should have been revisited rather than this selective and perfunctory approach to an update. It reeks of something George Lucas would do (i say that negatively) and sadly, GITS2.0 fails to live up to his much more seamless updates of the original STAR WARS films. More importantly, some shots lose their original intent somewhat, for example the scene where Motoko rises to the surface during her dive; also the angel-vision that Motoko has just prior to being blasted by snipers was diluted. There are little details added here and there like rain etc, which do add to the atmosphere, but ultimately i was left wondering about the intentions of the people that carried out this re-envisioning. I cannot for a moment believe that Oshii was consulted regarding small but important decisions like changing the sex of the Puppet Master from male to female. In the absence of the original director's blessing, i have no choice but to condemn what seems to be a superficial attempt at re-marketing a classic. As an introduction to the franchise, GITS2.0 is still more than adequate, but it merely offers a diminished and disjointed experience compared to watching the original. The sound FX are improved, although lacking in subtlety. Other user-comments suggest music was redone but i detected no apparent changes.",
         "Just like other reviewers have said, I can not recommend this remake of Ghost In The Shell to people who like the visuals and the sound of the original. For me, the original GITS was near-perfect in look and feel. The color palette, visual designs, animations and sound design were all strong, hard-hitting and rough. In the 2.0 remake, the color palette was changed to a earthy, brown look that we know from so many video games and movies. Additionally the image is drowned in blur and bloom effects. Watching the movie you can clearly tell which scenes are CGI and which are hand-drawn, whereas these elements integrated well in the original. To make matters worse, many of the CGI scenes do not hold up to the original hand-drawn scenes. The jaw-dropping intro and title sequences from the original GITS are ruined for that very reason. The city has lost it's dirty, melancholy mood and is now indistinguishable from designs in other movies. A similar treatment has been given to the audio. All new sounds are toned down in impact. Vehicles, machinery and weapons now sound like plastic. The new sounds alone destroy the combat scenes beyond recognition. On the upside, the original voices and music were preserved. Why Ghost In The Shell received this treatment I can not understand. Supposedly it was to adapt GITS to the look of it's successor \"Innocence\" (Ghost In The Shell 2). The merits of such an undertaking can be disputed on a general level, yet GITS 2.0 is a perfect example of how not to execute such a task. Viewers should be able to recognize \"Ghost In The Shell\" as \"Innocence\"'s predecessor from the title, the story and promotional material.",
         "First up, I want to make it clear that my rating goes to \"Ghost in the Shell 2.0\" and not the original film. The rating has nothing to do with the original storyline or old animation blablabla but only this new version, which is completely unnecessary in every imaginable way. The classic animation utilised in the original film looked amazing, and removing some of these classic masterpiece animations and intercutting them with new CGI stuff looks and feels, well, wrong. It's not BAD CGI, but unnecessary, and jarring when intercut with the older (and in my opinion superior) style. Don't watch \"Ghost in the Shell 2.0\". Buy the original version and enjoy that one instead.",
         "Basically, if you've seen the first one, you've seen this one. Lines are the same, acting may be a little less wooden given how much the cast has played these same characters by now, and any faults the first one had, this one has. That aside, the movie is gorgeous, more so if you've seen the original a few times. Not quite Innocence, but close. The new CG scenes aren't disjointing as they are only in places one would expect them, and the new dubbing is solid. Even though one can tell the cg was added as an after thought, it doesn't detract from the score, which is redone. From what I could tell, it is all newly recorded and rearranged, especially the theme, and is a step above and beyond the original score. Sound effects are great if subtle as well. The movie is still extremely sensory minded, and that is what this is for. It is gorgeous to watch and to listen to, but does not act a replacement for the original. They both have a place on the same shelf.",
         "As many have noted in their comments, the new CGI in this remastered version of the original Ghost in the Shell movie do more harm to the film than good. I mean, they are nice and all, but they don't add anything to the story and they contract strongly with the original animation. This being said, the movie is almost the same, so just as great. As a subject it is one of the masterpieces of modern sci-fi. One of my favourite films, GitS spawned two films and a series just as great, all adding more to the initial exploration of the human soul in the face of ever more complex and intrusive technology. I believe its beauty stands in the many levels that the film can be perceived at. If you are looking for flashy technology, police procedure and explosions, you have them all. If you are looking for dark political intrigue, there is plenty of it. If you are going for more philosophical aspects, like the source of the self, the true spring of identity and consciousness, that is at the very heart of the story. It's a win win situation. I can hardly wait for the film that is to be filmed in 2011. I just hope they don't turn it into some mellow brainless thing, like so many movies nowadays. Bottom line: I've seen the original a long time ago, so I can hardly comment on the differences. My advice to you is to watch either of them, because it is totally worth it.",
         "I gave this 1 star out of 10, not because the story sucks or anything, but because this was a completely unnecessary waste of time and effort. Here's the idea: take one of the greatest animes ever produced and re-draw certain shots with new CGI. Then intercut them with the original animation. The new CGI is very well done; unfortunately, it doesn't match the original artwork at all, and tends to distract from the overall film. It's like having someone slap you every few seconds. One other reviewer mentioned that this seemed like something George Lucas would do, and if you saw the \"new\" Star Wars films that came out in the 1990s with added scenes and (crappily done) CGI, you've had a taste of what was done with GITS 2.0. But imagine if the original was in B&W and the new scenes were not just in color, but completely CGI. That's how jarring GITS 2.0 is. If the creators wanted to do something with the new CGI technology that exists, they should have come up with a new idea, not tried to re-hash an old movie. They aren't even \"re- imagining\" it, they are just doing it over again. It's as if an artist working with charcoal discovered watercolors, and then tried to paint over all his old works. This was a terrible idea. My advice is to forget that this movie exists, and just watch the original.",
         "This story was\u0085 well confusing. The problem was that they had a 'puppeteer' who was changing people's thoughts and memories in order to use it for his own purpose to hack into official's heads. I won't lie, I don't normally understand all that political stuff. The fact that this was so heavy in that made it more of a chore to try and figure stuff out. If I missed something that someone said, to bad, I couldn't really go back and check it out because I wouldn't know where to find it again. When we get to the characters, the only ones we really get to understand slightly are Batou and Kusanagi. The others just seem like background characters compared to them. Even then, we don't get much about the two although you can tell that Batou really cares greatly for Kusanagi. When we do get near the end, it does get into a rather interesting and deep. It really dives into physiological problems and aspects to life. It might of still been a rather confusing show but I did enjoy it. The art style starts out with a lot of CG stuff in the beginning of the show and then going deeper into the normal animation after. I have to say they really took me off guard when they showed the naked body of the major in CG while she was working. Of course then they had to have an opening that expanded on showing a women's naked body being created through electronic means. There were little scenes where they would do a bit more of the CG and half of it is rather pretty. Some of the characters designs seem a bit off from how they looked in the anime that I had watched part of before, namely the major. Still, the camera angles and some of the ways they showed the world felt very classic to the anime style of the late 1990s. Some of the sounds are a bit off and the English voices sometimes don't match lip movements but the voice actors really tried their best to make such a serious show work. You can tell just how they read their lines that they were trying really hard to keep it interesting but sadly, I keep feeling that they do a whole lot of talking and sometimes not all that much action or just a lot of shooting. When we do get action, its mostly slow movement, looped or over almost as fast as it starts. Now there are also some talks that feel more like a lecture about the problems with the cyber technology and a philosophy of having your own identity. These small parts were the only things that kept my attention as the others talks seemed a bit more complicated and I had no way of understanding the political problems.",
         "PLEASE NOTE: This review will also be on the Ghost in the Shell (1995) IMDb section since they are the same movie) Ghost in the Shell was an amazing Anime film, that broke the mold on Sci-fi for the 1990's (like that Akira did for the 1980's.) The story is intriguing and interesting and the acting is very well done for both the English dub and Japanese versions. I doubt I need to explain the story to you since you have probably seen this by now but if you haven't, please watch it. You'll be happy you did. I give 'Ghost in the Shell 2.0' a 8/10"
      ],
      "genres": [
         "Animation",
         "Action",
         "Crime",
         "Drama",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Bandai Visual Company",
         "Manga Entertainment",
         "Production I.G."
      ],
      "summaries": ["A hacker known as the Puppet Master is hunted by a female cyborg cop and her partner. This film is a revised version of Kôkaku Kidôtai (1995)."],
      "budget": 0
   },
   "movielensId": 136449,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2008-07-12",
      "dvdReleaseDate": null,
      "directors": ["Mamoru Oshii"],
      "runtime": 85,
      "movieId": 136449,
      "title": "Ghost in the Shell 2.0",
      "mpaa": "",
      "actors": [
         "Atsuko Tanaka",
         "Akio Ohtsuka",
         "Kouichi Yamadera",
         "Tamio Ohki",
         "Tesshou Genda"
      ],
      "imdbMovieId": "1260502",
      "originalTitle": "攻殻機動隊 2.0",
      "genres": [
         "Action",
         "Animation",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["ZAK2PVKio0g"],
      "plotSummary": "In the year 2029, Section 9, a group of cybernetically enhanced cops, are called in to investigate and stop a highly-wanted hacker known as 'The Puppetmaster'.  Ghost in the Shell 2.0 is a reproduced version of its original 1995 counterpart. Among a numerous enhancements, for the film's 2.0 release, were a number of scenes were overhauled with 3D animation, visual improvements, and soundtrack rerecorded in 6.1 surround sound.",
      "tmdbMovieId": 14092,
      "avgRating": 3.99699,
      "releaseYear": "2008",
      "numRatings": 498,
      "posterPath": "/ygMORms9SJaW8P5hdXsuFRDW4WV.jpg"
   }
}