{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cartoon",
            "id": 6513
         },
         {
            "name": "big bad wolf",
            "id": 11180
         },
         {
            "name": "silly symphony",
            "id": 156139
         },
         {
            "name": "short",
            "id": 214549
         }
      ],
      "imdb_id": "tt0024660",
      "video": false,
      "title": "Three Little Pigs",
      "recommendations": [
         58159,
         72640,
         67572,
         418956,
         53219,
         53565,
         57472,
         47166,
         45665,
         101806,
         33600,
         67661,
         53494,
         106112,
         109301,
         109337,
         80927,
         68986,
         161605,
         48504
      ],
      "backdrop_path": "/19kbfE5zM3dOAzKVwOVquRiEVFR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Big Bad Wolf (voice)",
               "gender": 2,
               "credit_id": "52fe45659251416c91030d73",
               "name": "Billy Bletcher",
               "profile_path": "/wVMoPHj7zTswZJx96VqY1yWgN8j.jpg",
               "id": 31771,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Practical Pig (voice)",
               "gender": 2,
               "credit_id": "52fe45659251416c91030d77",
               "name": "Pinto Colvig",
               "profile_path": "/iHUSTwJAlqn0OzZpjiZwrkRgzXq.jpg",
               "id": 5462,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Fiddler Pig (voice)",
               "gender": 0,
               "credit_id": "52fe45659251416c91030d7b",
               "name": "Dorothy Compton",
               "profile_path": null,
               "id": 112405,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Fifer Pig (voice)",
               "gender": 0,
               "credit_id": "52fe45659251416c91030d83",
               "name": "Mary Moder",
               "profile_path": null,
               "id": 112406,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45659251416c91030d89",
               "name": "Burt Gillett",
               "profile_path": "/wkfzrGKP2pXC7DMIJ3vfOmQ5YYL.jpg",
               "id": 122633,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "553f9c8592514138a900c737",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "553f9c9292514137f9005733",
               "name": "Albert Hurter",
               "profile_path": "/3fFbgMLwhA6HFy9kZQHT6Lym9Bz.jpg",
               "id": 225715,
               "department": "Directing",
               "job": "Layout"
            },
            {
               "gender": 2,
               "credit_id": "553f9cb7c3a3687845010b90",
               "name": "Frank Churchill",
               "profile_path": "/u0HHq11XNUcZTRbGWnAxCXLs1BQ.jpg",
               "id": 5466,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "553f9cd9c3a3683e5500a7cc",
               "name": "Fred Moore",
               "profile_path": "/zIa8qsuIv5Djs7ExSgYtoy3l59P.jpg",
               "id": 222578,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "553f9ce2c3a3683e5500a7ce",
               "name": "Dick Lundy",
               "profile_path": "/1xDOsCB5TRmuoH5eikT7gduaqPu.jpg",
               "id": 150768,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "553f9ceb92514137f9005740",
               "name": "Norman Ferguson",
               "profile_path": "/o6ZqI5lXaQW3q05ri2WyMUZKYLg.jpg",
               "id": 226599,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "553f9d1a9251411435005863",
               "name": "Art Babbitt",
               "profile_path": "/bRjADfWGu2lxWYnghnQaeCg21yy.jpg",
               "id": 5692,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "553f9d2792514138a900c749",
               "name": "Jack King",
               "profile_path": "/yJ5KLAn47LhuWgdC6Yz8kr8QXkF.jpg",
               "id": 148147,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.267763,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34463,
      "vote_count": 101,
      "budget": 15719,
      "overview": "The two pigs building houses of hay and sticks scoff at their brother, building the brick house. But when the wolf comes around and blows their houses down (after trickery like dressing as a foundling sheep fails), they run to their brother's house. And throughout, they sing the classic song, \"Who's Afraid of the Big Bad Wolf?\".",
      "similar": [
         812,
         150540,
         21385,
         10340,
         10144,
         10193,
         10895,
         9479,
         12230,
         856,
         10882,
         10530,
         10555,
         41513,
         37135,
         9016,
         10198,
         12092,
         2300,
         3933
      ],
      "original_title": "Three Little Pigs",
      "runtime": 8,
      "poster_path": "/aPmSY3y4A2xMSkF24tdIfDQNKJy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Walt Disney Productions",
            "id": 3166,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "United Artists Pictures",
            "id": 16685,
            "origin_country": ""
         }
      ],
      "release_date": "1933-05-27",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Who's afraid of the BIG BAD WOLF?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Burt Gillett"],
      "runtime": 9,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0024660/",
      "coverLink": null,
      "actors": [
         "Billy Bletcher",
         "Pinto Colvig",
         "Dorothy Compton"
      ],
      "reviews": [
         "One of the most enduring of animated classics is Walt Disney's Three Little Pigs, taken from the old fairy tale about three juvenile little oinkers, only one of whom meets the challenge of the Big Bad Wolf. Coming out as it did in 1933 it's both a metaphor for the Great Depression, the consequence of no financial planning for a rainy day and the steps we must take to reform the system as the New Deal attempted to do. A lot of people thought the same way as the Three Little Pigs did in poopooing the notion of a Big Bad Wolf, but only Practical Pig took practical steps in building his house of bricks so the wolf was kept from his door. In Steamboat Willie, Mickey Mouse became the first of Walt Disney's animated creations, but in Three Little Pigs, the first of many songs identified with the Magic Kingdom was written and has certainly endured. Who's Afraid of The Big Bad Wolf is probably sung by so many parents to their children in reciting this tale that they probably think it came with the fairy tale. It probably was what won Disney his Oscar for Best Short Subject for the cartoon. It was a mega-hit during the Depression, not an easy thing when people weren't buying records. I happen to have a rollicking version by Thirties band-leader and entertainer Ben Bernie of the Frank Churchill- Ted Sears classic. It's still quite a hoot. And as a lesson in planning ahead, Three Little Pigs for children and former children can't be beat.",
         "HAVING been raised up with the knowledge of and familiarity with a particular work of Art, Music or Cinema often leads one to lack a proper appreciation for them. It's strictly a matter of lack of maturity, lesser wisdom and taking them for granted. This is a condition that usually finds a cure with a reviewing of the work in question; particularly if it is screened again after a substantial length of time has elapsed. TAKE the case of today's special honored guest, THREE LITTLE PIGS (Walt Disney Productions/United Artists, 1933). To someone who had viewed it originally, during its first release theatrically, or to a Baby Boomer (like Schultz and Me!), who've seen this on TV since we were kids, this is perhaps just another cartoon. However, when one takes a good step back and views it freshly; one realizes just how great a work it is. IN dissecting the animated 8 minutes, we find a much more complex movie than we would first imagine. Yes, it is a Cartoon Short; a very good one. Yes, it has beautiful Technicolor, the finest of Artwork and flawless animation; we concede all these amenities. It possesses the most lively and beautiful Original Musical Score imaginable. All of these things are true, but we can easily overlook one particular aspect; one that well may be the catalyst which rendered it so special. THAT almost invisible ingredient is Poetry. The whole narrative of the short is tastefully done in rhyme. This is an aspect that is so well rendered as to be virtually unnoticed. All of the rhyming dialogue, regardless of which of the four characters delivered it, blended in a nearly flawless and seamless fashion. This is a highly important and possibly redeeming quality; for many a movie goer would be prejudicially affected about seeing and listening to \"that sissy stuff.\" INSTEAD, we're told that this 8 minute cartoon, this musical short had a great effect on our people in Depression Era America and the World. The original theme song of \"Who's Afraid of the Big Bad Wolf\" was heralded as the unofficial rallying call of the common folk and high society types alike. It certainly has a peppy, upbeat sound and mood about it and has a certain feeling of having one uplifted just to hear it. As far as longevity, it is about as well known now as it was 75 years ago. WE did read of one particular problem that Disney and the Production Crew faced early on with THREE LITTLE PIGS; one that seems incredible today, but true nonetheless. It concerns the Wolf's masquerade as a salesman coming to the door of the Practical Pig. IN the film we see, the Wolf says he's \u0085\"Working my way through College\" and \"you want to buy a brush?\" Both of these are certainly long established clichés; as, who hasn't heard that 'Working my way through College\" or the Brush remark's being an obvious reference to the Fuller Brush Company. BUT the scene originally called for the Wolf to be using a decidedly Yiddish Accent as he was supposed to be disguised as a Jewish Door-to-Door Salesman. Even Big Bad's costuming is reminiscent of the manner of dress used today by Observant Hasidic Jews, many of whom are active in any number of businesses.* WHATEVER the reason, the scene was changed to a gag about a \"College Kid, working his way through School.\" OTHER than that point, it's extremely difficult to find fault with this edition of Walt Disney's SILLY SYMPHONY Cartoon Shorts. It remains a near perfect masterpiece in 1933, today and for all of the tomorrows on our bountiful planets vast horizons. NOTE: * There were many such similar stock characterizations or stereotypes used in Film, as a tradition borrowed from the legitimate theatre's stage. For example in the highly acclaimed CIMARRON (RKO Radio Pictures, 1931), character actor George E. Stone portrays a traveling salesman by the name of Sol Levy. His costuming was just about the very same as that used by B.B. Wolf uses in THREE LITTLE PIGS. Well, for whatever the reason, Disney changed the scene; although it is neither better nor worse for its happening. POODLE SCHNITZ!!",
         "Well, to start with, what do you say about a cartoon that somehow got its way into The Shining? Well, it's that damn iconic, simply put. I first saw this short many years back, so long ago it was when the Disney channel played, from time to time, 1930s and 40s Disney cartoons at certain times of the morning or day (when kids were at school so, you know, on sick days and such). It stuck with me for the simple reason that, hey, it's the 3 Little Pigs, what kid doesn't know the basic gist of it? The Big Bad Wolf will come to the door, you got to know how to defend against him from getting in. \"Not by the hair on my chinny chin chin,\" being one of those lines. But what's so much fun about the short, why I can remember it (and them, there was more than one short I think) was that it kept the song catchy throughout, the animated characters had strong, direct personalities, and I actually felt some danger for those little animated pigs from the Wolf. It's colorful, it's funny, it's a little terrifying in the strange way that a 30s cartoon can get in little moments, and it has persevered due to its message for young and old alike of facing against the odds and the \"Big Other\" that might try to come down. It's great to find out that the term 'Who's Afraid of the Big Bad Wolf' was used as a line of optimism in the Depression too.",
         "Three Little Pigs is a cheerful, fun and lovable little classic that I have loved ever since I was a child. While the pacing is a tad too quick in places it is still hugely enjoyable for a number of reasons. When I was little, I marvelled at how good the animation was for its time. From a 17 year old perspective it is still very very good, with colourful backgrounds and beautiful colours. I also remembered singing along to the song Who's Afraid of the Big Bad Wolf? That song has to be one of the most memorable songs ever in a Silly Symphony, it is ever so catchy and easy to sing along to. The dialogue is great. The Big Bad Wolf has some classic lines, but I think the best of them come from Fifer and Fiddler. There is one funny part when the Wolf dresses up in the sheepskin, the dialogue Fifer and Fiddler say cracks me up every time. The Wolf, like the Three Little Pigs, is a truly memorable character. Sinister and rapacious, he did scare me when I was little, not so much now but the animation and voice work is wonderfully impressive even by today's standards. I do think the Wolf from Peter and the Wolf is scarier, me and sister haven't got over how scared we used to be of him. The voice work is excellent. Billy Bletcher is perfect as the Big Bad Wolf and Walt Disney I recognised immediately from his voicing of Mickey in cartoons like Boat Builders and Mickey's Good Deed. Pinto Colvig, the original voice of Goofy, also does a stellar job. Overall, hugely enjoyable childhood favourite. 9.5/10 Bethany Cox",
         "I've heard about the politically incorrect version...the original version...of this cartoon, but have never seen it until today. It's the theatrical release that featured the wolf dressed as a jewish peddler, complete with a BIG false nose, beard, long black hair and hints of Yiddishe music for a few bars in the background as he gets hit over the head by Practical Pig (A clever(?) disguise as why would a Jew be at the door going after some pork?) In the latter day, \"cleansed\" version (circa???), Disney artists edited this part out and REDREW the scene aping the old classic style, changing the Big Bad Wolf into a harmless Fuller Brush Man, sans Jewish features. This modern whitewashing happened due to protests from folks over offensive stereotypes, but anyone whose seen pre-code movies knows Jewish peddlers were omnipresent whenever street scenes were shown, as were all ethnic stereotypes On the \"forbidden\" video I viewed, the second cartoon featuring the wolf in \"Little Red Riding Hood\" ('34), he dons a fairy outfit and minces about in the forest in an openly gay manner (it's hysterical), enticing Bo Peep and two of the Little Pigs. I don't know if this scene has been subsequently cleaned-up as well for today's uneasy audiences, but I have never seen this cartoon before. In fact, it was a well-kept secret, never featured on any Disney TV show to the best of my knowledge. The video I previewed is fairly recent, released circa 1995 (I thought it was cleaned-up in the '50's or '60's...the old version being yanked from circulation around the same time). Other videos I have seen feature the \"scrubbed\" PC version from an even earlier date, so I don't really know what's going on over at Disney. All I can say is that I'm Jewish, and love watching stuff like this. I don't believe in censorship, revisionism, correctness, or cowardice for that matter. These films are a chronicle of their age, and should be left alone. I'd like a show of hands...have any of you seen one or both versions...and do you deplore the Disney clean-up...or condone it?",
         "Academy Award-winning Disney short that brings to life the timeless fairy tale of the three little pigs who, as we all know, live in houses made of straw, sticks, and brick. The Big Bad Wolf comes by and does his thing, huffing and puffing. You know what happens next but it's still very entertaining to watch it unfold. It's a wonderful cartoon that was very popular with the Depression-era audience that first saw it and still holds up quite well today. Who doesn't love the classic song \"Who's Afraid of the Big Bad Wolf?\" It's a beautiful-looking cartoon with rich colors and fluid animation. The voice work is terrific and the music score is delightful. It's the premier version of the three little pigs tale, which has been told in countless cartoons over the years. It's a fun short that everybody should see at least once, preferably when they're still young enough to truly appreciate its simple charms.",
         "Three Little Pigs (1933) **** (out of 4) Disney's adaptation of the Grimm fairly tale is certainly one of the highlights of their early animated films. The story is pretty simple as three pigs are building a house. The two who builds it out of straw and sticks are free to play around more but the one building with brick has to work even harder. The two lazy pigs think it's quite funny until a wolf shows up and their lack of work comes back to haunt them. THREE LITTLE PIGS is certainly one of the best animated shorts from this era of Disney and it's amazing when you think of the fact that when people think of the story, their ideas come from this short and not the Grimm tale. That says quite a bit because the story itself was quite popular before this short but ever since it was released people think of this short when the idea of three little pigs come along. The animation is as great as you'd expect and there's no question that there's a certain flow in the story that just makes it irresistible. Fans of Disney and animation will certainly love and remember this one.",
         "A Walt Disney SILLY SYMPHONY Cartoon Short. Each of THE THREE LITTLE PIGS builds a home from materials that suits his personality. The two lazy porkers choose straw or sticks; the Practical Pig uses sturdy bricks & mortar. His brothers think he's wasted his time - until the Big Bad Wolf shows up... This is one of the all-time great cartoon classics. Lots of attention was lavished on it, and the characterizations & visuals were just right for this version of the old children's tale (notice the sly humor in the details: the picture of `Father'; the piano made of brick; the corkscrewing tails). But the film and its instantly popular tune `Who's Afraid of the Big Bad Wolf?' caught the public's fancy as an inspiration to laugh in the face of the Great Depression, America's own Wolf at the door. This must have come as a surprise to Walt, as he intended the song to underscore the silly pigs' foolishness, not their foolhardy defiance. Be that as it may, the cartoon was a huge commercial success, perhaps the most famous animated short of all time. It easily won the 1933 Academy Award and produced a litter of three sequels, the first of which was THE BIG BAD WOLF (1934). The SILLY SYMPHONIES, which Walt Disney produced for a ten year period beginning in 1929, are among the most fascinating of all animated series. Unlike the Mickey Mouse cartoons in which action was paramount, with the Symphonies the action was made to fit the music. There was little plot in the early Symphonies, which featured lively inanimate objects and anthropomorphic plants & animals, all moving frantically to the soundtrack. Gradually, however, the Symphonies became the school where Walt's animators learned to work with color and began to experiment with plot, characterization & photographic special effects. The pages of Fable & Fairy Tale, Myth & Mother Goose were all mined to provide story lines and even Hollywood's musicals & celebrities were effectively spoofed. It was from this rich soil that Disney's feature-length animation was to spring. In 1939, with SNOW WHITE successfully behind him and PINOCCHIO & FANTASIA on the near horizon, Walt phased out the SILLY SYMPHONIES; they had run their course & served their purpose.",
         "This short assumed a symbolism that few cartoons do as America stumbled through the Great Depression of the 1930's. \"Who's afraid of the Big Bad Wolf?\" was false bravado for many Americans who were losing their jobs and homes. I remember hearing this short as well as seeing it. Our school had an audio version of it.",
         "We've all seen this a hundred times. The lazy pigs build houses of straw and sticks and fool around, singing that song. Meanwhile, the practical third one is putting up a brick building. The wolf is lurking and has pork chops on his mind. After accosting the first two pigs, he must make it past the door of the third little pig. The animation is wonderful. This is Disney and it is pristine, far superior to other efforts at that time. There is a great deal of humor, particularly related to the arrogant bragging of the first two pigs. The wolf is a sight to behold. He is obviously born of poverty, but more of a symbol of the threat that faced those who had little in 1933. Disney was just getting his chops in the animation business and the rest is history.",
         "This should be the lesson to the two foolish pigs who were constantly singing and joking around instead of working like their brother. His dedication saved everybody in the end in this Academy Award winning 8-minute cartoon from over 80 years ago. Of course, it's done by Walt Disney and Pinto Colvig and Billy Bletcher are voice acting legends from the first half of the 20th century. This is a fairly famous short film from the old days, maybe also because the wolf is so wonderfully scary. Admittedly, I did not find his costume fake tactics too interesting, but when he started to huff and puff, my eyes were glued to the screen. And back on the pigs, their family photos at the smart pig's wall were really epic. Oh by the way, there are a handful sequels to this short film out there. Check them out if you enjoyed this original. \"Three Little Pigs\" is a decent watch. Not among Disney's very best, but still recommended.",
         "I remember as a kid reading and flipping thru the pages of the classic storybook \"Three Little Pigs\". I highly enjoyed it as it taught good moral lessons of hard work, courage, and to be prepared and ready when danger strikes always be alert! I as a kid was even afraid of the big bad wolf! So it was a real treat when I just recently watched the 8 minute Disney short. It's one of Disney's best animated classics. It moves along beautifully by the sounds and singing of the three pigs saying \"Who's Afraid of the big bad wolf\"? And remember I'll huff and puff and blow down your house! Anyway the wicked wolf begins his journey thru the wooded landscape towards the pigs dwellings. And the first two pigs who are both laid back and take things as a joke clearly are not concerned with the wolf and both put up their new homes. One made of straw the other of sticks, yet after the wolf huffs and puffs and blows down their houses, the two seek shelter and protection with their brother the third pig and this serious and hard working swine very wisely made his home of bricks! So no matter how much huffing and puffing this house will not be blown down. Overall this is one great memorable classic a Disney favorite it teaches the morals that can be applied in life like being clever, and smart plus with a little hard work one will be protected as you will not fall prey to the evil traps and destruction of your shelter! \"Three Little Pigs\" is an entertaining classic and educational for the lessons it teaches.",
         "I remember first watching this before Pollyanna on \"The Wonderful World of Disney\" in 1981 and enjoying it so I decided to see this again on YouTube. Still enjoyable and hearing \"Who's Afraid of the Big Bad Wolf\" brings such nice memories of being a child. Did not see the controversial version with the wolf posing as a Jewish peddler with the big nose but that's the only disappoint I got from this. (Just to make this clear: I'm disappointed not because I wanted to see a Jewish stereotype but because I wanted to see this short the way it was originally presented.) Burt Gillett really did a fine job as director with the music and the houses being blown down and the first two pigs still not completely learning their lesson as evidenced by the worker pig doing a trick on them at the end. So with all that said, I highly recommend The Three Little Pigs. Update 3/3/11-I just saw the excised scene on YouTube.",
         "I've seen the second version with the Wolf dressing as a fairy but it is in Japanese and was a gift from my in-laws (my wife is Japanese) to my daughter. It's weird in that it combines the stories of the three little pigs with Little Red Riding Hood with the practical Pig coming to Riding Hood's rescue. This version doesn't have the Jewish Peddler sequence in it. I recently rented another video version which sounds like the one most viewers are commenting on as it does not have the Red Riding Hood sequence. The animation, colour, are excellent and the Wolf is terrifying even as an adult. Something about how Disney drew predators in these early films is extremely effective even today.",
         "A charming cartoon; but you'd never know it if you'd seen the three sequels without seeing the original - as I had. Luckily I know better now. The animation is primitive - about as primitive as in \"Shrek\", although of course more expressive - but unlike \"Shrek\", the character designs promise less, not more, than the animators are capable of delivering. The sequels were made in EXACTLY the same style as the original, but what was state of the art in 1933 was no longer state of the art even in 1934, and you can tell this just from watching one of the sequels, even if you're unaware of the year of its release or the fact that it's a sequel. Obviously, the cartoon struck a chord in 1933 (the popular theory that the Wolf symbolised the Great Depression may well be right) which it doesn't strike today. Good though it is, it's far from being the best of the Silly Symphonies, most of which are truly timeless. It is, perhaps, the one that ushered in Disney's \"high\" period.",
         "As for the censored version the last poster refers to, I've never heard of that, and the supposedly censored version is the one on the new Silly Symphonies DVD. Anyhow, this is one of the most famous of the Silly Symphonies, going so far as to inspire the title for the Edward Albee play (and subsequent Mike Nichols movie) Who's Afraid of Virginia Woolf?. The music just bops in this short, and kids are likely to bop along to it. It's very funny, and very cute. But note the dark little joke in the corner: there is a picture of the pigs' mom and another of their dad. Mom is a sow with piglets suckling on her. Dad, however, is a line of sausages. You might have missed that one if you were not paying attention. Any you definitely missed it if you saw it as a little kid! 10/10.",
         ". . . or is it the sort of Fake News carefully crafted to mold the minds of Young America into brains full of mush, like every word emanating from the White House in 2017? Teaching moments are few and far between early on during THREE LITTLE PIGS. For instance, the so-called \"Practical Pig\" sings \"I have no chance to sing and dance, for work and play don't mix.\" If his sentiment is True, then WHY is he SINGING and DANCING?! At 2:41 the Big Bad Wolf prances into the picture wearing red pants with green suspenders. Always conscious of the potential coterie of Disney Princess Wannabes, Walt finally yanks out his teaching pointer 6:57 into THREE LITTLE PIGS. America long has associated the most deplorable incorrigible wolves (think White House Occupant Trump's infamous ACCE$$ H0LLYWOOD confessions) with Sexual Assault and Forcible Oral Penetration. So how does Mr. Disney suggest to young would-be princesses proper preparation for a Wolf's Big BJ? By dropping his drawers, of course! Though this climactic scene is totally illogical in a literal sense for anyone equipped with suspenders, it's completely in line with the subversive intent of the smutty Disney perverts!",
         "When a hungry wolf starts blowing down some pigs' houses, they take refuge in their sensible brother's brick house. In many ways, this film is the definitive version of the three little pigs story. I suspect (though I may be wrong) that this was the first time \"Who's Afraid of the Bid Bad Wolf\" was ever sung, or at least sun on film. This had to be influential, because we still sing the song today (2015). I am a bit sad the anti-Semitic part has been cut. I mean, of course I understand why. But it seems that for historical purposes it ought to be kept in. We like to think that the only people who were anti-Semitic in the 1930s were the Germans, but that is not close to the truth. Americans were in many ways just as bad.",
         "This is an adorable Disney cartoon short of the classic story-time tale, \"The Three Little Pigs.\" It is the only adaptation of the tale I've remember seeing on TV and is, what I think, still one of the most recognizable animated features in history. Just like the storybook, you get to see the three little pigs set out on their own in the countryside, each building their homes of straw, twigs and bricks. The latter was the most sturdy and strong as it could withstand the Big Bad Wolf's fiery breath. And, you get to see the three little pigs try to outsmart the wolf at the very end. This cartoon short features one of the most famous children's songs, \"Who's Afraid of the Big Bad Wolf,\" sung by the pigs as they deal with the wolf. Once you've listened to it, it will etch in your mind for a long time - very spirited and lively. It's a timeless cartoon that will certainly entertain children for years to come. Grade A",
         "Who is afraid of the Big Bad Wolf? The wolf resplendent with a German accent and this wolf cubs is after some porkers for dinner. He already runs intensive tuition classes on porcine butchery. No better cuts can be had done two dumb pigs who think needlessly blowing the wolf warning horn is good for a laugh to annoy their older and clever brother. Warner Brothers may had the Merrie Melodies and Disney had the rival Silly Symphonies, cartoon shorts with action that fitted the music. The wolf and his offspring might be cunning in enticing the two little pigs but beware the third pig is the wolf terminator, he is certainly not afraid of the big bad wolf.",
         "The animation on this 1933 Disney cartoon is bright and colorful, but typically choppy of the vintage. There is absolutely nothing here that you wouldn't expect from the title. Three pigs build houses of various architecture (the one who builds his house from wood is dressed like Donald Duck for some reason) while a hungry wolf attempts to blag his way in to eat them. Personally I'd rather see the pigs get gobbled up and the wolf get his dinner, but that's just me. How can kids side with the pigs and yet eat bacon themselves? The wolf even disguises himself as a stereotypical Jewish salesman at one point. I can't imagine anyone getting away with that now in these over sensitive times. Forgettable.",
         "Disney's THE THREE LITTLE PIGS is a classic and I remember watching and loving it as a child. In some ways the film isn't as good as I remember and in other ways it's far more impressive. As far as the story goes, it's much more tame than I'd remembered and this was disappointing. According to the older story by Grimm, after the two foolish pigs' homes are destroyed, they are eaten AND when the wolf goes down the chimney, he is made into stew and eaten by the wise pig!! I was actually hoping for this, as the tame Disney version didn't appeal as much to the sadistic child living within me! However, even with an overly tame approach, there is still a lot to love about the film. In particular, I marveled at the newly restored print as the colors are so vivid and inviting. Additionally, as a child I never noticed that the artwork was simply amazing--especially the great painted backgrounds. It's nearly the equal of the later full-length films such as SNOW WHITE or PINOCCHIO--it's that good. Overall, it's a lovely little film that will appeal to all but mostly to kids. Unfortunately, I don't know of any gritty versions available today because too many parents are afraid it'll traumatize the kids. What's wrong with a little trauma?! Give me the moralistic and bloodier version every time! By the way, a decade later, Looney Tunes essentially stole the idea of this cartoon in the form of PIGS IN A POLKA. However, despite being Oscar nominated, PIGS IN A POLKA isn't nearly the film THE THREE LITTLE PIGS and never gained classic status.",
         "You know the basic story, the practical hardworking pig builds his house with bricks and mortar; one lazy buddy uses sticks and the other uses straw. Then when the time comes to keep out the Big Bad Wolf everyone heads to the brick house. It's an old fable and Disney wisely altered the original story where the wolf eats the two lazy pigs and is eaten by the remaining pig after falling into boiling water. \"The Three Little Pigs\" was the 36th cartoon in Disney's \"Silly Symphony\" series and came just a year after \"Flowers and Trees\" forever changed the animation industry by introducing the first Technicolor cartoon. Technicolor was a process where three separate negatives (each a primary color) were combined to produce a color print. It took a while to perfect it for live action so it was first utilized for animation. \"The Three Little Pigs\" was the most popular cartoon in history, on many theater marquees it was billed above the feature film. Disney had a two year exclusive on the use of the Technicolor process and had one animator work on giving each pig a distinct personality while another animator created the wolf. Frank Churchill wrote the \"Big Bad Wolf\" song, which unexpectedly became a monster hit-Disney's first published song. The wolf at the door was considered the symbol of the Depression and the song became a national rallying cry. Disney would follow it up with three other attempts: \"The Big Bad Wolf\", \"Three Little Wolves\", and \"The Practical Pig\". None were nearly as successful as the original and Walt is said to have repeatedly stated: \"You can't top pigs with pigs.\" Then again, what do I know? I'm only a child.",
         "\"The two pigs building houses of hay and sticks scoff at their brother, building the brick house. But when the wolf comes around and blows their houses down (after trickery like dressing as a foundling sheep fails), they run to their brother's house. And throughout, they sing the classic song, \"Who's Afraid of the Big Bad Wolf?\". it's pretty good classic animation movie one of the greatest of all time without a question i think.wolf is pretty funny there and pigs are funny too.i recommend it strongly,but i can completely understand why some guys wouldn't ,because there is no style,but it's funny all the way and i still recommend it's classical movie one all time best animation films.",
         "This is one of Disney's best works and the song, \"Who's Afraid of the Big Bad Wolf?\" had an attitude that went over quite well with the public during the Depression, selling heavily itself. There were sequels with the Pigs and they even did their bit for the war effort in the 1940's. I wonder if Mickey got jealous? Very well-executed and thankfully in-print. Highly recommended."
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy",
         "Family",
         "Musical"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "The two pigs building houses of hay and sticks scoff at their brother, building the brick house. But when the wolf comes around and blows their houses down (after trickery like dressing as a foundling sheep fails), they run to their brother's house. And throughout, they sing the classic song, \"Who's Afraid of the Big Bad Wolf?\".",
         "When a hungry wolf starts blowing down some pigs' houses, they take refuge in their sensible brother's brick house."
      ],
      "budget": 15720
   },
   "movielensId": 136501,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1933-05-27",
      "dvdReleaseDate": null,
      "directors": ["Burt Gillett"],
      "runtime": 8,
      "movieId": 136501,
      "title": "Three Little Pigs",
      "mpaa": "NR",
      "actors": [
         "Billy Bletcher",
         "Pinto Colvig",
         "Dorothy Compton",
         "Mary Moder"
      ],
      "imdbMovieId": "0024660",
      "originalTitle": "Three Little Pigs",
      "genres": [
         "Music",
         "Animation",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The two pigs building houses of hay and sticks scoff at their brother, building the brick house. But when the wolf comes around and blows their houses down (after trickery like dressing as a foundling sheep fails), they run to their brother's house. And throughout, they sing the classic song, \"Who's Afraid of the Big Bad Wolf?\".",
      "tmdbMovieId": 34463,
      "avgRating": 3.13636,
      "releaseYear": "1933",
      "numRatings": 33,
      "posterPath": "/aPmSY3y4A2xMSkF24tdIfDQNKJy.jpg"
   }
}