{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "scotland",
            "id": 388
         },
         {
            "name": "confession",
            "id": 718
         },
         {
            "name": "police brutality",
            "id": 796
         },
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "night shift",
            "id": 4225
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "psychopath",
            "id": 6259
         },
         {
            "name": "blood splatter",
            "id": 8636
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "arson",
            "id": 11363
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "police station",
            "id": 15321
         },
         {
            "name": "drunk driving",
            "id": 155232
         },
         {
            "name": "stranger",
            "id": 156104
         },
         {
            "name": "jail cell",
            "id": 156257
         }
      ],
      "imdb_id": "tt3148348",
      "video": false,
      "title": "Let Us Prey",
      "recommendations": [
         265010,
         296065,
         174678,
         258086,
         132064,
         157115,
         92395,
         13220,
         121606,
         294308,
         257117,
         254193,
         279968,
         244610,
         291865,
         287084,
         18029,
         47763,
         257874,
         354220
      ],
      "backdrop_path": "/6y5s5XboARsaZARPBO9L3oYM9Bl.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5662960cc3a3682c01002c93",
         "content": "The number of the beast?\r\n\r\nAn apparent victim of a hit and run, a mysterious stranger is held at a remote police station and starts to take over the emotional state of staff and inmates alike.\r\n\r\nIt's not a new premise, something which is being held against Brian O'Malley's film like it's a crime, but the execution, the technical guile, and atmospheric touches brought to the piece, mark this out as a horror film of some merit. Boosted by having the great Liam Cunningham in the lead role, it's a film that shocks and awes with each passing chapter. It revels in the bloody aspects that unfold, positioning the vile nature that some human's are prone to right at the forefront, and with bloody impact. \r\n\r\nPiers McGrail's cinematography is superb, the bold and beautiful shine of the blues and golden browns mingle disconcertingly with the down and dirty feel of the police cells, the latter of which appropriately marry up with the characters on show. Steve Lynch's score is a treat, a real nerve bothering piece of work, gnawing away at the senses in the same way that Cunningham's character tugs away at the emotional conditions of his prey. It's a film of many pleasures for the so inclined, it does get away from itself a little at the end, asking a little too much of the viewer, but it doesn't kill the pic and this is very much a horror necklace worth wearing on a night out. 7/10",
         "url": "https://www.themoviedb.org/review/5662960cc3a3682c01002c93"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Six",
               "gender": 2,
               "credit_id": "53a80f7ac3a3687a310051d9",
               "name": "Liam Cunningham",
               "profile_path": "/8RMX0M8AEaldVAC6WUJIViUdDkm.jpg",
               "id": 15498,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Dr. Duncan Hume",
               "gender": 0,
               "credit_id": "53a80f91c3a3687a2e00520e",
               "name": "Niall Greig Fulton",
               "profile_path": "/jVbIWnCYirZqprAh0RTW9SWE6XW.jpg",
               "id": 122648,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "PC. Rachel Heggie",
               "gender": 1,
               "credit_id": "53a80fccc3a3687a3400517b",
               "name": "Pollyanna McIntosh",
               "profile_path": "/u1T42rrc26kGDfwmE6jCVtiH04v.jpg",
               "id": 92730,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Sgt. MacReady",
               "gender": 2,
               "credit_id": "53a80fe2c3a368707a004420",
               "name": "Douglas Russell",
               "profile_path": "/hks9pNX0BBa3YbkXkamKkbU1e28.jpg",
               "id": 119095,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "PC. Jack Warnock",
               "gender": 2,
               "credit_id": "551690dfc3a3683489001094",
               "name": "Bryan Larkin",
               "profile_path": "/oVqPGi5bJWs2F95HdlhRUfzekhl.jpg",
               "id": 567086,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "PC. Jennifer Mundie",
               "gender": 0,
               "credit_id": "551690fcc3a368348c00109b",
               "name": "Hanna Stanbridge",
               "profile_path": null,
               "id": 1446564,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Ralph Beswick",
               "gender": 0,
               "credit_id": "551691199251414ec900098b",
               "name": "Jonathan Watson",
               "profile_path": null,
               "id": 928939,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Caesar Sargison",
               "gender": 2,
               "credit_id": "55169131c3a368348900109c",
               "name": "Brian Vernel",
               "profile_path": "/xvC5diN35LZrF1Q4uIpaZYGTpiO.jpg",
               "id": 1446565,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Mulvey",
               "gender": 2,
               "credit_id": "5516913e9251413eb2001145",
               "name": "James McCreadie",
               "profile_path": null,
               "id": 1446566,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5415f2360e0a261c380027d0",
               "name": "Brian O'Malley",
               "profile_path": null,
               "id": 1364023,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55128028c3a36801bb0033c2",
               "name": "David Cairns",
               "profile_path": null,
               "id": 1032588,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55128037925141065c00923a",
               "name": "Fiona Watson",
               "profile_path": null,
               "id": 1445468,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55169153c3a368348f000fa0",
               "name": "Eddie Dick",
               "profile_path": null,
               "id": 55363,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "551692e8c3a36834890010d2",
               "name": "John McDonnell",
               "profile_path": null,
               "id": 63371,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "551692f7c3a368347d0011f9",
               "name": "Lee Brazier",
               "profile_path": null,
               "id": 1103577,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "55169304c3a368347d0011fb",
               "name": "James Daly",
               "profile_path": "/teh0iQXccF0zQgj1glAb2QQHKo6.jpg",
               "id": 13259,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "551693149251417f4e000ec6",
               "name": "Chris Hainsworth",
               "profile_path": null,
               "id": 1103579,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5516931dc3a36834890010da",
               "name": "Nick Munday",
               "profile_path": null,
               "id": 1446584,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "55169329c3a36834850011c6",
               "name": "Steve Lynch",
               "profile_path": null,
               "id": 1446585,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55169335c3a36834820010b2",
               "name": "Piers McGrail",
               "profile_path": null,
               "id": 1108141,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55169349c3a36834820010b5",
               "name": "Tony Kearns",
               "profile_path": null,
               "id": 1084985,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55169355c3a368347f001086",
               "name": "Alison Crosbie",
               "profile_path": null,
               "id": 1392738,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "55169363c3a368347f001089",
               "name": "James Lapsley",
               "profile_path": null,
               "id": 1037754,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "551693729251413eaf0010a1",
               "name": "Jamie MacWilliam",
               "profile_path": null,
               "id": 1308522,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "551bec8bc3a368474e00105a",
               "name": "Brendan McCarthy",
               "profile_path": null,
               "id": 43145,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 6.619946,
      "production_countries": [
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 276488,
      "vote_count": 129,
      "budget": 0,
      "overview": "Rachel, a rookie cop, is about to begin her first night shift in a neglected police station in a Scottish, backwater town. The kind of place where the tide has gone out and stranded a motley bunch of the aimless, the forgotten, the bitter-and-twisted who all think that, really, they deserve to be somewhere else. They all think they're there by accident and that, with a little luck, life is going to get better. Wrong, on both counts. Six is about to arrive - and All Hell Will Break Loose!",
      "similar": [
         984,
         357096,
         123109,
         15069,
         8090,
         12619,
         2832,
         10285,
         238636,
         445954,
         21484,
         9411,
         30833,
         10651,
         10781,
         2749,
         1696,
         49797,
         18587,
         26390
      ],
      "original_title": "Let Us Prey",
      "runtime": 88,
      "poster_path": "/lNv3xVngqW1W9CsdmDlLIH4MNNO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Greenhouse Media Investment",
            "id": 47348,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Makar Productions",
            "id": 2446,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fantastic Films",
            "id": 18078,
            "origin_country": ""
         }
      ],
      "release_date": "2014-04-17",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Darkness Shall Rise",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Brian O'Malley"],
      "runtime": 92,
      "synopsis": "Eerie images of a raven flying by. Title credits. A man whistling. PC. Rachel Heggie (Pollyanna McIntosh) wakes up from her nightmare right before her alarmclock rings. She finds a raven feather in her bed. She just does her morning work out, and we can see scars from long ago in her body. She leaves the cheap hotel room where she lives for work and when she is walking away, we can see the light turning on in her room and the silhouette of a man inside. Images of a reckless driver. Rachel sees a man and a raven feather falls from him. The young driver, who is going way too fast, cannot stop to a halt and runs over the mysterious man. The young driver, Ceaser Sargison (Brian Vernel) gets off his car saying \"Not again, please\", but the man is nowhere to be seen. Rachel arrests him, leaving the car stranded in the middle of the deserted street. Sgt. Gene MacReady (Douglas Russell) turns off the computer and says that the young driver is a well-known \"customer\". He elbows the driver on the stomach, and he throws up on Rachel's shoes, which she finds disgusting. Meanwhile, two adults are having wild sex in a car. He is married, and she finds exciting when he calls her \"bitch\". She slaps him but they do it again. They are Police Officers as well: PC. Jack Warnock (Bryan Larkin) and PC. Jennifer \"Jen\" Mundie (Hanna Stanbridge). Caesar was carrying a knife. Jack and Jennifer look for the man, and Rachelf says that there was blood on the headlights of the car, but it looks like it was from a previous victim. The two PC stop by an oil station for some coffee. Caesar is put in a cell but he remains cocky. He tells to another prisoner that he is witness to the rough treatment he's getting, but the other prisoner, called Ralph Beswick (Jonathan Watson), says that he hasn't seen anything. They speak of a battered lady who always retire her charges. Six (Liam Cunnigham) is taken to the police station, but he won't speak at all. He just stares at Rachel. Warnock says that it's the uniform what attracts him. Dr. Duncan Hume (Niall Greig Fulton) checks on the man, and he says that he only has superficial wounds. Six has no phone, no keys, no documents, no money... only a black book with names and strange symbols. He speaks, the lights go off and Dr Hume has a vision of himself arriving home, walls bleeding and him running terrified. Dr Hume says. \"He knows.\" When he is asked what, he says \"He knows everything.\" and tries to kill him. Rachel has to put the doctor in a cell. Beswick mocks Duncan, and Ceasar shows off that he was only looking for something to impress his friends. Six's fingerprints are checked. He says \"sticky little fingers\" and opens and close his hands. Crows cover Ceasar's abandoned red car. Alexander Russell - that's Six - died in 1883 in Glasgow in a fight. MacReady blames it on a computer mistake. Six says that he can smell revenge. MacReady sees images of doors closing up that make him cranky and nervous. Six, Ceasar, Duncan and Beswick are all in their own solitary cell. Rachel sees herself as a young woman (Sophie Stephanie Farmer) tied to a bed, crying. Jennifer remembers as well and has to leave, almost choking and feeling suffocated. She sees images of herself taking revenge vilently and almost choking. Six gives Rachel the cell keys that had fallen to the floor. When he is on his own, Six asks aloud, \"So, who goes first?\" Jennifer tells Rachel that they are no friends, and to mind her own business. The Sergeant leaves, letting the three PC with the prisoners, but Jen and Jack are leaving as well, so it will be Rachel on her own. It's 22:10. The Sergeant is driving like crazy and he thinks he has seen Six on the backseat, with white eyes. He drinks while driving, and a blooddied arm appears for half a second by the side of the road. Beswick wonders why Six knows his name. Rachel remembers being raped. She controls herself and takes a look at the black book. She checks on David Brundrige (AKA Acid Bath Murderer), Bryan Hefflington (AKA The Whale), another serial killer. There are more, but they are all deceased. Whatever Six does, it affects Beswick, the wife-beater. Six lights a match, and the shadow of a hand appears threateningly. The monitor of the CCTV goes to blank, and the radio sounds so that Rachel doesn't check on the prisoners. She tells Jack and Jen to enter Beswick's home to check on his wife. An alarm is pounding while Beswick hits himself against the door until he is a bloody mess. Ceasar says that Beswick tried to kill him. Rachel lets him out and Beswick falls to the ground. Duncan says that he can help him. Jack and Jen find out something. Rachel lets Duncan out so that he can help Beswick. Jen and Jack find the corpse of the deceased wife of Beswick, which has been left hanging to death. MakReady is also trying to get rid of a body - it is a bloodied young man who used to be his lover, Mulvey (Jim McCreadie). He drank and killed him with his bear hands. Jen and Jack are shocked with their discovery. Duncan becomes threatening and creepy; Rachel hits him while she feels dizzy and confused by her own visions of Dr. Hume's intentions - it looks like he's also a psychopath, having killed his wife (Kate Gisbourne) and children (Max McCarthy & Ellen Keaveney). MacReady is trying to get rid of his ex-lover's body, and he is scared by his own vision of Six, just staring at him. Six can make a match float. He replies back that all the devils are in this police station when Rachel tells him \"Go to hell\". Rachel tries to leave, but Six whistles what Rachel's raper used to whistle while he was having sex with her. Finally, the young Rachel gets free and slowly walks away and runs from that everyday-looking house. Rachel tries to compose herself and hold back her tears. MacReady speaks to Rachel sitting on a bed with blood-stained sheets. He also picks up a shotgun from under the bed. Duncan is also justifying himself, saying that patients die all the time of natural causes. Six says that \"he is giving Caesar a last chance to remember\". He had run over an already bloodied lady (Holly Beattie). The accident left her worse, but he could have saved her if he had taken her to hospital. Instead, he ran away. It's 23:19. Rachel pushes away a crossword with the word DEATH on it. She is still checking on that black book of Six's. Jen and Jack return. Beswick's body is under a blanket. Jen swears a lot and is angry. Six stares at Caesar, who wants to make a confession to Jen and Rachel, but they are too busy and Jen tells Caesar to shut the fuck up. Six says that he's in the business of retribution, not salvation. Rachel paces up and down trying to make sense of it all. Dr. Hume says that he found a \"higher calling\". Six suggests hanging himself. The black book opens at Warnock's page. He appears to beat and kill a prisoner, pushed by Six, who stings himself with a match, which now looks more like a nail. Warnock justifies the murder of the prisoner. Jack and Jen defend that murder, saying that they \"take care of our own\". Rachel gives in, but is really distraught. Caesar confesses to Rachel. Six says that the girl died two minutes before. Rachel saw Six from the window of the room where she was kept. Rachel hears Jen saying that she was having sex with Jack and trying to make plausible tales. She interrupts them so that they can't make out. It's 23:41. Jen and Jack attack Rachel, but she puts up a good fight. Jack tries to strangle her, but then MacReady appears, dressed with barbed wire and shooting everybody on sight. Jack is dead. Jen and Rachel lock themselves and hurt MacReady, who now is limping. MacReady smashes the door and shoots Jen, who can still run away with Rachel. Six compliments Rachel on her body. He has decided to take matters on his own hands because of humanity's sins. Outside, MacReady is surrounding the station with petrol and then sets fire to it. It's 23:52. Rachel opens the cells of Six and Caesar. Six says \"Thanks, but I think I can handle him.\" MacReady shoots at fleeing Rachel, Caesar and Jen but fails. Jen is killed by the broken glass at a door. Six stays quiet at his cell. MacReady shoots Rachel at a shoulder and kills Caesar. Six is still calm. MacReady is still alive although he's very burnt. Rachel kills him. Rachel leaves the police station and falls to the floor. After her, Six slowly walks out as well and offers her a cigarette. It's 0:00. It's at that moment when Six collects the souls of the sinners. He crosses them out from his book. Ravens crooning is heard. Six wants Rachel to help him. Six had knocked on Rachel's torturer (Andrew Parker)'s door, and he was a witness of Rachel's fiery survivor spirit. Six says that he will be complete with Rachel. Rachel says \"yes\" to help him on his tasks. The kiss against the background of the burning police station. \"That's my girl\", he says. A raven is heard. Steve Lynch's music, fade to black and end credits. [I have completed the list of minor performers checking the end credits of the film.]",
      "writers": [
         "Fiona Watson",
         "David Cairns"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3148348/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTYxNzk2Mjk5Nl5BMl5BanBnXkFtZTgwNTIxNjY3NDE@._V1_UY268_CR9,0,182,268_AL_.jpg",
      "actors": [
         "Liam Cunningham",
         "Pollyanna McIntosh",
         "Bryan Larkin"
      ],
      "reviews": [
         "A mysterious man hands himself into a police station in small town one night. It soon appears that he seems to know about the inner demons of everyone there, the cops and prisoners alike. All of these individuals have dark secrets it seems and the mystery man is the catalyst that brings them to the fore and drives them to further depravity and violence. Let Us Prey is one of a small group of horror films set in Scotland. As it happens, two of its stars featured prominently in a couple of the other most notable Scottish set horrors of the last few years, namely Liam Cunningham who appeared in Dog Soldiers and Hanna Stanbridge so impressive as one of the main characters in The Outcast. In this one Cunningham has the central role of the mysterious demonic stranger, while Stanbridge gets to sink her teeth into a role of a female cop with a penchant for violence. She is not the only strong female character here though; Pollyanna McIntosh plays the other policewoman and is in fact the lead character to all intents and purposes. It is refreshing to have a genre picture give women more central roles; I have no idea why it doesn't happen more often. As it is McIntosh's cop is on her first night at this remote police station, the very night when things go horribly wrong. In this respect, the influence of John Carpenter's Assault on Precinct 13 is pretty obvious. In addition, the electronic soundtrack used here sounds very Carpenteresque too, which was also nice. It's a pretty modest production but it makes the most of what it has. The cast all acquit themselves very well and make the most of their characters. The direction is pacey and nicely stylised in places. I particularly liked the opening credit sequence with images of giant waves and sinister ravens. It maybe could be argued that the film doesn't perhaps ultimately go into as interesting places as it promises it might and it does get a little generic towards the end. But it is still different enough to ensure it is interesting. It also has the distinction of having a central demonic villain who is not one dimensionally evil; he's just a guy with a job to do.",
         "Let Us Prey features a police station in a ghost town. Literally. You cannot find any people in this town making you wonder what these idiots are policing. Regardless, a stranger played by Liam Cunningham (Ser Davos from Game of Thrones) appears in the police station and sets off a chain of events which results in everyone in the station confronting/unleashing (mostly the latter) their inner demons. And boy are those demons nasty or what! The film is not that scary but it is quite fun and has a good sense of humor. It also has good performances from Cunningham and Pollyanna McIntosh as a likable rookie named Rachel. Also in the mix are a gallery of interesting, if not likable characters such as a really creepy sergeant, his two vengeful subordinates alongside Rachel, a (not so) slightly unstable doctor, a grammar Nazi wife-beater and a drunk-driving teen. Overall, the movie is quite fun with a delightfully nutty climax. The 5.9 rating is a bit too low. Do give it a look!",
         "An apparent victim of a hit and run, a mysterious stranger is held at a remote police station and starts to take over the emotional state of staff and inmates alike. It's not a new premise, something which is being held against Brian O'Malley's film like it's a crime, but the execution, the technical guile, and atmospheric touches brought to the piece, mark this out as a horror film of some merit. Boosted by having the great Liam Cunningham in the lead role, it's a film that shocks and awes with each passing chapter. It revels in the bloody aspects that unfold, positioning the vile nature that some human's are prone to right at the forefront, and with bloody impact. Piers McGrail's cinematography is superb, the bold and beautiful shine of the blues and golden browns mingle disconcertingly with the down and dirty feel of the police cells, the latter of which appropriately marry up with the characters on show. Steve Lynch's score is a treat, a real nerve bothering piece of work, gnawing away at the senses in the same way that Cunningham's character tugs away at the emotional conditions of his prey. It's a film of many pleasures for the so inclined, it does get away from itself a little at the end, asking a little too much of the viewer, but it doesn't kill the pic and this is very much a horror necklace worth wearing on a night out. 7/10",
         "When director Brian O'Malley introduced his new film, Let Us Prey, via a prerecording in front of the Toronto After Dark Film Festival he informed us that his intention was to make a timeless horror classic. To accomplish this, he set on out to deliver a film that could not be dated (watching Let Us Prey ten years from now and there is nothing in the fashion, look or feel of the film that would immediately reference 2014) and that had a synthesizer styled score reminiscent of the great John Carpenter films of the 1970's and 80's. Check and check. Let Us Prey stars Liam Cunningham (Game of Thrones) as Six, a mysterious drifter who is hit by a vehicle driven by Caesar (Brian Vernel) on a quiet town road. Casear is immediately taken into custody by first-day-on-the-job Constable Rachel Heggie (Pollyanna McIntosh), but Cunningham's Six character cryptically disappears. It is while at the police station we are introduced to the remainder of the cast which includes a Sargent, two Constables that are lustfully engaged, a wife beating prisoner and a doctor who is called to assist when Six suddenly appears at the front door of the station. The veteran Constables and Sargent do not immediately warm up to the by-the-book newbie in Rachel, but their personal feelings towards her routine are quickly swept to the side once Six begins to instigate mayhem in the prison taking over the minds and souls of all those with a dark past to hide. And this is when the fun really starts. Each character shows a history of violence in their backstories from the simple (hit and run) to the extreme (mass murderer) and when a prior transgression is revealed, Six is there to ensure their life pays for their wrongdoing. With a backdrop of a fantastic musical score (as promised) there are fights, shootings, beatings, murders and attempted murders as things at the station escalate quickly and deadly for all those involved. Cunningham is a standout and plays the mysterious Six with devilish glee. The film hinges on Cunningham's character and the well-trained thespian delivers the goods with a Clint Eastwood cool. Pollyanna McIntosh is equal to the task as the freshman fish-out-of-water new Constable. She is equally beautiful and tough and McIntosh walks this line with the ease of a veteran. The story goes a bit off the rails towards the end as some of the character's revealed background stories and subsequent actions are a bit 'out there'. But it is a means to an end to heighten the violence and give the audience the good time expected from the action/horror intention. Let Us Prey was a surprise delight and the perfect way to begin winding down the Toronto After Dark Film Festival. It was violent and fun and the ending opened the door to a multitude of possibilities and, hopefully, sequels. www.killerreviews.com",
         "... I've decided this was quite good. I'm hovering between a 7 and 8. At first my main thought was \"Meh. So Judaeo-Christian-specific that this atheist cannot find a thing scary about it.\" However, even if it is within that tradition, it does some surprisingly daring and fresh things inside of it. This is a movie with ambitions, and it is stylish enough and solidly-acted enough to pull most of them off. I particularly liked the performances by the two leads. Both roles could have easily led to lots and lots of scenery-chewing, but neither Cunningham nor McIntosh go this easy and tired route: they are both subtle, varied and positively aces, as is Douglas Russell as the feral Sgt. MacReady (his role does call for some scenery chewing, and he does it well). I absolutely adored the ending. Kudos.",
         "The plot of \"Let Us Prey\" might very well be derivative and predictable (I can already list at least 5 similar titles without even thinking too hard), but debuting writer/director Brian O'Malley nevertheless managed to deliver a compelling, brutal and sinisterly atmospheric horror/thriller. Straight from the eerie opening sequences – with a particular fascination for black birds, by the way – you'll immediately notice that O'Malley must be a tremendous genre lover and definitely knows the classics. The script borrows all kind of ideas and elements from different horror sub genres, from raw 70's grindhouse features to grotesquely silly 80's slashers, but somehow everything neatly and coherently interweaves into a tense and gruesome little film. Liam Cunningham, the extremely charismatic and marvelous actor who previously starred in \"Dog Soldiers\" and Dario Argento's \"The Card Player\", is well-cast as the mysterious stranger (complete with beard and clichéd long raincoat) who comes wandering into the police precinct of a quiet and remote Irish community. He seems to know an awful lot about the darkest secrets of everyone that is there – cops as well as petty criminals – and clearly intents to penalize them and mess up their minds beyond repair. It's up to Constable Rachel Heggie, on her very first night at a new location, to deal with the overload of maniacal tendencies that suddenly come to the surface. The Brussels International Festival of Fantastic Films promoted \"Let Us Prey\" as a – and I quote – demonic version of John Carpenter's \"Assault on Precinct 13\". That is actually a rather apt description, and I can also add the film is properly produced and brings forward impressive special effects, make-up art and a handful of cool stunts. The primarily stern plot makes a couple of absurd loops near the end, including the most derailed serial killer in recent cinema history, and admirers of harsh violence and explicit slaughter certainly won't be disappointed. Cunningham receives good and solid support from the rest of the cast, including powerful females Pollyanna McIntosh (watch \"The Woman\" if you dare) and Hanna Stanbridge, whom I already admired in the obscure \"Outcast\" and whose accent makes Irish sound like the sexiest language on earth.",
         "Wow, I REALLY liked this film! I could tell Immediately that I liked the feel of it. The first several shots alone are to die for. Seriously, they were stunning and beautiful. I instantly liked the soundtrack, the cinematography, and the tone that the director set for the film. I could tell right away that this was my kind of movie. Even the lighting of the main street was exquisite and reminded me a LOT of the way Bava would light his sets with otherworldly blues and reds, setting the perfect tone for this Good vs. Evil 'Morality' tale. Nicely done... I have always liked religiously themed Horror films. I really dig the Prophetic or Biblically based stuff (movies like 'THE PROPHECY' or 'THE SEVENTH SIGN', for example) Although this film isn't as overtly religious as those, it is based upon similar themes. What I felt made this movie particularly intriguing was that it didn't treat the Good vs. Evil theme in the usual way that a lot of these types of films do, but it added more dimension and complexity in portraying 'Evil' more from the angle of Retribution or Punishment, which is a little different. This movie had PRECISELY just the right tone that I really like with Horror films. It was stylized, but with just the right balance to give it an entertaining 'Punch' and yet, not so much (or so stupidly self-conscious) as to overdo it and ruin it, as happens often in many of today's Horror films. I am not familiar with this director, but I REALLY loved his approach to the material. He kept a good, tense edge on the proceedings, but allowed himself nice touches of style here and there. There were a few really effective jump scares too. Just one thing... And this is just MY personal preference. But, what the HELL is the point of showing extended scenes of people brutally beating on others. Why...? It's mindless with absolutely NO entertainment value. It's not creative or clever in any way. Are we supposed to 'Get Off' on it...? In my lowly and wretched opinion, it's just pure, stupid brutality. BUT... other than FFing through just a few of these pointless and repetitive scenes, I truly found the film overall to be done very well and the acting was quite good. Just for my taste, I felt the violence was a little too much. To me, the story and atmosphere were strong enough not to needlessly rub our faces in the extreme violence so much. I think that so much of it begins to detract from the true strength of the film, which is NOT 'Torture Porn', but a strong, atmospheric Morality tale. If you like your Horror films with a slight fanciful touch or based on religious themes, or more basically in this case a kind of Good vs. Evil morality tale, and you like a director who adds a REALLY nice artistic tonal style to the story, then I think you might find this clever and well written Horror film quite entertaining...",
         "Well developed characters, good casting, articulate script, well acted, well directed - particularly the flashbacks which are too often a weak point, and produced adequately if cost effectively, provide us with an unexpected gem, and one of the best in the genre in the past five years. Little things matter. Loved the barbed wire work throughout. The director does not overindulge the characters or the actors. And conversely, he still retains sufficient bloodiness to invoke our primitive emotions and symbolism without trying to shock us with something new - the story is the story after all, and it's a character's journey. And he respects us along the way. One of the things that struck me repeatedly, was the difference between the British and American acting schools, and just how much better suited the British technique is for presenting the internal moral conflict necessary for good horror. Thought still exists in such characters, where Americans favor the senselessness of the raw nerve. As if honest acting somehow prohibits rational moral conflict, and self reflection. The director proves it's still possible to still produce a moral movie, a moral horror movie, in the western tradition of our pagan fairy tales and Christian horror tales. It's just not in possible to do in Hollywood, where our pagan and Christian morality is actively suppressed both by intent, and non-verbal consensus in the culture of the place. Prey is how it is done. Without novelty of effects and gimmicks that can be put into trailers, it may be harder to sell to distributors and studios. But it's a nearly flawless addition to our visual libraries. I hope we see a series of movies with the same character development, with the same basic effects, under the same narrative, hopefully by the same producers. They're profitable. We want them. We can't get enough of them. So yes. More please. And thank you.",
         "This film would be worth seeing just for the opening - no words for a while just brilliant photography and electronic mood music but that's only the beginning. The high quality acting and attention keeping building of the story makes this film as acceptable in the mainstream cinema as it is in the horror genre.Unbelievable on this budget.How did they do it.The cast all give totally convincing performances and Liam Cunningham is just so in control.This film got an extended round of applause at the viewing which I attended and it richly deserved it though I cannot remember the last time I saw that at a cinema rather than at a theatre Odds on a sequel to this one.",
         "Finally a good well written British thriller/horror after many have tried and failed, brian o malley has created a superb British one. Based all in a police station the story of good vs evil takes place in a Scottish town where all is not what it seems with a well thought out cast this film is brilliant and a deserving of a Toronto after dark film festival award, liam cunningham is a perfect choice for the role of (six) where pollyanna mcintosh is one to watch for the future as she captures you from the get go and you will be rooting for her all the way through. A great story well told with a perfect surrounding plenty of scares and shocks this is one British thriller/horror you will want to watch",
         "Not that I see a lot of Irish horror movies- but this was the best i've seen so far. I'd say it was the best I've seen in this genre in a few months for sure. Less horror, more on the gore factor. I agree that Liam Cunningham is a great straight faced actor- Sir Davos was awesome, lol. Pollyana McIntosh was okay- was WAY better in 'The Woman' (which I really liked). Some of the other actors were just 'okay'. The Sergeant was good- there's one scene where he returns to the station everyone will enjoy! The script was pretty original. I would have liked a little more to the ending- maybe a bit of a flash forward with the main female character. All in all, a solid movie for the genre- 8.5/10 for me. A must watch for horror fans. I was definitely pleasantly surprised.Finally have time to write a little bit better review of the movie. Not that I see a lot of Irish horror movies- but this was the best i've seen so far. I'd say it was the best i've seen in this genre in a few months for sure. Less horror, more on the gore factor. Liam Cunningham is a great straight faced actor- Sir Davos was awesome, lol. Pollyana McIntosh was okay- was WAY better in 'The Woman' (which I really liked). Some of the other actors were just 'okay'. The Sergeant was good- there's one scene where he returns to the station everyone will enjoy! The script was pretty original but predictable. I would have liked a little more to the ending- maybe a bit of a flash forward with the main female character. All in all, a solid movie for the genre- 8.5/10 for me. A must watch for horror fans. I was definitely pleasantly surprised.",
         "I was surprised. This Indie film is great! I'm a very critical viewer and the IMDb rating of 5.6 didn't offer much encouragement. The odd thing is, a number of those reviewers admitted to liking it (so much for the rating system). The plot of this comes straight out of those Amicus movies (From Beyond the Grave, etc.) as a mysterious stranger arrives at a small-town nick where pretty soon all Hell breaks lose. The acting is fine, the effects effective, script and direction good, and there's a nice nod to John Carpenter with the soundtrack. If you like the better Carpenter movies, you'll probably like this one. Oh, and something a few IMDb reviewers agreed on: they loved the end. So did I.",
         "Let us prey, searching for a new film to rent I came across this film. From start to finish this film takes you on a psychological roller coaster ride. Directed beautifully by Brian O'Malley this takes the story of a stranger in town, but I think this to be certainly Pollyanna Mcintosh's film. Her character was strong but as an actress she has really good screen presence, I will definitely have to check out more of her work's from the U.K. Liam Cunningham also acted great, the stranger but so much more. Liam's character from what I can gather is a fallen angel, an outcast but with powers we cannot conceive. On her first night in a new precinct you see the other players in this coming together one by one. Liam's character is there to collect the souls of the wicked knowing of the atrocities they have all committed, except for Rachel, She is a survivor of unspeakable horror, and now she will join with Cunningham's character to fight sinners. This film has a mix of religion, which is good. Douglas Russel's character is lights out, being the Sgt. Of the precinct but having committed brutal act himself it sets off the end for the film, great job Douglas. The story which was written, great. The acting was superb. Directing was also on point. This is definitely recommended,enjoy.",
         "This movie felt like a extended episode of the TV series FEAR ITSELF, mainly reminded me of the episodes: EATER and FAMILY MAN, both of them episodes were pretty good, especially the latter but in comparison to those this one falls flat. Now unlike that series which all squeezed their stories into a 42 minute long episode, this one is stretch into 90 minutes long but what we got could easily been slimmed down to that length a time no problem, and maybe then it wouldn't have turned out to be as dull as this one often is. It's completely humor free it's just bad things happening to mostly bad people and frankly it's hard to find reasons to why you as a viewer should care what is going on. Not all negative though, the movie looks good visually, the gore and make up and effects are on point. The acting is not terrible, but yeah I found it really hard to get engaged by the plot, maybe if they had 1 or 2 likable people in it. But they didn't really, I guess one of the characters wasn't half bad but she didn't manage to make me care for her still. Forgettable.",
         "It was a pretty good flick but the ending left much to be desired. I didn't get the ending. I don't understand exactly what he was asking , why she agreed and am confused with the last words she says. I thought the stranger was Jean Reno , lol! It's not its stannis's man from GOT. The movie was alright, it was different. I dunno about all this assault on precinct 13 as it was a supernatural kinda flick , but I don't remember assault on precinct 13 so , so there is that. I which more of an explanation was given. I was fine that they were playing around with the strangers identity , but what was meant at the ending who was the rookie cop suppose to be . Is this 10 sentences yet?",
         "Well this is a first , a horror film set in Scotland that is actually brilliant , I doubt Scotland will ever manage another so this is prob a first and last for them , ha. OK it's got that guy out of game of thrones as the bad guy , he's great , the other actors are all good as well, not seen them before. Film all centres around a police station , er someone may of taken some inspiration from precinct 13 here ! The title music was very carpenter as well. I'm impressed by this film and would recommend it , it was different and someone put the time into the script and story thank god .... It came of as a nice piece of horror , never can tell if something like this will do well , doubt it will big in the cinema , but if your a home viewer who likes horror this is a seriously good piece of work. Kept my solid attention all the way and I watch a lot of horror inc the crap American stuff , not often we get a good one in the UK , I gave it 8 , was gonna be 9 but I'm gonna stick with 8 cause that's just how I roll !!! Whoooop",
         "Sleepy police station turns into Hell's waiting room. Opening sequence is excellent - amazing shots of the sea and the crows. And Polyanna does look good in uniform. Problem with the dialogue straight away - weak wisecracks, procedural slips or just lack of common sense, so the feeling of implausibility is there from the beginning - it's not as if you have to research the police to know what an audience expects. Have the characters do it by the book, then figure out a way to mess it up for them and defeat expectations. In the end it does go full mental, with a bizarre Rambo moment, so you can forget about the finer points of story telling and just enjoy the moderate shoot-'em-up gore. I really like this lead actress, and the cast does pretty well. And it is a good concept. I guess British actors must get frustrated with lines and action that leave the audience scratching their heads.",
         "Incredibly bad. I haven't looked at the other reviews yet, although I'm sure there are paid reviews from friends of the cast and crew sprinkled among them, as seems to be a common thing on IMDb. I watched this movie based on a recommendation included in another review for \"Last Shift\" (one of the best horrors I've seen lately). Let Us Prey is so bad that I immediately went back to this review and clicked on the author's name because I figured they had to be a fake account. It turns out there's no substitute for good taste. Why is this movie bad? From beginning to end, everything is just lacking in effort. Everything is overacted, everything is ridiculous, none of the character's actions make any sense, the one bit of cgi looks like something from \"sliders\" (the 90's TV show). It's just consistently awful, always, in every seen. Constant cringe worthy lines. I was tricked by a review. From now on when I receive advice on what constitutes a good movie, I'm going to click on the author's name and see what other movies they consider \"good.\" There is no substitute for good taste. This movie was terrible and cringe worthy, from start to finish.",
         "I watched this movie with low expectations, and it still managed to completely disappoint me. Usually I like \"bad\" movies or low-budget productions just for some laughs and gory scenes. But this one is just too random for any sober person to enjoy. At no point in this movie you can relate to any of uninteresting characters with their unexplainable erratic behavior. It seems like the film makers just stitched together a couple of mediocre murder scenes and filled it up with a lot of pseudo-religious end-time bogus to make it into a 90min \"movie\". I doubt many people will make it through the full movie before being bored to death. There are many horror flicks with a 5-ish IMDb rating that are still very enjoyable, this one doesn't deserve such a high rating.",
         "The mood the movie is creating is strong, the characters on the other hand not that much. Still and even though this is as predictable a horror movie as they come and characters decide to or rather choose to do the worst thing possible, it still is able to build a certain kind of tension. The actors are doing their best to keep it going, even in the most ridiculous situations. For some it might be strange seeing Pollyanna in a \"weak\" role like this, especially if they have seen her breakout performance. But that would be unfair to the movie and her as an actress. She conveys her role better than her male counter part. But both characters are tough to relate to, not to mention remove themselves from likable during the course of the movie (decision making again) ... if you don't mind those things and can just get into the situation without judging, you'll far more entertained obviously",
         "Ugh, I'm SO annoyed by some of the ratings on here. I watch a lot of low budget-ish horror. Often in the 4-5-6 rating- range. Although, I mostly skip those with a rating of under 5, because they are rarely any good. However. This one currently has a rating of 5.7. That's not that low, but it is too low. It should be in the 6-range somewhere. Why? Because it looks good. It's never boring. Has a interesting story. And has some pretty cool characters - Liam Cunningham being one of them. He's not like unforgettable or anything, but he has a strong presence to him. And I think the fact that he is in it, is some of the reason for this movie having a lower score than it deserves. That's gonna attract people that normally wouldn't watch this type of horror movie, and so, they expect something else than what they get. Expectations play a HUGE role in how you like a movie, unfortunately. If you go into this expecting a entertaining, relatively small, horror-thriller, I think you'll enjoy it. I've seen so many movies with scores in the 5's, and most of them suck. This doesn't. So yeah, you can't always trust IMDb-ratings. Too many people give bad ratings to be shocking, or to seem interesting. And that is, to quote the President, SAD.",
         "A-Z Horror Movie of the Day...\"Let Us Prey\" (NR - 2014 - Ireland) Sub-Genre: Psycho/Paranormal My Score: 7.3 Cast=5 Acting=9 Plot=6 Ending=9 Story=7 Scare=7 Jump=4 F/X=9 Psycho=10 Creep=7 Held in a remote police station, a mysterious stranger takes over the minds and souls of everyone inside. I'm not sure who the mysterious stranger was...was he fate? Was he an angel of death? Or did Professor X turn evil? The way he goes about it was brutal and exciting...I can't say I understood it but I couldn't help but watch! The movie had kind of a Stephen King feel to it...you definitely don't want to be in this little black book. Watch this one when you get a chance!!",
         "I don't review a lot of movies. Mostly because i can agreed with what the majority feels about it. But when i stumble on a hidden gem that's not recognized then yes i will speak my mind. I went to see this film just because i love Ms McIntosh in her roles. And shes a beauty as well so yeah that's out. When i saw the trailer and cover i thought this would be at least a little entertaining. Oh was i wrong. The movie starts slow so you'll have to stick with it for half an hour but you will probably not regret it. It just needs that time to have the story open up to us. So without giving spoilers..if you like a thriller with horror elements and you don't mind a low budget that's remarkably well done... then i recommend this. I still have hopes that this will have a follow up. There is still enough left to validate one. When you've seen the ending you might think so as well."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Creative Scotland",
         "Fantastic Films",
         "Greenhouse Media Investment"
      ],
      "summaries": [
         "Rachel, a rookie cop, is about to begin her first night shift in a neglected police station in a Scottish, backwater town. The kind of place where the tide has gone out and stranded a motley bunch of the aimless, the forgotten, the bitter-and-twisted who all think that, really, they deserve to be somewhere else. They all think they're there by accident and that, with a little luck, life is going to get better. Wrong, on both counts. Six is about to arrive - and All Hell Will Break Loose!",
         "Held in a remote police station, a mysterious stranger takes over the minds and souls of everyone inside."
      ],
      "budget": 0
   },
   "movielensId": 136798,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-04-17",
      "dvdReleaseDate": null,
      "directors": ["Brian O'Malley"],
      "runtime": 88,
      "movieId": 136798,
      "title": "Let Us Prey",
      "mpaa": "R",
      "actors": [
         "Liam Cunningham",
         "Niall Greig Fulton",
         "Pollyanna McIntosh",
         "Douglas Russell",
         "Bryan Larkin",
         "Hanna Stanbridge",
         "Jonathan Watson",
         "Brian Vernel",
         "James McCreadie"
      ],
      "imdbMovieId": "3148348",
      "originalTitle": "Let Us Prey",
      "genres": [
         "Thriller",
         "Horror"
      ],
      "youtubeTrailerIds": ["k2fnLntATUo"],
      "plotSummary": "Rachel, a rookie cop, is about to begin her first night shift in a neglected police station in a Scottish, backwater town. The kind of place where the tide has gone out and stranded a motley bunch of the aimless, the forgotten, the bitter-and-twisted who all think that, really, they deserve to be somewhere else. They all think they're there by accident and that, with a little luck, life is going to get better. Wrong, on both counts. Six is about to arrive - and All Hell Will Break Loose!",
      "tmdbMovieId": 276488,
      "avgRating": 3.0566,
      "releaseYear": "2014",
      "numRatings": 53,
      "posterPath": "/lNv3xVngqW1W9CsdmDlLIH4MNNO.jpg"
   }
}