{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "class reunion",
         "id": 188737
      }],
      "imdb_id": "tt0130216",
      "video": false,
      "title": "The Redeemer: Son of Satan!",
      "recommendations": [
         30519,
         86685,
         74072,
         54132,
         48789,
         85165,
         90888,
         40366,
         33801,
         40464,
         40258,
         28111,
         70490,
         87905,
         126793,
         187801,
         136881,
         78250,
         84372,
         144696
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "John Sinclair",
               "gender": 0,
               "credit_id": "52fe49819251416c910af791",
               "name": "Damien Knight",
               "profile_path": null,
               "id": 933261,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Cindy",
               "gender": 1,
               "credit_id": "53de7092c3a3686c560014c6",
               "name": "Jeannetta Arnette",
               "profile_path": "/uVaqZLhpTh5OmJDFSv7wim63sV1.jpg",
               "id": 2842,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "Terry",
               "gender": 0,
               "credit_id": "5411e16bc3a368020a001431",
               "name": "Nick Carter",
               "profile_path": null,
               "id": 1363039,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Jane",
               "gender": 0,
               "credit_id": "5411e178c3a36802150013c5",
               "name": "Nikki Barthen",
               "profile_path": null,
               "id": 1363040,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "Roger",
               "gender": 0,
               "credit_id": "5411e194c3a368020a001438",
               "name": "Michael Hollingsworth",
               "profile_path": null,
               "id": 1363041,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49819251416c910af78d",
               "name": "Constantine S. Gochis",
               "profile_path": null,
               "id": 933260,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5411e152c3a368020700154f",
               "name": "William Vernick",
               "profile_path": null,
               "id": 1363037,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.900846,
      "production_countries": [],
      "id": 86332,
      "vote_count": 11,
      "budget": 0,
      "overview": "Six people are trapped within the confines of their old high school during their 10th high school reunion with a psychotic, masked preacher who kills them off for their sinful lives they have made for themselves.",
      "similar": [
         11300,
         509243,
         43339,
         327476,
         279722,
         184929,
         174987,
         278621,
         463998
      ],
      "original_title": "The Redeemer: Son of Satan!",
      "runtime": 84,
      "poster_path": "/qE0lSTMmwWzEqHbYQiUgxxtlYMf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1978-04-07",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "If You Have a Craving for Terror… Come to the Class Reunion",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Constantine S. Gochis"],
      "runtime": 84,
      "synopsis": "A strange boy, named Christopher, rises from the depths of a river and visits a sleeping priest, casting a spell over the man. Later that day at church, Christopher sits with the boys choir as the priest delivers a sermon about sinners and the wrath of God. At an abandoned high school, a janitor lets in a stranger who claims to be an insurance inspector, but who shoots the janitor dead, drags the body into a classroom, and prepares a plaster cast of the man's head. Later, the stranger pulls out a yearbook for the Class of 1967 and opens it to the \"Most Likely To Succeed\" page that features six students, three boys and three girls, and cuts out each photograph. Among those pictured in the yearbook is John Sinclair, a dodgy lawyer who only represents wealthy clients, even if they are criminals; Terry Day, a gluttonous traveling businessman who cheats on his wife; Jane, a wealthy trophy wife in a loveless marriage who \"skeet shoots\" live pigeons; Roger, a vain and ornery actor who causes endless difficulties on the set; Kirsten, a closeted lesbian who is ashamed of her life; and Cindy Pilson, a promiscuous woman, twice married and divorced. Some days later, the six arrive at their former high school for their ten-year reunion. Roger notes that the school doors are locked, and assumes they must be early. They knock, and the stranger, posing as the janitor, lets them in. The group enters the cafeteria where a feast awaits. They enjoy the food, although Cindy wonders why no other classmates have yet arrived. John offers to call a former classmate who still lives in the area and Jane joins his search for a payphone. Back in the cafeteria, Cindy remembers that another classmate lives within walking distance and leaves to find her. As John and Jane realize the phone lines are dead, Cindy notices all of the exits are locked. She searches for the janitor, but finds a dead, maggot-covered body. As the group gathers around the janitor's body, they realize he has been dead for several days and that the man who greeted them earlier was not the janitor. As they separate and check the windows and doors, George notes that all of the windows have bars. In another part of the school, Kristen yells through one of the locked gates when she spots a stranger in the distance. Realizing it is a masked man swinging a scythe, she runs away screaming. John and Terry notice music coming from the public address system. As they enter the audio/visual room, they notice a man sitting in a chair with his back turned to them. When they swing the chair around, they see a dummy holding a live blowtorch, which sets Terry on fire and burns him alive. Later, the five remaining alums wonder if they are victims of a revenge plot but they are unable to think of a reason. John notes that the school is isolated and that no one is around to see or hear them, so Kirsten suggests they start a fire to draw the attention of the fire and police department. As they separate to gather material to burn, Jane returns to the cafeteria for tablecloths and hears a door opening. She runs outside for help and comes across a hunter carrying a shotgun. She pleads with him to take her to the nearest phone, but as they walk, Jane realizes the \"hunter\" is the stranger and he has led her back to the school where he chases her down before shooting her. Later, the four survivors find Jane's dead body laid out on the cafeteria table. Back in the stairwell, they plan what to do next but follow sounds coming from the auditorium, where a strange show is in progress. The stranger, dressed in a cape and a mask, recites a Shakespearean speech as a sword-bearing puppet dances. Entranced, Roger moves toward the stage as a dagger falls from the ceiling, impaling him in the head. Terrified, John runs away leaving Kirsten and Cindy alone. He runs into the empty library and finds their old yearbook with their pictures cut out. Meanwhile, Kirsten and Cindy go to the bathroom, but when Kirsten steps outside, the stranger, now dressed as a clown, locks the door behind him, trapping Cindy and taunting her before drowning her in the bathroom sink. Later, the stranger, now disguised in a business suit and mustache, confronts John in the library. As the stranger holds him at gunpoint, John demands to know why he wants them dead and the stranger proclaims that they are sinners and he is their redeemer. John lunges and they struggle over the gun, but John manages to shoot the stranger in his right hip while they both have their hands on the weapon. Refusing to let go, the stranger turns the gun on John and shoots him in the head. Hearing the commotion, Kirsten runs toward the library and comes face to face with the stranger, then runs, screaming as he chases her back to the auditorium. Bleeding and stumbling from his injury, the stranger drops the gun. As she scrambles and picks up the gun, the puppet swings its sword at her head, killing her. Back at church, the film comes full circle as the priest finishes his fiery sermon. As he says goodbye to his parishioners, Christopher joins him, saying that everything will be all right now and leaves on the shuttle bus which he arrived on. The priest goes to his room and undresses, revealing a bandaged gunshot wound to his waist. As Christopher walks back to the river, the priest touches his wound but finds it miraculously healed. The boy returns to the depths of the river. The film closes with the text: \"From out of the darkness the hand of the Redeemer shall appear to punish those who have lived in sin... and return to the watery depths of Hell\".",
      "writers": ["William Vernick"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0130216/",
      "coverLink": null,
      "actors": [
         "Damien Knight",
         "Jeannetta Arnette",
         "Nick Carter"
      ],
      "reviews": [
         "This offbeat little curiosity happens to be one of my absolute favorite slasher films. In fact, only 1974's \"Black Christmas\" (which is also my pick for best of the horror genre in general) beats it. Released mere months before Carpenter's \"Halloween\" would kick start the core slasher movement, it's an extremely eerie picture. There's a sense of the foreboding here that is more prevalent than you'd expect. It focuses on a mysterious morality killer who tricks a group of \"undesirables\" into attending a fake high school reunion, only to begin picking them off once they arrive. If you think this sounds a bit like \"Slaughter High\", you'd be right. This came first and is the infinitely better of the two. It's religious subtext alone makes it far more intriguing than that popular, but ultimately quite bland effort. The six so-called degenerates include a lawyer, a gay actor, a lesbian, a cute girl who takes pride in her appearance, a rich snob and a cocky former football jock with gluttonous tendencies. Despite negative comments about the acting on this site and in a horror reference guide of mine, the six main characters are perfectly believable people. In fact, all but the glutton wind up being rather likable, particularly Cindy, played with a free-spirited innocence by the lovely Jeannetta Arnette. The Redeemer himself comes off as over the top at times, which actually works in the character's favor, really making him seem like an absolute lunatic. His Shakespearean rant in the auditorium is a highlight. Props to T.G. Finkbinder for going all in with the role and, in turn, bringing to life one of the most memorable psychos on film. Indeed, the Redeemer is a very creepy individual. Throughout, he dons many different costumes (as \"Terror Train\"'s killer did a few years later), each one representing an aspect specific to his victims' lives. It's an unsettling touch that really adds to the overall tone. Perhaps the creepiest scene in the entire movie is when one of the girls is yelling for someone in the distance to let her out of the locked down school. Said individual turns out to be the Redeemer, dressed as the Grim Reaper, who proceeds to pound on the barred window with his scythe. This film is an exercise in the surreal, the above mentioned sequence being positively nightmarish in execution. The film's ambiguous opening and closing segments revolving around a sinister child reinforce this feeling tenfold. The school itself is an atmospheric setting, imprisoning our characters like a tomb. The rural area surrounding it certainly lends to the feeling of hopeless isolation. Having originally seen this via the big box \"Class Reunion Massacre\" VHS at my local video store, I was instantly taken with it. Not easy to forget, it's a bleak, dread-inducing slasher with a unique utilization of religious themes and well worth rediscovering. It should be regarded much more highly. It truly is one of a kind.",
         "I for one enjoyed this little known film, first having seen it at a friend's house way back when VCRs were for people who had a bit of extra money to burn and were the darlings of the neighborhood. We were really blown away by The Redeemer since there just weren't that many great horror films showing at theatres or on home video at the time. Just notice how those of us who appreciate The Redeemer were young at that time and those who don't like it are young NOW and weaned on flashier \"horror\" fare that are really Tommy Hilfiger ads in disguise. Sure the lack of budget shows sometimes, but The Redeemer (later retitled Class Reunion Massacre for those who need a lot of help in knowing what a film is about in the title, what a joke) has many little things in it that really shine. For me, the one scene where the victims are in the school's gym for the \"reunion\" and are sitting at the table, notice how it's a re-creation of The Last Supper? There are several tense scenes of chases that really offer some sense of dread and the killings are rather creative and effective for a film from 1978 (that blade going into the guy's head and the marionette are a wow). There's some brilliance at work here in this little gem of a film. Note also that this film was shot in 1976, so it pre-dated films like Halloween and others that were considered forerunners of the genre. There is much that leaves us befuddled: What's with the two thumbs, the kid possibly changing into the man and then back, why the lake.....but I enjoyed the film for trying and succeeding if you can just put aside the questions of logic and lack of budget. I actually like when a film uses unknown actors, it helps you get into the characters and the story easier that way (and not being distracted by a very recognizable actor), and the fact that the actors aren't all young and pretty people posing as teens was a major plus. It's why I enjoy horror films like The Bone Yard and more recent efforts like Session 9 where the film's creators aren't scared to give us mature characters. Also noteworthy is that it is full of atmosphere, not needing to distract audiences with nudity nor heavy gore to distract them from lack of substance. The Redeemer holds its own quite well. Some may be put off by the film's \"moral\" theme, claiming it's not fair that these killings are justified because each person killed represents a sin. I think of it like the story presented in the frightening 1991 film The Rapture, what IF the universe really is controlled by a vengeful god that punishes us at every little turn? I just see it in The Redeemer that religion really can be a bit hypocritical in how it seems to justify killing in the name of God. That said, then I must be missing something else though because one of the titles for this film is The Redeemer: Son Of Satan! Does that mean that it's really Satan having some fun killing in the guise of Christianity? Hmmmm. Or just that like the awful retitling Class Reunion Massacre, by putting the words \"son of Satan\" in the title it grabs the attention of more gullible minds? (Just like ruining a good drama called Celia by retitling it Celia: Child Of Terror) Geez, I'm getting a headache. This is a film to just enjoy it as it is, and giving it credit for really trying. There are way too many big budget Hollywood films that can easily be forgotten, but little films like The Redeemer manage to stay in people's minds and over the years always manage to be brought up in conversation about memorable obscure films. This one is a gem I'm glad people love and has been kept alive all these years. Update October 2010: Now available on DVD from Code Red as The Redemeemer: Son Of Satan. Hooray!",
         "I noticed here on IMDb.com, that nearly every low budget horror film that I have merely enjoyed or even thought to be spectacular has been given a bad review. To me, The Redeemer:Son Of Satan is an incredible film. It has gaillo qualities... very atmospheric, creepy, yet it doesn't need a whole lot of blood and guts to keep you interested. A stereotypical slasher film this is not. On VHS, the title of Class Reunion Massacre was most likely used to cash in on the whole slasher trend of the 80s. I found the cinematography to be incredible. The acting wasn't bad either. This isn't your regular 'piece of cheese' horror film. It was shot well, and overall, had good production values. It does have its 'cheese' moments, as most films of the genre do, but I can look beyond them. Also, I'm sure this film had a political subtext AGAINST Christianity. Showing how a crazed religious fanatic (the priest) committed murder under the justification that he was eliminating those who sinned. I also believe that the character of the little boy from the lake was the apprentice of the priest. Thats how his character comes into play. I really wish the director kept making horror films, he could've done something incredible. Love it or hate it, this film is MEMORABLE. It is Not some shoddy piece of garbage that you want to forget. All in all, The Redeemer:Son Of Satan isn't just another over-the-top slasher gore-fest. Its something more. So what if The Redeemer isn't as polished up as a squeaky clean \"Scream\" or \"I Know What You Did Last Summer\"? Cant find redeeming values in a low budget film? Stick to your million dollar Blockbuster horror.",
         "I rented this a while back, being the fan of slashers films that I was (and still am, I guess). Seemed like an interesting premise, and hopefully, it would do better with it than the awful \"Slaughter High\" did. (Saw \"Slaughter High\" twice--first time, I was young and terrified, second time, older and bored. I don't recommend it.) Anyhoo, I took a chance on this, and actually, it's a very good movie, at its core. Some of the evil doings surrounding the pudgy boy from the lake, if I can recall, were sort of confusing, though. I won't go on to describe the plot, you must know it by now. It's not a new plot, but what's done with it is what's unique. I don't remember all the characters too well, but the lesbian takes near-center stage as the leading lady, which I found to be a surprise, since the lesbian is usually just that. All the characters are utterly likeable, even the promiscuous girl. She may have been one of the sweetest characters, and her demise is heartbreaking. (C'mon, you knew it would happen.) From the murders in the film I remember (one of which I can't remember at all, God, my memory sucks), the one involving the killer dressed as a hunter and the character trying to escape outside was probably the scariest. You actually think she's going to make it, seeing how long the scene went on (once again, if I remember correctly). Add to that the stark daylight which is far scarier than the scene may have been at night. (Why don't more filmmakers realize this? Daytime can be extremely scary. See the climax to \"Texas Chainsaw Massacre.\" An early-morning nightmare.) Anyway, I must be giving the worst review right now, but I thought I'd let people know that this is actually a very tense movie, with a merciless atmosphere of doom. It's not obvious who will live and who will die, and overall, you want everyone to survive, even the \"bad girl\" (who isn't bad at all!). The killer dons a couple creepy costumes--the hunter and the clown were pretty freaky (need I add--if I can remember). And while some of the peripheral plotlines concerning this killer are somewhat perplexing, don't let that turn you off to this movie. It's worth seeing, if you can find it. If I can remember : ).",
         "***SPOILERS*** ***SPOILERS*** First off, let me state why I believe this wonderfully creepy movie is highly misunderstood. Most reviewers often state this movie as being overtly religious and homophopic, due to some blatant stereotypes being a couple victims. My impression is that the movie portrays how hypocritical religion is. It gives the impression, murder is a sin... unless religiously justified. I think if people could view it as I believe it was meant to be then perhaps there would be more fans. Now my history with this movie. I saw this movie as a second feature in 1979-80 with the awful mutant bear movie \"Prophecy\". Being that I was only 9 years old, this movie had an amazing lasting impression with me and my sisters. We always remembered it, and tried to find it on video, to no avail, when getting our first VCR in 1986. Having always wanted to see it again, to see if it was as effective on me years later, I continued trying to find it. In 1997, when I connected to the internet, I did a search for the film and found that it had been renamed \"Class reunion massacre\" for one of it's home video releases. I went out the next day and found it in a place I had looked for it under \"The redeemer\" years ago. Immediately after starting the film I was very excited with the fact that I have finally found the movie after 17 years of wanting to see it again. The movie began with eerie music with the remembered shot of the boy sticking his hand up through the lake and coming on shore. Then came the creepy bus out of nowhere to pick the boy up. The basics of the movie is that a number of students from a school are invited to a fake 10 year class reunion to be offed for their sins. Nonsense like vanity, selfishness, homosexuality, gluttony, etc... The killer changes costumes and characters to do each of the people in. Most are very creepy, which have stayed with me all these years. Examples: he wears a huge plastic smiley mask and burns 1 of the people with a flame thrower, he dresses like a clown and drowns one woman, he disguises himself as a camper/hunter and shoots another, and the one that was most memorable to me was the killer being on a stage doing some scene from a play with a life size marionette with a sword. He lures 1 man closer when the marionette cuts a rope and a knife plummets in the mans head. I remembered the mans body shaking in spasms as very haunting and effective. The movie definately leaves some questions unanswered. What is the signifigance of the second thumb that moves between 2 characters? Who exactly was the boy from the lake? Etc? The movie is very atmospheric, giving a sense that a strong evil force is aiding the killer to finish his designated task. The music is very haunting and the main character \"The Redeemer\" makes quite an impression. I was surprised at how much, and how clearly, I remembered this movie being such a young age and having only seen it once, but after rediscovering it 4 years ago I am pleased to say it is one of my top three favorite films, along with the 1976 film \"The Haunting of Julia\", and the 1982 film \"The Sender\". I absolutely love it. It was so nice not to be disappointed after all these years. Sadly, after sharing the movie with one of my sisters that saw it back in the day as well, she was very unimpressed. Her loss. It is rumored that a future DVD special edition is to be released within the coming months. Amazing, considering this is not a mass appealing film, or even that much of a cult film. I can't wait!",
         "Well, I didn't know what to expect going into this movie. The copy of it I have is entitled \"Class Reunion Massacre\", but after you watch it, that title is a bit misleading. Instead of a \"massacre\" we get a very atmospheric, strange horror/slasher film. I don't even know if the writers of the film knew which direction they wanted to go in, but it all seems to work if you are into this kind of stuff. Basically, the beginning of the movie is strange as it starts with a boy walking out of a lake and getting a ride from a bus to a church. There we here the ramblings of a mad priest talking about sinners getting what they deserve and what not. Then, the movie seems to go into the past introducing a group of people, one by one, talking about going to their high school reunion. When the group arrives at there old high school, they are locked in and one by one are murdered off in various ways by a man wearing multiple costumes. Everything about this movie is bizarre. The music is very good appropriate and helps to build some dread, especially during the scene in which the boy at the beginning of the movie is walking out of the lake. The whole storyline feels like it was two stories put together as the beginning and the end of the movie doesn't fit with the whole class reunion part. It was still fun. Also, the costumes the killer was wearing was a nice little treat as it gave him some personality. But don't expect much gore. There was only one scene and that was actually pretty hilarious. Check this one out. You might not be disappointed. 7/10",
         "(There are Spoilers) What really disturbs me, as well as a lot of the people who've seen this movie, is how it uses revenge against a number of innocent, if not at all that biblically observant, persons in \"crimes\" that they committed that almost everyone watching the film did at one time or another in their life: #1.Greed #2.Arrogence #3.Hunting for sport #4.Stuffing oneself with food, mostly cheeseburger's. #5.Having extra marital affairs and finally #6. Falling in love with someone of the same sex. We first see the Redeemer, T.G Finkbinder, posing as a priest at a Catholic School giving a fire and brimstone speech to his congregation that includes this little boy Christopher, Christopher Flint, who earlier walked out of this lake and hitched a ride to the priest's school. Chris was earlier threatened by the school bully, Daniel Elliot, with a knife for not laughing at one of his corny jokes. Daniel for his actions which were nothing more then having a big and abusive mouth was given the death penalty at the end of the film. The movie then switches directions in what seems to be a totally different story with the graduating class of the 1967 Stuart Morse Academy coming together for a class reunion. It turns out that the priest is behind all this and is targeting the six former classmates for his brand of righteous indignation in punishing them for the horrendous \"crimes\" that they all committed over the last ten years. You get the feeling right away that this Redeemer is a bit off his rocker in his righteousness. The Reedemer for some reason that's never explained in the movie brutally murders the school janitor, Erick Kjoenes,who as far as we know didn't commit any of the \"crimes\" that the Redeemer would consider to carry the death penalty. With the unsuspecting former Stuart Morse alumni now gathered together in the school all the doors are locked and the telephone lines cut off, by the crazed Redeemer, as their left to their fate, a brutal and sudden death as we sit through and watch in horror the Redeemer go into action. Using all kinds of weird disguises the Redeemer first murders the gluttonous former high school football star Terry,Nick Carter, by burning him alive. The fun loving and beautiful Jane, Nikki Barthen, somehow makes it out of the school and trying to get help runs into the Redeemer, dressed as a hunter with a fake wig and even faker silly looking mustache. Acting as if he's trying to help the Redeemer blows Jane away with his shotgun just like she killed a number of pigeons earlier in the movie taking target practice. The out of control Redeemer continues his deadly rampage by running through the conceited Roger, Michael Hollingworth, with a flying dagger, dropped from he celling, that penetrates his skull. Later in the most brutal and sickening act in he movie he has Cindy, Jeanetta Arnette, trapped in the Lady's room and in what seems like a good ten minutes beats abuses and finally drowns the terrified young woman in the bathroom wash basin. The scene has to be one of the most shocking scenes ever put into a horror/slasher film with it not having a single drop of blood in it. The killer for some reason takes off his disguise when he confronts John, Damien Knight, and gives him this whole line of BS of why he deserves to be killed. This has to do with John, a lawyer, overcharging his customers and defending and getting off those who are accused of horrible crimes, like the Redeemer? Then after a brief struggle, where he seems to have gotten shot by John with his own gun, blows John's brains out. The last and final member of this bloody class reunion the gay or lesbian Kirsten,Gyr Patterson, is trapped on the schools stage and after grabbing the Redeemer's gun can't seem to be able to fire it. The Redeemer uses one of the evil puppets, pulling it's strings, to sneak up from behind and slice poor and hysterical Kirsten's head off. The movie ends as we go back to the Catholic School and hear the Redeemers, or this time priest, harangue to his congregation with tales of sin and redemption. Later as he goes back to his room we notice that he was wounded, by John?, with his midsection bandaged up and blood seeping out. The young Christopher who seems to be the power behind the Redeemers murderous actions is then seen going back from where he came from the bottom of the lake. This, more then anything else, is what really spooked me about the movie when we see both the Redeemer and Christopher have double thumbs looking like they were Devil hoofs as the movie finally ends. In fact it was the double thumb that miraculously healed the Redeemers wounds by him just rubbing it over them!",
         "I am amazed how many people seem to remember this movie, and actually hunted it up on video. Me, too. I saw it when I was 17 and was so scared I actually slept with my bedroom light on. OK, it didn't have that effect today, 24 years later, and most of it is just terrible, but: I can't believe how well I remembered it over the years. Parts of it definitely stayed with me, and that is pretty impressive for a no-budget little nothing movie. I think most of the religious symbolism is underdeveloped (I really can't tell if the movie is endorsing religion or appalled by it), and the mysterious second thumb that travels from character to character is a bit much. The acting sucks (only Jeannetta Arnette seems to have any talent, and even then it's hard to be sure because of the poor sound quality--though she has proven it over the years, most spectacularly in Boys Don't Cry), the special effects are limited by budget, and the film is a technical shambles. But it is really scary in places, and it does indeed stay with one. Most memorable moment: the creepy marionette who releases the dagger. Creepiest moment: the extremely sudden, yet strangely calm moment when the Redeemer just shows up in the bathroom, though the women have only just turned their backs and have only separated for a second or two. Its quickness, unaccompanied by a jolt of \"Boo!\" music makes it quite frightening; he is just there all of a sudden, and ready for business. I guess I recommend this movie with big reservations. I don't quite buy all the pseudo-deep religioso explanations I see posted here, and I think the film-makers' intentions were way above their abilities, but, still, The Redeemer (and I do recall the \"Son of Satan\" tag as part of the title clear back in 1978)is worth seeing. Hack through the cheese and there is something there. It fairly cries out to be remade, this time with just a bit more polish.",
         "A real strange movie,good effects for such a low budget movie. Very Richard Kern type of plot twists. Memorable ending.",
         "Wonderfully strange and offbeat \"The Redemeer:Son of Satan!\" aka \"Class Reunion Massacre\" tells the story of six old high school friends,who meeting up at their old school under the guise there is a reunion taking place.Of course this is a deadly trap.The Redeemer wants to punish them for their sins.Very bizarre and highly original slasher flick with dreamy atmosphere and the sense of impending doom.It's like a religious morality tale mixed with slasher elements on acid.There are some effective deaths including a really creepy scene involving the life size marionette and the killer dons a different costumes like in \"Terror Train\" or \"Hollow Gate\".He is clown,magician and grim reaper.The film is taking place within a nightmarish dream.It's time to punish sinners!Beware!From out of the darkness the hand of the Redeemer shall appear to punish those who have lived in sin...9 out of 10.",
         "well, this flick from the seventies proving that religion has its repercussions. this pre-Halloween movie follows more in the venue of Italian \"giallos\" films, except you get to see the killer like a chameleon changes props, set design and costumes with each killing. there was some great chilly moments such as the theatrical scene where one character get it in his head. even a lesbian subtext (in the beginning each character is given some time to show us their hidden lives) to satisfy the \"straight\" male interest. each killing relates to each of the seven deadly sins, a killer if you are Christian follower! there is some quirky film-making moments, which add on to the weird environment in which the characters inter act with. watch out for the scene where the freeze framed image of the killer wearing a black cloak outfit with a skull mask, with his eerie laugh echoing, fun stuff!",
         "I'll be honest - I don't know what the hell was going on during most of The Redeemer (or Class Reunion Massacre as the version I watched called itself), but I know I sure did love it. Although the plot sounds like a rather straightforward slasher (in fact, \"the killer staging a fake reunion to lure classmates back\" thing has been done a few times since), but it's anything but. It begins with a little boy rising from a lake and hoping aboard a bus to church (as one does) and joins the choir as a priest with two thumbs(?) gives a rousing fire and brimstone speech about damnation. In between these bits, we see a man (never see his face) walk into a school with a briefcase, kill the caretaker, and make a mold of his face. Confused yet? The man begins slicing into an old yearbook and, as he does, we get to meet several former classmates and see what they're up to now. One is a lawyer, one is a glutton, a slutty barfly, a lesbian, a bitchy gay actor, and we have one who's so rich that she likes to shoot birds for entertainment. According to this priest, they're all sinners and deserve to die. Did I mention that it turns out this priest is the same man who killed the caretaker and made a mask of his face? Why did he do this? Well, to put it on and fool all these people that there really is a high school reunion going on. Once he gets everyone inside, he locks and bars the doors and windows, so there's no chance of escape. People start putting two and two together and figure out they were called her under sketchy circumstances. Pretty soon, ol' priesty is dressing up like a clown, a hunter, and even the grim reaper himself to kill these people off one by one. This is probably the most straightforward part of the film (and the must substantial), but even this feels askew and dreamlike (in the best way). I don't know if it's because of the quirky prologue and epilogue it's sandwiched in between or what, but this film really does feel like someone's horrible nightmare. The Redeemer has interesting cinematography, a good cast, phenomenally creepy music score, atmosphere out the ass, and a genuinely creepy villain. Give this one a watch!",
         "I saw this movie quite recently, I've read a lot of negative reviews about it but I never let bad reviews lower my expectations for when I actually see the movie myself. This movie does have a lot in common with \"Slaughter High\" both having more or less the same story line, only this one is much better. Now then this is one uniquely strange horror film, creepy and unsettling, plus I had no idea what the hell was going on. Why did that kid just rise out of the water Is this a fully-functioning Catholic boys school or a deserted old high school? Two thumbs?! Are the filmmakers really trying to say that if you're a dirty sinner, Satan will send \"The Redeemer\" from the depths of the California desert to even the score? Or was it just an easy set-up for a slasher. After a truly baffling prologue involving said water-kid, a sermon, and a janitor murder, Class Reunion Massacre (aka The Redeemer) sets the scene. The robot music kicks in. Six stereotypical former high-schoolers are introduced through presentback (you know, like a flashback...but now). We've got the heartless lawyer, the town drunk, the ex-quarterback, the rich bitch, the flamboyant gay actor, and the good-hearted lesbian. All total sinners, right? Anyway, the super-six arrive at their ten year high school reunion, only to find that they're the only ones invited. Ignoring the obvious clues, the old kids partake of the catering and live it up. Until they find out that all the doors are locked. From the outside. Soon enough, a disguise-changing, bible-quoting killer picks off our cast one by one. After the carnage, the film wraps up just where it started, only with an accompanying on-screen biblical blurb to help us out. Wow. All in all Class Reunion Massacre succeeds, it may be light on gore but it's effective and filled with interesting shots. The killer himself was really creepy and the idea he changes costume for each murder was a really great idea. Naturally, when you add the religious subtext to all of this, things get even stranger. I find it a little far-fetched to buy into the idea of selling anything (are these filmmakers anti or pro Christian?) through the \"art\" form of trashy horror, but whatever. Just the idea of someone trying to get their message out through the use of \"The Redeemer\" is both hilarious and scary.",
         "\"The Redeemer\" follows a group of six adults who are conned into attending a high school reunion party at a the remote academy they all graduated from. Among them are a vain actor; an avaricious lawyer; a woman who married for wealth; a frivolous (albeit kind) woman on her umpteenth divorce; a lesbian in a committed relationship; and a man who is a lite gourmand. When they realize they are the only ones there, they grow somewhat suspicious of the supposed \"reunion,\" and it isn't long before they find themselves locked inside the building. Like rats in a cage, they are systematically knocked off according to their \"sinful\" proclivities. Oh yeah, and did I mention that the film is inexplicably bookended by the literal son of Satan emerging and entering a lake...or something? Opinion on \"The Redeemer\" (also released as \"Class Reunion Massacre\") seems to be divided, with some reviling the film for its religious overtones and sloppiness, while others herald its surreal disposition and dread; I tend to fall in the camp of the latter for a handful of reasons. While it is admittedly no masterpiece, \"The Redeemer\" does weave a spell on its audience, and the entire thing feels like it could have been borne out of the writer's fugue state. A large part of this weirdness is due to the bizarre supernatural angle that is woven into the film; the beginning and end almost feel as though they are part of a different movie entirely, while the mid-section is a fairly conventional (albeit atmospheric) slasher. In the beginning and end, there is a boy coming out of a lake and interacting with a lunatic preacher (i.e. the killer); the boy is ostensibly the son of Satan-at times one wonders if the boy is the childhood version of the preacher/killer-the reality is that we'll probably never know. Promotional material for the film tried to tether it to the success of \"The Omen,\" which leaves me wondering if these bookended sequences were added as an afterthought to cash-in on the \"supernatural child\" motif that was en vogue at the time. The bulky midsection of the film is remarkably atmospheric, at times reminding me quite a bit of another oddball proto-slasher, \"Savage Weekend.\" There are a few artful sequences leading up to the characters' arrival at the school that predate similar sequences in countless slasher films, and there is an unnerving score that permeates the entire film. The killer's appearance alternates from victim to victim, though each is marked by theatrical pontification; some, such as a shotgun murder, are twisted and ingenious in a tongue-in-cheek way while others, such as a protracted murder in a bathroom, are far more grim and unpleasant to watch. Each of the adult characters have a bit of personality and humanity to them which is supplied by capable performances, so there is an emotional gravitas to the film that makes the killings feel particularly mean-spirited; it also lends a potentially subversive ethos to the proceedings, as the extent to which the characters are truly \"sinful\" remains questionable as we watch them like lambs to the slaughter. In the end, it all comes crashing down in the same way it began. Who is the boy with the three thumbs, and why does he come out of the lake? What is his connection to the killer? Why this particular group of \"sinners\"? Is the film a commentary on religious delusion, or is it a mythological Christian morality tale dressed as a slasher movie? Was the director on acid? I don't have patent answers, but I can say that I find the film endlessly perplexing. Accidental or intentional, there are macabre strokes of genius here. For those who are attracted to the weirder side of the slasher spectrum. 8/10.",
         "A young boy rises from a lake, fully clothed, and travels to church where a priest delivers a fire and brimstone speech about the sins of the world, in particular, six people. Afterward, the other choir members bully the boy, even putting a knife to his throat. Those six people have been invited to a ten-year class reunion: John, a lawyer who doesn't care if his clients are guilty. Cindy, a promiscuous party girl. Terry, an overweight ne'er-do-well. Jane, a wealthy and immoral heiress. Roger, a vain actor. And Kirsten, a lesbian. The event will be at their old high school, where a mysterious man arrives to kill the janitor and make a mask of his face. None of the six people really knew one another. Yet they enjoy a room appointed with plenty of room and drink. It's all fun and games until they find the dead body of the janitor filled with maggots and that the school is locked. Am I really spoiling anything if I tell you that everyone dies? Terry gets his crotch set on fire with a flamethrower. Jane meets a hunter in disguise who recites poetry to her before killing her with a shotgun. Roger is killed by a magician and his deadly trick. Cindy is attacked by a clown and drowned in a sink, an attack that seems to take forever. John meets the killer face to unmasked face. He reveals that he has lured them to the school to punish them for lives of sin, such as John being a criminal lawyer who helps guilty criminals go free. The killer is a Redeemer, one who has decided to rid the world of the wicked starting with a few sinners. They fight and John shoots the killer in the side, but he recovers and graphically shoots John in the head. Kirsten is chased through the school and even gets the gun, but a giant puppet stabs her. The Redeemer is revealed to be the priest, who returns to the church to finish his sermon, claiming that the six sinners will be given redemption. He then meets with the boy, who reveals that he has killed one of the boys who bullied him, as well as a Bible salesman. The boy tells him that all will be right. The priest goes home to tend to his wounds and we notice he has an extra thumb, which disappears. The boy goes back to the lake, where he walks into the water and disappears. The movie closes with this: \"From out of the darkness the hand of the Redeemer shall appear to punish those who have lived in sin... and return to the watery depths of Hell.\" Shot in July 1976 and also known as Class Reunion Massacre, this movie is way ahead of its time. And it also seems like it wasn't created by human beings. It's legitimately unsettling at times and raises plenty of questions. Who is behind everything? The kid or the priest? Why are they really doing it? Why pick these exact people and this exact school? Why the masks and deathtraps? Why ask why? This film is closer to a surrealist art film than a horror movie. Just watch the scene with the Grim Reaper costume and the Redeemer screaming and yelling, but locked outside the gates. It's just...off. And I loved it. I'm interested to hear what other people think of this one, because I feel that this should be a much bigger cult film than it is.",
         "THE REDEEMER is an early slasher film with a character all of its own and plenty of creepy atmosphere to see it through, even if the story is rather light and stretched out. It was made on an indie budget which means that what takes place is very low budget indeed, but at the same time it manages to achieve a level of realism that a slicker production might have lacked. A bunch of former high school students head off for a class reunion but find themselves in a deserted, run-down old school and pursued by a masked maniac. The kills are inventive and there are some genuine creepy moments here, although elsewhere the tale is hampered by the inexperience of the cast and crew. Still, it's fun to see a slasher film made before certain tropes and cliches became entrenched in the genre.",
         "Going into The Redeemer (or as my tape calls it \"Class Reunion Massacre\"), I didn't expect anything, but I'd been told it was a really weird movie I just had to see to believe. Well, they were right. The Redeemer is about as weird as they come, but I wasn't expecting it to be quite as creepy as it is. Trying to decipher the first 15 minutes of this movie are next to impossible, but if you get past that, you'll find an eerie and atmospheric early slasher before \"the rules\" of the sub-genre had been created. The characters are colorful with special attention to Jeanetta Arnette's lovable floozy, Cindy. They're all picked because of their \"sins\", such as gluttony, greed, homosexuality, etc. and picked off one by one at their fake high school reunion by a creepy preacher with a knack for outlandish disguises. I'll be honest - some of these disguises range from daffy to downright terrifying (that scene in the auditorium, the grim reaper, and the John Wayne Gacy-ish clown are all horrifying). The entire film feels like someone's nightmare, cobbled together without much thought for logic or realism. It's quite a sight to behold. T.G. Finkbinder's Redeemer is a truly imposing and creepy figure with his endless disguises and penchant for long Shakespearian monologues. The Redeemer is worth the time for cult film fanatics. It'll be hard to find an American film this bizarre.",
         "When THE REDEEMER: SON OF Satan was released back in 1978, the ad campaign made it look like another THE OMEN. I remember seeing the ad campaign but I never saw the movie because I was too young back then. I've wanted to see the movie ever since. I finally got hold of a very cheap video, renamed as CLASS REUNION MASSACRE, and watched it for the first time. Boy, what a letdown. The original OMEN angle was extremely deceptive. The film is more like a standard Agatha Christie kind of movie (and no, it's not even close to being a giallo), sorta like a crude version of TEN LITTLE INDIANS, were people are locked up in some big mansion, in this case it's a rundown High School (it doesn't look like a school) and the stupid people are killed one by one by a maniac. The whole thing is soooo lame. I expected Jessica Fletcher to pop in at any moment and try to solve the killings. If you look at the cast list at the IMDb page for this movie, the killer, or the REDEEMER, is played by T.G. Finkbinder, a doughy guy who overacts shamelessly in a theatrical manner and looks like he ate too many twinkies. Now how scary is that for a murderer? There's NO supernatural element in this film, or no one is killed with supernatural means. The boring killer uses a flamethrower, death by drowning or a standard shotgun to off his victims. Again, where's the originality? I suspect the producers of this film had original intended the film to be a standard TEN LITTLE INDIANS kind of movie but decided to make a few superficial changes to the film in order to sell it as an OMEN kind of film, which were popular back in those days and were making a lot of money at the box office. The core of the movie is the Agatha Christie part. The superficial additions I suspect were added at the last minute to bookend the movie: they happen at the beginning and at the very end, with a little boy (sorta like Damien from THE OMEN) walking out of a lake(!) and heading for the school, and ends with the kid going back into the lake. If you cut those two pointless scenes, it wouldn't make any difference to the bulk of the movie. In fact, the scenes with the kids don't have anything to do with the group of six adults locked up in the mansion. The whole thing is obvious and remarkably tacky and transparent. Imagine, back in the 1970s, the producers tried to sell this turkey as an OMEN kind of film. When the film was released on video in the 1980s, the producers retitled the film in order to sell it as a slasher, which were all the rage thanks to the success of HALLOWEEN and Friday THE 13TH. I wonder what title they'll come up with when they release the film on DVD today. SCREAM AND MORE SCREAMING ?!?! Having said that, is the core of the movie good? Nope. It's lame. Acting, dialogue, cinematography. Practically everything about the TEN LITTLE INDIANS portion of the film sucks. The only good thing in the movie is the main theme of the soundtrack. It's actually good and effective. If you expect an OMEN or DAMIEN kind of film with THE REDEEMER, well, you'll be sorely disappointed. If you expect to see a slasher kind of film under its second title, CLASS REUNION MASSACRE, well, you'll be disappointed by it as well. And if you expect a good movie of any kind, well, you won't find it with this sad excuse of a horror film.",
         "I needed that extra thumb to point straight down to the depths of hades where this monstrosity belongs. Terrible writing, coupled with worse editing, made for a nightmare of a movie. From the too-long opening, until the ridiculous and un-decipherable end (I probably crapped out on the spelling of that one)I watched in horror as a junior high-school student with a cheap video camera attempted to be Hitchcock. I think that I am a worse person for watching this. Well... maybe not, it did lower my standards for any movie... of any genre... ever. Only a few movies have graced my wall of shame, and I proudly place this one with them. Right next to Double Dragon. All that said, I had a great time watching this with a friend, and just tearing holes through it. Great cheese-filled fun in here. But, unfortunately, the cheese is rotten.",
         "BIG SPOILERS There was absolutely nothing I enjoyed about this film.. those who think \"Carnage\" is the worst ever.. they should watch this... There are 6 people who have done something sinful, who knows what it was-- and these six people get invites to a class reunion at their high school.. It's just them, and then this preacher guy shows up at the school --I have no idea how or why!! And he basically murders the six people who try desperately to elude this loony toon to get out of the school alive!!! The preacher also uses like 4 different disguises, a skeleton, clown, and something else.... I really didn't care whether these characters lived or died-- it was that boring... The deaths are basic--- shotgun, revolver, sword in head, little flamethrower another sword killing, and a girl gets drowned in a restroom sink!!!! 6 different deaths for each of the six people..!!! As it turns out, they all never escape, and they ll get murdered!! And the psychotic preacher is shown at the end as a very regular \"unpsychotic\" preacher preaching at a service...then the boy who we see rise from the lake in the beginning, gets back on the bus, and gets driven to the lake.. and he walks back under the water to where he arose from... ends with a quote from the bible!!! Don't watch unless you have insomnia-- this will put you right to sleep!!! This was a double feature DVD with Carnage from EastEnd DVD's.com-- Absolutely no extras, no scene selection on either movie--- I already have the VHS movie of Carnage which was better than the Redeemer: son of Satan! So I took the DVD, and ran in electric saw through it!!!! \"The Plumber\" is as just as bad- except I rented that one-- good thing I did!! Took it back IMMEDIATELY after I watched it!!",
         "The Redeemer rises from the watery depths(..in the form of a boy) to assemble members of a specific class for a reunion where he will inflict wrath upon them for their sins..he possesses a priest(..whose fiery, condemning sermon is used as exposition for the movie), who masquerades in various disguises as he kills each individual one at a time. The sixth chosen wonder aloud why no one else had turned out for the reunion, impressed at the decorum and feast available for them. Those who arrive include a lesbian(..who wishes to keep her sexuality a secret from the gang), lawyer(..a scoundrel with unpopular practices), former high school star(..now a slob, who gorges himself on food anytime he can, and we see that he treats his wife and kid rather inhospitably), a multiple-married bar-hopper(..who lives to party), a primpy flamboyant homosexual actor, and a cold-hearted wench(..unhappily married into wealth who likes to shoot pigeons, among other animals, for sport). When they attempt to reach outside to discover why they are the only ones at the reunion, the group find that all the doors are locked, with bars and gates trapping them inside the building with no escape available. There's this great(..or hilarious?)scene where bangs on the front gate pleading for help, when someone in a grim reaper costume interrupts, swinging a scythe, laughing hysterically, his face covered with a skull mask. Another inspired sequence has a mannequin, in a seat, containing a blow torch in it's arms, setting on fire. Damien Knight(..John Sinclair, the lawyer), Michael Hollingsworth(..Roger, the gay actor), Nick Carter(..Terry, the glutton ex-pro quarterback), Jeannetta Arnette(..Cindy, a stickler for bad relationships with men), Gyr Patterson(..Kirsten, the lesbian), and Nikki Barthen(..Jane, the privileged wife who likes to shoot those animals for sport, her fate resembling her own extracurricular activities)round out the cast of those judged to be executed for their sins. TG Finkbinder is the creepy \"Redeemer\" who hunts them down one by one, his distinctive voice full of contempt and vigor, pronouncing their doom for their misdeeds and indiscretions. While this is still a slasher film, draped in religious subtext regarding the \"wicked\" paying for their sins, credit I think goes to the filmmakers for creating this really eerie ambiance throughout, in just the way it is scored and shot, there's just this weird atmosphere it has that worked it's power over me. While we do have some jarring death sequences, such as the dagger to the skull and bullet to the the forehead, I think the most disturbing and successful kill concerns Finkbinder in a clown mask drowning Arnette in a bathroom sink full of water..I think what makes it so effective is how she struggles with everything she has to escape, unable to free herself from the inevitable. The deal with the two thumbs and the whole idea of some force from hell in the guise of a child only adds extra strangeness to the proceedings. I think this has potential to become(..if it hadn't already)a cult classic. The way victims are selected(..their sins)might be offensive to some(..particularly homosexuals).",
         "This thing is a low budget clunker that could have been a serviceable slasher flick. The characters are unlikable, and we don't get any time to like them anyways. The confusing beginning and ending don't seem to fit with the meat of the film, which is standard one-by-one death fest. I will never understand why anyone would make a slasher flick with no nudity. This script has some good spots for exploitation, especially in the bathroom scene between the harlot and lesbian, but no deal. The kills are not imaginative, with no less than three getting offed by guns. GUNS? Come on people. The villain's motives are never really revealed, except for some convoluted 7 deadly sins idea that is never really fleshed out. Maybe it's trying to be arty, maybe the filmmaker just sucks at horror. Either way just avoid this one.",
         "Six folks gather together for a ten year high school reunion at their old alma mater located in the remote countryside. The motley bunch are knocked off by a mysterious moralistic psychopath (a gloriously hammy, stylized, and theatrical performance by T.G. Finkbinder, who went on to become an English teacher after he quit acting!) for their various \"sinful\" indiscretions. Director Constantine S. Gochis, working from an unflinchingly dark and grim script by William Vernick, does a sound job of building a considerable amount of gut-wrenching suspense and delivers a potently brooding atmosphere of pure dread and absolute hopeless gloom. Moreover, the murder set pieces are quite brutal and upsetting: one guy gets set ablaze with a flamethrower, another fellow has a dagger dropped on his head, a woman is drowned in a bathroom sink, and so on. The solid acting by the capable no-name cast helps a lot, with praiseworthy work from Damien Knight as greedy, cynical shyster lawyer John Sinclair, fetching future 80's \"Head of the Class\" sitcom regular Jeanetta Arnette as sweet, but promiscuous harlot Cindy, Nikki Carter as stuck-up rich snob Jane, Michael Hollingsworth as vain, preening actor Roger, Nick Carter as gross, lazy glutton Terry, and Gyr Patterson as lovely lesbian Kirsten. Moreover, the main characters are surprisingly well-drawn and even pretty sympathetic individual beings who aren't totally deserving of their ugly untimely fates. In addition, there's a striking ambiguity evident throughout which gives this picture an additional profoundly unsettling flesh-crawling creepiness: Whether this singularly sick and mean-spirited film is a savage condemnation of a rigid puritanical ultra-conservative morality run viciously amok or a stark endorsement of the same warped religious values is certainly open for the viewer to decide. Harsh and unpleasant for sure, with some perplexing oddball touches (what's that vague wrap-around stuff about an extra possessed thumb all about?), but undeniably effective and often genuinely harrowing just the same.",
         "I would like to preface these comments by saying that I saw this movie on a poor quality double feature DVD (paired with Andy Milligan's \"CARNAGE\") that I picked up at the dollar store, so I honestly wasn't expecting much from CLASS REUNION MASSACRE (aka \"THE REDEEMER: SON OF Satan!\") from the get-go. I read some reviews of the film on this site and several others before viewing it, and I noticed a lot of comments about its \"dreamlike\" or \"surreal\" quality. After watching the movie, I wonder how much of that \"dreamlike\" quality was intentional and how much was just dumb luck on the director's part. There were a few interesting scenes in CLASS REUNION MASSACRE but for the most part I found myself laughing at the screen more often than not. Here's our \"plot\" more or less: six people, each a cartoonish stereotype representing a \"deadly sin,\" (a greedy lawyer, a vain gay man, a lesbian, a rich bitch, a male chauvinist pig, and a promiscuous former teen-queen) return to their now-closed high school for a ten-year reunion, where they quickly discover that they're the ONLY people in the school building aside from a psychotic killer who locks the doors and proceeds to pick them off one by one while wearing a variety of masks and costumes. Our six victims, to be blunt, are idiots. After nearly every death scene, the remaining survivors invariably sit around looking dejected and discuss \"NOW what are we going to do?\" until the crazed killer strikes again, rather than doing the logical thing, like trying to smash out a window, break down a locked door, or whatever is necessary to escape. They also tend to stand around in shock and horror after every death while the killer makes a long, drawn-out speech about their sinful lives, letting him say his piece rather than simply rushing the guy and trying to kick his ass. Oddly enough, our killer (who is a fire-and-brimstone priest, judging from the not-very-helpful exposition shown at the beginning of the movie) seems to have no connection to the six people other than the fact that they're sinners and he hates them. If he had gone to school with the six and they'd shoved him in a locker or otherwise mistreated him in some way in the past, then perhaps the rampage would make sense. I'm not even going to get into the kid with an extra thumb (?) who rises mysteriously out of a lake (!) at the prologue of the movie (accompanied by some of the most annoying synthesizer music ever recorded) and is not seen again till he returns there in the epilogue, because those scenes feel like they were pasted in from a different film. The prevailing theory seems to be that the kid is actually \"The Redeemer\" and that he's the one pulling the strings (those of you who've seen the movie will get that reference, I'm sure) behind the Priest's murder spree, but overall CLASS REUNION MASSACRE isn't coherent enough for the viewer to know for sure. It seems to me like the makers of the film were trying to mesh the then-popular \"Satanic child\" genre (i.e. \"The Omen\") with the slasher film genre, but they bungled both sides of the equation. The highlights for me were the teen-queen character, a Farrah Fawcett wanna-be who was wearing a short skirt, and one kill scene involving a pendulum hanging from the ceiling and a creepy puppet in a clown suit. Otherwise, CLASS REUNION MASSACRE was 90 minutes that I should've put to better use, like clipping my toe nails or watching paint dry."
      ],
      "genres": ["Horror"],
      "productionCompanies": [],
      "summaries": [
         "Six former classmates receive invitations one day to a high school reunion. When they arrive at their alma mater, however, they find that not only are they the only ones to have receved letters, the invitations were actually sent by a deranged preacher intending to murder them all as punishment for their wicked ways. Will any of them escape from the remote schoolhouse alive, or will they all meet their final judgement?",
         "Six people are trapped within the confines of their old high school during their 10th high school reunion with a psychotic, masked preacher who kills them off for their sinful lives they have made for themselves."
      ],
      "budget": 0
   },
   "movielensId": 140235,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1978-04-07",
      "dvdReleaseDate": null,
      "directors": ["Constantine S. Gochis"],
      "runtime": 84,
      "movieId": 140235,
      "title": "The Redeemer: Son of Satan!",
      "mpaa": "",
      "actors": [
         "Damien Knight",
         "Jeannetta Arnette",
         "Nick Carter",
         "Nikki Barthen",
         "Michael Hollingsworth"
      ],
      "imdbMovieId": "0130216",
      "originalTitle": "The Redeemer: Son of Satan!",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["KLeBc3RUAq4"],
      "plotSummary": "Six people are trapped within the confines of their old high school during their 10th high school reunion with a psychotic, masked preacher who kills them off for their sinful lives they have made for themselves.",
      "tmdbMovieId": 86332,
      "avgRating": 1.875,
      "releaseYear": "1978",
      "numRatings": 4,
      "posterPath": "/qE0lSTMmwWzEqHbYQiUgxxtlYMf.jpg"
   }
}