{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "eroticism",
            "id": 1664
         }
      ],
      "imdb_id": "tt1233487",
      "video": false,
      "title": "Don't Look Down",
      "recommendations": [
         102461,
         70410,
         41528,
         10079,
         24583,
         78237,
         47383
      ],
      "backdrop_path": "/9YIw4CTOpdgvpRgBLWSERUxGUVX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Eloy",
               "gender": 0,
               "credit_id": "52fe46d0c3a36847f8113b11",
               "name": "Leandro Stivelman",
               "profile_path": null,
               "id": 133568,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Elvira",
               "gender": 1,
               "credit_id": "52fe46d0c3a36847f8113b15",
               "name": "Antonella Costa",
               "profile_path": "/nfKlI4epG9AzHsYMsvbhxbGrOId.jpg",
               "id": 125493,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Padre de Eloy",
               "gender": 0,
               "credit_id": "53e2bf85c3a36848500011d3",
               "name": "Hugo Arana",
               "profile_path": "/ay75uNPUTTjgnEHf6UQbvUBfW04.jpg",
               "id": 228441,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ana",
               "gender": 1,
               "credit_id": "53e2bf9bc3a36848500011d5",
               "name": "Mónica Galán",
               "profile_path": "/52ZDhh5S8bDeH8uTtrNjIMlRfsS.jpg",
               "id": 267827,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46d0c3a36847f8113b07",
               "name": "Eliseo Subiela",
               "profile_path": "/VnJ7QQwEjNrLXC1rJBKXaZwxx8.jpg",
               "id": 81116,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d0c3a36847f8113b0d",
               "name": "Eliseo Subiela",
               "profile_path": "/VnJ7QQwEjNrLXC1rJBKXaZwxx8.jpg",
               "id": 81116,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.438422,
      "production_countries": [
         {
            "iso_3166_1": "AR",
            "name": "Argentina"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 45722,
      "vote_count": 12,
      "budget": 0,
      "overview": "A sexy Spanish siren named Elvira schools a young man in tantric lovemaking.",
      "similar": [
         22705,
         2149,
         27066,
         14174,
         1813,
         80752,
         106646,
         53932,
         884,
         1278,
         116,
         979,
         28468,
         4995,
         112160,
         86331,
         627,
         122081,
         263472,
         1259
      ],
      "original_title": "No mires para abajo",
      "runtime": 80,
      "poster_path": "/qCh0UbczsJZmJhYtJoaWrBveXrK.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ministère des Affaires Étrangères",
            "id": 2588,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fonds Sud Cinéma",
            "id": 22625,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ministère de la Culture et de la Communication",
            "id": 25818,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pensa & Rocca Producciones",
            "id": 29266,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Orgon Films",
            "id": 29269,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "2008-03-07",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "When sexual fantasies come true.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Argentina",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Eliseo Subiela"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Eliseo Subiela"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt1233487/",
      "coverLink": null,
      "actors": [
         "Antonella Costa",
         "Leandro Stivelman",
         "Hugo Arana"
      ],
      "reviews": [
         "This film has a low rating by the users here. Lower than some really bad films that are more popular. It is a very magical coming of age film which deals with sexual knowledge and its relationship to the mysteries of life and the balancing of the spirit. It is told with sensitivity and some humor. It is quite erotic but short of being explicit. I think many young men in particular would benefit from seeing a film where a woman is so respected, where the woman is the teacher and the wise one. Men should see this film and imagine they should be so lucky. It is not perfect, but it is quite charming and makes very important statements about the higher consciousness of sexuality and affection....in particular for young people.",
         "The fact that a beautiful film like No mires para abajo receives a rating as low as this can only mean that most people simply cannot look past the explicit depiction of sex and nudity on film. It's a shame, because aside from being quite erotic, it's actually a beautiful and sensitive film, a piece of magical realism in the finest tradition of South American authors like Márquez and Borges, and it deals with the organic and spiritual links between life, death and sexuality with no attempt to create controversy or to arouse in the usual sense, but rather to create an atmosphere of magical, dreamy bliss. To be fair, No mires para abajo gives only a glimpse into the dreamworld it describes; the film is very short, very small in scope, and it probably wouldn't have worked had it been longer - it's an image, rather than a complete story. The two main characters are intriguing, lovable and mysterious, but neither one is a full and complex character. But for what it is, it works beautifully. It's not a story with a beginning, a middle and an end; there's no arc, or character development, or conflict. It's just a beautiful short glimpse into a more beautiful side of our reality, and if you can look past the sex and nudity and enjoy it for what it is, it's highly recommended. It won't be to everybody's taste, to be sure, but it should never be dismissed as softcore porn.",
         "Compiled from a rich tradition of oral history, most Tantric teachers rely on a book known as the Kama Sutra, a manual describing different sexual acts and different positions. Tantra is a Sanskrit word that means expanding, spreading, and manifesting - like a cosmic weave made up of different energies, including thoughts, actions, and all physical matter. In Tantric sex, you learn to prolong the lovemaking so that a perfect and harmonious union can emerge and the act of doing becomes an act of being, a spiritual rather than just a physical experience. Winner of the Best Picture Award at the 2008 Latin American Film Festival and Best Latin American Film at the 2008 Montreal World Film Festival, visionary Argentine director Eliseo Subiela's latest film Don't Look Down attempts to translate the meaning of Tantric sex into cinematic terms. While it is a brave film that has run afoul of the Argentine censors, it is not altogether successful. Eloy (Leandro Stivelman) has become a sleepwalker after the death of his father. Living close to a cemetery and having worked with his parents delivering ornamental statues and monuments for gravesites, Eloy, now 19, has a mystical bent. He can see the spirit of his father passing through his life as well as the dead inhabitants of the nearby cemetery who sit outside its walls. Trained by his father in the art of walking on stilts, Eloy's day job is to wear a ridiculous sandwich costume and walk the streets of Buenos Aires marketing his sandwiches. When sleepwalking one night, Eloy falls through the window into the bed of a beautiful woman, Elvira (Antonella Costa). He soon finds out that both Elvira and her mother Celia (Maria Elena Ruaz) are spiritual teachers. Ana reads auras and Elvira is an expert on tantric sex and the Kama Sutra. Through spending his afternoons with Elvira, Eloy discovers the confluence of sexuality and mysticism and, in his goal of thrusting 81 times without ejaculation, finds that he can travel out of his body, manifesting in Venice, Paris, and Barcelona among other destinations. All good things must end, however and when Elvira, who been visiting in Beunos Aires, tells Eloy that she must return to Barcelona, he finds it very difficult to let go - literally and figuratively. Don't Look Down, in spite of its being almost an instructional manual in how not to reach an orgasm, is not very erotic or even that interesting as cinema. We never really get to know what the characters are thinking or feeling and it is difficult to relate to them as more than teacher and pupil. The material, however, is very instructive. I can't guarantee that when you reach 60 thrusts you will materialize elsewhere but this is one exercise you can definitely try at home.",
         "This movie was very interesting. The love of the father for his son, the love of the son for his father. The music in the movie is very good. I love the scene where the nana dances as the same time as Elvira dances for Eloy. A beautiful movie. Even tough it is suppose to have been made from a tao manual, I feel it turned out to be very philosophical. I enjoyed it immensely. It was erotic and I am sure it depicts a lot of the journey for tantric student. The actors are beautiful. The decor are enchanting. The music is appropriate. The dead father finally \"living\" his life is a glimor of hope for the afterlife. The best line ever: In life you will always be saying goodbye – don't let that stop you from loving.\".",
         "This is one of those films which you will watch either because of the sex scenes it contains or because you want a good Spanish speaking film with readable English sub-titles - or both. What you get in fact is an underrated emotional comedy which has all the sex you might want to watch for curiosity sake while using it as a lesson to brush up on your Spanish. My wife and I were very taken with the film, it was nice to watch together. Yes it is a sort of Kama Sutra movie, but the film is artistically directed and the storyline, although not reaching Hollywood heights, will tickle and tease you with delight, and I am not talking about the sex scenes in that reference. Here is a film carrying a double meaning, a young boy who has been taught by his Father to walk on stilts, so he looks down on people in an amusing way. Not only that, as a sleepwalker, he has an uncanny ability to see the dead 'alive' each morning, this is all very touching in a young man who is setting out on a life of sexual exploration. I found this film on DVD by accident. I am always glad to watch a foreign language movie and especially one in Spanish. An Argentinian movie is a rare treat. Something as sexually evocative and artistic as this IS a rare treat indeed. There is hardly any nudity in movies of current release nowadays and when there is, it is hardly done in an artistic way. There are some great expressions and some really funny moments. The story is somewhat thin at times but that matters not to the overall enjoyment of the movie. Here we have a movie with artistic credibility, no bad language, no violence, a movie which is just a pleasure to watch.",
         "I'm sort of sad to be a part of this party, but like another reviewer said, this piece of French handiwork received a low rating. But like Meatloaf said after a night of busting helmets on the gridiron \"I guess they didn't understand\". Know what's funny? I rented this movie for the sex. Soft core is the wrong word to describe what I just saw, completely. I don't mean to become more caustic here, but it made me understand what people here enjoy about the glossies, you know the ones in the bags that Junior can't buy or look at. \"Don't Look Down\" was artistic and genuine. I was completely drawn toward Antonella Costa. She was innocent in an odd way, with the mystique of both a nymph and satyr.Actually, she was a woman with much knowledge about pleasure. The actress needed the body for the part, for all the parts. Why I was so entranced by a film about kama sutra, and a relationship between two French lovers is just beyond me. Because it all meshed, and subtitles I could have foregone and still understood most. The man had a very serious sleep disturbances. Becoming involved with this woman was his redemption. It was not just ordinary physical passion. He learned an art from her. He himself knew things, and soon the two of them were walking with their heads in the treetops. Some of the movie was pure fantasy, probably. Among American audiences that might be a turn-off. But a lot of people don't have the patience to watch films with subtitles. To see fantasy in a good movie, you pick out a fantasy, you know like Doctor Doolittle or Spacebusters. I feel like some day we are going to go to a computer and create our own movies, that have Genre No.1, PGH-135-1, use these preservatives, as it were, in a recipe. Where would the story be, the characters? I like foreign movies, but my viewing pleasure of this film goes beyond any genre assimilation. Foreign movies are very simple..I think that's how the actors find a chance to be characters in a movie. A lot happens, but there is not a lot of crypticism and the drive to embarrass. Although snubbed by any possible combination of American movie critics, Leandro Stivelman and Antonello Costa had a great story and a beautiful soundtrack. It's not what we go for over here, I'm not sure why.Maybe they should have processed the movie through Panaflex. It did not have real fruity colors.",
         "Eliseo Subiela has that rare quality of seeing magic in reality, of portraying it in his movies with freshness and philosophical depth. His characters, despite being normal, are in a special kind of reality, and their interaction with our world is always eccentric and quirky. Subiela is true to himself in the premise of the movie, as it departs from a quote from a poem by Andre Breton that intrinsically links live, love and death and considers physical love as a redemptive element in life. The movie revolves about the sexual awakening of Eloy, a sweet and absent-minded teenager, apprentice of electrician and courier boy to the nearby cemetery, who starts sleepwalking after the death of his father and ends in the arms of a sassy and older neighbor, Elvira, who will teach him how to satisfy a woman and himself. If you want to make a movie about tantric sex and sexual initiation you need two basic elements. Firstly, a couple of sensual actors who have chemistry on camera and are able to transmit eroticism to the spectator, so that we can believe that they are having sex and enjoying it. Secondly, to create the right atmosphere and mood so the sex scenes look natural and passionate. All of that was missing from the movie, despite sex being the main subject of the movie. The scenes look unnatural, forced, like a rehearsal. They are shot with constriction, without passion and with some visual bigotry, despite the intention of the movie being quite the opposite. It felt like those modern Kamasutra books with photos of nude couples posing in the different sexual positions - Boring and not erotic. It would have been better, perhaps, showing less, and leaving more to the imagination, which always gives great results. The most memorable moments of the movie are, however, those few in which the movie distracts itself from sex and portrays reality in Eloy's eyes and part of the family's story. The happy eeriness of Eloy's trips to the cemetery on his bike to deliver tablets are wonderfully photographed and shot, the natural interaction between the deceased and those alive are those more closely connected to Breton's initial poem and Subiela's style. Here we see the always charming Subiela in action, focusing on what he does best. Regarding the acting, I found Leandro Stivelman good and believable in his portray of the sweet and dreamy Eloy, and also Hugo Arana in his short role as Eloy's deceased father. I did not find Antonella Costa believable at all in her portray of Elvira, neither in the sex scenes or in the talking ones. Perhaps because the script does not give much information about her, and the one that gives does not help the viewer to understand her. On the other hand, she does not have the sensuality or acting maturity necessaries to affront a role like this. The rest of the actors are OK in their respective roles. Glimpses of the best Subiela are wasted by a rather mediocre and un-erotic movie with a very weak script",
         "I've watched this movie by the advice of my friend who's liked very much and find it successfully. After watching movie, I have also loved this film. It is the one of the best erotic movies which I have ever seen. İnitially, this movie is instructive. It is described various sex positions, the ways of extension of sexual intercourse and so on. In the other side, it is not contain only erotic scenes. There are magic realist scenes, dreams, imagination, longing of father, amusing scenes and so on. Director Eliseo Subielo is one of the my best directors, his other movies are good particularly \"El lade oscuro del corazon\" which picturegoers must watch.",
         "It comes as a surprise to find that Subiela, leading exponent of Magic Realism in the movies, is still at it after decades and the exposition, with the cemetery's dead taking afternoon sun and his dad showing up with nuts and bolts, looks like it's going to be vintage. However the piece settles down into lengthy make-out sessions between the two good looking leads - which is OK for five minutes but tedious thereafter. Good film craft but no substance. There's nothing much else to say about this one to bring a coverage up to the minimum requirement.",
         "A young somnambulist working for his late father's monumental masonry business (and occasionally in street advertising either on stilts or, with colleagues, dressed as wraps of the local variety) falls through a skylight onto the bed of a beautiful woman visiting Buenos Ares from Madrid. The woman's grandmother reckons the auras and conjunctures are right, so the couple engage in tantric sex for the next hour and a quarter. In a few brief intervals, the young man has daydreams about his father and all the other men buried in the cemetery sitting in a long line against the outer wall of the place enjoying the sunshine. Having taught the man to be the best lover in town, the woman returns to Madrid. I didn't get the tantric bit."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Centre National de la Cinématographie (CNC)",
         "Charivari Films",
         "Fonds Sud Cinéma"
      ],
      "summaries": ["Coming of age. In Buenos Aires, Eloy is on the verge of manhood. He studies physics, helps with the family headstone business, and does advertising - handing out flyers while walking on stilts or wearing an empanada costume. When his melancholy father dies, Eloy imagines that his father visits him at night; the explanation is more pedestrian - Eloy has started sleepwalking. Things change abruptly: while sleepwalking, he falls through an open skylight into the bed of Elvira, a young woman from Barcelona visiting her grandmother. Elvira invites Eloy to become her lover and teaches him Tantric sex. Eloy discovers bliss. And his father?"],
      "budget": 0
   },
   "movielensId": 143061,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2008-03-07",
      "dvdReleaseDate": null,
      "directors": ["Eliseo Subiela"],
      "runtime": 80,
      "movieId": 143061,
      "title": "Don't Look Down",
      "mpaa": "R",
      "actors": [
         "Leandro Stivelman",
         "Antonella Costa",
         "Hugo Arana",
         "Mónica Galán"
      ],
      "imdbMovieId": "1233487",
      "originalTitle": "No mires para abajo",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["WtSp0mi4twA"],
      "plotSummary": "A sexy Spanish siren named Elvira schools a young man in tantric lovemaking.",
      "tmdbMovieId": 45722,
      "avgRating": 3.28571,
      "releaseYear": "2008",
      "numRatings": 7,
      "posterPath": "/qCh0UbczsJZmJhYtJoaWrBveXrK.jpg"
   }
}