{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "horse",
            "id": 2673
         },
         {
            "name": "stop motion",
            "id": 10121
         },
         {
            "name": "animation",
            "id": 10336
         },
         {
            "name": "black and white",
            "id": 12999
         },
         {
            "name": "silent film",
            "id": 154802
         },
         {
            "name": "short",
            "id": 214549
         },
         {
            "name": "chronophotography",
            "id": 220102
         }
      ],
      "imdb_id": "tt2221420",
      "video": false,
      "title": "Sallie Gardner at a Gallop",
      "recommendations": [
         315946,
         159897,
         16464,
         16463,
         96882,
         33315,
         105153,
         32571,
         426903,
         105157,
         163114,
         130851,
         104476,
         386743,
         154339,
         104852,
         172126,
         175473,
         44449,
         178995
      ],
      "backdrop_path": "/AdgleVvZ1xyARr3Oa216OpYAOF8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Herself - Sallie Gardner (horse)",
               "gender": 1,
               "credit_id": "585dc47c92514115ca0045cf",
               "name": "Sallie Gardner",
               "profile_path": "/mNTxZRpSjUlRucpqpfgIZpdtoqu.jpg",
               "id": 1727031,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Himself - Domm (jockey)",
               "gender": 0,
               "credit_id": "58f358269251413da70102dd",
               "name": "Gilbert Domm",
               "profile_path": null,
               "id": 1797112,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ce29251416c91103327",
               "name": "Eadweard Muybridge",
               "profile_path": null,
               "id": 1077300,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "585dc2f892514115be0045ec",
               "name": "Eadweard Muybridge",
               "profile_path": null,
               "id": 1077300,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "585dc311c3a3681a6500411c",
               "name": "Leland Stanford",
               "profile_path": null,
               "id": 1727030,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 2.651779,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 194079,
      "vote_count": 28,
      "budget": 0,
      "overview": "Sallie Gardner at a Gallop was one of the earliest silent films — a production experiment by the photographer Eadward Muybridge on June 15, 1878 that led to the development of motion pictures. The motion picture consists of 24 photographs in a fast-motion series that were shown on a zoopraxiscope.",
      "similar": [
         3933,
         38757,
         533,
         62214,
         326359,
         140420,
         234567,
         5698,
         17700,
         20722,
         31135,
         9389,
         16464,
         461955,
         13246,
         32085,
         50081,
         46624,
         25126,
         27040
      ],
      "original_title": "Sallie Gardner at a Gallop",
      "runtime": 1,
      "poster_path": "/u6nKsvROfG9yjEED93zfIejoI5k.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Palo Alto Stock Farm",
         "id": 84748,
         "origin_country": ""
      }],
      "release_date": "1878-06-14",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Eadweard Muybridge"],
      "runtime": 1,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "None",
      "imdbLink": "http://www.imdb.com/title/tt2221420/",
      "coverLink": null,
      "actors": [
         "Gilbert Domm",
         "Sallie Gardner"
      ],
      "reviews": [
         "Sometimes ascribed as \"The Father of the Motion Picture\", Eadweard Muybridge undeniably accomplished exploiting and sometimes introducing a means of instantaneous and serial images to analyze and synthesize animal locomotion. In part, the reasons for and the claims made of his work support Virgilio Tosi's thesis that cinema was invented out of the needs of scientific research. Conversely, they're informed by Muybridge's background as an artistic location photographer and, as Phillip Prodger suggests, in book sales and more useful to art than to science, as Marta Braun has demonstrated (see sources at bottom). Additionally, Muybridge quickly exploited their entertainment value via projection to audiences across the U.S. and Europe. Muybridge pursued both of these paths of invention: the path taken by Jules Janssen, Étienne-Jules Marey and others for science and the path taken by Ottomar Anschütz, Thomas Edison, the Lumiére brothers and others for fame and profit. Muybridge began taking instantaneous single photographs of multi-millionaire railroad magnate Leland Stanford's horses in motion in 1872. It was disputed at the time whether all four of a horse's legs were off the ground simultaneously at any time while running. Although no surviving photographs prove it, contemporary lithographs and paintings likely based on the photographs, indeed, show the moment of \"unsupported transit\". In between and interrupting these experiments, Muybridge was found not guilty of the admittedly premeditated fatal shooting of his wife's lover and possibly her son's father. Publication of Marey's graphic measurements of a horse's movements reignited Stanford's interest in the gait of horses. In turn, Marey was convinced to switch to photography in his motion studies after witnessing Muybridge's work (see \"Falling Cat\" (1894)). This work in \"automatic electro-photographs\" began in 1878 at Stanford's Palo Alto Stock Farm. Multiple cameras were stored in a shed parallel to a track. A series of closing boards serving as shutters were triggered by tripped threads and electrical means. The wet collodion process of the time, reportedly, could need up to half a minute for an exposure. For the split-second shutter speeds required here, a white canvas background and powdered lime on the track provided more contrast to compensate for less light getting to the glass plates. Employees of Stanford's Central Pacific Railroad and others helped in constructing this \"set\" and camera equipment. Contrary to unattributed claims on the web, this so-called \"Sallie Gardner at a Gallop\" wasn't the first series photographed by Muybridge. Six series of Muybridge's first subjects were published on cards entitled \"The Horse in Motion\". The first is of the horse Abe Edgington trotting on 11 June 1878. Reporters were invited for the next two series on June 15th, and, as they reported, again, Abe went first—trotting and pulling the driver behind in a sulky, which is what tripped the threads. The second subject that day was Sallie Gardner running and, thus, the mare had to trip the threads. Reporters noted how this spooked her and how that was reflected in the negatives developed on the spot. As one article said, she \"gave a wild bound in the air, breaking the saddle girth as she left the ground.\" Based on such descriptions, it doesn't seem that this series exists anymore. The animations on the web that are actually of Sallie are dated June 19th on \"The Horse in Motion\" card. Many animations claimed to be Sallie on YouTube, Wikipedia and elsewhere, as of this date, are actually of a mare named Annie G. and were part of Muybridge's University of Pennsylvania work published in 1887, as the Library of Congress and other reliable sources have made clear. The early Palo Alto photographs aren't as detailed and are closer to silhouettes. The 12 images of Gardner also include one where she's stationary. The Morse's Gallery pictures are entirely in silhouette, while the La Nature engravings of these same images show the rider in a white shirt. The shot of the horse stationary, as Braun points out, was added later and is indicative of the artistic and un-scientific assemblages Muybridge made of his images—with the intent of publication, including in his own books. This was especially prominent in his Pennsylvania work, which included many nude models that were surely useful for art. Muybridge influenced artists from Realists like Thomas Eakins and Meissonier, Impressionists like Edgar Degas and Frederick Remington, to the more abstract works of Francis Bacon. His precedence has also been cited in the photography of Steven Pippin and Hollis Frampton, as well as the bullet-time effects in \"The Matrix\" (1999). Muybridge lectured on this relationship with art when touring with his Zoöpraxiscope, which was a combination of the magic lantern and phenakistoscope. With it, he projected, from glass disks, facsimiles of his photographs hand-painted by Erwin Faber. Without intermittent movement, the Zoöpraxiscope compressed the images, so elongated drawings were used instead of photographs. Muybridge and others also used his images for phenakistoscopes and zoetropes. The first demonstration of the Zoöpraxiscope was to Stanford and friends in the autumn of 1879. A public demonstration was given on 4 May 1880 for the San Francisco art association, and Muybridge continued these lectures for years—personally touring the U.S. and Europe. Although there were predecessors in animated projections as far back as 1847 by Leopold Ludwig Döbler, in 1853 by Franz von Uchatius, and with posed photographs by Henry Heyl in 1870, the chronophotographic and artistic basis offered some novelty for Muybridge's presentations. They also led him to meet Edison and Marey and inspire the likes of Anschütz and others—those who took the next steps in the invention of movies. (Main Sources: \"The Inventor and the Tycoon\" by Edward Ball. \"Eadweard Muybridge\" and \"Picturing Time\" by Marta Braun. \"The Man Who Stopped Time\" by Brian Clegg. \"Man in Motion\" by Robert Bartlett Haas. \"The Father of the Motion Picture\" by Gordon Hendricks. \"The Stanford Years, 1872-1882\" edited by Anita Ventura Mozley. \"Time Stands Still\" by Phillip Prodger. \"Cinema Before Cinema\" by Virgilio Tosi.)",
         "So this is it. Interestingly enough, this is also the only movie-related work by Eadweard Muybridge. I'm truly curious how people perceived and reacted to these 3 seconds back in the 1880s. Muybridge certainly made a good choice for picking this subject, a majestic horse and its rider with a strong contrast in color between his shirt and his breeches. Surely a smart move to use the animal's hooves as the trigger for making the shots. If you take a close enough look you can see the numbers of the photographs he used in the bottom left. What I also liked about it is all the different shadows and shades altering constantly. It must have been a unique experience to see something in motion that, at the point of time when they saw it, was already long gone.",
         "Sallie Gardner at the Gallop (1878) While this here isn't technically the first movie, it was certainly a great introduction of what was to come. We basically see a horse being filmed by twenty-four different cameras for what amounts to a moving image. I'm not about to rip off other people's work so it's best that you Google this title and read for yourself what exactly had to be done to give it the effect that we are seeing today. It's impossible to viewing this as a \"movie\" and it would be silly to do so especially since that's not what it is. It's just twenty-four images of a horse put together and of course we know what happens.",
         "\"Sallie Gardner at a Gallop\" is probably the one experiment that made its maker, Eadweard Muybridge, famous. That's probably because it's his first. Muybridge himself would go on to create hundreds of these brief series photographies, featuring both humans and animals. While this man is certainly a key influence on the development of motion pictures, this movie here is not the first movie. Why? It's just a lot of photos. You cannot call a series of photos shown one after another to create the illusion of movement a film, because it's not an actual strip of celluloid. It's just photos. But, despite this, the historical value remains. This one may not have been a true motion picture, but it was inspiration for what was to come. The short was made using 24 different cameras. These cameras, triggered by trip wires, would each snap a photo after the trip wire was triggered. As a result, we end up with 24 different photos when put together show the horse galloping. Originally, the idea of this was to see if a horse had all four feet off the ground and briefly air-born, as Leland Stanford believed they did. Muybridge was more interested in proving Stanford's theory correct than actually trying to create a moving picture. But despite this, \"Sallie Gardner at a Gallop\" remains a look into the beginning of motion picture experiments today and can be viewed on YouTube and Wikipedia. While not the first movie, Muybridge had the right idea when he made it. An eight for the historic value behind it."
      ],
      "genres": ["Short"],
      "productionCompanies": ["Palo Alto Stock Farm"],
      "summaries": ["The clip shows a jockey, Domm, riding a horse, Sally Gardner. The clip is not filmed but instead consists of 24 individual photographs shot in rapid succession, making a moving picture when using a zoopraxiscope."],
      "budget": 0
   },
   "movielensId": 148048,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1878-06-14",
      "dvdReleaseDate": null,
      "directors": ["Eadweard Muybridge"],
      "runtime": 1,
      "movieId": 148048,
      "title": "Sallie Gardner at a Gallop",
      "mpaa": "",
      "actors": [
         "Sallie Gardner",
         "Gilbert Domm"
      ],
      "imdbMovieId": "2221420",
      "originalTitle": "Sallie Gardner at a Gallop",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [
         "o-ZJxDHDK9c",
         "xch3VrRik_Q"
      ],
      "plotSummary": "Sallie Gardner at a Gallop was one of the earliest silent films — a production experiment by the photographer Eadward Muybridge on June 15, 1878 that led to the development of motion pictures. The motion picture consists of 24 photographs in a fast-motion series that were shown on a zoopraxiscope.",
      "tmdbMovieId": 194079,
      "avgRating": 2.83333,
      "releaseYear": "1878",
      "numRatings": 12,
      "posterPath": "/u6nKsvROfG9yjEED93zfIejoI5k.jpg"
   }
}