{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "alien invasion",
            "id": 14909
         },
         {
            "name": "human subjugation",
            "id": 207569
         },
         {
            "name": "environmental disaster",
            "id": 215299
         },
         {
            "name": "based on young adult novel",
            "id": 223438
         }
      ],
      "imdb_id": "tt2304933",
      "video": false,
      "title": "The 5th Wave",
      "recommendations": [
         262504,
         294254,
         290595,
         262500,
         205584,
         158852,
         257445,
         267860,
         274854,
         131634,
         166424,
         325133,
         254128,
         47933,
         328387,
         157350,
         68735,
         76757,
         227156,
         227719
      ],
      "backdrop_path": "/4obYMyIZALl7svc83fn7KelTZDp.jpg",
      "revenue": 109906372,
      "reviews": [
         {
            "author": "Frank Ochieng",
            "id": "56a6cb0392514129fe001383",
            "content": "Well, the young adult movie adaptation genre continues to percolate despite the farewell sentiments as demonstrated by hugely popular products meant to entice the teen scene such as the Twilight, Divergent, Maze Runner and The Hunger Games film series. Sure, why not tamper with a proven formula that guarantees all the right ingredients to tap into the angst-ridden world of young feminine empowerment set against a background of apocalyptic strife and undefined self-discovery? In director J Blakeson’s drippy and derivative dystopian drama The 5th Wave we are introduced to another similar sci-fi serving of a disillusioned heroine out to reflect some consciousness in a boundary of uncertainly and destructive despair. Sadly, The 5th Wave is nothing more than a stillborn alien invasion soap opera that wants to spout off its Hunger Games-esque copycat coating but fails to delve into anything remotely original or bitingly daring.\r\n\r\nThe 5th Wave is the literary brainchild of novelist Rick Yancey’s printed pages as he brings to life the trials and tribulations of tenacious teen tart Cassie Sullivan (Chloe Grace Moretz from “Kick-Ass”), a timid tyke-turned-guerilla warfare gal whose guts and gumption to find and protect her little brother during a full-scale alien invasion of the planet is put forth in flimsy animated fashion. Actually the young actress Moretz, a veteran of a few films already lodged under her belt, has quite a feisty presence on screen and more than holds her own as the “princess of panic” in the generic doomsday drama that really brings nothing to the tension-filled table.\r\n\r\nThe material that Moretz is obligated to bring to life feels rather strained and stilted because the YA creative cloud hovers over the proceedings in a predictable, syrupy manner. The 5th Wave lacks the intensity and philosophical fiber that The Hunger Games effortlessly put forth in imaginable conception. Plus, the energy and bombastic buzz of Hunger Games imitator Divergent does not seem to be part of The 5th Wave’s anemic pulse. Incredibly, Blakeson’s lean and lacking futuristic feminine fable incorporates a cinematic stew of film flavors that heavily echoes such solid blueprints as everything from Red Dawn and Independence Day to the WOW-factor of blockbusters in Jurassic Park and Starship Troopers. The sad part is that even with the borrowing of these cinematic ideas The 5th Wave still registers as a limp alien invasion actioner without much punch or promise. The film is well-intentioned in its YA-oriented gravitas but will soon be dismissed as another Hunger Games wannabe going through the motions.\r\n\r\nAs with the inspired makeup that is at the root of these conventional YA melodramas, The 5th Wave offers its share of youth-minded dire and doom, romantic exploration and the element of military-style redemption and rebellion. As Moretz’s Callie is called into action among the devastating ruins she is determined to reunite with her last surviving  relative Sam (Zackary Arthur). Soon, this mild-mannered schoolgirl has to whip into shape and protect the interests of her deteriorating community as the hard-nosed alien invaders look to wreak havoc and take over the world–or at least Callie’s part of the world that has her fellow citizens shocked and stunned.\r\n\r\nPoor Cassie…in addition to her mind focusing on locating her sibling, revving up for her showdown with the alien intruders and shaking of her vulnerabilities she is caught in a love triangle that tests her limits. Should Cassie fall for the dashing and daring Ben (Nick Robinson, “Jurassic World”), a fellow classmate about to enroll into the junior start-up army looking to combat the unwelcomed visitors or should her confused heart throb for backwoods bad boy Evan Walker (Alex Roe)? Also, how would Cassie feel if she discovers that her hunk-in-training may have a thing for the ravaging rough-around-the-edges recruit Ringer (Maika Monroe). Ah, love among the languishing landscape!\r\n\r\nIt is definitely the consensus that The 5th Wave may not be included in the Mount Rushmore of youth-friendly dystopias merely because it is nothing more than a shadowy reminiscence of the more defining, developed and decisive babes-in-the-woods boisterous actions. Even when not just comparing The 5th Wave to its better conceived contemporaries it dos not feel comfortable in its own mediocrity when standing on its own two feet. It is compelling only for its goal in pushing the conveyor belt of sci-fi YA duds to uphold Hollywood’s attempt to kidnap the psyche of young moviegoers looking for the next big screen teen scene sensation to boost box office receipts.\r\n\r\nSorry but there is no need to take out the sci-fi surfing board for the tepid trappings of The 5th Wave. \r\n\r\nThe 5th Wave (2016)\r\n\r\nSony Pictures Entertainment/Columbia Pictures\r\n\r\n1 hr 53 mins.\r\n\r\nStarring: Chloe Grace Moretz, Nick Robinson, Alex Roe, Liev Schreiber, Maria Bello, Ron Livingston, Maika Monroe, Maggie Siff, and Zackary Arthur\r\n\r\nDirected by: J Blakeson\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Teen Fantasy/Drama/Alien Invasion Thriller\r\n\r\nCritic’s rating: ** stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng 2016",
            "url": "https://www.themoviedb.org/review/56a6cb0392514129fe001383"
         },
         {
            "author": "Reno",
            "id": "571cd1bf925141342b000ac8",
            "content": "> Another teen film trilogy, alien invasion theme on a roll.\r\n\r\nThe 80s teen films were different, (like the recent one 'Turbo Kid') especially those I watched when I was growing up in the late 90s and early 2000s. But now most of them are dystopian action-adventure-fantasy/sci-fi themes, and obviously trilogies with high end graphics. I won't blame for that, the time has come for a change, the movies have technical qualities and they know how to render them, but the stories are terrible.\r\n\r\nTo me this was just an okay film. Felt like the action-adventure versions of 'The Host', but I loved that one, not this. I know it's a trilogy, so, more stories to come with more explanations, but the first film in a series is always important and it failed to impress me. This installment is all about a teen girl and her younger brother. After getting separated during the chaos of alien invasion, she goes to look for him and that's the film.\r\n\r\nThis might be the finer contents for a book, but for a movie, it is not that any special. I did not like the ending as well, felt like it was so stupid. Even some B films got better conclusion and stunt sequences. I feel bad for Chloe Moretz for taking up this project. She should do more action films like 'Kick-Ass'. I thought she would be the one who's going to replace Angelina Jolie. I can only hope for this series to get better in the follow up and end as a decent trilogy.\r\n\r\n5/10",
            "url": "https://www.themoviedb.org/review/571cd1bf925141342b000ac8"
         },
         {
            "author": "Killa-What?",
            "id": "57d4843ec3a36855680079c7",
            "content": "Here we go again, another female empowered teen movie. HW seem to be literally pumping this garbage out for the last few years. Is it any wonder why movie sales are down with garbage like this on the shelf? Designed to be for all those teens who like the idea of blood, but really don't want to see it (think twilight, hunger games etc). Save your money and 1h50m of your time and skip.\r\nIf you really need to see it, in brief it's about a 16 year old girls world turned upside down by an 'alien' invasion when her brother is taken by supposed US army to fight the aliens and father is shot. Befriended by one of 'the others' helps to get the aliens on the run.\r\nNifty idea, however for me falls way short as you don't see any real 'aliens', mediocre acting and story line is very predicable. Look for it in the bargain bin at videoezy in 12 months.",
            "url": "https://www.themoviedb.org/review/57d4843ec3a36855680079c7"
         },
         {
            "author": "Gimly",
            "id": "57e5cca7925141413f003f3e",
            "content": "It's like someone read _The Road_ and went \"Oh hey, that was pretty good, I know how I can ruin it!\". It's a worse _Hunger Games_ movie than even the last _Hunger Games_ movie was. It's the kind of film where after the opening scene, there is a 40 minute flashback sequence of pure awkward exposition. It's the kind of film that manages to avoid being \"offensively bad\" by by the skin of its teeth, only because it is instead \"embarrassingly bad\". It's the kind of film that thinks it's going to get a sequel, so it resolves **nothing**, but that sequel will never happen.\r\n\r\nI terms of acting? Look, Liev Schreiber was okay, but his role is both minor and beneath him. Chloe Grace Moretz has never been worse. Even Maika Monroe who was amazing in _It Follows_ and _The Guest_ is absolutely awful in this. Everyone else was terrible. There are so many moments in The _5th Wave_ that had me shaking my head, and the acting, dialogue and plot are all equally to blame.\r\n\r\nOh. And the CGI fuckin' sucks.\r\n\r\n_Final rating:★ - Of no value._",
            "url": "https://www.themoviedb.org/review/57e5cca7925141413f003f3e"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Cassiopeia \"Cassie\" Sullivan",
               "gender": 1,
               "credit_id": "5450e730c3a3680239003ffa",
               "name": "Chloë Grace Moretz",
               "profile_path": "/qdGkECvmdubsMJO4GhHka5YCoOu.jpg",
               "id": 56734,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Ben \"Zombie\" Parish",
               "gender": 2,
               "credit_id": "5450e7460e0a263a0a0042c5",
               "name": "Nick Robinson",
               "profile_path": "/33RypiHCQc3BkuzZ6WsonrhSIer.jpg",
               "id": 1108907,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Evan Walker",
               "gender": 2,
               "credit_id": "5450e765c3a368022a00441e",
               "name": "Alex Roe",
               "profile_path": "/1p0F7PPgQMxgZ8KKGFpJfpxPfHl.jpg",
               "id": 1167375,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Marika \"Ringer\" Kimura",
               "gender": 1,
               "credit_id": "5450e7940e0a263a04004539",
               "name": "Maika Monroe",
               "profile_path": "/3MyvscK0RoxmwLSIWzxRA2UrC6v.jpg",
               "id": 1094091,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Sammy \"Nugget\" Sullivan",
               "gender": 2,
               "credit_id": "5450e7ca0e0a263a100043b9",
               "name": "Zackary Arthur",
               "profile_path": "/n2r3eHRClebQ7jp77N3LMX9oLhm.jpg",
               "id": 1379122,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Lieutenant Colonel Alexander Vosch",
               "gender": 2,
               "credit_id": "5450e7720e0a263a100043a9",
               "name": "Liev Schreiber",
               "profile_path": "/qFn3npmqd1qaYOk6yohmi3FbPhc.jpg",
               "id": 23626,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Sergeant Reznik",
               "gender": 1,
               "credit_id": "56b024c09251410b37000aff",
               "name": "Maria Bello",
               "profile_path": "/tFkbad0JoWvYc6XYBITv6EfeLwR.jpg",
               "id": 49,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Lisa Sullivan",
               "gender": 1,
               "credit_id": "5450e7a70e0a2639fe00449d",
               "name": "Maggie Siff",
               "profile_path": "/ufiWZMq4z5yra0At3NlYvyZ72ws.jpg",
               "id": 74537,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Oliver Sullivan",
               "gender": 2,
               "credit_id": "56b02501c3a368647700098a",
               "name": "Ron Livingston",
               "profile_path": "/AjR0aCaDOK6S38I8ziICgVbxH5I.jpg",
               "id": 17402,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Allison / \"Teacup\"",
               "gender": 1,
               "credit_id": "5450e7eb0e0a2642c20012cf",
               "name": "Talitha Bateman",
               "profile_path": "/4zGOVkPuA9WAcMGSIHTNVpw0GVj.jpg",
               "id": 1379123,
               "order": 9
            },
            {
               "cast_id": 97,
               "character": "Dumbo",
               "gender": 2,
               "credit_id": "574b1b8ec3a36858670012c5",
               "name": "Tony Revolori",
               "profile_path": "/gZbodAVh4dv06zc4zmAnyBdCkah.jpg",
               "id": 1291350,
               "order": 10
            },
            {
               "cast_id": 104,
               "character": "Kenny / \"Oompa\"",
               "gender": 2,
               "credit_id": "574b1e6dc3a368586700132b",
               "name": "Cade Canon Ball",
               "profile_path": "/343VD2HqLr3vOy9KheMZfk1dxra.jpg",
               "id": 1487329,
               "order": 11
            },
            {
               "cast_id": 107,
               "character": "Tank",
               "gender": 2,
               "credit_id": "574b1fa49251413f4700153d",
               "name": "Flynn McHugh",
               "profile_path": "/v2jZPEg98XObEQ0eIoycEtNJGfq.jpg",
               "id": 1628095,
               "order": 12
            },
            {
               "cast_id": 105,
               "character": "Flintstone",
               "gender": 2,
               "credit_id": "574b1ee5c3a368319a001731",
               "name": "Alex MacNicoll",
               "profile_path": "/1RTMIaEXDh0dfq829Opxsq65ykH.jpg",
               "id": 1381981,
               "order": 13
            },
            {
               "cast_id": 106,
               "character": "Poundcake",
               "gender": 2,
               "credit_id": "574b1efb9251417468000024",
               "name": "Nadji Jeter",
               "profile_path": "/cG48MotQHIvqIe6Vz82TiXXWFDz.jpg",
               "id": 587035,
               "order": 14
            },
            {
               "cast_id": 90,
               "character": "Lizbeth Morgan",
               "gender": 1,
               "credit_id": "574b0fc0c3a368319a001519",
               "name": "Gabriela Lopez",
               "profile_path": "/qNTvzdufblvqqzzV78GnUaTmQrz.jpg",
               "id": 1628061,
               "order": 15
            },
            {
               "cast_id": 91,
               "character": "Julia",
               "gender": 1,
               "credit_id": "574b15c1c3a36858670011f9",
               "name": "Bailey Anne Borders",
               "profile_path": "/o4VHrStTAS7CSTPDaAsk34ipegf.jpg",
               "id": 1168702,
               "order": 16
            },
            {
               "cast_id": 96,
               "character": "Jeremy",
               "gender": 2,
               "credit_id": "574b1a7ac3a368586700129e",
               "name": "Parker Wierling",
               "profile_path": "/kzTEsgvA2mfAtIazSQ14F4NDOsW.jpg",
               "id": 1371097,
               "order": 17
            },
            {
               "cast_id": 98,
               "character": "Hutchfield",
               "gender": 2,
               "credit_id": "574b1ba6925141362d00173d",
               "name": "Terry Serpico",
               "profile_path": "/3znAbAv0sqBZMvwluRaRQQBeR2M.jpg",
               "id": 2257,
               "order": 18
            },
            {
               "cast_id": 95,
               "character": "Ms. Paulson",
               "gender": 1,
               "credit_id": "574b19bc9251412d29001550",
               "name": "Charmin Lee",
               "profile_path": "/q6AsPap6ZOMQhjLayu545ba8Kp4.jpg",
               "id": 1628087,
               "order": 19
            },
            {
               "cast_id": 111,
               "character": "Major Bob",
               "gender": 2,
               "credit_id": "574b205dc3a3683c180018b3",
               "name": "Michael Beasley",
               "profile_path": "/mk8jUlzVPUsKSQjHi6ATtaCtb47.jpg",
               "id": 143261,
               "order": 20
            },
            {
               "cast_id": 89,
               "character": "Wounded Man with Crucifix",
               "gender": 2,
               "credit_id": "574b0fa3c3a3683a5e001447",
               "name": "Matthew Zuk",
               "profile_path": "/gu0Cv1V7x5JwJjbYP8IpbOlbhg0.jpg",
               "id": 1480027,
               "order": 21
            },
            {
               "cast_id": 92,
               "character": "Soccer Coach",
               "gender": 2,
               "credit_id": "574b1822c3a368210d0015a9",
               "name": "David Maldonado",
               "profile_path": "/2AECSd786VrroYxwoLOZyN12XsU.jpg",
               "id": 1327175,
               "order": 22
            },
            {
               "cast_id": 93,
               "character": "TV News Anchor",
               "gender": 2,
               "credit_id": "574b192fc3a368393a001549",
               "name": "Paul Ryden",
               "profile_path": "/oyA1eL4vima80yVeA7nUtD00LIa.jpg",
               "id": 1628085,
               "order": 23
            },
            {
               "cast_id": 94,
               "character": "White House Spokesman",
               "gender": 2,
               "credit_id": "574b19a2c3a36802f600330b",
               "name": "E. Roger Mitchell",
               "profile_path": "/ooczOXwYhY6WRampNqYDIM6ecoT.jpg",
               "id": 41020,
               "order": 24
            },
            {
               "cast_id": 99,
               "character": "Private Parker",
               "gender": 0,
               "credit_id": "574b1bbac3a368210d001619",
               "name": "Derek Roberts",
               "profile_path": "/d5rqUZmRX7ElNp8NnDTnbeYhgjV.jpg",
               "id": 1445680,
               "order": 25
            },
            {
               "cast_id": 100,
               "character": "Bullhorn Soldier",
               "gender": 2,
               "credit_id": "574b1bcf92514139200015ba",
               "name": "Geoffrey Kennedy",
               "profile_path": "/qLjMd6PBGSXlkj2GYwUYgm8ImQJ.jpg",
               "id": 1317541,
               "order": 26
            },
            {
               "cast_id": 101,
               "character": "Confused Man",
               "gender": 2,
               "credit_id": "574b1c3dc3a36858670012dd",
               "name": "Devin McGee",
               "profile_path": "/w114aNIUCnWYxodcXLS4yAV6k30.jpg",
               "id": 1021528,
               "order": 27
            },
            {
               "cast_id": 102,
               "character": "Exam Room Tech",
               "gender": 1,
               "credit_id": "574b1d199251414073001515",
               "name": "Adora Dei",
               "profile_path": "/hEUxt0xDXUmxjjtbVy6BxGrCzGY.jpg",
               "id": 1032522,
               "order": 28
            },
            {
               "cast_id": 103,
               "character": "Sniper in Woods",
               "gender": 2,
               "credit_id": "574b1e28c3a3683a5e00161c",
               "name": "Kevin L. Johnson",
               "profile_path": "/ahmMHAEmPBmvpeFC3M4cVQ4tFol.jpg",
               "id": 1098577,
               "order": 29
            },
            {
               "cast_id": 108,
               "character": "Helicopter Soldier",
               "gender": 0,
               "credit_id": "574b2015c3a36802f60033d5",
               "name": "Courtney Munch",
               "profile_path": "/um5AzVKTEto9JL922fS1C0x39h3.jpg",
               "id": 1205900,
               "order": 30
            },
            {
               "cast_id": 109,
               "character": "Situation Room Soldier",
               "gender": 0,
               "credit_id": "574b202cc3a3683a5e00164e",
               "name": "Kendrick Cross",
               "profile_path": "/rEXGbYVk5NPmCrJLY5AdYC5uS1W.jpg",
               "id": 1230922,
               "order": 31
            },
            {
               "cast_id": 110,
               "character": "Tech Soldier",
               "gender": 0,
               "credit_id": "574b20499251413f2f0015b3",
               "name": "Chelsea Hayes",
               "profile_path": "/wHfseKDKrubOfDhq3tlOdpmyRg2.jpg",
               "id": 1381406,
               "order": 32
            },
            {
               "cast_id": 112,
               "character": "Captured Teen (uncredited)",
               "gender": 1,
               "credit_id": "574b24bfc3a36802f600344b",
               "name": "Olivia Cloer",
               "profile_path": "/znCN0EzWSg41QQRZ7fQK9LGVioh.jpg",
               "id": 1628106,
               "order": 33
            },
            {
               "cast_id": 114,
               "character": "Quarantine Victim (uncredited)",
               "gender": 1,
               "credit_id": "5a3a07fa0e0a264ccd20f721",
               "name": "Kelly Róisín",
               "profile_path": "/cxhxKnIUlBkqtrSUjp4WngDpJ1F.jpg",
               "id": 1945016,
               "order": 35
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5450e56e0e0a263a10004373",
               "name": "J Blakeson",
               "profile_path": "/uioDLhI4kXUeNZPgBOv7gWvwG1q.jpg",
               "id": 111588,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5450e59dc3a368022a0043cf",
               "name": "Susannah Grant",
               "profile_path": "/jEvMIuUbTu9HDzNfv5P23kQixy7.jpg",
               "id": 6340,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5450e5b6c3a368022a0043de",
               "name": "Rick Yancey",
               "profile_path": null,
               "id": 1379119,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5450e5dc0e0a263a0a00429b",
               "name": "Tobey Maguire",
               "profile_path": "/l8e9we9RmTsYgNpx4xqQIlMplLl.jpg",
               "id": 2219,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5450e6010e0a263a0a00429f",
               "name": "Graham King",
               "profile_path": null,
               "id": 16729,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5450e61bc3a3680242004501",
               "name": "Paul Rubell",
               "profile_path": "/8s0yqFYTjb6gA8uBpMCX3DILhfI.jpg",
               "id": 10816,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5450e636c3a368022a0043f0",
               "name": "Francine Maisler",
               "profile_path": "/7kOKhRSuwDXqyd2Dm2xdWdi18lQ.jpg",
               "id": 6410,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5450e64d0e0a2639fe004476",
               "name": "Jon Billington",
               "profile_path": "/3wMaenFPT4rhJuPKJcE49eH7WGk.jpg",
               "id": 9819,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5450e65d0e0a263a10004391",
               "name": "Travis Pates",
               "profile_path": null,
               "id": 1379120,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "56b4b1d792514112b900402a",
               "name": "Enrique Chediak",
               "profile_path": null,
               "id": 17598,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56b4b20cc3a36806ee004fa6",
               "name": "Julian Ashby",
               "profile_path": null,
               "id": 9818,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 0,
               "credit_id": "56b4c1d392514114e5004fff",
               "name": "Jennifer R. Blair",
               "profile_path": null,
               "id": 1555644,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56b4c21ec3a36806ea00514f",
               "name": "Michael Gowen",
               "profile_path": null,
               "id": 1533094,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "56b4c25cc3a36806f1004e4c",
               "name": "Chase Paris",
               "profile_path": null,
               "id": 1345610,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "56b4c26dc3a36806ea00515b",
               "name": "Tara Feldstein",
               "profile_path": "/8Mtv58QeYereQ7OgkNjTxJDRrXg.jpg",
               "id": 1345611,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "56b4c27fc3a36806ee0052d9",
               "name": "John McAlary\t",
               "profile_path": null,
               "id": 935493,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "56b4c292c3a36806f1004e5a",
               "name": "Jodie Stern",
               "profile_path": null,
               "id": 1573012,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "56b4c2a9c3a36806ec006292",
               "name": "Charlene Amateau",
               "profile_path": null,
               "id": 1323077,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c2c892514114eb00505a",
               "name": "Rendell Bryce",
               "profile_path": null,
               "id": 1573013,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "56b4c2dec3a36806ea00516d",
               "name": "Ashley Marie Parker",
               "profile_path": null,
               "id": 1573015,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "56b4c2f5c3a36806f8004cbf",
               "name": "Myra N. Foy",
               "profile_path": null,
               "id": 1533100,
               "department": "Costume & Make-Up",
               "job": "Seamstress"
            },
            {
               "gender": 2,
               "credit_id": "56b4c30bc3a3680700004d2c",
               "name": "Tom Kramer",
               "profile_path": null,
               "id": 1336197,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c337c3a3680700004d37",
               "name": "Gail Hunter",
               "profile_path": null,
               "id": 1458202,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c35ec3a36806ea005181",
               "name": "Robert John Dubiel",
               "profile_path": null,
               "id": 1573016,
               "department": "Directing",
               "job": "Script Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56b4c3c1c3a36806ec0062b6",
               "name": "Jeff Crumbley",
               "profile_path": null,
               "id": 1573017,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56b4c3e892514114d9005114",
               "name": "Patrick Longman",
               "profile_path": null,
               "id": 1495530,
               "department": "Camera",
               "job": "Helicopter Camera"
            },
            {
               "gender": 0,
               "credit_id": "56b4c3fcc3a36806fc005091",
               "name": "Chuck Zlotnick",
               "profile_path": null,
               "id": 1394724,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "56b4c40f925141662c0029e3",
               "name": "Dan Cornwall",
               "profile_path": null,
               "id": 1403412,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "56b4c422c3a36806e60054d5",
               "name": "Art Schultz",
               "profile_path": null,
               "id": 1573019,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "56b4c4ae9251410aab002a8c",
               "name": "Sean Schur",
               "profile_path": null,
               "id": 1433059,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c4c99251417dca001bf1",
               "name": "Patrick Zentis",
               "profile_path": null,
               "id": 1573022,
               "department": "Crew",
               "job": "Visual Effects Art Director"
            },
            {
               "gender": 0,
               "credit_id": "56b4c4f1c3a36806f8004cff",
               "name": "Karina Benesh",
               "profile_path": null,
               "id": 1558090,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56b4c5039251410aab002aa1",
               "name": "Joel Greenberg",
               "profile_path": null,
               "id": 1558574,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56b4c5149251410aab002aa6",
               "name": "Crisanta Melendez",
               "profile_path": null,
               "id": 1573023,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56b4c529c3a36806e6005500",
               "name": "Jacquelyn Racine",
               "profile_path": null,
               "id": 1570597,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56b4c53c9251410aab002ab3",
               "name": "Anna-Lena Carl",
               "profile_path": null,
               "id": 1573024,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56b4c54e925141662c002a13",
               "name": "Brett Madill",
               "profile_path": null,
               "id": 1573025,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56b4c5609251415320003cb8",
               "name": "Shawn Broes",
               "profile_path": null,
               "id": 1459895,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c58392514114d9005154",
               "name": "Mike Fay",
               "profile_path": null,
               "id": 1314588,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c596c3a36806ee005356",
               "name": "Brandon Terry",
               "profile_path": null,
               "id": 1453671,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c5adc3a36806ea0051e9",
               "name": "Ryan Andersen",
               "profile_path": null,
               "id": 1573031,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c5c5c3a36806ec006314",
               "name": "Neishaw Ali",
               "profile_path": null,
               "id": 1364798,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "56b4c5d9c3a36806ec00631a",
               "name": "Diana Stulic Ibanez",
               "profile_path": null,
               "id": 1573033,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "56b4c5ed9251417dca001c26",
               "name": "Jinnie Pak",
               "profile_path": null,
               "id": 1384381,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "56b4c60392514114d9005173",
               "name": "Carrie Richardson",
               "profile_path": null,
               "id": 1573035,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "56b4c61d925141662c002a37",
               "name": "Darren Poe",
               "profile_path": null,
               "id": 1368851,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c6309251415320003ce2",
               "name": "Scott Stokdyk",
               "profile_path": null,
               "id": 1411835,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c64492514114e50050d6",
               "name": "Gregory D. Liegey",
               "profile_path": null,
               "id": 1395027,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c6599251410aab002aed",
               "name": "Bryan Godwin",
               "profile_path": null,
               "id": 1335151,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c677c3a36806ea005216",
               "name": "Jeff Campbell",
               "profile_path": null,
               "id": 1403400,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c69e92514114d9005183",
               "name": "Hugo Weng",
               "profile_path": null,
               "id": 1050930,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 2,
               "credit_id": "56b4c6b7c3a36806f8004d46",
               "name": "R.J. Kizer",
               "profile_path": null,
               "id": 52193,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 0,
               "credit_id": "56b4c6d792514114d900518c",
               "name": "Rick Owens",
               "profile_path": null,
               "id": 1367362,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "56b4c6ecc3a36806ec00635a",
               "name": "Christopher Flick",
               "profile_path": null,
               "id": 1546875,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 2,
               "credit_id": "56b4c7799251415320003d12",
               "name": "Richard King",
               "profile_path": null,
               "id": 1341403,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "56b4c78bc3a36806ec006382",
               "name": "Richard King",
               "profile_path": null,
               "id": 1341403,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "56b4c7a2c3a36806fc00512d",
               "name": "Anji Bemben",
               "profile_path": null,
               "id": 1182909,
               "department": "Costume & Make-Up",
               "job": "Hair Department Head"
            },
            {
               "gender": 0,
               "credit_id": "56b4c7bdc3a36806fc005134",
               "name": "Suzanna Boykin",
               "profile_path": null,
               "id": 1573037,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56b4c7e5c3a36806e6005567",
               "name": "Elizabeth Robinson",
               "profile_path": null,
               "id": 1573038,
               "department": "Costume & Make-Up",
               "job": "Key Hair Stylist"
            },
            {
               "gender": 1,
               "credit_id": "56b4c7fa9251410aab002b43",
               "name": "Lisa Love",
               "profile_path": null,
               "id": 25021,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "56b4c826c3a3680700004dcd",
               "name": "Michele Lewis",
               "profile_path": null,
               "id": 1573039,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56b4c8459251410aab002b50",
               "name": "Alex Portin",
               "profile_path": null,
               "id": 1573040,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "56b4c85ec3a36806ec0063b6",
               "name": "David Alonzo",
               "profile_path": null,
               "id": 1573043,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "56b4c8719251415320003d33",
               "name": "Leslie Webb",
               "profile_path": null,
               "id": 1536977,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 2,
               "credit_id": "56ed44349251411958002608",
               "name": "Henry Jackman",
               "profile_path": "/wJYFGHG5Vsh8cbiyiS8zpO2SMHb.jpg",
               "id": 227440,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56ed444ac3a3682251006e69",
               "name": "Akiva Goldsman",
               "profile_path": "/smyKiXX4rAfehztrmg3lxgRAuZF.jpg",
               "id": 5575,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56ed4456925141569f00180a",
               "name": "Jeff Pinkner",
               "profile_path": "/tbTEasPFZRw52iEnooF5hBdYOTK.jpg",
               "id": 168309,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56ed44809251415e620067aa",
               "name": "Chris Lowenstein",
               "profile_path": null,
               "id": 76481,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "56ed448fc3a3682260006b88",
               "name": "Richard Middleton",
               "profile_path": null,
               "id": 65822,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "56ed449c92514143fc006432",
               "name": "Matthew Plouffe",
               "profile_path": null,
               "id": 1501297,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "57455d9ec3a368699400092d",
               "name": "Lynn Harris",
               "profile_path": null,
               "id": 4768,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "574623b0c3a36806a600003b",
               "name": "Glenn Kaplan",
               "profile_path": null,
               "id": 1308529,
               "department": "Camera",
               "job": "First Assistant Camera"
            },
            {
               "gender": 0,
               "credit_id": "574623df9251415f6000003b",
               "name": "Freddy Thomas",
               "profile_path": null,
               "id": 1625948,
               "department": "Camera",
               "job": "First Assistant Camera"
            },
            {
               "gender": 0,
               "credit_id": "574624519251415f8c000039",
               "name": "Shawn M Gray",
               "profile_path": null,
               "id": 1625949,
               "department": "Crew",
               "job": "Armorer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 17.121039,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 299687,
      "vote_count": 2511,
      "budget": 38000000,
      "overview": "16-year-old Cassie Sullivan tries to survive in a world devastated by the waves of an alien invasion that has already decimated the population and knocked mankind back to the Stone Age.",
      "similar": [
         198663,
         101299,
         157350,
         5491,
         3509,
         2048,
         602,
         49849,
         605,
         604,
         281,
         76341,
         262504,
         157336,
         348,
         294254,
         335984,
         333339,
         137113,
         131631
      ],
      "original_title": "The 5th Wave",
      "runtime": 112,
      "poster_path": "/cgxEscv6TQRK6a514FwuJOjcqQ5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "LStar Capital",
            "id": 34034,
            "origin_country": "US"
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": "/pfmb82VUfN9VKB1YuBSY69WVNVm.png",
            "name": "GK Films",
            "id": 3281,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Material Pictures",
            "id": 12139,
            "origin_country": ""
         }
      ],
      "release_date": "2016-01-14",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Protect Your Own",
      "adult": false,
      "homepage": "https://www.facebook.com/5thWaveMovie/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["J Blakeson"],
      "runtime": 112,
      "synopsis": "In the opening scene, Cassie Sullivan (Chloe Grace Moretz) is walking through the woods with a gun in her hands. She comes across an empty store and takes what little supplies she can get her hands on. A voice is heard calling for help. Cassie finds a man hidden in the back. They both have their guns aimed at each other. The man lowers his gun but Cassie won't lower hers because the man is holding something in his hand. She orders him to show what's in his hand, but when he does, a light flashes from it and startles Cassie, prompting her to shoot the man. She sees that he was holding a crucifix, and she is horrified at what she's done. Several months earlier.... Cassie was a regular 15-year-old teenager in high school girl. She lived with her parents Oliver (Ron Livingston) and Lisa (Maggie Siff), and her little brother Sam (Zackary Arthur) in a suburb of Cleveland, Ohio. Her best friend was Lizbeth (Gabriela Lopez) and she had a crush on football player Ben Parish (Nick Robinson). Soon, however, everything changed as a mysterious alien spaceships descended and remained hovering above everyone for a number of days without movement. The humans would come to refer to these visitors as \"The Others\". The Others unleash the first wave, which is an electromagnetic pulse that wipes out all the power on Earth. Planes fall from the sky and kill countless people. Without a fresh water supply, Cassie and Sam have to gather water from a nearby lake. The second wave brings powerful earthquakes and devastating tsunamis to coastal cities, killing even more people. The third wave has the Others modifying the avian flu, which infects people like Lizbeth and even Lisa. Cassie, Sam, and Oliver bury Lisa in the front yard of their house and say goodbye to her. The three head to a survivors camp. After a few days of residing in the camp, a large cloud of dust forms, and from it emerge military men in vans, led by Colonel Vosch (Liev Schrieber). He says he's there to help them. They gather all the children and send them on a bus to a safe location. Oliver reluctantly lets Cassie and Sam go. Sam forgets his teddy bear, so Cassie runs off the bus to grab it. The buses start driving away before Cassie can make it back. Vosch tells the adults that the fourth wave has begun. The Others have begun to use humans as physical hosts, inciting anger and panic among the adults that demand to know how they can tell who is really an Other. A gunfight breaks out, and nearly every adult is killed, including Oliver. Cassie mourns her father and proceeds to move forward on her own. The kids arrive at Camp Haven, a military training facility. Ben and Sam are among those that are recruited. They are given new nicknames as well - Ben is \"Zombie\" and Sam is \"Nugget\". Ben meets Sergeant Reznik (Maria Bello). She injects a tracker in the back of his neck and sits him down in front of a two-way mirror where a boy is hooked up to a chair. Reznik says the boy is really an Other. She shows Ben through a lens that the boy has a green skull, then gives Ben a button to kill the boy. Reznik sees that Ben is wearing his dead sister's necklace, using it as motivation to push Ben to press the button, which he does. Cassie carries a gun that her father gave her before he died. She arrives at the abandoned convenience store in the opening scene and is forced to shoot and kill the wounded man as seen before. Next, Cassie walks through an abandoned freeway littered with many abandoned cars and sees many dead bodies. A shot is fired, hitting Cassie in the leg. More gunfire is heard, and Cassie crawls to safety under one of the cars before she passes out from blood loss. Meanwhile, Ben and the other kids start their training. He befriends another kid named Dumbo (Tony Revolori), and they are presented with a girl called Ringer (Maika Monroe), who is tough and takes crap from no one. She is an excellent shot, and she teaches the kids how to shoot after Ben takes her down during training. Cassie wakes up to find herself in the care of a young man named Evan Walker (Alex Roe). He tends to her gunshot wound. Cassie wants to leave and find Sam, but Evan warns her that it would be dangerous for her to go out there on her own without protection. Cassie discovers that Evan took her gun and hid it. She runs away but sets off one of his traps in the woods. Evan runs back to her and protects her as someone else with a gun is walking through the woods. At Camp Haven, Colonel Vosch brings Ben into the control center and tells him that the fifth wave is already happening. He gives him a helmet that will allow him to detect an Other so that he can easily kill them. Evan teaches Cassie how to defend herself by showing her how to take someone's gun and incapacitate them. She shows him pictures of the people she used to know and love before the invasion. Quickly, Cassie and Evan develop an attraction for each other. The kids are brought to a location where Others have been detected. They spot a number of people with green skulls and fire at them. However, they then see Ringer through their lens and see a green skull. Before anyone can shoot her, Ben stops them. He is spotted with a green skull too. He quickly realizes that Vosch and Reznik lied to them, and that THEY are really Others. The fifth wave is the kids themselves. Since they are easily manipulated, they are being used as pawns to slowly wipe out the rest of the humans. Cassie learns that Evan is not quite human after witnessing him kill someone in the woods. He claims that when the alien ship arrived, a switch went off in him. He says he saved her when she got shot from someone else in the distance. Evan claims that his love for Cassie is making him more human. She runs from him and is rescued by the military. Cassie is taken to Camp Haven and goes through the same process as the other kids, only this time she can immediately spot something suspicious with Reznik. The two of them fight until Cassie knocks Reznik out. Ben confronts Vosch about the truth, to which he confirms that he and the rest of the military personnel are Others, and that they need the Earth for themselves. The base is then infiltrated. Cassie runs into Ben, and is then reunited with Sam. Evan shows up and kisses Cassie one last time before he goes to blow up the facility. The heroes run outside as the place is blown up. Ringer rescues them in a van, and they drive away, while Cassie watches as the place is destroyed, sad for Evan's sacrifice. But Colonel Vosch and the rest of the infected military and child cadets escape in a fleet of helicopters and fix-wing aircraft. The kids then set up their own camp, with some of the other kids like Dumbo joining them. Cassie closes the film by narrating that they haven't lost hope, and that hope is keeping them alive.",
      "writers": [
         "Susannah Grant",
         "Akiva Goldsman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2304933/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjQwOTc0Mzg3Nl5BMl5BanBnXkFtZTgwOTg3NjI2NzE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Chloë Grace Moretz",
         "Matthew Zuk",
         "Gabriela Lopez"
      ],
      "reviews": [
         "\"The 5th Wave\" is the umpteenth version of a post-apocalyptic scenario that has all but taken over pop-culture since the turn-of-the-century (or, more specifically, the attacks on 9/11). In this case, it's a race of mysterious aliens who, in an effort to take over the planet, are eliminating humans one \"wave\" at a time (destroying the power grid, creating massive earthquakes and tsunamis, spreading fatal epidemics, etc.). The screenplay focuses primarily on one Ohio family, and, specifically, their teenage daughter, Cassie (Chloe Grace Moretz), who suddenly has to find ways of surviving in this new and dangerous world where everyone is out for him- or herself and, thus, no one can be trusted. As they pass through desolate, auto-strewn landscapes that look like they came straight out of \"The Walking Dead,\" Cassie and a caring (and dreamy) stranger (Alex Roe) - who saves her life at one point and rehabilitates her to full health - go in search of her missing little brother. And, speaking of TWD, since the movie can't fit any ACTUAL zombies into its narrative, it partially compensates by at least having a character NAMED \"Zombie\" (Nick Robinsons). Ah well, after a few moments of fleeting interest in the early stages, the movie quickly settles into a predictable and boring series of teen drama, alien invasion and end-of-the-world tropes. And with its open-ended conclusion, we're left wondering (or is it dreading?) if there will be a 6th wave in our movie-going future.",
         "When Earth is attacked by aliens, there is a sequence of waves of destruction to annihilate the population. The aliens drain the energy and create diseases and natural disasters. The teenager Cassie Sullivan (Chloë Grace Moretz) moves with her family to the countryside, but when her mother Lisa (Maggie Siff) dies, her father Oliver (Ron Livingston) decides to go to a refugee camp with Cassie and her young brother Sam (Zackary Arthur). Out of the blue, the army comes to the camp to transfer the survivors to a military base. They transfer the children first but Cassie misses the bus where Sam is. She learns that the in the 5th wave, the aliens have assumed the human form and she witnesses the military executing the civilians in the camp including her father. She flees and now she begins her quest to find Sam. Meanwhile the teenagers and children are trained by the military to fight the enemy. But how to know who is human and who is alien? \"The 5th Wave\" is a teen adventure with a silly and illogical story and a shallow romance. The plot has an interesting beginning but unfortunately becomes terrible. The idea of using the teens and children to destroy the survivor is totally absurd. My vote is five. Title (Brazil): \"A 5ª Onda\" (\"The 5th Wave\")",
         "Wow! That was complete and utter rubbish. Can we please have it listed under genres as Teen Romance / Brain Rot and not under the genre Sci-fi, Action, Adventure as it is listed above. Are teenagers these days all goldfish???, is this not the same plot as Twilight, Divergence etc only replace vampires etc. with Aliens?. I love my apocalyptic movies and after the first 20 minutes I thought it wasn't going so bad... decent special effects, seeing what each \"wave\" was going to do and I was looking forward to seeing \"the others\", but alas that was it for the movie after that it was like opening a teen magazine while jamming a skewer up my nose in to my brain. I must say I did get a few laughs at the many clichés I called before they happened followed by my swift exit to save my brain from rotting by the absurd stupidity of it all. If you are not a girl aged 11 to 15 avoid this movie like you would avoid the plague",
         "The 5th Wave is based on the book of the same name and it's main focus is on a girl reconnecting with her brother. It's a tried and true story for the post-apocalyptic genre and doesn't do anything really cool with it except for the title. The title of the film plays into the \"twist\" in the film, if you can even call it that and it's about the only thing that it does a little differently. Nothing too bad on the acting side. There's no Oscar winning performances but everybody does a decent job with the crap dialogue they are given. Except the kid... He just stares all the time, looking dumbfounded. Must have been a way to keep people from calling him \"The annoying kid.\" The film looks good in it's presentation. The choreography in the fight scenes is a bit exaggerated but I enjoyed that. What is does so wrong is the absolute straight 'teen angst novel' scenes and relationships. The books suffered from this too and I feel it could have been made to be a bit more serious to kind of adult up the series and make it fit with a wider audience. Overall it is a bad adaption of an average book. It alienates everyone over the age of 12 by making it way too much like the novel and not trying to change up some of the things it needed to.",
         "As a low-budget sci-fi flick, The Fifth Wave starts quite promisingly with a more logical continuation from the opening scenes of \"Independence Day\". The end of the world is nigh. An alien spacecraft has put itself into a threatening earth orbit (note: actually 'orbiting' - as a nod to science guys like me - rather than just inexplicably hanging there in the sky, as Douglas Adams once put it, \"in much the same way that bricks don't\"). The aliens are throwing calamity after calamity down at small-town America in 'waves': earthquakes; tidal surges; modified bird flu; and bombings. Against this stressful backdrop, the ever-reliable Chloe Grace-Moretz (\"Kick Ass\"; \"Let the Right One In\") plays Cassie who after getting separated from her younger brother Sam (Zackery Arthur) faces the dangers of a cross-country Alabama trek to rescue him. Like I said, quite a promising premise, and it flows quite nicely until the family get to a Fort Wilderness style sanctuary in the forest. There however the plot goes awry, with the aliens making a seemingly ridiculous strategic move. Jaw-dropping dumbness now follows with a 'see-it-coming-from-a-mile-away' plot-twist casting Cassie onto her solo-mission, and the film declines into a rather poor 'Hunger-maze-giance' wannabe with Cassie torn between the affections of old crush Ben (Nick \"Jurassic World\" Robinson) and mysterious saviour Evan (Alex Roe). Much muscle-rippling and skinny-dipping ensues as Cassie oohs and aahs in a girlie fashion that erodes her kick-ass (no pun intended) characterization to date. The director is J Blakeson.... no, me neither. This is only his second feature, and is a big ask. The film rather obviously cues up a sequel: this is the first of a series of – apparently quite good – books by Rick Yancey, with the next in the series being called \"The Infinite Sea\". I don't think I will be rushing to the cinema to see the sequel, if it does happen. A disappointing film that starts with real promise but then loses its way. Grace-Moretz really does deserve better. Nice animated Gif poster though!. (Please visit http://bob-the-movie-man.com for the graphical version of this review, and to comment with your thoughts. Thanks).",
         "I don't understand how this is getting any good ratings, I guess people who benefit from it are the ones giving those ratings. There is nothing interesting about this movie, the story is very flat and everything is predictable. It is filled with illogical decisions and the alien race, who is intelligent enough to come here and rule on landing, has no clue what to do and how to do anything efficiently. The so called waves are a fun given fact but make little sense. If if an alien race would go with that, I am sure they could come up with a more efficient 'wave' than to just infiltrate the human race. Their drones seem to be having no use at all, other than flying from point A to B. If an alien race has such technology and are in such dire need for living space, I don't think they will go with such a slow and pretty stupid method. They were already observing the earth for decades (if not longer) so I am sure wave 3 could have been a lot more efficient. Even setting all that aside, the movie is just one cliché event after another. It's one of those movies you go watch if you have really, really nothing else to do.",
         "For the first time i am writing a review for a movie. If you are not under 15 years old you should stay away from this movie because its just a really bad movie with some visual effects. The movie was looking good at first 10 minutes but after that everything in the movie started to seems stupid. Ending scene was the worst part of it. Scenario and most of the scenes in the movie is just disaster.",
         "We had The Breakfast Club, Sixteen Candles, St Elmo's Fire, The Goonies to name but a few. Defining moments in movies, defining teenage angst, growing pains and young love and loves lost. Films that stand up today, not just for nostalgia's sake but because of solid acting, amazing characters and good stories. I despair for the drivel that our millennial's have to endure today in the name of cinema. If you've grown up on good films through the years then you want to avoid The Fifth Wave. Encourage your young-lings to watch something else. Chloe maybe a good actress, but she couldn't drag the film from the mire of this cliché driven plot line with shallow characters and an awfully banal story of an alien plot to take over the Earth in as seemingly clueless manner as possible.",
         "The 5th Wave follows the beautiful and wonderful 16-year-old actress Cassie Sullivan and her family. Waves of alien strategic invasion have devastated the world and Earth's population is on the verge of extinction. Humankind is knocked back to the Stone Age. Cassie's mother is dead from a modified plague by the Others (the Aliens). Cassie's remaining family move into a neighbouring refuge camp. The army comes in and says they are there to help. However, the army buses the kid out of the camp and promises to bus the adults out next. Cassie gets separated from her brother. Her brother is taken by the Army for care and protection. Her father and other survivors in Ohio are killed in a massacre by the army. Cassie scavenges her way through to the base to meet her 5-year-old brother, Sam. Cassie is saved from an enemy sniper by Evan Walker. Cassie falls in love with him and later learns he is an Other in humanoid form. Cassie learns that Colonel Vosch and the Army is actually the Others and the fifth wave they have planned is to use children to eliminate the rest of the earth's survivors by misleading them. She learns the hard way to trust no one and leaves him. The only thing that keeps Cassie going is the hope that she can save her brother from the \"training\" camp established by the Army (Others). Meanwhile Ben Parish, Cassie's crush before the wave and her brother are in the same squad trained under the Others. Ben also comes to know the Others plans. Evan who follows Cassie helps her and Ben to save Sam and demolish the training facility. The Others evacuate from the facility with the intend to deploy the children as soon as possible to other cities. Ben and his squad is seen enjoying their meal with Cassie and ponders hope as humanity's driving force for survival.",
         "I mean seriously, why is everyone attempting to be a professional critic with such high standards for every movie made?! This movie was entertaining and followed pretty closely to the book and yet still getting such bad reviews! Why? For the one person saying they won't take their kid bc they don't want their kid to think its okay to get implanted with a microchip. Are you kidding? You know this is a movie about an alien invasion right? Not exactly a guide to how to live your life under normal circumstances. You don't want your kids wielding guns? AGAIN, ALIEN INVASION! It's not like this is teaching your kids to have guns during all situations. get a grip, this is a movie.. Chill out.",
         "What a third class movie. Made on the Same formula as the likes of divergent, maze runner and lots of others... Was hoping to see some alien vs human action. But Nooo the producer had to ruin my expectations... The viewers are forced to see the same crap, sexually confused really innocent know nothing teens. Who have just all the right of knowledge when needed to fight soldiers and know how on shooting all kind of possible guns... The lead actress, Ohhh she is a sight to see, if you are blind and don't know what emotions are... I think she could have been better playing an alien... That would be more believe able... Again what a brain fryer... Good going director. I could make better film in my sleep then this... Just one request to the rating dept. They should introduce a rating for Formula movies too. So that we have warning before ruining my brain cells... What a waste of time...",
         "I consider this movie an above average YA adaptation. Sure it's not perfect and has a few cringe-worthy moments, but they are few and far in between. It has talented young actors and good pacing that keeps you on your toes especially in the first half of the movie. So imagine my surprise when I looked at Rotten Tomatoes and found out it has only a measly 17 percent. I couldn't help it and read some of the reviews. I wondered what exactly were those esteemed critics complaining about. Let's see. No originality – true, but then again I have yet to see a Hollywood sci-fi YA that is original. Somehow this didn't bother them during Hunger Games or Divergent. Love triangle – except there isn't one. Ben and Cassie have one short scene in the beginning. She has a crush. How unusual for a teenage girl. And that's it. After this they only meet at the end of the movie and there is no romantic tension whatsoever. She's no longer interested in him, he was never interested in her. At the beginning we also see scenes of Cassie with her best friend, Cassie at school, Cassie with her family, Cassie playing soccer – so obviously that scene with Ben was there to simply show that she's a normal girl and to introduce Ben as a character. Similarity to Twilight, Evan as a stalker type – Yeah, for about 5 seconds in a flashback that really had to be there to show the moment he first saw her. With the exception of a few scenes, the movie only shows destruction in the US, even though the problem is worldwide – the movie budget was 38M. Enough said. The movie's cliché romantic scenes yes, but nowhere near Twilight level. Actually scenes between Peta and Gale talking about Katniss in Mockingjay 2 were way more cringe worthy than this. Also one might get the impression those scenes take the whole second half of the movie, while it's in fact about 15 minutes of screen time. Getting your gunshot wound stitched is not a romantic scene. The movie is like an AD for NRA (National Rifle Association) – because I guess it's a really bad idea to give your daughter a gun in a post-apocalyptic world where aliens invade the Earth. The all-white cast. Yes, I will open this can of worms. This movie dared to exclude the obligatory minor role the talented non-white actors usually get. On purpose? In the book, the first thing you'll read after the title is Hawking's quote about Columbus and Native Americans. So the casting choice could very well be a reference to that and western Europe's colonization of other countries centuries ago. To make people think that maybe screwing with other nations isn't the best idea just like H.G. Wells did in War of the Worlds. But let's hate this movie anyway, because \"I see white people.\" So the most disappointing about this otherwise quite entertaining movie, as long as you like the genre, is the laziness of its reviewers. It looks like all the things the critics wanted to write about the YA franchise for a while were crammed into the reviews of the Fifth Wave. Therefore it gets a 10 to compensate for all the nonsense I read.",
         "Of all the actresses to do YAF movies, Chloe Grace Moretz is the sweetest and most convincing of the bunch. She has the rare gift of being able to do both action and romance. She makes the character surprisingly affecting quite quickly in the movie. Her grief and anxiety are believable as she searches for her little brother and somehow manages to keep his teddy bear intact throughout. She has chemistry with her co stars Nick Robinson of Jurassic World and Alex Roe. Liev Schreiber actually is well cast for a change - his face suits his role. The story starts off impressively. The disaster scenes and waves of destruction are effective, exciting and grandly done. The middle section is a little slower when the training (a bit like Divergent) starts and the romance blossoms. The fighting and shooting are big budget action movie standard and well done considering it's kids who are doing the fighting. As the plot twists the story makes sense in it's own way and is clear enough to follow. I found it more palatable than the Hunger Games which has a rather sickening premise kids killing each other, and easier to relate to than the Divergent series which is rather monotonously dominated by fighting and training. Go see it - it's entertaining and enjoyable. Hope it does well enough to ensure the sequels are made",
         "when i went to the theater i'm not hoping that this movie would be this awesome. i thought this movie like 2012, independence day or any other usual disaster movie. But OMG it blew my mind. This movie has a twilight, hunger games and maze runner mashed up. this is perfect. i really love Cassie and Evan, hope Evan make it out alive after the explosion. at first i thought it was all about surviving, but its not. i think there is gonna be love triangle between Cassie, Evan and Ben. and what happen to Vosch? he just let them go? uh huh no way. That's what i am waiting for the sequel. TELL ME THERE IS SEQUEL RIGHT???? All of you go to theater and watch it, tell everyone you know to watch it, because this movie is too damn good for you to miss it. REALLY HOPING FOR THE SEQUEL!!!",
         "This movie deserves a good 9 or 10 stars! Even though you don't even see any aliens in it, you still get the action and the \"edge-of- your- seat\" feels. Chloë Grace Moretz plays the role of Cassie Sullivan brilliantly! Possibly the best movie released in January 2016? I think so! It had me on the edge of my seat, and I really do like movies like that! I don't really like films about alien invasions, but this one is by far the best - and I still think \"The 5th Wave\" will be better than \"Independence Day: Resurgence\" which releases in cinemas this June! Will definitely be paying to see this again! The Blu-Ray & DVD release date is too long away (around May/June 2016)!",
         "I went into the movie, having just gotten not so good news, but I left rather happy with what I saw. It is a very good movie, the preview to the movie was not at all making it seem like what it was. In my opinion this was better to the Hunger Games last two movies, I was enjoying the movie, and I didn't fall asleep half way through the movie like I did with both of the last Hunger Game movies. That serious got boring after the second one, I really hope to see the second book become a movie. I know the movie is going into a genre that's got too many movies in it at this point, but this one actually had me feeling like it could actually happen. So far, this one and the Divergent series movies have been the main YA movies that truly get my attention. And at this point the Maze Runner Series seems to be all about the actor not the movie, when a selling point is that the main guy is hot, then is it really a good movie or just good to the people who think the actor is hot? I will recommend for people to see this movie, cause I think it deserves better then what it's getting. Amazing movie.",
         "Cutting it short, I thought it was amazing. Me and my friends, as well as a lot of other people I have talked to who have seen it, really really loved it! I don't get what the bad reviews are about! I really hope that they make the next few books into movies too! The acting was amazing and there wasn't anything that I thought \"they could have done that better\" because it was all perfect. The film follows the books very well too so if you have read the novels and you are worried that they won't be as good, there isn't a need to worry. Other have said that they are happy with how well the movie followed the book as well. So definitely go and see it or get the DVD when it's released because it was an amazing film!",
         "This review is from my daughter This a great movie for family . I absolutely loved it, it is now one of my favorite movies . Please don't listen to any of the bad reviews . I hope they make the next two books into movies as well I can't wait to see what happens . Even though they don't show real aliens I was on the edge of my seat from the beginning of the movie until the end of the movie . I loved all of the characters especially Evan . When I came home I was frantically texting all my friends telling them they had to go see this movie right away",
         "The 5th Wave is a new Sci-Fi Film directed by J Blakeson and is based on the novel of the same name by Rick Yancey. Cassie Sullivan (Chloë Grace Moretz,-Kick Ass) was a normal teenage girl before Earth was invaded by the others, destroying homes and family's. In desperation to find her younger brother, she teams up with a man who might be her final hope. I had been excited for this movie for maybe about a year. When the movie finally came out, I went in on the first day and first session, and boy was I not disappointed! Director J Blakeson did an amazing job with pretty much everything in this movie! Chloë Grace Moretz made a terrific performance playing the title role Cassie Sullivan. She got in so much depth with her character, she played the emotions perfectly, not under-exaggerated, not Over- Exaggerated, it was perfect! But so were all the other actors, including Alex Roe as Evan Walker, and Nick Robbinson as Ben Parish. Director J Blakeson did so well at keeping the story at a pace, the story never got boring and it never stretched out any of the scenes. I was always at the edge of my seat, especially with realistic special effects of the floods, the explosions, EVERYTHING! The story was filled with heaps of action and awesomeness! It is hard to find a movie these days with a great story-line, effects, dialogue and acting. But, this movie was fantastic and is worth the $15.00 you pay for the ticket. It did leave me with a few questions though, but it was overall, one of the greatest movies I have ever seen. I would watch it again and buy it on Blu-Ray. So if you are looking for a good watch, go see The 5th Wave!",
         "I think the book/movie have a amazing idea, I love the way Rick Yancey writes and I love the book, the movie is so good-disappointment to me, I think the movie is good because I really felt the same emotions that I had when I've read the book, but for other side I think the people that not have read the book before see the movie could be confuse while they see the movie, The Reason: The way everything happened on the movie is too fast, and I think they wasted the amazing idea of the waves because the movie is more about the Cassie's journey to go for Sammy and Zombie's training , I really loved the movie because I really felt so happy while I was seeing, I really hope the second part The Infinite Sea but whit another director (So sorry J Blackerson no it's nothing personal) Pd: I loved all the actors in the movie",
         "I actually like the plot twist of the movie. It has alien invasion, romance, and the cast of the movie is what makes the movie good. I would have liked if the movie had more excitement but I think the movie was good. Chloe G. Moretz, Nick Robinson, Alex Roe & Maika Monroe. The 5th Wave has to be one of the best movies this year. It's in the level of being as big as The Hunger Games, Divergent, and the Twilight. I really thought that the movie was excellent and I hope the other 2 movies are made so we can all find out what happens next. Hopefully the next movies are done better than the first. The 5th Wave is similar to these other movie series but the only difference is that most of the characters are ordinary and all of a sudden there are aliens and the aliens are disguised as humans so any real humans will have to be aware if they are with real humans or the aliens which in the book/movie they are known as \"the others\"",
         "Anyone with brains is good enough to know what happened on the movie and that it isn't a cliché. That was literally the BEST movie I've ever watched! Based on the best book i've ever read. If you really want to enjoy this movie to the max, read the book first, I promise it won't be boring and it will be an adventure for you. If you don't want to read the book, just pay good attention on the movie and it'll be the best one you'll ever see. It starts off telling some background story on how Cassie lived her life, and although that goes by pretty quick, it contains everything it needs and saves time for what really matters. What follows is a brilliant plot, full of twists and action. The ending is the biggest cliffhanger ever and it'll make you want more, if you like good/smart movies, you'll definitively like The 5Th Wave.",
         "I read the 5th Wave long before I found out it was going to be a movie I was ecstatic. Especially with Nick Robinson (YUM) and Chloe Moretz. I went to see the movie a few days after it came out. With all of the negative reviews, I was worried that it was honestly as bad as everyone said it was. Chloe made a fabulous Cassie, she was even who I pictured as Cassie. There have been reviews about how she had eyeliner and painted nails. I think many people overlook the fact that she had a book bag filled with things that she probably wanted to have to make things seem normal, just like she packed her cellphone. They stayed true to the book besides the minor changes they decided to make. But in all honesty, no movie will be exactly like the book. I mean, look at Twilight. It got better and better as time went on. I honestly think people are being too hard on the movie.",
         "The acting, action and story line of this movie is amazing. It made me really emotion and always of the edge of my seat. Scenes had a huge mixture of thriller where i was covering my eyes and other times where i had a tissue glued to my face soaking up the tears because of all the feelings formed throughout the movie ! The casts fit so well for each role and the relationships formed really help build up tension for the viewers. The cast are all very attractive and this really does make you that much more interested in the film ! All stunts and editing are so personal and realistic and this is great for the people viewing to really feel the stress and connection of all the scenes. Would definitely recommend to anyone, not even just those interested in sic-fi because it has a little bit of everything and depending on how you wanna view the movie, it could be your typical romance film or just an action/thriller. Make it want you want but this is a must see movie for everyone !!"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Columbia Pictures",
         "LStar Capital",
         "Material Pictures"
      ],
      "summaries": [
         "Four waves of increasingly deadly attacks have left most of Earth in ruin. Against a backdrop of fear and distrust, Cassie is on the run, desperately trying to save her younger brother. As she prepares for the inevitable and lethal fifth wave, Cassie teams up with a young man who may become her final hope - if she can only trust him.",
         "When Earth is attacked by aliens, there is a sequence of waves of destruction to annihilate the population. The aliens drain the energy and create diseases and natural disasters. The teenager Cassie Sullivan moves with her family to the countryside, but when her mother Lisa dies, her father Oliver decides to go to a refugee camp with Cassie and her young brother Sam. Out of the blue, the army comes to the camp to transfer the survivors to a military base. They transfer the children first but Cassie misses the bus where Sam is. She learns that the in the 5th wave, the aliens have assumed the human form and she witnesses the military executing the civilians in the camp including her father. She flees and now she begins her quest to find Sam. Meanwhile the teenagers and children are trained by the military to fight the enemy. But how to know who is human and who is alien?",
         "Four waves of increasingly deadly alien attacks have left most of Earth decimated. Cassie is on the run, desperately trying to save her younger brother."
      ],
      "budget": 38000000
   },
   "movielensId": 148172,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-01-14",
      "dvdReleaseDate": null,
      "directors": ["J Blakeson"],
      "runtime": 112,
      "movieId": 148172,
      "title": "The 5th Wave",
      "mpaa": "PG-13",
      "actors": [
         "Chloë Grace Moretz",
         "Nick Robinson",
         "Alex Roe",
         "Maika Monroe",
         "Zackary Arthur",
         "Liev Schreiber",
         "Maria Bello",
         "Maggie Siff",
         "Ron Livingston",
         "Talitha Bateman",
         "Tony Revolori",
         "Cade Canon Ball",
         "Flynn McHugh",
         "Alex MacNicoll",
         "Nadji Jeter",
         "Gabriela Lopez",
         "Bailey Anne Borders",
         "Parker Wierling",
         "Terry Serpico",
         "Charmin Lee",
         "Michael Beasley",
         "Matthew Zuk",
         "David Maldonado",
         "Paul Ryden",
         "E. Roger Mitchell",
         "Derek Roberts",
         "Geoffrey Kennedy",
         "Devin McGee",
         "Adora Dei",
         "Kevin L. Johnson",
         "Courtney Munch",
         "Kendrick Cross",
         "Chelsea Hayes",
         "Olivia Cloer",
         "Kelly Róisín"
      ],
      "imdbMovieId": "2304933",
      "originalTitle": "The 5th Wave",
      "genres": [
         "Adventure",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "lTX6Vvr7jdo",
         "H7NOdji6BSU",
         "ATHDWPsggYs",
         "Ud-ssDYMJ7w",
         "kmxLybfGNC4",
         "JDJj9X0ZAsM",
         "cW7ObKqWN-w"
      ],
      "plotSummary": "16-year-old Cassie Sullivan tries to survive in a world devastated by the waves of an alien invasion that has already decimated the population and knocked mankind back to the Stone Age.",
      "tmdbMovieId": 299687,
      "avgRating": 2.9537,
      "releaseYear": "2016",
      "numRatings": 486,
      "posterPath": "/cgxEscv6TQRK6a514FwuJOjcqQ5.jpg"
   }
}