{
   "tmdb": {
      "original_language": "bs",
      "keywords": [
         {
            "name": "yugoslavia",
            "id": 449
         },
         {
            "name": "bosnia and herzegovina",
            "id": 1662
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "partisan",
            "id": 15182
         }
      ],
      "imdb_id": "tt0070758",
      "video": false,
      "title": "The Battle of Sutjeska",
      "recommendations": [],
      "backdrop_path": "/5xiKKvqpRKpzM5Gwk06LJ02jVN3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Josip Broz Tito",
               "gender": 2,
               "credit_id": "52fe4b059251416c750f5b59",
               "name": "Richard Burton",
               "profile_path": "/fRoBAQQP9sfnIYuqw546yFs3qKn.jpg",
               "id": 5341,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sava Kovacevic",
               "gender": 0,
               "credit_id": "52fe4b059251416c750f5b5d",
               "name": "Ljuba Tadić",
               "profile_path": "/dZWFU3f9ZQEn8Uy6YojbQcmKlJn.jpg",
               "id": 1043275,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nikola",
               "gender": 2,
               "credit_id": "52fe4b059251416c750f5b61",
               "name": "Velimir „Bata“ Živojinović",
               "profile_path": "/8oV6tqfFySoXC2Y8aWv0xzfwv8J.jpg",
               "id": 38130,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Borina majka",
               "gender": 1,
               "credit_id": "52fe4b059251416c750f5b65",
               "name": "Irene Papas",
               "profile_path": "/tJ0ErVqe8bmqz5vuU9iJLwiBGle.jpg",
               "id": 18847,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Vera",
               "gender": 0,
               "credit_id": "52fe4b059251416c750f5b69",
               "name": "Milena Dravić",
               "profile_path": "/uVCXhbyelkkoCCVmaaEKYVKOGeD.jpg",
               "id": 110976,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Barba",
               "gender": 0,
               "credit_id": "52fe4b059251416c750f5b6d",
               "name": "Bert Sotlar",
               "profile_path": "/lNobhQFAqLbMJ4t8A6fCHLVmjcs.jpg",
               "id": 91598,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "German General",
               "gender": 2,
               "credit_id": "583f0caa925141153500dd2c",
               "name": "Günter Meisner",
               "profile_path": "/ratLVv6yrmsyViUECpBGWKaY78r.jpg",
               "id": 3617,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Generaloberst Alexander Lohr",
               "gender": 2,
               "credit_id": "58502a519251416fad00ad96",
               "name": "Anton Diffring",
               "profile_path": "/uJ0l6TulElk9iEkuMKz6uvZBSfq.jpg",
               "id": 97935,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Oberst Wagner",
               "gender": 0,
               "credit_id": "58502a62c3a3682e4300ab86",
               "name": "Michael Cramer",
               "profile_path": "/pZLGSc8FCktS8hJHNkHtruSRkld.jpg",
               "id": 46682,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Stanojlo",
               "gender": 2,
               "credit_id": "58502b0a9251416f1000aee8",
               "name": "​Ljubiša Samardžić",
               "profile_path": "/qt7oNLK1ijkHWLTH6BtCG3wsgp3.jpg",
               "id": 112393,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Dalmatinac",
               "gender": 2,
               "credit_id": "58502b21c3a3682fb800cf2b",
               "name": "Boris Dvornik",
               "profile_path": "/yVNi8nCRsvinC6bND2NkQT9oBQ.jpg",
               "id": 1047281,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Rados",
               "gender": 0,
               "credit_id": "58502b38c3a3682dfe00bc90",
               "name": "Rade Marković",
               "profile_path": "/nAOTgY7yw7l2QqBjouCHecC8YiH.jpg",
               "id": 1053366,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Captain Stewart",
               "gender": 2,
               "credit_id": "58502b529251416e4b00b3e4",
               "name": "Relja Bašić",
               "profile_path": "/hCxQQ9aqjnYBDKu1xceWf5KnCAd.jpg",
               "id": 1046833,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Captain Deakin",
               "gender": 2,
               "credit_id": "58502b6bc3a3682dfe00bcbd",
               "name": "Petar Banićević",
               "profile_path": "/pT1GMeLtFfEaVNY7B2uq5RTq39c.jpg",
               "id": 1313571,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 2,
               "credit_id": "58679e62c3a36811090091ce",
               "name": "Hardy Krüger",
               "profile_path": "/3RhjxJ4ZzIzEzF6lP1HOVV3VT6z.jpg",
               "id": 37777,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b059251416c750f5b55",
               "name": "Stipe Delić",
               "profile_path": null,
               "id": 1118977,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "589c8e2792514168f60000ac",
               "name": "Sergey Bondarchuk",
               "profile_path": "/4uUlgQPFR5i6HsNHQrXz4kQXaMs.jpg",
               "id": 38131,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56c48503c3a36871f40023fc",
               "name": "Wolf Mankowitz",
               "profile_path": null,
               "id": 29663,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56c485269251416bb7002423",
               "name": "Ugo Pirro",
               "profile_path": null,
               "id": 239917,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56c48530c3a3687200002670",
               "name": "Branimir Šćepanović",
               "profile_path": null,
               "id": 1023675,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56c4853c9251416bb300226f",
               "name": "Miljenko Smoje",
               "profile_path": null,
               "id": 1308699,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "War",
         "id": 10752
      }],
      "popularity": 0.908948,
      "production_countries": [
         {
            "iso_3166_1": "RS",
            "name": "Serbia"
         },
         {
            "iso_3166_1": "BA",
            "name": "Bosnia and Herzegovina"
         }
      ],
      "id": 143355,
      "vote_count": 1,
      "budget": 0,
      "overview": "The film tells the story of the Battle of Sutjeska which occurred in Nazi-occupied Bosnia and Herzegovina in 1943.",
      "similar": [
         423,
         424,
         5925,
         14574,
         228150,
         369885,
         21876,
         803,
         637,
         1771,
         289222,
         16869,
         853,
         2253,
         613,
         409,
         857,
         227306,
         339259,
         1251
      ],
      "original_title": "Sutjeska",
      "runtime": 117,
      "poster_path": "/eOEiRFaeZNSXW1d3r1RV77FlWuk.jpg",
      "spoken_languages": [
         {
            "name": "Bosanski",
            "iso_639_1": "bs"
         },
         {
            "name": "Hrvatski",
            "iso_639_1": "hr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bosna Film",
            "id": 10617,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Filmska Radna Zajednica",
            "id": 28223,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sutjeska Film",
            "id": 28713,
            "origin_country": ""
         }
      ],
      "release_date": "1973-07-31",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Post Production"
   },
   "imdb": {
      "country": "Yugoslavia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stipe Delic"],
      "runtime": 117,
      "synopsis": null,
      "writers": [
         "Sergey Bondarchuk",
         "Wolf Mankowitz"
      ],
      "originalLanguage": "Serbo-Croatian",
      "imdbLink": "http://www.imdb.com/title/tt0070758/",
      "coverLink": null,
      "actors": [
         "Richard Burton",
         "Ljuba Tadic",
         "Velimir 'Bata' Zivojinovic"
      ],
      "reviews": [
         "If you have an interest in WW2 and especially movies related to that conflict, this might make an interesting change from the usual Hollywood epics from the 60's. I had to see this having been impressed with 'The Battle on the River Neretva', another entertaining and well produced 70's film from the former Yugoslavia. I've also seen some poor Italian efforts that generally lack decent direction and are half-baked cash-ins on the Hollywood epics they attempt to imitate (there are a few decent ones). Like 'Neretva' you can tell this was made in a former communist country with an emphasis on the common struggle, with sentiment sometimes contrived and also overbearing a little too much (a few scenes are genuinely moving). However, this is a story told with much truth, and the braveness and courage of the Yugoslavian resistance to the Nazi's is nothing to mock. As a story it's a little too episodic but is nevertheless a gripping watch. What's impressive also is the budget involved, you'd seriously struggle to find any WW2 movie with as many extras as this (and 'Neretva') and the props (vehicles, weaponry etc) are all excellent for this era. The direction is fine (not exceptional), the scenery is fantastic. Burton as Tito is pretty stiff, he plays the man as if he were being portrayed in a propaganda description (probably exactly what was required) and the other actors are generally all good. Overall this is a highly entertaining film and deserves a better fate as it portrays one of the lesser known struggles of WW2. Not that easy to find, here in the UK it was released on tape in the early 80's (The fairly rare Videomedia label, same as 'Neretva') with a bright, decent quality, slightly letterboxed print. Maybe a DVD will surface that's not just a rip from tape!! One fault with this UK release was the fact the subtitles are missing from the German speaking scenes, a shame, but it doesn't spoil the film too much.",
         "The film takes place in 1943, when the Germans make a last effort to destroy Tito and his partisans in the Balkan mountains. The battle scenes are pretty well made - although it's clearly the same 5 or 6 fighter planes that keep attacking the partisans throughout the whole movie. The movie's weakness is the characters (!) - the partisans are all heroes who die in the arms of their friends and lovers, and the Germans are all Germans as we know them from so many Hollywood films - speaking german with an evil nazi accent and only thinking about vengeance and destruction (they might as well be zombies or vampires!). We never really get to know anybody, apart from general Tito who is portrayed as a saint (he was still alive when the film was being made) by Richard Burton, the only star in the film. It is refreshing to see a WWII film where it's not american G.I's slaugtering nazi's. The heroes in this movie are communists with red stars on their caps fighting for their country. Too bad it's such a poor script, there is a lot of goodwill here, and it could have been a very exciting and different film about the dark years of Europe.",
         "I saw THE FIFTH OFFENSIVE recently weekend in Italian without subtitles (I speak English), cut to some 100 minutes, to the review will be short but ought to give you an idea of what the film is like. Richard Burton plays Partisan leader Josip Broz Tito, who leads the Yugoslav Partisans on a trek to safety, culminating in a huge battle at the Sutjeska River. The film features a ton of familiar faces, from familiar Hollywood actors to Yugoslav commoners. Bata Zivojinovic (BATTLE OF THE EAGLES) is one of the main partisans; Milena Dravic (THE BATTLE OF NERETVA) is his love; Ljubisa Samardzic (THE BATTLE OF NERETVA) commands an artillery gun; Stole Arandjelovic blasts away with a machinegun in the final battle; Relja Basic (THE FIFTH DAY OF PEACE) is one of the British commandos; Gunter Meisner (THE BRIDGE AT REMAGEN) is the German General and Anton Diffring (KILL ROMMEL!) is his executive officer. Familiar names of Boris Dvornik, Rade Markovic, Kole Angelovski, Petar Banicevic, Marinko Sebez and Dusan Tadic are all credited, but I have no idea who they play. The Partisan commander from BATTLE OF THE EAGLES features prominently in the second half of the film, but I can't quite put my finger on which character he is. The film features a number of big battle scenes with a good number of extras, a few Russian tanks, plenty of explosions and some vintage aircraft. It's all set to a great, rousing musical score, made up of actual Partisan chants (one of which was used for HELL RIVER a year later). One great combat scene has the partisans rushing up one side of a hill, not knowing that on the other side the Germans are charging as well, racing to capture the high ground first. A great hand-to-hand battle ensues. There are also some rather graphic attack-dog maulings thrown in for good measure. The scenery, as with all Yugoslav war films, is breathtaking. I saw this on a rip from an Italian video, titled LA QUINTA OFFENSIVA. It was in Italian with no subtitles, cut from 130 minutes to about 100 minutes. It was hard enough for me to follow in Italian, even harder with so much footage cut. The colors are washed out and there is plenty of print damage, ranging from flurries of speckles to scratches and many holes in the print. The pan-and-scanning is bad in some very important dialog scenes, too. Overall, this looks to be a pretty good Yugoslav war picture, better than usual. It's probably as good as THE BATTLE OF NERETVA, but I'll have to see it in English before I can write a really strong review. RATING: 7/10",
         "The Axis gathered 127,000 soldiers and over 300 airplanes against 18,000 soldiers of Yugoslav National Liberation Army(partisans) with only one goal, to destroy partisan HQ and kill or capture the partisan leader Tito. I live in Bosnia that was part of Yugoslavia and here we used to take some things granted when it comes to WWII movies that were made in former Yugoslavia. Most of us who are now age 30 and above, remember the history lessons from our schools when we had to learn all about the Axis offensives against partisans. Regarding Sutjeska (the movie), the first choice for director of this movie was Veljko Bulajic who directed the Battle of Neretva, however he gave up on the project since he disagreed with the producers and even with Tito. Veljko Bulajic did not want to make a movie that would varnish the history and turn a partisan defeat(both moral and tactical) into a total victory. Director of Sutjeska Stipe Delic acted as a craftsman and directed the movie as ordered by the regime. The photography in this movie is outstanding and most of scenes were shot at authentic locations. Characters are well played by at the time standard A class Yugoslav actors. Richard Burton plays Tito, just for the sake of the foreign audiences. The battle scenes are very realistic and even up to modern standards and together with amazing scenery and already mentioned photography make this movie worth watching . The movie does show critical moments from the actual battle, and is fair enough to show that escape of the partisan HQ was possible only if certain units (whole partisan brigades) were sacrificed to the Axis.It is true that breakthrough was made easier because certain partisan commanders disobeyed direct orders and kept antitank guns and mortars, symbolically presented in this movie by characters played by Ljubisa Samardzic and his sidekick. Regarding the portrayal of the Axis soldiers in this movie, it is realistic, they are showed as the cold blooded, sadistic killers and they actually got orders to behave like that before the battle. Again, too bad that this movie lacks certain amount historical integrity and it could have been shot by more inspired director. Hence, if you are to watch this movie consult Wikipedia, search for \"Fifth enemy offensive\" or \"Sutjeska offensive\" get informed about real historical events and then press play on your remote control unit.",
         "This 1973 rather sad and gripping World War2 story takes place in former Yugoslavia. Though close to being too \"patriotic\", showing the people of Yugoslavia:s sacrifices and struggle against diabolic Germans, the movie is quite realistic. We follow supremecommander Tito, rather well-played by Richard Burton, who leads the Yugoslav forces. Tito is shown as a peoples man who fights together with his people and helps the wounded. As usual the story base upon the not to original \"good guy/bad guy\" idea. In this story the good thing is that it is not the US or English army that act as good guys - but the partisan army. The film is not the greatest I have seen, and as a WW2 drama I can only recommend it for the rare opportunity of following another army than the US or English.",
         "Here is the real antifascist army fighting the real antifascist war. Richard Burton plays the beloved Yugoslav president Tito, who cast Burton himself. Milena Dravic, Bata Zivojinovic, Boris Dvornik, Ljubisa Samardzic were the A-listers of former Yugoslavia, all of them with drama school background. All actors in Yugoslavia were required to have a degree in acting. So, Burton was surrounded with quite a cast. Beautifully photographed on real locations, with great fight scenes and explosions that Yugoslav partisan films were famous for, this is a film about very sad events in history. Just like The Flags of Our Fathers, it's realistic and heart-wrenching. You don't wanna see it twice.",
         "Good but not great sequel to the much slicker and more entertaining \"Battle of Neretva\". This one has fewer international stars, just Richard Burton as Tito (!), Irene Papas in a throwaway role, and a few recognizable German actors like Gunter Meissner and Anton Diffring. The bulk of the cast are Yugoslavian actors, many of whom were also in Neretva but I assume played different characters (one guy got shot at least 5 times by a Chetnik in Neretva but here he seems just fine). It's not exactly a sequel, but presents the logical next big event after the Neretva battle, and the cinematographer and military supervisors are the same. The Pro's: Lots of breathtaking scenery in the high-altitude national parks of the Balkans (which are historically where a lot of the battle really took place). The music by Mikis Theodorakis (Serpico) is excellent. There are numerous battle scenes with lots of pyrotechnics... around a dozen German planes flying in formation (the air attacks are the high points) and 3 mock-up Tiger tanks (though obviously T-34s underneath). Good, sincere performances on the part of most of the actors. The Con's: Burton seems to sleepwalk through his performance it's so congratulatory to the glory of Tito (who was still alive at the time this movie was made) that it's dull-as-dishwater to watch. He has no personality or character beyond an obsession for taking care of the wounded. The directing is barely adequate with a lot of the dialog flatly staged and uninteresting. The scope is a lot less comprehensive; the Italians and NDH are barely alluded to. The final battle is a ridiculous steamroll over the evil (but inept) Germans. Here comes to one of my pet peeves in war movies: idiotic portrayal of the German army. They are more like zombies than soldiers, marching forward firing 'Revolutionary War'-style with no semblance of tactics involved. And when their comrades die the other soldiers continue walking like nothing happened, and their \"strong points\" don't seem too terribly well (or enthusiastically) defended. Although the officers are played by Germans, the bulk of the enlistees look very Slavic, and it's hard to forget that you're watching Yugoslavians play Germans. The English version curiously has the Germans speaking (dubbed) German but not subtitled... which nearly spoils possibly the best scene in the movie where the Germans kill a Partisan's son (he lost all 4 of his others previously in the fighting). One soldier raises his MP40 to kill the father, but then his sly-looking NCO holds him back and says something to the fact like \"let him live, it's worse punishment for him\". That scene, for me, made it all worthwhile. However, the English version is missing the scene where the Germans massacre the 6,000 (mostly wounded) Partisans that Tito left behind. Would be a nice DVD to pick up, but only if uncut and widescreen."
      ],
      "genres": ["War"],
      "productionCompanies": [
         "Bosna Film",
         "Filmska Radna Zajednica (FRZ)",
         "Sutjeska Film"
      ],
      "summaries": [
         "The Battle of Sutjeska known as ''Fifth offensive'' is the hardest, most tragic and the greatest battle that was led Yugoslav Partisans in World War II. Chaos, hell, fates, suffering, heroic deaths and all the tragedy of Sutjeska is a one poetic way and at the same time on one tragically way described in this phenomenal movie. This movie, was made for the 30th anniversary of the battle is also the most expensive movie in the history of Yugoslav cinema.",
         "The Battle of Sutjeska known as'' fifth offensive'' is the hardest, most tragic and the greatest battle that was led Yugoslav Partisans in World War II. Chaos, hell, fates, suffering, heroic deaths and all the tragedy of Sutjeska is a one poetic way and at the same time on one tragically way described in this phenomenal movie. This movie, was made for the 30th anniversary of the battle is also the most expensive film in the history of Yugoslav cinema.",
         "Nel maggio del 1943 l'armata di liberazione jugoslava guidata da Tito deve affrontare la quinta offensiva delle truppe tedesche. La lotta si rivela senza tregua per riuscire ad aprirsi un varco nella cerchia di ferro e di fuoco del nemico."
      ],
      "budget": 0
   },
   "movielensId": 150479,
   "movielens": {
      "languages": [
         "Bosanski",
         "Hrvatski",
         "English",
         "Deutsch"
      ],
      "releaseDate": "1973-07-31",
      "dvdReleaseDate": null,
      "directors": ["Stipe Delić"],
      "runtime": 117,
      "movieId": 150479,
      "title": "The Battle of Sutjeska",
      "mpaa": null,
      "actors": [
         "Richard Burton",
         "Ljuba Tadić",
         "Velimir „Bata“ Živojinović",
         "Irene Papas",
         "Milena Dravić",
         "Bert Sotlar",
         "Günter Meisner",
         "Anton Diffring",
         "Michael Cramer",
         "​Ljubiša Samardžić",
         "Boris Dvornik",
         "Rade Marković",
         "Relja Bašić",
         "Petar Banićević",
         "Hardy Krüger"
      ],
      "imdbMovieId": "0070758",
      "originalTitle": "Sutjeska",
      "genres": ["War"],
      "youtubeTrailerIds": [],
      "plotSummary": "The film tells the story of the Battle of Sutjeska which occurred in Nazi-occupied Bosnia and Herzegovina in 1943.",
      "tmdbMovieId": 143355,
      "avgRating": 3,
      "releaseYear": "1973",
      "numRatings": 1,
      "posterPath": "/eOEiRFaeZNSXW1d3r1RV77FlWuk.jpg"
   }
}