{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "africa",
            "id": 409
         },
         {
            "name": "lion",
            "id": 2043
         },
         {
            "name": "elephant",
            "id": 2857
         },
         {
            "name": "vegetarian",
            "id": 4459
         },
         {
            "name": "leopard",
            "id": 4478
         },
         {
            "name": "tiger",
            "id": 4809
         },
         {
            "name": "animal attack",
            "id": 5160
         },
         {
            "name": "zebra",
            "id": 7639
         },
         {
            "name": "wildlife",
            "id": 9902
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "jungle",
            "id": 10787
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "wildlife reserve",
            "id": 211504
         },
         {
            "name": "wildlife conservation",
            "id": 211505
         }
      ],
      "imdb_id": "tt0083001",
      "video": false,
      "title": "Roar",
      "recommendations": [
         168994,
         218233,
         130241,
         168300,
         118565,
         144610,
         48698,
         48276,
         34712,
         162749,
         146784,
         79720,
         147603,
         128753,
         100318,
         105560,
         234817,
         210972,
         47238,
         63350
      ],
      "backdrop_path": "/w0S04Q3qiQxLfUtf5AcqxQU4xUJ.jpg",
      "revenue": 2000000,
      "reviews": [{
         "author": "Law",
         "id": "59878522c3a3681c6500fcf7",
         "content": "This is not a real movie. Possibly the most repugnant thing ever made for cinema, Roar is just a snuff film without any snuffing. Its only merit is in making the viewer despise everyone involved. I'd give it a zero if I could.",
         "url": "https://www.themoviedb.org/review/59878522c3a3681c6500fcf7"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Madeleine",
               "gender": 1,
               "credit_id": "52fe437ac3a36847f8057015",
               "name": "Tippi Hedren",
               "profile_path": "/5piyjLaNRESJZ2Q8comMEjXqZBW.jpg",
               "id": 6929,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Melanie",
               "gender": 1,
               "credit_id": "52fe437ac3a36847f8057019",
               "name": "Melanie Griffith",
               "profile_path": "/rdRjFsPQDQqPE8JlDQcuT5JDpED.jpg",
               "id": 29369,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jerry",
               "gender": 0,
               "credit_id": "52fe437ac3a36847f805701d",
               "name": "Jerry Marshall",
               "profile_path": null,
               "id": 29372,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mativo",
               "gender": 0,
               "credit_id": "52fe437ac3a36847f8057021",
               "name": "Kyalo Mativo",
               "profile_path": null,
               "id": 29373,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Rick",
               "gender": 0,
               "credit_id": "52fe437ac3a36847f8057025",
               "name": "Rick Glassey",
               "profile_path": null,
               "id": 29374,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Prentiss",
               "gender": 0,
               "credit_id": "52fe437ac3a36847f8057029",
               "name": "Steve Miller",
               "profile_path": null,
               "id": 29375,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Hank",
               "gender": 2,
               "credit_id": "52fe437ac3a36847f805702d",
               "name": "Noel Marshall",
               "profile_path": null,
               "id": 29342,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "John",
               "gender": 2,
               "credit_id": "52fe437ac3a36847f8057061",
               "name": "John Marshall",
               "profile_path": null,
               "id": 89246,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Committee Member",
               "gender": 2,
               "credit_id": "52fe437ac3a36847f8057065",
               "name": "Zakes Mokae",
               "profile_path": "/sxzqrmSm7Kd7eSHzos7UeiT0mke.jpg",
               "id": 47458,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe437ac3a36847f8057033",
               "name": "Noel Marshall",
               "profile_path": null,
               "id": 29342,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe437ac3a36847f805703f",
               "name": "Tippi Hedren",
               "profile_path": "/5piyjLaNRESJZ2Q8comMEjXqZBW.jpg",
               "id": 6929,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe437ac3a36847f8057045",
               "name": "Noel Marshall",
               "profile_path": null,
               "id": 29342,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe437ac3a36847f805704b",
               "name": "Jan de Bont",
               "profile_path": "/9kPf2LuyLLwCawSGyPIQCX7ighX.jpg",
               "id": 2209,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe437ac3a36847f805705d",
               "name": "Vincent Prentice",
               "profile_path": null,
               "id": 29377,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "551be0e4c3a3687670002e2e",
               "name": "Noel Marshall",
               "profile_path": null,
               "id": 29342,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "551be105c3a368766c0030ba",
               "name": "Ted Cassidy",
               "profile_path": "/rQwD5L0y45GQ6woImqM5A9HyAb9.jpg",
               "id": 9600,
               "department": "Crew",
               "job": "Additional Writing"
            },
            {
               "gender": 0,
               "credit_id": "551be11dc3a368474e000e5a",
               "name": "Joel Marshall",
               "profile_path": null,
               "id": 1448345,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "551be09ac3a3687679002c49",
               "name": "Jack Rattner",
               "profile_path": null,
               "id": 1448342,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "551be08cc3a3687679002c42",
               "name": "Robert Gottschalk",
               "profile_path": null,
               "id": 1185752,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "551be0aac3a368767d002d5a",
               "name": "Charles Sloan",
               "profile_path": null,
               "id": 1448343,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "551be0b79251414af3002dd5",
               "name": "Banjiro Uemura",
               "profile_path": null,
               "id": 393389,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "551be0ca9251414aed002a50",
               "name": "Terrence P. Minogue",
               "profile_path": null,
               "id": 29376,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "551be171c3a3687679002c77",
               "name": "Matthew W. Mungle",
               "profile_path": null,
               "id": 23788,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "551be17ec3a3687669003214",
               "name": "Ken Diaz",
               "profile_path": "/evDWsHoxnKp5saXTjVOMFXJnX3O.jpg",
               "id": 14653,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "551be18a9251414af3002e04",
               "name": "Karen Kalberer",
               "profile_path": null,
               "id": 1448347,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.882819,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2989,
      "vote_count": 26,
      "budget": 17000000,
      "overview": "Roar follows a family who are attacked by various African animals at the secluded home of their keeper.",
      "similar": [
         278927,
         258489,
         10603,
         948,
         9732,
         12222,
         18994,
         635,
         242095,
         10527,
         11430,
         10586,
         1730,
         14211,
         9904,
         38940,
         6404,
         39957,
         606,
         14873
      ],
      "original_title": "Roar",
      "runtime": 102,
      "poster_path": "/3v5T5ahdzSg8EzPddprTaEeAmrM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "American Filmworks",
         "id": 8310,
         "origin_country": ""
      }],
      "release_date": "1981-11-12",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "No animals were harmed in the making of this movie. 70 members of the cast and crew were.",
      "adult": false,
      "homepage": "http://www.roarthemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Noel Marshall"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Noel Marshall",
         "Ted Cassidy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0083001/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ1ODM3NDY3Nl5BMl5BanBnXkFtZTgwNzY1NzQ3NDE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Tippi Hedren",
         "Noel Marshall",
         "Melanie Griffith"
      ],
      "reviews": [
         "I first saw this movie as a child and it has always stayed in my memory as an enjoyable experience. I just watched it recently as an adult and found it every bit as enjoyable as before. It's directed by Noel Marshall who spent a decade making this film. What really works the best is the fantastic music score. Unlike some films today, \"Roar\" doesn't drag on for hours and has no shallow character's or bad CGI. This is the way films should be made. Real lions and tigers involved in this amusing story of a family arriving at the wrong time to be greeted by the local wildlife. I don't understand the other reviewer and their negative comments. Watch this for yourself. It's not spineless garbage but a passionate and thoughtful film. Thank you for reading.",
         "Although it is no Disney classic, Roar is a tale of adventure well worth watching. I am a huge fan of films that take me to the far reaches of the world, and, in that regard, this is a movie that delivers. The lions are incredible and the filmmakers exhibit a thorough understanding of who the real stars of the show are. The lions take center stage and shine. The performances by the cast are competent, but I am an animal lover and for me, that is the true draw of the film.",
         "There's nothing fake about this film. It's shot beautifully, on real locations. Tippi Hedren and Melanie Griffith head a talented and fearless cast, who literally throw themselves in the jaws of the beasts over and over again. The picture has a terrific rhythm and is fun to watch but I couldn't help dwelling upon how dangerous a film it must have been to make. Although there were some poignant and funny moments like the scenes where dauntless John Marshall tries to pull his boat away from the shore but the lion keeps pulling it back or when he hides in a barrel filled with water and the lions begin to drink from it. The story seems simplistic in structure but is really quite profound in the way Marshall draws sympathy for the animals, brilliantly shot by John De Bont. The closeups of the dying beasts will bring tears to your eyes. This is must see for anyone who believes that filmmaking is artificial and safe.",
         "You know what? Sometimes words really aren't enough to do justice to something. Roar has to be without a doubt the most insanely unsafe cinematic undertaking I have ever had the pleasure of watching. The unbelievably high level of danger is quite frankly there for everyone to see up on the screen as we watch a group of actors interact with over one hundred big cats with no protection whatsoever! It was inspired by the success of the lion drama Born Free (1966). And you might make the observation that there is fifteen years between these two movies and think this strange, well that's because this flick took eleven years from start to finish! Its production met with all manner of set-backs such as fire, flood and disease; each of which put the film's schedule back. But more to the point, it was as dangerous to work on as it looks on screen. The opening credits state that no animals were hurt in the making of the film, what they could not say with as much confidence was that there were no humans hurt! As it was, seventy cast and crew were injured, including cinematographer Jan de Bont who was partially scalped, Tippi Hedren had her neck bitten, Melanie Griffiths almost lost an eye, Jerry and John Marshall both required extensive stitches, while Noel Marshall was attacked so often it took years for him to recover from his injuries. When you watch Noel in action in this film it is not exactly hard to see why! In fact some of the injuries can be seen happening on screen. It is madness, pure and utter madness. But because of this, it makes for highly entertaining and bizarre viewing. Unfortunately, the public back in 1981 didn't seem to agree and Roar was a box office disaster. To be honest, this is not entirely surprising as this feels far more like a cult movie than blockbuster material, given its utter strangeness. For a start it doesn't really have a plot and it boils down to a few events that bring our human cast into contact with the big cats. The story barely makes sense if you think about it very long. But who needs a story when you've got this insanity on screen? The madness and health and safety black hole that the events on screen represent mean that a story needs be no more than an afterthought. For what it's worth, Noel Marshall - wrote, starred, directed and financed it and his wife Tippi Hedren, who was a wildlife activist who campaigned for the protection of big cats, was the big name draw. Hedren, of course, was previously most well-known for her starring role in The Birds (1963) where she was famously mauled and scratched by an assortment of flying fiends. Well, all I can say is that what she experiences on Roar makes the actions of the birds in Alfred Hitchcock's classic seem positively reticent by comparison. The actors are all splendidly game and deserve huge amounts of credit for their nerve but the real stars of Roar are the big cats and rampaging elephants. This is the ultimate wet dream for any lover of the big cats in particular and we have the very strange scenario of seeing lions, cheetahs, panthers, leopards and tigers interacting with each other. Watching them violently wrestle is a pretty nerve shredding thing, except if you are Noel Marshall that is, he usually runs in to join them! But on the whole, while there are a few continuity errors and the editing is full-on and sporadic, this is exciting stuff that could never in a million years be described as boring. It truly defines the term 'one of a kind'. With health and safety legislation what it is now, there is no way in hell there will ever be another film like Roar. It's truly unique and I sure lapped it up.",
         "It turns out that birds aren't the only critters to have given actress Tippi Hedren a rough time on screen! In \"Roar\" (1981), a film that Tippi and her then-husband Noel Marshall--along with sons John and Jerry and daughter Melanie Griffith--star in (Tippi and Noel also wrote, produced and directed), all manner of wild animals turn up to give the actress some fairly tense moments. In this virtually plot less film, a mother and her three kids go to Africa to visit their scientist husband/father after an absence of three years. Dad's not at home when they arrive, but around 30 large cats--lions, tigers, jaguars, etc.--are, and proceed to chase the family all around the abode. These animals are never shown in a bad light, however; this is very much a pro-conservation film that espouses all wildlife causes. That is all well and good, but the film's primary appeal, it must be said, is the Marshalls' fearless interaction with the big cats. Seeing Noel dive into a group of fighting lions and come out bloodied but happily beaming is really quite remarkable. Tippi reveals herself to be quite an extraordinary stuntwoman, too; just watch her get tossed about by an elephant, fall off a tipping ladder into a pond, climb down a waterwheel, and roll around with the lions! We are told at the picture's beginning that no animals were harmed during its (11-year!) filming; I for one could use a further reassurance about the movie's humans! Siegfried & Roy, eat your hearts out; no lion tamer act will ever seem impressive after one sees what Noel and family do during the course of this film! \"How did they ever make this thing?\" is the question that springs to mind constantly during a viewing of \"Roar\"; the human-animal interactions shown are like nothing you have ever seen. In that, it is a completely sui generis experience, and, despite a few genuinely scary moments, perfectly suitable for watching with the kiddies. Very highly recommended.",
         "I saw this movie dubbed in German in 1984 and thought it was incredible how lions were used in the movie. The plot, though simple, is interesting which makes the movie enjoyable for a wide audience. The writers did a good job in keeping the humor light. Kudos go to the lead characters in the movie, supposedly some of whom got injured in the filming.",
         "ROAR is one of those rare films where the behind-the-scenes story is more interesting than the one up on screen. It's a would-be animal movie along the lines of BORN FREE about a normal American family coping with a house full of big cats, but the whole thing is so ridiculous in both execution and planning that it's a film which has gained infamy as one of the most dangerous in history. The problem lies with writer/director/star Noel Marshall, he of the wild hair and dubious acting talents. Marshall thought it would be a good idea to mix together a ton of different big cats, including a number of male lions, and throw them in with unprepared actors, including his wife Tippi Hedren and stepdaughter Melanie Griffiths. The resulting shooting schedule saw over 70 injuries to cast and crew, the most infamous of which was the director of photography, Jan De Bont, getting scalped. The enjoyment factor of this one is of the 'car crash' variety. Marshall is obviously a zealot who acts and sounds a lot like Timothy Treadwell, the doomed star of the Herzog documentary GRIZZLY MAN, who got a bit too close to the grizzly bears he was obsessed with and paid with his life. Nobody died during ROAR, but they came close. There isn't really a script here, just characters reacting to the big cats, and the only decent bit is the tense mid-section in which Hedren and her screen children attempt to evade the cats which are chasing them around the house (which is far better than the whole of the tiger-in-the-house thriller BURNING BRIGHT). Otherwise, it's just a case of watch and endure it.",
         "Roar is an interesting look at how a man must fight to keep his ideals and his family. As a man must decide how to face a world taken over by animals, he must face his worst fears. That of deciding between cats and his family. While his family fights for their lives.",
         "Having both seen the film & visited the amazing home of the star, Tippie Hedren, to see the wonderful animals, I can't recommend the film highly enough. Cats of different species living together in the beautiful setting of Roar is stunning to see. Ms. Hedren shares her home at Shambala with as many as 80 great cats of all varieties, & provides a permanent home for them. The Roar film project taught Ms. Hedren & her family the importance of protecting these \"wild ones\" & she shares this with the public by opening her home twice a month to visitors over 18 years of age. I have experienced being up close & personal with the \"wild ones\" at Shambala twice & was able to, in a very special way, live \"Roar\". See the film & visit Shambala, you will be very happy you did.",
         "Jesus Christ! I've read a lot about this since it was resurrected a while back, but nothing quite prepares you for just how insane it is. It is as if Timothy Treadwell had decided to make a sitcom starring his beloved grizzly bears. The Treadwell here is Noel Marshall, Hollywood producer and husband of Tippi Hedron. The two were obsessed with lions, so they wrote this picture, where a family lives with like 50 different big cats, mostly lions but also several tigers, cheetahs, leopards, etc. There are also some elephants. The script is nearly nonexistent - I mean, how exactly are you going to get 50 giant cats to do what you want? So the idea is just to write a bare sketch of a plot and then throw your cast (which mostly consists of Marshall, Hedron and their children) to the lions like it's ancient Rome or something. Besides Noel Marshall, who probably should have been in a mental institution, the rest of the family members and other cast look terrified much of the time. At one point, one of the Marshall sons has to speak the line \"I don't have to be in Chicago until next week!\" A lion jumps up on him halfway through the line and you can hear his voice quiver. Of course, Melanie Griffith is one of the kids. Amazingly, no human died during the many years of production (some lions did, though, when the ranch was flooded). The film itself is far from great, but it's a must-see.",
         "This film is about a persons attempt to understand 'big' cats and to dispel the myth that they are dangerous. It is a very funny and poignant film, filled with excellent photography and music. A must for anyone who has a domestic cat, (and a wife)? The story is one of a domestic nature, and their attempt to make the marriage work. A man absorbed in his chosen profession, at the expense of his wife and family. This is a last attempt to resolve the issues between himself and his family, with catastrophic and hilarious consequences. The photography is one of the major aspect of this film, as it shows the gentleness of the 'big' cats and the hierarchy of the various prides. An outstanding piece of cinematic work, which led Tippi Hedren to continue her work for the 'big' cats after filming was completed (and still carries on her work).",
         "While this movie is certainly incredible in terms of its live action sequences with the lions, I would actually like to draw some attention to the soundtrack, which is not only unique, but powerful, exciting and highly eclectic. The two most notable figures involved in its production are Terence P. Minogue, who composed and conducted the symphonic contributions, and Robert Hawk, who wrote and sang the bulk of the songs. The symphonic score is grand and melodic, while the songs in the movie contain some brilliant and sincere pop moments. Who are these two people and have they done any other soundtrack work before or since Roar? (I've searched the web in vain!) The impression one gets in watching the movie is that Robert Hawk, at least, was part of the extended Marshall circle of family and/or friends, as Noel professes his liking for Robert's music in one scene in the movie (to Mativo).",
         "\"Roar\" is a movie that manages to be nerve-wracking as well as tedious to sit through. Tedious because there's no story to speak of; nerve-wracking because of what the cast and crew reportedly went through to produce it. \"Roar\" is about an American named Hank (Noel Marshall) who has gone to Africa where he can study lions up close - *really* close. To this end, he's constructed a private refuge and house where lions are free to wander about, inside and out. A *lot* of lions. And tigers. And leopards. And cougars. On this particular day, Hank is awaiting a visit from his estranged wife Madelaine (Tippi Hedren) and their grown children, who have traveled all the way from the States. But due to a lack of communications, Hank spends several hours headed to the airfield while his wife, sons and daughter make it to the refuge on their own. Once there, wife and kids are intimidated, when not downright terrified, by their close encounters with Hank's \"friends\" until they eventually decide the creatures aren't so bad after all. Dad finally shows up - and that's it, really. That's the whole movie, aside from a half-hearted subplot involving a couple of villainous big game poachers. You'd think that once the family settles down, \"Roar\" would start to tell a real story about something more substantial, but instead we get a cheerful, hopeful song accompanying a montage of the family interacting with the animals, and... the movie ends. (Just as well. At this point, I really didn't want it to keep going.) Said to have been a pet project (you should forgive the term) of Tippi Hedren and her then- husband, Noel Marshall, \"Roar\" reportedly cost $17 million, much of it their own money, and earned back only a fraction of its cost. It's certainly a sincere and heartfelt plea for wildlife conservation. But as I sat there, the film's opening disclaimer about how only \"untrained animals\" were used kept rattling in my brain. Untrained animals. It was alarming to see all these lovingly filmed scenes of lions playing (i.e. fighting) with each other. And seeing the actors let themselves be swarmed or pursued by the lions was downright heart-pounding. (I soon lost track of how many times I silently shouted, \"Are you crazy?\") \"Roar\" was a true family affair, with Noel Marshall's real-life sons and Tippi Hedren's real-life daughter, Melanie Griffith, playing the kids. (If I ever get to meet Melanie Griffith, who here plays a character named \"Melanie,\" I must ask her about the scene in which she allowed one of the lions to pin her to the floor, face-down.) \"Roar\" seems to tell you that lions are just a bunch of oversized pussycats with big, sharp claws - treat 'em right, don't let them sense fear, stand up to them when necessary, let them lick and paw you to their hearts' content, and everything will be just fine, the occasional bad scratch notwithstanding. The thing is, just about everyone connected with this production was injured by the animals at one point or another, including the actors. (By unhappy happenstance, I saw this film about a month after the death in South Africa of Hollywood visual effects editor Katherine Chappell, who'd made the awful mistake of rolling down a car window during a visit to a lion park to take a picture, and was attacked and fatally bitten by a lioness.) Perhaps instead of making a \"real\" movie, Hedren and Marshall would have done better to have made a documentary about the wildlife they obviously admire so much. And speaking of documentary, if they had done a behind-the-scenes film about the making of this movie, that film could very well have been much more interesting than \"Roar.\" By the way, \"Roar\" was beautifully photographed in Metrocolor. As in MGM. As in... lion? (Coincidence? Of course, but I couldn't resist.)",
         "And I thought Grizzly Man was crazy. This film made me uncomfortable, bewildered, and astonished all at once. How nobody died during the making of this is beyond me. How ANYBODY in their right mind would even think of committing to this movie for even a fraction of a year is completely and totally insane. For a film with overtones of slapstick comedy, it certainly manages to deliver a feeling of intensity and uneasiness that I've never experienced while watching a movie before. At times, I felt like the novelty was fading away, only to be reminded that THIS FILM IS WHAT HAVING A DEATH WISH LOOKS LIKE. Every so often, you come across a movie that sticks with you for whatever reason. This is one that you won't forget anytime soon. I promise you.",
         "This movie, which I understand took years and years to make, should have been left unmade. The one man show of Noel Marshall, the producer-director-writer-star and who knows what else, is another example of how a Hollywood personality (in this case a former agent) makes it big (with the Exorcist) and blows his money to make a ludicrous vanity project. The story, which makes Marshall out to be a Hemingway warrior type, is laughable excrement. There are no characterizations and no intelligence behind the film making. The animals are good. They would have been better if they had eaten Noel Marshall.",
         "Noel Marshall and Tippi Hedren certainly had a, uh, interesting relationship for a while there in the 70's and early 80's. I don't know what their marriage was like behind closed doors of course, but somehow it's a great gift to the Earth that they produced the film ROAR. Why this is can't be easily explained in a review, but I can try with this: it's about a family that lives with lions and tigers and some elephants and panthers too. Or rather it's about a guy who LOVES these lions and tigers (by the way, why tigers, shouldn't they be in India and, oh, nevermind) and panthers and so on, and invites his wife to come live with him along with her and his kids. So here comes Tippi Hedren and actual real life children Melanie Griffith and John and Jerry (Marshall's kids), and when they arrive Noel is out uh doing stuff out in the plains or jungle, and they have to contend with a house full of lions. Oh, and these were UNTRAINED LIONS by the way. In a way I should be critical of Roar. Marshall, with the exception of one sequence that takes on the qualities of a Night of the Living Dead picture with wild cats in place of the un-dead, doesn't really set up suspense very well. The fascination with watching Roar is basic but constant: these are real people, many of them likely not exactly used to the f***ing idea of hanging out with things like lions and tigers, being knocked around, chased, bombarded by their paws and jaws and bodies, and that should in all likelihood they could/should kill these people. There's also the behind the scenes drama that imbues real danger with what's on screen so much; right on the cover of the blu-ray it states that 70 cast/crew were harmed, and looking up who got what is just staggering (to give you an idea of the extent, director of photography Jan de Bont got his skull practically knocked off, and Melanie Griffith got facial reconstructive surgery, though the fact that we didn't notice in those movies she starred in in the 80's shows how good that surgery must have been). If there was a documentary on the making of this film it might make Herzog's Grizzly Man look like kids stuff. Indeed the hero to me of this film is de Bont; he gets his camera into places that I just couldn't think would be possible, right in the faces of these lions, capturing action that seems impossible - certainly with the knowledge that these lions didn't have proper, you know, TRAINERS. It's just a feeling of constant WTF that goes on with this - likely why it got picked up by Drafthouse Films as Drafthouse CEO Tim League is all about finding the freshest and brightest of those WHAT IS THIS sort of flick (they also released Miami Connection some years back) - and it's amazing just on that basis alone. It's also just hysterically funny in that way that the movie lacks that awareness of the danger. Or, let me rephrase that, I think the director knew that there would be danger with these cats, but, well, why carp? The attitude is that Man is the biggest enemy - the closest thing to antagonists are under-developed hunters, you know they are as they get lines showing that I guess and they have the guns - and that, with the exception of one memorable/super-bloody lion named Togar, the lions would be just peaceful and lovable creatures if left alone. But the ethos of the filmmakers is constantly at odds with what IS shown on screen. The actors, to their credit (at least Hedren and Griffith to an extent), get this and play this fear well through a long mid-section. There's really the feeling like there isn't really any, shall we say, 'acting' going on here; to this end, Melanie is named Melanie as are the Marshall sons, though why Hedren is a different character name is anyone's guess. I'd be surprised if there even was a solid script - how do you get these lions et al to do the things they do? It's an entirely maddening enterprise to see unfold, the kind of movie that shouldn't have been made, and may even be (borderline?) unethical, but as it is here you can't look away from the metaphorical train-wreck.",
         "\"This is a madhouse.\" Mativo (Kyalo Mativo) Roar, an action film about a marauding gang of jungle beasts such as lions, tigers, jaguars, leopards, and cougars, is one of the worst movies I have ever seen, yet like an Ed Wood production, not without its amusements. While the animals appear to be real, the actors are mostly grade-school quality. Even the accomplished Tippi Hedren as Madelaine and her daughter, Melanie Griffith, as Melanie, come off as amateurish probably because of the ineptitude of the other actors; the script; and her husband, the writer-director of Roar, Noel Marshall (who plays Hank, the soul-mate of the animals). While the core conflict is about poachers who are central-casting nasty, most of the story involves the loving animals chasing Hank's hapless family until we realize the animals are not going to hurt them, in fact just long to hold and be held by the humans. Not so lucky are the poachers, whose sneers and overall seedy looks promise retribution. Not so lucky are some real production people, such a cinematographer Jan de Bont, who needed a scalp reattachment and Melanie Griffith, who had facial reconstruction after being mauled. It's a partly-true story of Marshall's family, who lived among 100 beasts on their California estate. Although the pedestrian plot is obvious from the get-go, Roar is saved by the sincere intentions of Marshall and Hedren, who must have wanted to make some kind of conservation statement with the film. Re-released from 1981, Roar did show me that tigers love to swim and lions not so much and that anyone with money can make a movie that eventually falls into the hands of discerning, unkind critics. Hank running around yelling in order to shepherd the animals is just one of many repeated scenes that lose impact the minute one realizes these are animals trained to love humans. Surprisingly, the animals are house-trained, or so it seems. The film feels like a Jungle Jack Hanna production, spiced up from Born Free, and encouraged by former Keystone Cops, who also must be animal trainers.",
         "I went into this movie with an open mind and heart, and I'm glad I did! Ever since I have been a small child I have had a deep love for animals. Big cats and elephants? NO exception! This was a very endearing movie who is not short of its heartstrings moments as well. You will be hard pressed to see such a wide variety of big cats all in one movie! The cast was great and the cats truly do steal the limelight -- and your heart. It is with hope that this movie had reached out and touched many others and hopefully inspired them to take better care of the wildlife around us. If you've enjoyed Born Free and the like, I am sure you will love Roar, perhaps even more so.",
         "I laughed whole heartedly when I heard Tippi Hendren exclaim \"Oh God! Look what the cat dragged in!\" I had never seen before or after such a realistic and frightening movie. This film did not use any CGI (computer generated imagery) when heards of lions and tigers were running amuck through Hank's (Noel Marshall) house situated on an island at the Shambala Preserve near Acton, California that Tippi Hendren is founder and President of the Roar Foundation. This film was definitely a family event as actor/writer/director Noel Marshall and two of his three sons Jerry and John Marshall played his sons in the film. His wife Madelaine was played by Tippi Hendren who convinced her own biological daughter future Hollywood star Melanie Griffith to play their daughter Melanie. The basic plot is that the father and alpha male Hank is off site trying to save some wild animals when his wife Madelaine, daughter Melanie, and two sons Jerry and John pull up in a boat to his wild animal reserve home after not seeing their father for a few years only to be greeted by herds of lions, and tigers and elephants...oh my! The musical score was perfect as these full grown adult lions and tigers were everywhere and anywhere while the family of four tried sheltering themselves from the herds of wild beasts and all the time wondering where their father was as he knew they were coming. In reality, no animals were hurt throughout the film shoot but some of the films cast and production crew fell victim to the animals claws. Melanie Griffith was clawed by a lion and she required 50 stitches to close the deep gash on her eye. She was lucky not to lose her eyesight. In the classic 1939 film The Wizard of Oz, Dorothy repeats this particular line \"Lions and Tigers and Bears Oh My!\" whilst walking through the woods. But in this real life action film Roar, this family of four are confronted by real life lions and tigers and a two ton elephant that literally shreds their puny little outboard motor boat apart with his giant two foot tusks. I I would really like to see this film come back to the theaters so that a new generation of film goers could witness in awe the capabilities of actors Tippi Hendren, Melanie Griffith, Noel, John and Jerry Marshall who risked their lives participating in this real life action film continuously surrounded by fully grown adult lions, tigers and elephants. It was just an incredible film to watch which included some real life battles between lions who wanted to be King of their jungle and some win and some lose. I cannot wait for this film to come out on Blu ray as it would make a great Christmas gift for many of my friends and family. Roar is a film that must be seen to be believed if you can watch the entire film without closing your eyes and/or leaving the room. I give this documentary music infused stylish film a high 9 out of 10 rating for sheer effort of the cast and production crew who literally gave their blood, sweat and many tears to make this film a reality.",
         "After reading years ago various reports about this disaster-ridden (and extremely expensive) production, it immediately went on my \"must see\" list. However, until recently the movie was all but impossible to see. I only just now managed to watch it. So is the movie itself as much of a disaster as its problem-filled production was? Well, writer/director Noel Marshall does manage to make the whole middle section of the movie (concerning the visiting family being chased around the compound by wild lions) often quite tense and unnerving. Though when you are dealing with wild and unpredictable lions, they certainly bring with them some genuine danger and suspense. It's absolutely unbelievable given the actors put shot after shot right next to wild lions that none of the actors were killed - though I do believe the reports that many of the cast and crew got some severe injuries. There are many moments that will have your jaw drop, from risky interactions with the lions to Marshall trying to convince the audiences that lions aren't so bad and dangerous after all. Certainly, what I have reported so far has some kind of perverse entertainment value, but the movie all the same sinks in the end. The main problem with the movie is the script - there's barely any character development or plot here. It doesn't take too long for the movie to become somewhat repetitive and to a degree boring. Despite what I've said, I think the movie is still worth a look. As I said in my summary line, the movie is one of a kind. Possibly no other movie has put actors in as much risk as this movie, and its noble intentions come across as so misguided that you'll wonder what the heck Noel Marshall was thinking. You may not like the movie, but you'll certainly remember it for a long time afterwards - that's more you can say for a lot of other movies, even some better ones.",
         "Warning: Spoilers... for a movie that's 45 years old. I just watched a copy of this for the first time. It's pretty insane. I was left wondering why they made up a violent storyline instead of just showing the big cats among a family in a peaceful setting. I know a film can't be about the land of the happy people, but those cats are scary when they aren't fighting. 14 year-old Melanie Griffith has a scene where the blood has drained from her face and her lips are grey. You can tell that she really was terrified, not just acting. It is a movie with sheer terror mixed with enough absurdity to make you laugh in parts. The elephants in the film were my favorite to watch. They were the only elephants I've ever seen that I thought were scary. And by the time the family meets up with them, I couldn't help but cheer as one tears their boat out from under them and rips it apart. I wish this had gone the same way as Uly's 'Gods Must Be Crazy' though. That was a far superior film. It's a shame the concept for this was just plain stupid. i still highly recommend watching it. The bonus documentary is also worth seeing. Tippi Hedren's extremely candid comments left me speechless. Nothing gets more real than that.",
         "A mother ( Tippi Hedren) and his sons (Melanie Griffith..) go to Africa to find again his husband (John Marshall) who is a warden of wild animals as lions, tigers , elephants ...There occur strange and humorous events when some flocks invade a home and go after the family , up and down stairs and from a floor to another. This is a great family entertainment . It's a familiar film directed by Noel Marshall and starred by his then wife Tippi Hedren, also producer, and their true sons. Since choice was made to use untrained animals and since for the most part they chose to do as they wished, it's only fair they share the writing and directing credits also starring as Robbie, Gary and Togar. Furthermore appear uncredited secondaries as Will Hutchins and Zakes Moakae as two of the members of the committee. Colorful cinematography by the Dutch Jan De Bont, Paul Verhoveen's usual. Enjoyable score by Minogue is performed by National Philharmonic Orchestra and Togar theme by Dominic Frontiere. Plus, touching songs written and sung by Robert Hawk. At the end the film tells various warnings as : Although some scenes appear to show animals being injured , they were never actually hurt. The lions that appeared to be killed are all back to playing with their friends but the animals that are being slaughtered in Africa are a reality and many species are near extinction. In the eleven years since began filming ¨Roar¨ in most areas of Africa , 90 per cent of the animals have been killed. These are thinking , feeling beings who need your help to survive. Something must be done and there is much you can do , as contribute to one of the many effective wildlife organizations . Show your disgust with anymore who buys or owns furs of ivory. If at all possible , plan a trip to an African country with a good conservation record. The preservation of Africa's precious wildlife heritage is the responsibility of the whole world.",
         "10 is not enough. Nobody, I repeat Nobody is enough movie maker to brave what Noel Marshal accomplished. A making of would be more interesting than the film. You have to remember this was before digital effects made these things possible. 110 untamed cats, interacting with humans and each other and crew??? Over 1000 crew worked on this film. It was insane, but what a movie. Noel Marshal gave us the Scariest Horror film of all time, then sold his interest in the Exorcist to help his wife get back into the film business (after being blackballed by Alfred Hitchcock for not sleeping with him) This Producer has done two of the all time scariest and most real films of all time. He took his life in his hands making this. It's more than a film. It should be taught in film schools.Try to picturing yourself behind a camera or holding a boom mike on any of the shots and you'll immediately know you are in danger.Nobody else but Noel has balls big enough to tackle an adventure like this. If you want a true cult hero... Noel Marshal is it.",
         "Interesting if not particularly well-made \"film\" by Noel Marshall, starring him and his family, which includes wife Tippi Hedren and stepdaughter Melanie Griffith. The story, such as there is one, has Marshall running a wildlife preserve where he has dozens of big cats (lions, tigers, etc.). While he's away his estranged wife comes for a visit, bringing along their grown children. The wife and kids then proceed to run for their lives from the cats in one poorly-directed scene after another. It's a bizarre movie that seems to be advocating the naive idea that humans and predatory big cats can co-exist in peace and harmony, provided the humans don't mind the occasional mauling. Marshall comes across as insane throughout the film, which is really pretty dull when the cats aren't \"playing\" with people. It's of interest only for the production backstory and the fact that you have these animals roaming around doing as they please while stupid actors put themselves in harm's way for no good reason. The film has the notoriety of having over 70 of its cast and crew suffering injuries (although surprisingly no deaths). The movie also brags at the start that it was approved by the Humane Society and that no animals were harmed during the making of the production. Really? I must have imagined the lions fighting to the point of drawing blood. Watch this as a curiosity piece only and as a reminder that you should always be weary of zealots, no matter how well-intentioned they may seem.",
         "Wow. I never knew pussy could be both scary and inviting at the same time. What a whack movie. I'm writing this before I do any (further) research on it so that it's my genuine opinion. But, from what I barely heard or remember or WHAT THE POSTER BLATANTLY SAYS, many people got hurt in the making of this film. Not that I want that to happen, it sounds like the making of this movie would be far more interesting. In fact, bring on the feature-length doc and I will buy advance tickets! The movie sincerely starts off scary. And I am not kidding. Sure there's some bad acting, terrible ADR and the distracting character name of Melanie played by Melanie Griffith, but the idea of pitting humans amongst MANY ferocious carnivores, I kept expecting the worst to happen. But then, that was all in the first third. Then the real \"movie,\" began and it was terribly hard to determine if this was intentionally funny or the number one most unintentional comedy of all time. Personally, I love movies that are unintentionally hilarious like Birdemic: Shock and Terror, The Room and Twilight. But, this one had me puzzled since it seemed dead serious and suspenseful at times, but then had corky (corny?) music and so many Benny Hill chase scenes. Basically, most of a family tries to reunite with the father in Africa who had befriended many large and diverse cats. While he's goofily trying to get to his family, they spend a good chunk of the film running away from the cats in the dad's house made of cardboard that contains probably around 600 rooms. Again, what started off scary turns goofy and absurdly incoherent and then, sorry, spoiler, ends with the most \"Can't We All Get Along\" song and message. Once I finish writing this, I can't wait to learn more about the background to this movie. As I restate the movie poster's fantastic tagline: \"No animals were harmed in the making of this film. 70 cast and crew members were.\" I am yearning to hear more about the behind-the-scream issues. For one thing, I could not believe that the animals wouldn't turn on or even accidentally hurt, seriously maim or kill someone. There were just too many of them who all stayed in one small area, hardly hunted at all\u0085and they had to be hungry. But, that, again, is background information. This review is based on the movie I saw. And it's terrible, sadly, because it could've been more suspenseful and thrilling had they kept to one tone and had a much lower number of the unbelievably \"playful\" lions, tigers and elephants. Oh, myyy. *** Final thoughts: That all said, I do love me some When Animals Attack movies. Mostly the realistic animal ones such as sharks, ants, spiders, birds, piranha and even these cats. When they're all genetically mutated or, ah-hem, ROAR like the shark in Jaws: The Revenge, it's just silly and I'm less frightened since it couldn't happen. But, like I said, When Animals Attack and they're normal sized beasts\u0085 I'm having a blast by being scared. For the most part, anyways\u0085Sorry, cast and crew of Roar. You got hurt for such a failed product."
      ],
      "genres": [
         "Adventure",
         "Thriller"
      ],
      "productionCompanies": ["American Filmworks"],
      "summaries": [
         "Ravening jungle beasts assemble in flocks to invade an otherwise quiet home where they terrorize the visiting family of their keeper.",
         "A family goes to Africa to meet their father who lives with wild lions."
      ],
      "budget": 17000000
   },
   "movielensId": 155501,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-11-12",
      "dvdReleaseDate": null,
      "directors": ["Noel Marshall"],
      "runtime": 102,
      "movieId": 155501,
      "title": "Roar",
      "mpaa": "PG",
      "actors": [
         "Tippi Hedren",
         "Melanie Griffith",
         "Jerry Marshall",
         "Kyalo Mativo",
         "Rick Glassey",
         "Steve Miller",
         "Noel Marshall",
         "John Marshall",
         "Zakes Mokae"
      ],
      "imdbMovieId": "0083001",
      "originalTitle": "Roar",
      "genres": [
         "Adventure",
         "Thriller"
      ],
      "youtubeTrailerIds": ["cny_D50Rr44"],
      "plotSummary": "Roar follows a family who are attacked by various African animals at the secluded home of their keeper.",
      "tmdbMovieId": 2989,
      "avgRating": 2.95455,
      "releaseYear": "1981",
      "numRatings": 11,
      "posterPath": "/3v5T5ahdzSg8EzPddprTaEeAmrM.jpg"
   }
}