{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dc comics",
            "id": 849
         },
         {
            "name": "superhero",
            "id": 9715
         },
         {
            "name": "based on comic",
            "id": 9717
         },
         {
            "name": "super power",
            "id": 33637
         },
         {
            "name": "superhero team",
            "id": 155030
         },
         {
            "name": "teen superhero",
            "id": 213104
         }
      ],
      "imdb_id": "tt5091548",
      "video": false,
      "title": "Justice League vs. Teen Titans",
      "recommendations": [
         366924,
         297556,
         408220,
         408647,
         217993,
         323027,
         30061,
         321528,
         76589,
         103269,
         242643,
         22855,
         251519,
         17445,
         45162,
         382322,
         183011,
         14011,
         16234,
         15359
      ],
      "backdrop_path": "/rOWMgSlj69fUjYjMVfkvL62mfz7.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Gimly",
         "id": "57b069489251413b010045d6",
         "content": "Better than this year's other Damien Wayne film, _Bad Blood_, but certainly not what I'd call \"good\" either. The violence is initially somewhat cathartic, in a _Dragonball Z_ kind of way, but that wears thin quickly and the incredibly unusual decision making takes hold. There are a handful of concepts explored in Justice League VS Teen Titans that felt like they could have been quite interesting if they were dealt with in a longer, more personal format, like a television show. Instead because we're pressed for time in this animated feature, we have to montage through all that in some truly bizarre ways.\r\n\r\nThe \"versing\" is also, unsurprisingly, pretty bull.",
         "url": "https://www.themoviedb.org/review/57b069489251413b010045d6"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Trigon (voice)",
               "gender": 2,
               "credit_id": "56aa0d659251416fd80000f5",
               "name": "Jon Bernthal",
               "profile_path": "/w3epqN0BlV4TiUV9255d5tSCIRV.jpg",
               "id": 19498,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Bruce Wayne / Batman (voice)",
               "gender": 2,
               "credit_id": "56aa0d8b9251416f8600010c",
               "name": "Jason O'Mara",
               "profile_path": "/7OTkkGVB0A6b3RlXvtiuo5YHWBJ.jpg",
               "id": 183812,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Damian Wayne / Robin (voice)",
               "gender": 2,
               "credit_id": "56aa0ccfc3a36872e9005c97",
               "name": "Stuart Allan",
               "profile_path": "/lNQdGVXZOj46LKZIcli5tJ83PvM.jpg",
               "id": 1164238,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Victor Stone / Cyborg (voice)",
               "gender": 2,
               "credit_id": "56aa0ceac3a36872e9005ca8",
               "name": "Shemar Moore",
               "profile_path": "/yHhjKqWqfyJbMMIhfLRDfigwm7L.jpg",
               "id": 50266,
               "order": 3
            },
            {
               "cast_id": 1,
               "character": "Wonder Woman (voice)",
               "gender": 1,
               "credit_id": "56a5a6f5c3a368389000a2c4",
               "name": "Rosario Dawson",
               "profile_path": "/dEK1rMmSJAPGdc2t1XWdbqBmvEq.jpg",
               "id": 5916,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Rachel Roth / Raven (voice)",
               "gender": 1,
               "credit_id": "56aa0d039251410e2d0058d3",
               "name": "Taissa Farmiga",
               "profile_path": "/rV2jV0sXOgZ6YQQM4T0Ed19MIT0.jpg",
               "id": 527313,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Jaime Reyes / Blue Beetle (voice)",
               "gender": 2,
               "credit_id": "56aa0d1dc3a36872e1005fdb",
               "name": "Jake T. Austin",
               "profile_path": "/bxcgwmrxGOibH2uIhmXlq3cu7NH.jpg",
               "id": 60255,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Garfield Logan / Beast Boy (voice)",
               "gender": 0,
               "credit_id": "56aa0d3bc3a36872d30062bf",
               "name": "Brandon Soo Hoo",
               "profile_path": "/yZse73nxYlk9Ypr5r43PUkpuZGB.jpg",
               "id": 1115122,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Koriand'r / Starfire (voice)",
               "gender": 0,
               "credit_id": "56aa0d50c3a36872cb006019",
               "name": "Kari Wahlgren",
               "profile_path": "/9QEOdp5yM9B8IMAopBeX3Cz09tO.jpg",
               "id": 116315,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Clark Kent / Superman (voice)",
               "gender": 2,
               "credit_id": "56aa0d77925141547500455d",
               "name": "Jerry O'Connell",
               "profile_path": "/hkEBKk79L0ptmxGTng0v6X7Lzws.jpg",
               "id": 3035,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Barry Allen / Flash (voice)",
               "gender": 2,
               "credit_id": "56aa0da3925141547500457f",
               "name": "Christopher Gorham",
               "profile_path": "/1fAcWAtGeTluNjbGVGxaShQD090.jpg",
               "id": 53761,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Dick Grayson / Nightwing (voice)",
               "gender": 2,
               "credit_id": "56aa0db6c3a36872cb00605c",
               "name": "Sean Maher",
               "profile_path": "/yDuSytEe11oDoLvsPd26BjeRLl1.jpg",
               "id": 55148,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "56a5a6cc9251410c08006ef4",
               "name": "Sam Liu",
               "profile_path": "/6YLCBYqgILXZNpHql8xxadZldXq.jpg",
               "id": 90367,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56f30c1f9251411a85000163",
               "name": "Alan Burnett",
               "profile_path": null,
               "id": 34936,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56f30c329251411a8d00016c",
               "name": "Bryan Q. Miller",
               "profile_path": null,
               "id": 1237445,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56f30c4cc3a3682fe000016a",
               "name": "James Tucker",
               "profile_path": null,
               "id": 1225820,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "58d59facc3a368124f030e43",
               "name": "Christopher D. Lozinski",
               "profile_path": null,
               "id": 1033619,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Animation",
            "id": 16
         }
      ],
      "popularity": 8.829166,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 379291,
      "vote_count": 237,
      "budget": 0,
      "overview": "Robin is sent by Batman to work with the Teen Titans after his volatile behavior botches up a Justice League mission. The Titans must then step up to face Trigon after he possesses the League and threatens to conquer the world.",
      "similar": [
         155,
         272,
         1924,
         1452,
         364,
         141052,
         8536,
         9531,
         13640,
         415,
         24428,
         414,
         268,
         49521,
         49026,
         99861,
         299534,
         209112,
         297762,
         30061
      ],
      "original_title": "Justice League vs. Teen Titans",
      "runtime": 78,
      "poster_path": "/dQMO9EJxDBkdRzWUEWkbYzrMDC0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/2Tc1P3Ac8M479naPp1kYT3izLS5.png",
            "name": "DC Comics",
            "id": 429,
            "origin_country": "US"
         },
         {
            "logo_path": "/2Tc1P3Ac8M479naPp1kYT3izLS5.png",
            "name": "DC Entertainment",
            "id": 9993,
            "origin_country": "US"
         },
         {
            "logo_path": "/l5zW8jjmQOCx2dFmvnmbYmqoBmL.png",
            "name": "Warner Bros. Animation",
            "id": 2785,
            "origin_country": "US"
         }
      ],
      "release_date": "2016-03-29",
      "vote_average": 6.9,
      "belongs_to_collection": {
         "backdrop_path": "/zY2h6jGkAxBxkVYrIndqf9oz5iE.jpg",
         "name": "Teen Titans Collection",
         "id": 466894,
         "poster_path": "/vty8HGeI36LaLPSXjXGeHpHxJKD.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sam Liu"],
      "runtime": 78,
      "synopsis": null,
      "writers": [
         "Bryan Q. Miller",
         "Alan Burnett"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt5091548/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMDFiYTBkOGQtZjAwNi00OGMwLTg0YzQtNjI5YmFlZjY3ZWM3XkEyXkFqcGdeQXVyNTA0OTU0OTQ@._V1_UY268_CR22,0,182,268_AL_.jpg",
      "actors": [
         "Rosario Dawson",
         "Christopher Gorham",
         "Shemar Moore"
      ],
      "reviews": [
         "I haven't read a Teen Titans comic in more than 20 years, so therefore, I didn't know its modern version under The New 52 continuity. This allowed me to start watching Justice League vs. Teen Titans without particular expectations or particular affection for the characters; unfortunately, I have to say it didn't leave me very satisfied. On the one hand, it properly introduces us to the particular abilities and dynamics of the characters; but on the other hand, I didn't find the story very interesting due to its weak mythology and excessive use of weak mysticism as a replacement of logic and narrative consistency. I think this needs a personal explanation: I generally can't swallow the \"cosmic\" elements in the superheroes comics, and even less, the stories with magic and demons (with the exceptions of Doctor Strange in Marvel and the Vertigo Universe in DC). I almost always find them confusing and with an excessive tendency to \"deus ex-machina\", in which things aren't solved with ingenuity, strength or strategy, but arbitrary spells and forced invocations... something which exactly describes the second half of Justice League vs. Teen Titans. Too much hocus-pocus and very little creative effort. On the positive sides, the voice actors make a solid work in their roles, highlighting Taissa Farmiga, Brandon Soo Hoo and Jake T. Austin; on the other side of the coin, the quality of the animation is quite mediocre. In conclusion, I think Justice League vs. Teen Titans is the DC animated film I have liked the least, but I have to admit it didn't bore me, so I can give it a slight recommendation to DC followers who know where they are getting into. For the rest of the audience, it will be an obtuse and frustrating experience because the screenplay doesn't offer detailed explanations or concrete \"origins\" (well, maybe one). But, well... not all the films belonging to the DC Animated Universe can be as interesting and satisfactory as Justice League: The New Frontier or Batman: Year One.",
         "Warner Home Video and DC Comics unleash the fury in their latest direct-to-DVD offering \"Justice League vs. Teen Titans.\" The all-new DC Universe Original Movie is brought to us by Director Sam Liu (\"Batman: Year One,\" \"All-Star Superman\") from a script by Bryan Q. Miller (\"The Flash,\" \"Arrow\") and Alan Burnett (\"Batman: The Animated Series,\" \"Batman Beyond\"). It is based on an original idea instead of a comic book arc like most of the past animated films. Frustrated and disillusioned about his work alongside the Justice League, Robin is forced into a new position with a younger super team, the Teen Titans. Readily welcomed aboard, he is immediately intrigued by the mysterious Raven and the unnatural force that looms over them - her father Trigon - a deceptive being powerful enough to destroy Metropolis by pitting the mighty Justice League against the Teen Titans. Loyalties are on the line and lives hang in the balance in \"Justice League vs. Teen Titans.\" \"Justice League vs. Teen Titans\" reminded me of what would happen if an old Satanic Panic flick like \"Rosemary's Baby,\" \"The Exorcist,\" or \"The Masque of the Red Death\" was blended together with a super hero movie. You have the mother who is deceived into giving herself over to a cult and spawning the daughter of Satan (or Trigon as they call him in the DC Universe). The offspring of the Unholy One fights her destiny and chooses to use her powers for good. The only difference between this and a classic horror film starring Vincent Price or Linda Blair is the inclusion of Robin the Boy Wonder, Starfire, Cyborg, Beast Boy, Blue Beetle, Batman, Superman, and Wonder Woman. Writers Bryan Q. Miller and Alan Burnett are no strangers to the DC world of super heroes. Burnett has helped create some of the most adored animated television shows and movies from the past three decades, while Miller has brought to life several different comic book characters through live-action series starting with \"Smallville.\" Director Sam Liu knows how to pull it all together and give it a breakneck speed while not skimping on the story. I applaud the filmmakers for trying to reach out to a teen crowd with their use of rock and dance pop numbers as the Titans try to blow off some adolescent steam at a carnival. They also do a decent job of creating some convincing chemistry between Robin and Raven, who feel like they're the outcasts of the supergroup. At the same time, older comic fans might feel as if they're watching an episode of \"DeGrassi: The Next Generation\" or \"The O.C.\" \"Justice League vs. Teen Titans\" is rated PG-13 for fantasy action violence and some suggestive images. Several demons get their heads chopped off and regrow them. Our heroes also go to Hell and battle some very disturbing creatures that get hacked up. It's definitely not for younger audiences. Just be warned, parents. These are not the happy-go-lucky super heroes you know from \"Teen Titans GO!\" The group of youthful crimefighters we see here tend to use some profanity and are dark, angry, and grim. Their leader, Starfire, enjoys wearing extremely short skirts and shirts fashioned with what I call a boob window. I think she might use it as a distraction for her enemies while she battles with them. There's plenty of fun for older teens and adults to be had, but intense and disturbing scenes and other adult content keep this from being something the whole family can watch. With a great voice cast including Rosario Dawson as Wonder Woman, Jerry O'Connell as Superman, Jason O'Mara as Batman, and Jon Bernthal as Trigon, \"Justice League vs. Teen Titans\" is another action-packed thrill ride from DC Comics and Warner Home Video. Although the frantic pacing and short run-times of these animated movies sometimes feel a bit light on story buildup, they accomplish what they set out to. They're a comic book put in motion before our very eyes.",
         "Another movie in continuity with the other recent ones playing in the same universe! Keep an open mind and you will feel the time watching it is well spent. Let's start with technicalities! The animation quality and design of the movie is good to very good if you keep in mind that it is a direct-to-video production - there have certainly been much worse ones around. The visual style is a continuation of the other movies that were released in the last year or two, so if you've gotten used to that, you'll feel right at home. Frederik Wiedmann did a nice job with the soundtrack, and his choice of instruments stands out immediately once the movie gets to the first mystic scenes - I think it is a good match. The pacing is good. There is not really any part that feels too slow or drawn out too much, and enough action takes place throughout the movie to keep up the entertainment. A few scenes could benefit from a deeper exploration, but then again that would break the available time-budget. The story is entertaining, but a bit predictable. Not as predictable as the stories of some of the other DC movies, but there is still room for more complexity. It is targeted at a broader audience, most likely. The movie is somewhat family friendly, teens should feel right at home. I'm not really a fan of Damian in a leading role, but in a team the character plays out much better. Sort of like how Batman integrates nicely with the Justice League - both characters can add a bit of spice to the mix once they're able to clearly contrast with other characters. In my opinion this is the first movie in this line that manages to do this, so that is good to see. More of that please. Damian needs to be put on a leash for good! I could not relate a whole lot to the previous versions of the Teen Titans, so I am happy to see a version of them here that feels a bit more mature. Less goofy is good! There are some parallels between a few appearances in here and in Young Justice - some designs are related without a doubt, some characters share close or relatively close resemblances, but they are different personalities (and have different voice-actors). Wasn't sure how to take this at first, but they're likable. Would take another movie to get to know some of them a bit better, so here's hope we get that chance eventually. Overall it is an enjoyable movie. Anyone who liked the recent DC movies should give this one a watch.",
         "I have to wonder if anyone reviewing the movie has actually ever read a single comic title featuring / starring Damian Wayne? Because if you had you'd know in the comics he is portrayed as a genius level combat expert and genuine genius period. His physical attributes aside he is basically Batman on crack able to think ahead and figure out the weakness of those stronger than him. So all the incessant hate over a \" bratty kid \" that couldn't possibly do blah blah is annoying when it's actually pretty much how the comics are in fact written. That being said I agree with some of the issues some have mentioned, mostly Raven and her being under utilized and her God awful voice acting and her seemingly weakness. I'm only hoping it gives way to her understanding her true strength and in other animated adaptations she'll be more powerful. Overall I enjoyed the movie tho , it was humorous when it needed to be and action filled when it should be too. The music choices were iffy but none too distracting.",
         "I don't get it? You make an entire movie about Trigon, the father of Raven, and yet miraculously manage to avoid giving Raven any screen- time and instead showcasing the same boy wonder that everybody hates. Once again we have another movie where all of the seasoned professionals get the crap beat out of them while some bratty 12 year old child 'saves' them all. I can't even count how many times Raven ends up sat around being helpless while Robin is waltzing around saving the day, as if she's not the most powerful Titan, yet all she does is cry on the floor and get exhausted every time she exerts the tiniest bit of effort? Don't even get me started on the voice acting. Starfire? Averagely okay. Raven's voice acting? Diabolical and devoid of any inflection or tone. If you wanna watch 40 minutes of some 12 year old pest playing dance mats, which then progresses into Raven being helpless for the rest of the movie, then this is the movie for you.",
         "This movie is below average and as a dedicated Dc fan, i'm insulted. I'm honestly worried that the one thing that Dc has over Marvel, which is their animated movies, is getting more and more uninteresting as it goes. There are little good things in this movie that makes it worth watching, if you can ignore all the flaws that it has. I just feel like this movie had potential but ultimately failed due its many mistakes. The story tries its best to mix the Justice League and Teen Titans together but it just ends up failing in the end. The Teen Titans are there but they're pushed to the side with Raven and Damien being heavily focused on. Trigon is suppose to be the main villain in the story but they don't really make him seem that unique since all he does is attack the city (which every villain has done before in the Justice League movies) and kills an entire race of people, with that being one of the only truly bad thing that he's done. The Justice League feels like they're crammed in there and their appearances seem somewhat forced. It seems that DC doesn't have enough courage in a Teen Titans solo movie, so they need to put in the Justice League in order to feel safe. That wouldn't have been a problem if they had rebooted the Teen Titans franchise properly instead of making the awful Teen Titans Go. Just like Teen Titans Go, there's also a lot of scenes in the movie that doesn't make any sense or are just plain dumb. There's a scene where Beast Boy uncontrollably transforms into new forms of animals because\u0085...he's in hell? It was so stupid and so unnecessary and just seemed like it was there to make beast boy look cool. Also, why didn't Raven take the Justice League into hell? They could've gotten everything done way more faster than the Titans and fix the problem before Trigon could even reach the city. Speaking of Trigon attacking the city, there was only Superman, Wonderwoman, and the Flash there to help. It makes you think \"hmmm hey, wheres Green Lantern, Shazam, and Aquaman?\". You would think that they would come out and help defend the city but no, they don't make an appearance whatsoever. They don't even give a reasonable explanation why they aren't there, they're just like \"ha slackers\" and that's it. I don't care if it's because of budget cuts, if they aren't there to protect the city then don't write in Trigon attacking the city! Now that i got that out of my system, onto the characters themselves. I don't like that Damien is the \"go to\" main protagonist when the movie isn't focusing on the League. This version is very close to the comics so he has to be brat but i just can't see myself rooting for someone like that. He is making more of a change though so i do like that. Raven is used more like a plot device rather than a actual character and she's extremely weak in the movie but they do a good job setting up her back story though so i'll give them that. Starfire is just there so dudes can stare at her body, and Beast Boy and Blue Beetle are just there for fan service, offering nothing but the \"Power of Friendship\" to the story. I also find it extremely insulting that DC has the nerve to feature Nightwing as part of the team when he wasn't even in the movie for more than 1 minute! The animation in the movie is the only good thing about it but I saw a few scenes that shows the animators taking the easy way out of making the scenes rather than putting in time and making it feel more organic and dynamic. The voice acting is good here and there but it's overall pretty lacking. I do wish that they could have gotten the original cast to voice their respective characters but i can respect that if was due to budget cuts or just them wanting to distance themselves from that universe. The title is also very misleading. I was expecting an epic battle where the possessed Justice League fight the underdog Teen Titans in a last ditch effort to save the world. That would've been cool but you know what we get? We get Wonderwoman, Cyborg, and Flash beating the tar out of the Titans for like 3 minutes. It was so anti- climatic that i was dying with laughter because that was suppose be the one moment that everyone was waiting for and DC just wasted it. Something that they should have done was, take the Justice League out of this movie, make this simply a Teen Titans movie, and make the epic final battle be between the Titans and Trigon. I was just looking forward for this movie and after seeing it, i was a bit disappointed. This is an example of DC just making animated movies for a quick cash grab instead of adding quality and depth to their stories. Dc, please get better writers to make your animated movies and give the crew more time to work on things, i'd rather wait for a movie with a good story rather than immediately getting a movie that ends up very disappointing, i'm looking at you Throne of Atlantis. The movie has great animation but it's overshadowed with terrible voice acting, forced characters, cliché lines and acting, and a messy story that could've been great . If you are a casual comic fan who likes animated movies then this is the movie for you. If you're a die-hard DC comics fan who likes a good story then i can't recommend this for you. Overall, very disappointing and really hope that they do better the next time.",
         "This is one of the worst DC animated movie I have ever seen. I am usually hooked from the beginning to the end. And with a title like \"Justice League vs. Teen Titans\" I was expecting something at least somewhat entertaining to watch. This movie was bland and dull from beginning to end. Everything about this animated movie is so darn formulaic and boring. If you have seen a episode of a mediocre Saturday morning cartoon show this would be it. Except this is over an hour long. I wouldn't be so harsh on it if it was 3 episodes of a Saturday morning cartoon show. But the fact that it's a DC animated movie makes it disappointing. Sure, some they can use the excuse of cartoons being made for kids, but even 10 year olds will find this to be extremely forgetful. I am not sure if it's made for 10 year olds because it has some slightly sexual innuendo in it. It tries to be this edgy and hip movie for teenagers, kind of like what teen romance movie with sci- fi or supernatural elements but fails like most of those. It started out like it would be a good movie because the start was alright. And I did like the interactions and build up of the Teen Titans with Damian but it started to really go downhill from there. Overall, when it comes to the standards of DC animated movies this one falls flat. 3.5/10",
         "I had been really looking forward to this title, as I was a fan of both \"Justice League\" and \"Young Justice\". Unfortunately, this really falls flat. It was certainly not what I was expecting. For starters, it was disappointing to see the JL operating with an incomplete roster, with Green Lantern and Aquaman missing. The opening scene, where mention is made that they're fighting The Legion of Doom, piqued my interest briefly. This was far from entertaining though as there were only 4 villains involved, without a Black Manta, Giganta or Sinestro anywhere to be seen. My interest again returned when the image of Titans Tower appeared. Sadly, once again, a mere cast of 4 uninteresting and somewhat flat Titans appeared, with irritating character voices and 2 dimensional personalities. So in short, the characterization was really poor in this movie. As an adult, I found some scenes embarrassing and cringe worthy to watch, and chose to Fast Forward the entire carnival scene. Maybe this movie was made to appeal to children, but I have felt more comfortable watching \"The Challenge of the Superfriends\". By the time the final battle happened, I was already checking my Facebook messages on my iPhone, and wondering what housework needed to be done. I really wanted this movie to be better, but truthfully, this was a really poor effort. When you hear that the two greatest DC superhero teams are battling each other, you expect fireworks. Unfortunately this provided less sparks than a wet Roman Candle.",
         "People should just relax and enjoy the stories, I read some of the reviews and they are just so mean... it is a good story, and the introduction of some good characters, we need this, we need to expand our DCU, The story reminds me a lot the good old times when the Teen Titans were taken seriously in the old cartoons, and back when Young Justice was a great success, I guess the writers need to undust the Teen Titans muscles and get down to business, create more and better stories. I don't like the New 52 a lot, but I can watch this... my complaint, No Green Lantern, no Kid Flash and too little Beast boy-Cyborg interaction!",
         "As sad as I am to say this, this was not as great of a movie as I initially thought it was going to be. And apparently, I'm not alone. I have no extra beefs with Damian as the main Robin, I mean he isn't my favorite but he isn't my least favorite either. After years of experience have telling me that everyone hates my favorite characters, I've decided not to complain. So as long as my least favorites aren't getting extra attention. That being said, Damian adds one major thing to this team, confidence. He has the balls to exert himself when no one else wants him to and sometimes that's what is needed. And his \"OP feats\" in this movie? He wrecks the Batwing to defeat a villain, gets his butt handed to him by Blue Beetle, and gets serious burns which have to be healed, he trips demoniacally controlled Flash (who was probably underestimating him anyway, we all know Flash gets cocky), sucker-punches a demoniacally controlled Superman with the one thing known to beat him... Out of his four major feats in this movie, two do more harm than good, one doesn't affect the plot and the last literally anyone could have done. All these actions serve to prove that he isn't a normal kid but a kid nonetheless. He has resources and guts but he has childish recklessness and hotheadedness. But he certainly isn't League caliber. At least this time he isn't pulling blades out of his wrists and then going on to beating Deathstroke (one of DC's strongest mercenaries in case you forgot) by himself. I have 4 other major beefs with this movie: 1) Raven willingly goes to her brothers' avatars when she is called. A) she is outnumbered and she knows it. B) What reason does she have to converse with them other than to give the audience needed info? I feel they should have came after her, creating a scene and a panic. Feels more \"demonic\" and in that situation they can info dump all they like but in a way where everyone can hear, not just her. 2) I love Blue Beetle but he is the only one who isn't given a reason for why he is on the team. Some info dumping here would have actually been nice. Especially on how he got the Scarab, even if the only thing it serves to do is to explain to Damian his struggles. Without knowing his back story, someone who doesn't anything about the character has doesn't really have anything to distinguish Jaime from a rip off Iron Man which really made me upset. 3) Beast Boy's unexplained new forms in hell. Oh where do I start. This could have been an amazing moment to tell new viewers where Beast Boy's forms come from. The least they could have done is had a Titan ask where the new form came from. And have Beast Boy literally say anything in response. Oh and I'm complaining that he sprouts wings and then ends up in a sort of werewolf form but oh well. 4) I really wish we could have seen how things came together after they defeated Trigon. Batman waking up, Nightwing checking in and freaking out, Raven placing the jewel in her head (How does it stay there again?). A quick silent montage with some score music in the background showing all of this would have been nice. I would have traded the Terra post-credits scene for that closure. The one thing that the movie did right (in my opinion) was it kept my attention.The pacing was good, the teenage parts reminded me as a teen, wanting to show off, impress the girl and developing crushes that would eventually become doomed relationships based on nothing more than shared experience. Despite the things the movie did wrong, it found ways to entertain throughout the bad. And that's the real point of a movie, to entertain. Even if it does so in a cliché manner. Also, my response to those complaining above: Seriously, of all the things to complain about you had to choose the two busiest members of the Justice League NOT BEING IN THE MOVIE to complain about? The movie could have said so, but in it's own continuum it hasn't shown them all to reliably shown up when asked. I would like to have it mentioned in a future movie when those three remark about not being there for that but it's really not a big deal. Raven is fourteen. She isn't at the height of her power and from what I gathered it doesn't seem like she's gotten to overuse her powers like she did in this movie. Give her and the writers a break on that. And yes, the forced implied love-interest development between Robin and Raven wasn't needed. Do teens often develop crushes on people who can even slightly understand them after years of isolation? Yes, but even so I agree that it wasn't needed. But it's Hollywood and sadly it doesn't surprise me anymore. There have been worse movies and being perfectly honest, if we look back at any superhero movie we can sin it to death after it's done. But that doesn't accomplish anything. Hopefully DC uses this as a stepping stone to make a better made movie in the future.",
         "So this 'movie' wasn't a bad idea on paper, but it's the mediocre-fanfiction level writing that holds it back. I enjoyed a lot of the action sequences and seeing some classic characters in animated form (this animation style reminds me of Young Justice, which is a plus). But let's just get to the elephant in the room... Damian Wayne. Having a kid save the day in an action film this scale is not a good idea, especially when he's not supposed to be the main focus. Son of Batman was acceptable because it was his story and not many of the other villains or heroes were involved, but when Superman, Wonderwoman, the Flash and the Teen Titans face up against a villain like Trigon? I thought this was a movie about teamwork! Instead, Damian is portrayed as a Gary Sue who solves all the problems without even breaking a sweat (inability to be a team player is not a flaw in this case because it doesn't even cause him any problems). This is amateur writing... Yet, the action and animation are pretty solid in this movie. If you'd like to see some familiar characters (such as those from the original Teen Titans cartoon), just give this movie a casual shot and don't expect too much.",
         "The title should not be \"Justice league vs teen titans\" There is maybe 3 minutes of them fighting and the rest of the movie is about the new robin and raven. \"Raven vs her father\" would be more suitable. 1.There is only 3 members of the justice league there, they never mention where the other three are. They just say they are \"lazy\", Really? Sounds to me like lazy writing. The whole town is being destroyed and the world is potentially ending and they are just going to sit on their couch and watch? 2. Raven is 14! What?! Is that just so she can have a romantic relationship with robin? Why are they even having a romantic relationship? 3. This movie obviously states that Nightwing and Starfire use to be on the same team; teen titans. Wouldn't they have already fought ravens father? 4. Raven is the weakest character...really? She has the power to seal off her father; who is one of the most powerful creatures to be created, but she can't fight off three of his minions? OK. 5. Starfires transformation was laughable! This is NOT an anime! This is suppose to be based off a comic book. Her butt was the most showed shot during her transformation too. This movie is so jumpy, what happened to batman after he almost killed himself to stop being possessed? What purpose did he have? robin said he did it to give them an advantage. What advantage? Did he have information to tell them? Where was Nightwing in all of this? Why did beast boy transform suddenly? Don't waste your time. If you are hoping for some teen titans from the old show, this contains NONE of it! It is just a title to get people to buy it.",
         "For those who grew up watching the 2003 and got really irritated with Cartoonnetwork's attempt at reboot (the \"Dredd\" that is GO, LOL) then this movie is one for you. Being the 6th movie in the animated DC movie series (unofficially) this movie does a great job of capturing the personalities of the Teen Titian's that we, the old fans, know and love; as well as seeing Superman, once again, fall down (because who doesn't like watching the \"big man\" take a good hit). This movie additionally gives a bit more depth into Raven's back-story, being that the movie is centered around her back-story, and may answer few more questions to those people who did not have the luxury of reading comics about her. All in all, I found the movie to be fantastic!",
         "DC has released a great new film to show that the Teen Titans are here to stay. The story was great to follow and honestly fun to watch it all unfold. In my opinion the Teen Titans were the more powerful heroes in this movie, not in strength but in personality's. Damian was a great addition to the Titans as he brought tons of banter and some funny moments. Although the title says Justice League VS Teen Titans it should just be Teen Titans. In my opinion the Justice League were the side characters which is a good thing. We have way to many Justice League movies and adding the Teen Titans in this universe was refreshing. It felt nostalgic when I watched this movie because it brought back memories of the original Teen Titans show, which is a good thing. I grew up watching Teen Titans and it was great to see them back in their full glory. Despite some people not liking this just because the fight between the Teen Titans and Justice League only lasts a couple of minutes; and yes it was disappointing but it didn't ruin my experience. I'm not sure what to think of this Robin and Raven romantic interest sub-plot but once again didn't ruin the movie for me. This movie isn't for everyone, I think you've got to have an open mind when you watch this. But its now probably my new favourite DC animated film right next to Under The Red Hood. It's definitely worth a watch because it shows great story, characters and action. I hope we do get more Teen Titans in the future and I think that DC are stepping in the right direction. Either way its just good to finally say \"Teen Titans GO!\".",
         "I've been a huge fan of the Teen Titans since I was a young girl and when I heard this was coming up, I was jumping with joy. I really missed it and I got really excited that this was happening. Taissa Farmiga has been one of my favourite actress from American Horror Story and I've missed her performance since Coven. Jon Bernthal, I was excited to see him play as Trigon. He's an amazing actors. I also enjoyed the other characters. The whole movie seems fresh, new, unique. There were a few things that left me a bit confused but overall, I enjoyed the movie. It was enjoyable. I don't see how some people don't seem to like the idea of the movie being made in a different art style and the new actors. I became a bit upset how people start criticizing when the movie was already made. We all asked for a Teen Titans movie, we got one. But we can't all expect for things to go our way every single moment a director is making a film. Not everything is going to be handed over on a silver or golden platter. And we all expect for the same actors from the old TV shows to appear on the screen when we want them to and that's not cool. It's obvious that the original actors from the old TV show are not going to last forever and it was obvious they wanted to give opportunities to other actors to play the roles of the Teen Titans. And they were young adult actors which I found to be the right choice for them to find new talent. So, I do not see how it's fair that we start attacking something we've been asking for a long time. I for one enjoyed the film and I cannot wait for them to make more.",
         "I'll start by saying I've pretty much enjoyed all the DC animated movies, and this is no exception. For the most part, I did enjoy this, but I've got some issues with it. I'll go ahead and get the positives out of the way, not to say there's more bad than good, but there's really less to say about the good. The voice acting is, for the most part, pretty solid. These aren't the Teen Titans of the cartoon, just like this isn't the Justice League from the cartoon of the same era. Starfire was pretty spot-on, Beast Boy was actually pretty great, and Damien's child voice actor seems to have finally got the hang of the role. The plot is about as all-over-the-place as Batman: Bad Blood, but that's what happens when you condense a whole story arc into a movie that's less than 90 minutes, I don't mind it. Now for the bad. Raven's voice actress comes across as though she's just reading her lines so she can get it over with and go home. There's a scene in the middle of the movie that takes place in an amusement park, and the entire scene is bombarded with this horrible pop punk song, followed by a pseudo-J-pop... thing. This scene dragged on for far too long, and most of it could be cut from the film and the plot wouldn't be affected. Another thing is the misleading title, which DC seems to be fond of with these VS movies. While there is a scene where the Titans fight the Justice League, it's fairly brief, and only happens because the JL are possessed by Trigon. And that brings me to my next issue; Trigon, he spends the whole movie trying to manipulate Raven into getting him to Earth, and when he gets there he just kinda... stomps around for a while, breathes fire on some buildings. In the Teen Titans cartoon we got to see just how much of a threat Trigon could be, though it was built up over a whole season, when he actually showed up he was shown as something to be feared. Here, we see the literal devil reduced to a villain of the week. Would I recommend this? Yes, I'd recommend a rental, especially to the Young Justice crowd. Older fans of the DCAU (Justice League, Batman The Animated Series, etc.) and the original Teen Titns might be let down by this one, but it's still worth a watch.",
         "Reviewed by: Dare Devil Kid (DDK) Rating: 3.5/5 stars The DC animated universe introduces us to some engrossing new characters and plot elements with \"Justice League vs. Teen Titans\", the recent, exciting adventure in their entertaining DTH-video series. Fusing traditional Justice League superheroes like Batman, Superman, Wonder Woman, Flash and Cyborg against a bunch of upstart adolescent crime-fighters, and pitting them against each other could easily have turned out to be a convoluted muddle, a la \"Batman v Superman: Dawn of Justice\", but some fairly solid writing by Bryan Q. Miller and Alan Burnett, and more than a few innovative and pulsating action sequences envisaged by Director Sam Liu (Batman: Year One, Justice League: Gods and Monsters) make this a breezy ride that's guaranteed to whet your appetite for some plain, simple, no-holds- barred fun. If you still desire to see DC superheroes battling each other, this is a far more rewarding investment than \"Dawn of Justice\". As is the norm with these movies, \"Justice League vs. Teen Titans\" is short and snappy, clocking in at about 75 minutes, which means its themes are mostly presented on the surface, with little time for any deeper exploration. Nevertheless, this latest offering from DC's popular and highly entertaining animated universe – the only avenue where they still score over Marvel – has an enjoyable comic-book appeal, and it sets up the Teen Titans nicely for their own series of screen escapades.",
         "First Batman: Bad Blood. Then the should be flop that is Batman V Superman. And now this.. Seriously, is DC trying to turn me into a Marvel fan??? THE NEW 52 SUCKS! Fans told you it sucks, the sales of your comics told you it sucks, the ranking of your newer movies tells you it sucks. When are the clowns running the DCU finally going to do away with the new 52? Anyway, I guess I should review this piece of garbage and waste of time. Why is it called Justice League vs the Teen titans when that doesn't even happen in the movie? The Titans fight 3 members of the possessed Justice League with the help of another member of the Justice League if you do not count Batman who took himself out as a way to help the Titans. I know the answer to that question, because DC wants to sell crap and doesn't care about the fans. The plot is boring as hell and the main villain is dumb enough to not destroy the only thing in the universe that can stop him when he literally had it in his stupid little dimension. Plus Raven was dumb enough not to put protection on the Justice League members, not that it matters because she is the strongest person in the universe for whatever stupid reason. Oh, the action sucks. Just don't watch. I wish I didn't.",
         "all I can say is that to you nay sayers to this movie is well you can pound sand it's a movie about superheroes it's a cartoon but some moron has to pick it apart because he thinks he's an expert I am so tired of reading these reviews from people who think they know everything about movies witch they don'they say this one sucks listen to me don't watch it I bet they( live in there mom's basement) I watched the movie it was not perfect but it did not have to be once again it's a cartoon and once again some moron who thinks he is a movie critic witch he is not by a long shot who knows nothing about movies because he never watches them because he just looks them up on you-tube and then says i'm an expert because I say so well you suck this movie was very good and those who like these kind of movies should watch it",
         "The animated movie in question was adequately able to tie both of the respective superhero teams into one movie, although I found it unfortunate that the teams were modified so incredibly. Starfire and Nightwing appeared several years older than Beast Boy and Raven, and Cyborg wasn't even initially in with the Titans at all. Replacing Dick Grayson with Damien seemed necessary for the integration of the teams, and in the end it was a good call, but I feel that it focused too heavily on Damien regardless. In my opinion, the original characters from the teen titans should have gotten more of the spotlight, especially Nightwing and Beast Boy, who were unceremoniously pushed to the side. Even Raven, one of the main characters, was overshadowed by the new Robin. The story should have focused more on Ravens struggle, and not Damien's. Although the entire movie was practically about the rise of Trigon, he didn't get to do much destruction. I feel like the ultimate fight scene with him should have been a little more grandiose. What makes this movie so good, in my opinion, is that DC finally managed to get the Teen Titans into it. While most of the animated movies focus on Superman and Batman, it was nice to see a change.",
         "I want to see more Teen Titans action but not this cast .I don't know if I am so attached to Teen Titans or Teen Titans Go! but I can't stop feeling that casts of those series did a better job than these guys and Justice League cast too.Sometimes in the movie I felt that there were some awkward pauses and they were not played well. I like the story and effects were really good considering that this is Direct-To-Home release.The fight scenes were good too.But,I thought there were too many fight scenes and most of them were a flash. The movie was too serious and some jokes would have helped it.I felt there were some scenes in which they tried too hard to generate comedy but failed to do that. At the end of the day it was a good movie and I would recommend a friend to watch it.",
         "It's been awhile since I bought or even viewed a DC animated feature. I was a huge fan of the Justice League cartoon about 10 years ago, and still hold everything else up to that standard of excellence since then. I am an uncle who babysits, so I watch a lot of cartoons. I've been a somewhat regular viewer of the Teen Titans Go show for several years now, and it always amuses me, often with laughter. It's a fast paced dose of silly and crazy and I don't think kids catch half the humor, but it's entertaining for a babysitting adult. It was somewhat jarring to see Starfire as this mature, sexy woman who is now the leader. But I like it. She is not as indestructible as the TV version, but she had some good moments in battle. I think the ensemble of Blue Beetle, Beast Boy, Raven, Starfire and eventually Robin made for a nice match up against Superman, Wonder Woman, Batman, Cyborg and Flash. Their eventual clash was an interesting and satisfying display for fanboy appetites. The only somewhat disappointing display was the first fight scene, where Wonder Woman is, of course, matched up with Cheetah. Seriously, Cheetah? DC needs to make up their minds about the Amazon princess. Is WW on par with Superman, as she was portrayed in the Justice League cartoon series (Justice League Paradise Lost Part 1)? Or is she barely able to subdue a snarling acrobat like Cheetah? I DO like that they gave her back her ability to fly, something that they denied her in the Dawn of Justice debut. And it makes for an interesting dynamic to reintroduce the notion of Diana and Kal/Clark having a relationship, where in most other JL iterations there are romantic tensions between Diana and Bruce. I think this movie as a whole worked well because the story took its time to go broad and deep, revealing character backstory, character motivations, and character flaws -- something Batman vs Superman Dawn of Justice failed miserably at. Speaking of which, in comparison to that hot mess, this cartoon feature shines brightly, because of its ability to successfully flesh out the characters and the plot. I like the tension between Robin and Batman. It's palpable. The big- brotherly affection from Cyborg and big-sister warmth of Starfire are both welcome, without which the story might just ring a bit hollow and 2-dimensional. I know there are others who are severely disappointed and critical of this release, but I found it to be a rewarding 2 hours of entertainment and a beacon of hope that the creative minds in the DC engine can possibly turn the live-action franchise juggernaut around to something more gratifying on par with the Marvel body of work. That oeuvre is a great example and standard to reach for, and if it's too late to save the live action DC storytelling on the big screen, at least it's being done right in the animated universe. I give this video a B/B+.",
         "Personally I hate Nu52, but if the animated versions of it are anything to go by, they are literally trying to make up for the things that made 52 worse to begin with. While at the same time bringing in elements of the mainstream series. Much like how MCU is combining the elements of Mainstream and Ultimate Marvel in their movies. Is this movie perfect? No, but I'm rating it high anyway for the unique ideas. Raven and Damien's relationship is one of the best ideas because it gives fans of a Robin/Raven relationship what they want in a way that is convincing to those that don't understand it and it helped both Damien become more of a team player and less than a brat and at the same time help Raven open up more as a person. Speaking of which (no pun intended), while the Actress is no Tara Strong, she does have a unique way of portraying Raven that is both faithful to the original comics while at the same time using elements of the Animated series. Though she should cut down on the swearing. Just kidding.",
         "While one may argue this has nothing to do with the 2003-06 cartoon based on Teen Titans so old fans should keep quiet, the fact that DC is copying several elements from that specific incarnation including Raven, Starfire and Trigon's character designs, proves this movie is nothing but a quick cash grab which plays on your nostalgia. Another clear evidence of a cash grab is how they have brought in famous small-screen actors instead of using actual people with voice acting professions. This fools a lot of dumb viewers, the types that go: \"OMG! Taissa Farmiga from American Horror Story!\" \"Jon Bernthal, Shane from The Walking Dead! This is PERFECT!\" Bringing in small-screen actors for voice acting in no way determines the potential of a story. But lets come to the real deal, if you want to attract Titan fans, what do you have to offer? More than being about the Titans, this movie is the 4th in a row of movies based on bratty Damian Wayne, son of Batman. What baffles me is that after producing 3 movies based on this rather arrogant, self-centered and spoiled kid only a 12 year old brat can relate to, DC has yet to understand why people hate Damian Wayne so much and why the movies didn't do as good as others they made. Fact is: this movie timeline loves to give Damian random feats which is a straight up slap in the face of those who respect the heroes and villains Damian's unrealistically defeated or surpassed in these movies. This includes Deathstroke AKA the strongest mercenary in DC Universe who even Batman has had trouble defeating. Nightwing AKA the best Robin according to Batman himself, is also taken out like a weakling by this new kid and even Batman himself shows clear trouble in confronting him. For the record, these are made up feats for the movies exclusively as Damian is not capable of doing any of this. If you're having a hard time understanding why this is a problem, then imagine this scenario: 'A new hotheaded superhero suddenly shows up in DC and beats a couple of your favorite superheroes to a pulp like it was nothing. The more this new superhero will stick around, the more horrified you'll become realizing he isn't going anywhere and his arrogant attitude will never change. Soon, DC starts producing movies on this new guy, where he badmouths and bests any superhero you know and love. Now you understand where I'm coming from.' Which leads me to say, DC is forcing a character onto fans. A character who isn't even supposed to be OP. And all fans do is take it without daring to criticize the company. As a mature reader and follower of DC comics and animated movies, I have yet to find a reason on why I should like Damian Wayne. He has no redeeming qualities whatsoever and I am not like those simpletons who believe being Batman's son automatically makes you a great character. To be honest, Batman himself is a hypocrite for going easy on Damian for murdering people while lashing out on Jason for breaking less serious rules in the past. The uninspiring line-up is just another element in this huge cash grab as all characters are fan-favorites but when has adding fan-favorites without giving proper reason for them to be there has ever worked out before? Sam Raimi's Spider-Man 3 and Marc Webb's Amazing Spider-Man 2 tried that and we all know how they went.",
         "Expected a lot, got a lot more. The opening scene was nice. Might feel clichéd at first but then comes the important part. Nice to see a Teen Titans movie after so long. The character building up is a little bad but OK. Nice humor to balance the darkness and grittiness of the evil energies. I don't know why many people did not like it. The villain is strong and hard to stop. Very dark at some points, and fun at the other. Would recommend if you are free for few hours and want a little animated fun movie. However, the Justice League vs. Teen Titans part is very short. Hence, the title is wrong. Could have been better, but I am satisfied with it. Can't wait for future Justice League movies."
      ],
      "genres": [
         "Animation",
         "Action",
         "Comedy",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "DC Comics",
         "Warner Bros. Animation"
      ],
      "summaries": [
         "Robin is sent to work with the Teen Titans after his volatile behavior botches up a Justice League mission. The Titans must then step up to face Trigon after he possesses the League and threatens to conquer the world.",
         "Robin is sent to work with the Teen Titans after his volatile behavior botches up a Justice League mission. The Titans must then step up to face Trigon after he possesses the League and threatens to conquer the world."
      ],
      "budget": 0
   },
   "movielensId": 156000,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-03-29",
      "dvdReleaseDate": null,
      "directors": ["Sam Liu"],
      "runtime": 78,
      "movieId": 156000,
      "title": "Justice League vs. Teen Titans",
      "mpaa": "PG-13",
      "actors": [
         "Jon Bernthal",
         "Jason O'Mara",
         "Stuart Allan",
         "Shemar Moore",
         "Rosario Dawson",
         "Taissa Farmiga",
         "Jake T. Austin",
         "Brandon Soo Hoo",
         "Kari Wahlgren",
         "Jerry O'Connell",
         "Christopher Gorham",
         "Sean Maher"
      ],
      "imdbMovieId": "5091548",
      "originalTitle": "Justice League vs. Teen Titans",
      "genres": [
         "Action",
         "Animation"
      ],
      "youtubeTrailerIds": ["dFjg3oNxaJ4"],
      "plotSummary": "Robin is sent by Batman to work with the Teen Titans after his volatile behavior botches up a Justice League mission. The Titans must then step up to face Trigon after he possesses the League and threatens to conquer the world.",
      "tmdbMovieId": 379291,
      "avgRating": 3.1028,
      "releaseYear": "2016",
      "numRatings": 107,
      "posterPath": "/dQMO9EJxDBkdRzWUEWkbYzrMDC0.jpg"
   }
}