{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mercenary",
            "id": 3070
         },
         {
            "name": "undead",
            "id": 10327
         },
         {
            "name": "demon",
            "id": 15001
         },
         {
            "name": "necromancer",
            "id": 18123
         },
         {
            "name": "hijack",
            "id": 155238
         },
         {
            "name": "gods",
            "id": 161172
         },
         {
            "name": "wizard",
            "id": 177912
         },
         {
            "name": "sword and sorcery",
            "id": 234213
         },
         {
            "name": "battle wagon",
            "id": 234897
         },
         {
            "name": "darkspore",
            "id": 234898
         }
      ],
      "imdb_id": "tt5456798",
      "video": false,
      "title": "Mythica: The Iron Crown",
      "recommendations": [
         401689,
         370687,
         347096,
         321068,
         345921,
         487620,
         450519,
         329025,
         441762,
         489420,
         330628,
         371003,
         47065,
         253262,
         433829,
         205939,
         409582,
         369912,
         398943,
         445710
      ],
      "backdrop_path": "/nL5ksz7dZxIwUBs03c1f6AOjHfX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Marek",
               "gender": 1,
               "credit_id": "56eae7819251414b1100010d",
               "name": "Melanie Stone",
               "profile_path": "/4mIlmaMmuRlwlrdbbmAKEidArhJ.jpg",
               "id": 1362313,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Gojun Pye",
               "gender": 2,
               "credit_id": "56eae78f9251414b170000ff",
               "name": "Kevin Sorbo",
               "profile_path": "/a6rDi3tkNJwaVoP7VGbdGelwtYw.jpg",
               "id": 51965,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Thane",
               "gender": 2,
               "credit_id": "56eae79cc3a36806a6000158",
               "name": "Adam Johnson",
               "profile_path": "/jr3cne62q08VNZu7OhSTd4FdirF.jpg",
               "id": 107793,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Admiral Borlund Hess",
               "gender": 1,
               "credit_id": "575c4c3d92514161f00002c6",
               "name": "Eve Mauro",
               "profile_path": "/f7d4SFkDzt64q0MWOorsy7xP2VV.jpg",
               "id": 147382,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Dagen",
               "gender": 2,
               "credit_id": "59011f86c3a3681123002d37",
               "name": "Jake Stormoen",
               "profile_path": "/7ztQwCxm0GrzdZOqyeCUN9nYGAV.jpg",
               "id": 1418422,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Teela / Ana-Sett",
               "gender": 1,
               "credit_id": "59011fa992514155d6002e77",
               "name": "Nicola Posener",
               "profile_path": "/hOTePHAHanNEz4bC1FutfQV6JRU.jpg",
               "id": 930332,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Hammerhead",
               "gender": 2,
               "credit_id": "59011fcbc3a3681112002cb8",
               "name": "Christopher Robin Miller",
               "profile_path": null,
               "id": 550359,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56eae7b2c3a36806bd0000fc",
               "name": "John Lyde",
               "profile_path": null,
               "id": 130791,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59011ef092514155b5002b2a",
               "name": "Jason Faller",
               "profile_path": "/sZT0ZE6odt7zYRxlLWYcjgiEtI8.jpg",
               "id": 107796,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "59011f2bc3a36810a8002eab",
               "name": "Kynan Griffin",
               "profile_path": null,
               "id": 1085735,
               "department": "Writing",
               "job": "Characters"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 8.08327,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 388191,
      "vote_count": 23,
      "budget": 0,
      "overview": "When a team of unlikely heroes hijacks a steam-powered battle wagon, a daring young wizard (Marek) steals the final piece of the all-powerful Darkspore and embarks on a desperate quest to deliver the cursed artifact to the gods for safe keeping; but when they are caught in a death race between a ruthless team of elite mercenaries and a trinity of demons, Marek must learn to believe in herself before her friends are killed and the Darkspore is lost, to stop the evil necromancer (Szorlok) from uniting the Darkspore and flooding the living world with his legions of undead.",
      "similar": [
         68735,
         9610,
         12445,
         120,
         121,
         674,
         767,
         259316,
         109414,
         68737,
         57158,
         37430,
         284052,
         68728,
         9552,
         91586,
         1911,
         347096,
         287947,
         370687
      ],
      "original_title": "Mythica: The Iron Crown",
      "runtime": 93,
      "poster_path": "/otSfU9MrjYr1bJRhoAO61Pq1csH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mainstay Productions",
            "id": 9074,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Arrowstorm Entertainment",
            "id": 14787,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Camera 40 Productions",
            "id": 52699,
            "origin_country": ""
         }
      ],
      "release_date": "2016-05-14",
      "vote_average": 6,
      "belongs_to_collection": {
         "backdrop_path": "/nL8ZqjrpblbQHWiQEjj9Scp91C8.jpg",
         "name": "Mythica Collection",
         "id": 363092,
         "poster_path": "/nbsXfLZmgkwjB9mZ5p9Bt5SOFRY.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": "http://www.mythicamovie.com/#!blank/mcly4",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Lyde"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Jason Faller",
         "Jason Faller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt5456798/",
      "coverLink": null,
      "actors": [
         "Melanie Stone",
         "Adam Johnson",
         "Jake Stormoen"
      ],
      "reviews": [
         "I picked this up in the charity shop. I hadn't seen any of the earlier Mythica movies but that wasn't necessary. The film does a good job of setting the scene, and you get the idea of what it is all about from the first 10 minutes or so. The plot at first seems somewhat contrived (apparently there are several powerful magical artifacts involved), but as the story progresses it begins to make more sense. The main characters have good chemistry and I thought that the \"bad guy\" was really good too. Of course, it's pretty standard Dungeons & Dragons fare (the main characters are a Mage, Ranger / thief, and a Fighter / Paladin) but if you are OK with that then you will enjoy this.",
         "Somehow, the location of the last Dark Spore is known to both Wizard and Dwarf, both wanting to get their hands on it for different purposes. While the wizard keeps the warlock occupied, our team has to not only recover the shard of the Lich King's heart, but also protect it from no less than three different bands trying to get at it. In a way it was a more fun Mythica, with a lot of fights and running around and Warcraft-like dwarfish machines. However, the details were really what stuck out like a sore thumb. The fighting scenes were choreographed really badly, with people that are obviously not fighters doing clumsy moves. God, I miss Danielle Chuchran! Then the little scenes, where the personality of a character could have shone through, they completely missed the spot! In the end it was fun, but at every turn that could have been interesting something went really badly. I mean, I understand they cannot do focus groups on the result and reshoot the bad scenes, it's not that kind of budget, but when they shoot them, don't actors and directors feel something is off? See the scene where they make a deal, the bad guy gives their item first and the good guys go through with the deal, even when the fate of the world hangs in the balance. And the evil guys. They could be so much fun! The warlock has no sense of humor, he only wishes to kill everything. Why? What's the point? Anyway, bottom line is that I am amazed how little the show improves with each iteration. I can accept almost everything, from bad acting, directing, editing, sound, CGI... which funny enough are rare in Mythica, they do a good job with what they have. But I can't really be comfortable with a lack of progress. Whatever you do, guys, try to learn from it at least a little!",
         "I have devoured every one of these movies. Sure they are not the greatest movies ever but they are fun on a low budget. I saw the first two and could not wait for the rest to arrive. I can only imagine how well this would have done with a real budget.",
         "THE IRON CROWN is the fourth in the MYTHICA series of crowd-funded fantasy indies. Think of these as cosplay adventures with a budget a bit lower than those utilised by a particularly cheap SyFy Channel movie and you get the idea. This one's the best I've seen. Kevin Sorbo shows up at the outset for some brief exposition, then we're straight into a LORD OF THE RINGS-derivated action adventure template built around a chase format. You can forgive the cheesy CGI and acting as this is fast-paced and mildly enjoyable.",
         "I love fantasy genre films, there simply aren't enough of them. When Hollywood make them they're often pants and when indie developers try they usually swing above their weight and simply can't make a movie of that type on such a limited budget. Along came Mythica back in 2014, a crowd funded fantasy effort that though flawed had a real charm about it and developed a real following and a flock of sequels. 4 movies in, with the same cast and following the same story Mythica is holding ground and though nothing special in the grand scheme of things they are perfectly watchable. Here our party of heroes return minus Teela who fell in the last film, with a returning Kevin Sorbo and arch villain Necromancer. As with the previous three I enjoyed every hokey minute of it and was left wondering what the Mythica series could have been with a bit more money behind it. With a delightful recurring cast and a real light hearted charm Mythica scores with a win again even if it isn't a big one. The Good: Fantastic cast as usual Some great ideas Kevin Sorbo gets killed The Bad: Kevin Sorbo Not the best story Things I Learnt From This Movie: Crowdfunding movies is justified in some instances, no Zach Braff not you! I just can't take vehicles seriously in the fantasy genre With each passing movie I want to dropkick a flaming barrel of donkey pee into Kevin Sorbo's face more and more",
         "It had some good point and some bad. First is first, I felt this part does not stand very well on its own, unlike previous installments. On the other hand the knight-guy finally got a decent role written for him, and that was the best thing in the movie. Unfortunately until the ending despite like three different group targeting our crew - one of them I though are the gods, but they were not - the road-movie setup felt lack of action, which is totally strange. I never minded the amateur sword-pairing, no. Things were just ... happening. Maybe they needed some breath between the encounter, I don't know. But the special effects were used totally perfect, especially for the Sliders-like budget. Really, that was the other thing I praise the installment. The goa'uld/jaffa at the end even worked adequately, although I'm not sure where he disappeared. The ending pulled things up for me, despite some details being forgotten, like why the gunpowder on the airship why didn't blow up? How the characters got knowledge on the carriage? None thought the hummer looks pretty anachronistic? And how did that character at the end come back? Did the goddess finally revealed where the hammer is? But then there were details which weight for the good side, like Marek gaining a mage-robe instead of the apprentice-robe she previously wore. Or a trick with the knife while pairing (good stunt move). Or the viking with the two axe. Or the evolving of the world that the dwarf ex-adventurer bartender now gives them their quest. It was fun, and had its place, but had the same mistakes like Two Tower of Lord of the Rings - on its behalf we must confess this one cost way less though. All in all I'm glad they continued, and kept interest for the final part. Interesting decision that they wrote out Kevin Sorbo for it. But better start the franchise with one of the other films.",
         "The movie starts with a talk between Hercules and the dwarf. The dwarf proposes a valid plan with irrefutable logic. Yet Hercules refuses the plan because he is so self absorbed and goes with his own plan who would have worked if Hercules would have been to sacrifice his life. He was more than willing to sacrifice the life of friends and disciples but not his own. If you do not get how his plan would have worked watch http://www.imdb.com/title/tt0119099/?ref_=fn_al_tt_2 . In the end Marek realizes following Hercules is a bad idea and that she should start thinking for herself. Too bad it took her 4 movies but guess better late than never. I guess the only thing that stunk was how they resurrected two characters like pulling a melon out of the screenwriter's ass. Marek could have used her own power to revive Dagen by depleting the life from a bad dude, but apparently it would have been too simple. Also Hercules is incompetent. He just had too each her how to draw life from just one person instead of everyone around.",
         "It's no better than a series of cartoon Ninja Turtle episodes strung together with the same fight sequences repeated over and over. Written for indiscriminating TV addicts who will watch any trash no matter how bad (I was forced to be in the room while it was on).",
         "The Dark Spore, steam powered war machine, witches and spells, wizards and characters dressed as knights or swordsmen in some mythical time. Hot babes and the odd hunk to balance. All the ingredients of low hanging fruit of movies. This is no Game of Thrones. This is a weekend morning kid flick. The green screen effects are pretty lame, the fighting is slow motion in real time, just so that no one gets hurt. You can almost hear the \"actors\" reminding themselves of the moves they are supposed to make. I couldn't watch it past half an hour, Elementary students could write a better story line and image more interesting characters. They could also better act the sword play. All it takes a few bits of magic dust to throw and all is won.",
         "Mythica is turning out to be one of those pro-evil/satanic movies like evil dead, paranormal activity, naming the most obvious. So far I've progressed to the Iron Crown. Marek gave those stones because the evil in her push her to do so. She justified this whenever she gave a stone to Szorlok, always for a good reason, but she knowingly forfeits all other human life, because I can't explain why she gave the last stone away UNLESS. She is emotionally enslaved by Szorlok. As much as she promised to her friends that she will save the world, in the end she reveals her sneakiness. I am about to see the last movie, but I think that she is going to betray humanity. She may justify her choice for an ass-excuse, but she is foremost a necromancer and she will embrace the darkness that court her as a lover and it will encompass her soul."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Fantasy"
      ],
      "productionCompanies": [
         "Arrowstorm Entertainment",
         "Camera 40 Productions",
         "Mainstay Productions"
      ],
      "summaries": ["When a team of unlikely heroes hijacks a steam-powered battle wagon, a daring young wizard (Marek) steals the final piece of the all-powerful Darkspore and embarks on a desperate quest to deliver the cursed artifact to the gods for safe keeping; but when they are caught in a death race between a ruthless team of elite mercenaries and a trinity of demons, Marek must learn to believe in herself before her friends are killed and the Darkspore is lost, to stop the evil necromancer (Szorlok) from uniting the Darkspore and flooding the living world with his legions of undead."],
      "budget": 0
   },
   "movielensId": 160575,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-05-14",
      "dvdReleaseDate": null,
      "directors": ["John Lyde"],
      "runtime": 93,
      "movieId": 160575,
      "title": "Mythica: The Iron Crown",
      "mpaa": "",
      "actors": [
         "Melanie Stone",
         "Kevin Sorbo",
         "Adam Johnson",
         "Eve Mauro",
         "Jake Stormoen",
         "Nicola Posener",
         "Christopher Robin Miller"
      ],
      "imdbMovieId": "5456798",
      "originalTitle": "Mythica: The Iron Crown",
      "genres": [
         "Action",
         "Adventure",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["2uU_EoIj3tw"],
      "plotSummary": "When a team of unlikely heroes hijacks a steam-powered battle wagon, a daring young wizard (Marek) steals the final piece of the all-powerful Darkspore and embarks on a desperate quest to deliver the cursed artifact to the gods for safe keeping; but when they are caught in a death race between a ruthless team of elite mercenaries and a trinity of demons, Marek must learn to believe in herself before her friends are killed and the Darkspore is lost, to stop the evil necromancer (Szorlok) from uniting the Darkspore and flooding the living world with his legions of undead.",
      "tmdbMovieId": 388191,
      "avgRating": 2.08333,
      "releaseYear": "2016",
      "numRatings": 6,
      "posterPath": "/otSfU9MrjYr1bJRhoAO61Pq1csH.jpg"
   }
}