{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "hero",
            "id": 1701
         },
         {
            "name": "bird",
            "id": 2646
         },
         {
            "name": "pilot",
            "id": 3203
         },
         {
            "name": "airplane",
            "id": 3800
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "based on true story",
            "id": 9672
         },
         {
            "name": "travel",
            "id": 9935
         },
         {
            "name": "rescue",
            "id": 10084
         },
         {
            "name": "aviation",
            "id": 10168
         },
         {
            "name": "airplane accident",
            "id": 10812
         },
         {
            "name": "based on memoir or autobiography",
            "id": 14641
         },
         {
            "name": "imax",
            "id": 156395
         },
         {
            "name": "hudson river",
            "id": 230950
         }
      ],
      "imdb_id": "tt3263904",
      "video": false,
      "title": "Sully",
      "recommendations": [
         296524,
         302401,
         296098,
         302946,
         338766,
         308266,
         303858,
         369885,
         388399,
         324786,
         334541,
         253412,
         310307,
         314365,
         321697,
         325789,
         285783,
         321741,
         346685,
         333352
      ],
      "backdrop_path": "/vC9H1ZVdXi1KjH4aPfGB54mvDNh.jpg",
      "revenue": 238470033,
      "reviews": [
         {
            "author": "Lapakqq - Agen Judi Bandarq Domino QQ Adukiu Capsa Poker Online",
            "id": "57e116cd92514104490053d5",
            "content": "Segera bergabung dengan Lapakqq dapatkan hadiah dan bonus menarik. \r\nNikmati bagaimana rasanya menjadi bandar yang sesungguhnya. \r\nJangan sampai ketinggalan ya.\r\n\r\nLapakqq Menyediakan Promo Menarik :\r\n\r\n• Bonus Referral 10%+10%\r\n• Bonus TurnOver 0.5% \r\n\r\nDengan Proses DEPO & WD cepat.\r\nPelayanan yang selalu mengutamakan anda, di jamin tidak bosen dan nyaman dengan apa yang di berikan.\r\nJADI ??Tunggu apa Lagi. Kunjungi www.lapakqq.com sekarang.\r\n\r\nkami menyediakan website untuk anda, 6 permainan dalam 1 web.\r\n? Poker Online\r\n? DominoQQ\r\n? BandarQ\r\n? AduQ\r\n? Capsa Susun\r\n? Bandar Poker\r\n\r\n\r\nKAMI MELAYANI 24JAM UNTUK ANDA!",
            "url": "https://www.themoviedb.org/review/57e116cd92514104490053d5"
         },
         {
            "author": "Frank Ochieng",
            "id": "57e21174c3a36808c3007274",
            "content": "Filmmaker Clint Eastwood is certainly no stranger to overseeing exploratory biopics and his latest effort in **Sully** definitely supports his cinematic vision for spotlighting an unknown everyday aviation professional into an overnight national hero. Thus, airline pilot Captain Chesley \"Sully\" Sullenberger became an inspirational savior courtesy of the potentially fateful day on January 15, 2009 when US Airways Flight 1749 morphed into the celebrated newsworthy incident dubbed \"Miracle on the Hudson\" \r\n\r\nIn **Sully** Eastwood and screenwriter Todd Kormarinski presents Captain Sullenberger as an understated hero in the unconventional sense. Indeed, Sullenberger had his personal demons and doubts about that critical day years ago when his quick decision to land the doomed aircraft in the icy waters of the Hudson River in the aftermath of a freakish occurrence when a flock of birds managed to disable the engine's operation shortly after takeover from LaGuardia Airport. The label of \"hero\" may have been somewhat flattering for the veteran pilot in light of his accomplishment in saving the lives of his 155 passengers and crew courtesy of a risky landing that could have been their hellish watery graves. However, the burdensome christening of \"hero\" weighed heavily on Sullenberger especially when insulting suspicions arose questioning the pilot's actions. Sure, Sullenberger basked in instant adulation but his private torment was almost as haunting as the near tragedy he prevented when ensuring the airborne safety of those jeopardized on board.  \r\n\r\nThe challenging task in **Sully** was to create the tension and psychological strife behind an infamous 6-minute flight headed for disaster. Thankfully, Eastwood's steady direction and Komarnicki's adventurous script captures the tense and anxiety-driven moments that fuels **Sully's** soulful foundation. More important, two-time Oscar winner Tom Hanks diligently fits the bill as the beleaguered Captain Sullenberger whose personalized battles with heroism caused pressured ambivalence and self-inflicted guilt. It has been an awful long time since Hanks was tapped for an Oscar nomination so let's hope that his solid work in **Sully** warrants Academy Award consideration. \r\n\r\nSome may be rather cynical about Eastwood's daring narrative as the self-explanatory story has been interpreted in so many news accounts, documentaries, the personal accounts from the Flight 1749 survivors and to a certain extent Captain Sullenberger himself. Still, **Sully** sets out to examine a conflicted and confused man second guessing his aviation skills and instincts as an individual thrust into the national spotlight with a combination of hope and hesitation. \r\n\r\nNot only had the quick-thinking Sully and co-pilot Jeff Skiles (Aaron Eckhart in a welcomed, absorbing supporting role) dodged a major catastrophe when accidentally flying into the cluttered Canadian geese that caused the ice-cold water landing in the Hudson but they were actually scrutinized by the National Transportation Safety Board (NTSB) regarding Sully's decision not to return the malfunctioning plane to LaGuardia Airport or toward a nearby airport therefore opting to gamble using the Hudson River as the immediate surface available to land.  \r\n\r\nNaturally, the sudden media attention anointing the heralded pilot as a heroic soul coupled with the mixed reception of the buzz-killers in the NTSB speculating that foul play may have been involved for the piloting tandem of Flight 1549 understandably heightened the self-doubts and generated Sully's Post-Traumatic Stress Disorder. In the meantime, Sullenberger's wife Lorrie (Academy Award nominee Laura Linney) as well as other close family and associates are constantly being hounded by intrusive reporters in their attempt to get an exclusive piece of the cherished \"man of the moment\" in Chesley \"Sully\" Sullenberger.\r\n\r\nGranted that **Sully** will not go down as one of the flashiest biopics to cross our paths on the big screen in recent years. But Eastwood does deserve credit for showcasing the somber and beleaguered Sullenberger as a low-key, loyal isolationist dealing with the newfound fame and appreciation he is awkwardly at odds with facing as the Hudson River landing/rescue still chomps at his tainted psyche. Hanks's portrayal of the extremely likable but reluctant hero with lingering reservations is a stark contrast to contemporary cinematic heroes that routinely defeat monsters and aliens, parade around as slick and resilient super spies, wear superhero masks and capes, solemnly walk the mean streets with ready-made badges and firearms or are war-torn warriors from ancient historical times. Quite frankly, Chesley \"Sully\" Sullemberger is a flawed yet conscientious man urged to question his own courageousness and professional conviction.  \r\n\r\nEckhart's Stiles is effectively drawn as Sully's ardent supporter whose disbelief is tested when the NTSB has the nervy gumption to place his capable colleague under the dubious microscope after his amazing endeavor in protecting the sacred lives all on board the panicky plane destined for its doomsday fate. Conveniently, Eastwood inserts Anna Gunn (from TV's \"Breaking Bad\") as one of the perceived NTSB interrogating \"baddies\" trying to pin the wrap on Sully's numb shoulders in reference to his troubling flight methods. Linney, always the talented and involving actress, is merely reduced to displaying the commonplace hysterics of Sully's concerned spouse. \r\n\r\nPerhaps **Sully** is not the most thoroughly in-depth biopic one would have imagined because we are working with the perplexing man whose heroic actions made us aware of this seasoned phenomenal flyboy glorified in our living rooms nearly two decades ago. There is not much to ponder about Eastwood's fictitious Sullenberger from his past that gives insight to his current-day characterization as the media-praised hero-in-healing. In all fairness, Captain Chesley \"Sully\" Sullenberger's claim to fame was his hasty option to spare the endangered existences of his passengers and crew so Eastwood allows his problematic protagonist's questionable heroics to paint the picture as the incredible individual whose January 2009 resourcefulness spoke more truthfully than any miscellaneous flashbacks could do to justify Sully's angst-ridden tendencies.  \r\n\r\nOverall, **Sully** establishes a different kind of turbulence for an introspective yet gently intense wounded wonder tip toeing on the borderline of deserved and deceptive worship.  \r\n\r\n**Sully** (2016)\r\n\r\nWarner Bros.\r\n\r\n1 hr. 36 mins.\r\n\r\nStarring: Tom Hanks, Aaron Eckhart, Laura Linney, Jeffrey Nordling, Jamey Sheridan, Michael Rappaport, Anna Gunn, Valarie Mahaffey\r\n\r\nDirected by: Clint Eastwood\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Drama/Biopic\r\n\r\nCritic's rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016",
            "url": "https://www.themoviedb.org/review/57e21174c3a36808c3007274"
         },
         {
            "author": "Reno",
            "id": "585ea0dec3a3681a6201055d",
            "content": "**When a real human bravery wasn't appreciated till the computers confirmed it.**\r\n\r\nAnother excellent biographical drama for Tom Hanks in the title role. He has transformed from captain Phillips to captain Sully. Another great addition to Clint Eastwood's filmography as well, he never disappoints us. This film was based on the real event of the January 15, 2009. When a US passenger plane got hit by birds just after the take off, losing both the engines, landed on the New York's Hudson river. So the film reveals the heroic event, as well as followed by the investigation of the crash landing.\r\n\r\nAs it is a Hollywood film what should I expect, another American bravery? Yep, but still a good film, very engaging plot. It's not all about the plane event, because I thought one of the film poster is a spoiler. So the film covers more story, about the drama surrounding the main event. Especially saving the lives, that inspires even for the outside Americans. The entire narration is about two-three day affair, but most of the film was about the crash landing. From the actors to the visuals, all were top class. One of the best biopic that's not based on one's whole life, but one heroic attempt which will be remembered him and this film for forever.\r\n\r\n_8/10_",
            "url": "https://www.themoviedb.org/review/585ea0dec3a3681a6201055d"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Chesley 'Sully' Sullenberger",
               "gender": 2,
               "credit_id": "561c1d9cc3a3682251002307",
               "name": "Tom Hanks",
               "profile_path": "/pQFoyx7rp09CJTAb932F2g8Nlho.jpg",
               "id": 31,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jeff Skiles",
               "gender": 2,
               "credit_id": "561c1dcac3a36822580021a5",
               "name": "Aaron Eckhart",
               "profile_path": "/aRSofX2rMpOhPanB9Wh7veYmFn4.jpg",
               "id": 6383,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Lorraine Sullenberger",
               "gender": 1,
               "credit_id": "561c1dacc3a3682261001eaf",
               "name": "Laura Linney",
               "profile_path": "/unRRWITXrZsbk9iTmnjVxd6yZv9.jpg",
               "id": 350,
               "order": 2
            },
            {
               "cast_id": 80,
               "character": "Elizabeth Davis",
               "gender": 1,
               "credit_id": "57d2542a9251415e020008d1",
               "name": "Anna Gunn",
               "profile_path": "/6yLKtfYFWbJp5HAjvCecQCYlmqk.jpg",
               "id": 134531,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Tess Soza",
               "gender": 1,
               "credit_id": "561c1dd9c3a36822560020d4",
               "name": "Autumn Reeser",
               "profile_path": "/vZlZQkQzQ0PSCnQT77vqEFnYsoO.jpg",
               "id": 74607,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Mike Cleary",
               "gender": 2,
               "credit_id": "561c1df39251415a64001eeb",
               "name": "Holt McCallany",
               "profile_path": "/5Mw4StSwWwTLyBapXz9nOg7iUl5.jpg",
               "id": 7497,
               "order": 5
            },
            {
               "cast_id": 78,
               "character": "Charles Porter",
               "gender": 2,
               "credit_id": "57d253e8c3a3685b4800093a",
               "name": "Mike O'Malley",
               "profile_path": "/9VwiKnQySJN7buvCg53v4NB5Tj7.jpg",
               "id": 87192,
               "order": 6
            },
            {
               "cast_id": 79,
               "character": "Ben Edwards",
               "gender": 2,
               "credit_id": "57d254089251415cb90008e7",
               "name": "Jamey Sheridan",
               "profile_path": "/xOhl3hP49XKTZuj8hzs2CdtMliT.jpg",
               "id": 2977,
               "order": 7
            },
            {
               "cast_id": 2,
               "character": "Michael Delaney",
               "gender": 2,
               "credit_id": "561c1db99251415a670023f9",
               "name": "Jerry Ferrara",
               "profile_path": "/sjYRLct4yHiRDQWM0nOvhDr2yAP.jpg",
               "id": 98953,
               "order": 8
            },
            {
               "cast_id": 87,
               "character": "Doreen Welsh",
               "gender": 1,
               "credit_id": "57dc7d53c3a368639c001b70",
               "name": "Molly Hagan",
               "profile_path": "/xfqpbt6U5dROCbhX31IwfNUqsUq.jpg",
               "id": 58045,
               "order": 9
            },
            {
               "cast_id": 6,
               "character": "Jimmy Stefanik",
               "gender": 2,
               "credit_id": "561c1e9f9251415a6e00202f",
               "name": "Max Adler",
               "profile_path": "/jns8DiIYETg1Y24razNgbeJadpe.jpg",
               "id": 205335,
               "order": 10
            },
            {
               "cast_id": 31,
               "character": "Jeff Kolodjay",
               "gender": 2,
               "credit_id": "5636cdf29251414ab7019fe5",
               "name": "Sam Huntington",
               "profile_path": "/nq7pwic6Xe6XTRzOfXjMCuUqbjt.jpg",
               "id": 53492,
               "order": 11
            },
            {
               "cast_id": 89,
               "character": "Brian Kelly",
               "gender": 2,
               "credit_id": "57ed6c5f92514131c2000015",
               "name": "Wayne Bastrup",
               "profile_path": "/ejTa81V0ZSWdXHLpGJ43JG65T4q.jpg",
               "id": 1023458,
               "order": 12
            },
            {
               "cast_id": 77,
               "character": "Diane Higgins",
               "gender": 1,
               "credit_id": "57d253cfc3a3685d4900097e",
               "name": "Valerie Mahaffey",
               "profile_path": "/xO1RmcHQqagRlc4bUdhAKJJ8jEU.jpg",
               "id": 99351,
               "order": 13
            },
            {
               "cast_id": 90,
               "character": "L. T. Cook",
               "gender": 2,
               "credit_id": "57ed6c7892514131c200001e",
               "name": "Jeff Kober",
               "profile_path": "/txzJcwIFZKuGV7dBuGYKRqxfAuB.jpg",
               "id": 54865,
               "order": 14
            },
            {
               "cast_id": 30,
               "character": "Larry Rooney",
               "gender": 2,
               "credit_id": "5636cda5c3a3681b5901b6ed",
               "name": "Chris Bauer",
               "profile_path": "/3KYVMaGkWTEDQ0T9lsu85pVbP4T.jpg",
               "id": 4445,
               "order": 15
            },
            {
               "cast_id": 82,
               "character": "Herself",
               "gender": 1,
               "credit_id": "57d2549b9251415d950008cd",
               "name": "Katie Couric",
               "profile_path": "/uCBhJtyH4sWSceDGgWf53vuxQM6.jpg",
               "id": 166658,
               "order": 16
            },
            {
               "cast_id": 81,
               "character": "Pete the Bartender",
               "gender": 2,
               "credit_id": "57d2545dc3a3685c3b000a34",
               "name": "Michael Rapaport",
               "profile_path": "/i39bAISjAUWYlXZZA0wmjYWnZGf.jpg",
               "id": 4688,
               "order": 17
            },
            {
               "cast_id": 133,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5883dd96c3a3684ec600e0e5",
               "name": "Vincent Lombardi",
               "profile_path": "/kofpALprOT9YTqFmYvvq8DIZVdY.jpg",
               "id": 1743272,
               "order": 18
            },
            {
               "cast_id": 92,
               "character": "Jim Whitaker",
               "gender": 2,
               "credit_id": "57ed6cad92514131cc000032",
               "name": "Cooper Thornton",
               "profile_path": "/A0rZn1YC69t2iRcBmyqbQNeiof2.jpg",
               "id": 162828,
               "order": 19
            },
            {
               "cast_id": 93,
               "character": "Emma Cowan",
               "gender": 0,
               "credit_id": "57ed6cb7c3a3684c3f000034",
               "name": "Noelle Fink",
               "profile_path": "/mz6LxRsKU1J7wVoKbpGkKf8j6P5.jpg",
               "id": 1661814,
               "order": 20
            },
            {
               "cast_id": 8,
               "character": "Passenger 12B",
               "gender": 1,
               "credit_id": "561c1f00c3a3682264002135",
               "name": "Doris McCarthy",
               "profile_path": "/g0bhIkFDmO23w9xlHh4nxqPAdlO.jpg",
               "id": 1457224,
               "order": 21
            },
            {
               "cast_id": 9,
               "character": "Gurisman",
               "gender": 1,
               "credit_id": "561c1f109251415a6e002041",
               "name": "Purva Bedi",
               "profile_path": "/c1hnJKpSqWSOlSVdSqnIJAGbeYC.jpg",
               "id": 109024,
               "order": 22
            },
            {
               "cast_id": 11,
               "character": "Rob Kolodjay",
               "gender": 2,
               "credit_id": "561c1f349251415a6e002046",
               "name": "Christopher Curry",
               "profile_path": "/1UUvuuXIFlJ6hKNrLnhu0JU9tiC.jpg",
               "id": 90519,
               "order": 23
            },
            {
               "cast_id": 13,
               "character": "Luis Salerno",
               "gender": 0,
               "credit_id": "561c1f6ec3a368225300203c",
               "name": "Grant Roberts",
               "profile_path": "/bADsqOjiv40iK98myH7w0Qz64qZ.jpg",
               "id": 1378662,
               "order": 24
            },
            {
               "cast_id": 18,
               "character": "Carlo Alfonso",
               "gender": 2,
               "credit_id": "561c2000c3a3682261001ef7",
               "name": "Graham Sibley",
               "profile_path": "/eciTx3gZjD3pFTPsZ1buhkUkJtS.jpg",
               "id": 93090,
               "order": 25
            },
            {
               "cast_id": 86,
               "character": "Donna Dent",
               "gender": 1,
               "credit_id": "57dc7d1992514179a2000bd7",
               "name": "Ann Cusack",
               "profile_path": "/yQ68n8G6xl8TDMDr0534nnaGINS.jpg",
               "id": 59260,
               "order": 26
            },
            {
               "cast_id": 88,
               "character": "Patrick",
               "gender": 0,
               "credit_id": "57e68142925141390b00729a",
               "name": "Patch Darragh",
               "profile_path": "/9xgGGfdiqtGkdE9GruKJxfqYJp3.jpg",
               "id": 172156,
               "order": 27
            },
            {
               "cast_id": 20,
               "character": "EMT",
               "gender": 2,
               "credit_id": "561c204e9251415a67002436",
               "name": "Shaun Rey",
               "profile_path": "/5wT8fFTYwGmOBrY8HCX8YvWhRtl.jpg",
               "id": 1521876,
               "order": 28
            },
            {
               "cast_id": 134,
               "character": "Rescued Passenger",
               "gender": 2,
               "credit_id": "597a92239251413643002bbb",
               "name": "Shane P. Allen",
               "profile_path": "/dp1rrcE5OyRkBBqbLrXypWNMgCW.jpg",
               "id": 1636964,
               "order": 29
            },
            {
               "cast_id": 10,
               "character": "EMT",
               "gender": 0,
               "credit_id": "561c1f239251415a72002027",
               "name": "Justin Michael Woods",
               "profile_path": null,
               "id": 1521872,
               "order": 30
            },
            {
               "cast_id": 21,
               "character": "EMT",
               "gender": 0,
               "credit_id": "561c2060c3a368225e001f5c",
               "name": "Tommy McInnis",
               "profile_path": null,
               "id": 1521878,
               "order": 31
            },
            {
               "cast_id": 23,
               "character": "EMT",
               "gender": 0,
               "credit_id": "561c2092c3a368225e001f61",
               "name": "Kyle Julian Graham",
               "profile_path": null,
               "id": 1503851,
               "order": 32
            },
            {
               "cast_id": 14,
               "character": "ESU",
               "gender": 0,
               "credit_id": "561c1f82c3a36822580021e1",
               "name": "Marc Chouen",
               "profile_path": null,
               "id": 1521873,
               "order": 33
            },
            {
               "cast_id": 85,
               "character": "Sheila Dail",
               "gender": 0,
               "credit_id": "57dc7cffc3a3686384001b21",
               "name": "Jane Gabbert",
               "profile_path": null,
               "id": 1680287,
               "order": 34
            },
            {
               "cast_id": 7,
               "character": "NYC Police Officer",
               "gender": 0,
               "credit_id": "561c1ec29251415a6e002033",
               "name": "Lynn Marocola",
               "profile_path": null,
               "id": 1460933,
               "order": 35
            },
            {
               "cast_id": 12,
               "character": "Sully (16 Years Old)",
               "gender": 0,
               "credit_id": "561c1f5d9251415a6b001f50",
               "name": "Blake Jones",
               "profile_path": null,
               "id": 1318907,
               "order": 36
            },
            {
               "cast_id": 16,
               "character": "Reporter",
               "gender": 0,
               "credit_id": "561c1fd79251415a6700242a",
               "name": "Kamron Leal",
               "profile_path": null,
               "id": 1521875,
               "order": 37
            },
            {
               "cast_id": 17,
               "character": "Reporter",
               "gender": 1,
               "credit_id": "561c1fddc3a3682253002048",
               "name": "Laura Lundy Wheale",
               "profile_path": "/oxjvxt3KdhomIdspy2ZPUNPCw72.jpg",
               "id": 1521874,
               "order": 38
            },
            {
               "cast_id": 19,
               "character": "Passager secouru",
               "gender": 0,
               "credit_id": "561c203b9251415a6b001f5e",
               "name": "Michael Joseph Donlan",
               "profile_path": null,
               "id": 1355475,
               "order": 39
            },
            {
               "cast_id": 22,
               "character": "Pam Seagle",
               "gender": 0,
               "credit_id": "561c2073c3a3682261001f02",
               "name": "Kelly L. Moran",
               "profile_path": null,
               "id": 1521879,
               "order": 40
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "561c20b9c3a368225300205a",
               "name": "Clint Eastwood",
               "profile_path": "/n8h4ZHteFFXfmzUW6OEaPWanDnm.jpg",
               "id": 190,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5775cf8bc3a36808fd001d6e",
               "name": "Clint Eastwood",
               "profile_path": "/n8h4ZHteFFXfmzUW6OEaPWanDnm.jpg",
               "id": 190,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5775cf9b925141674a001ad4",
               "name": "Frank Marshall",
               "profile_path": "/dVPOD85wQ1Xscpe3DOVQ1I59IIF.jpg",
               "id": 664,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56292661c3a368487d00277f",
               "name": "Blu Murray",
               "profile_path": "/5zSabDsf704LN2IkctaYrV2iunR.jpg",
               "id": 1061203,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5636ce60c3a3681b5c01dce9",
               "name": "Chesley Sullenberger",
               "profile_path": "/r2xvlk0MUAGlnIC1HERStJo7akM.jpg",
               "id": 1185286,
               "department": "Writing",
               "job": "Book"
            },
            {
               "gender": 0,
               "credit_id": "5636ce70925141284c01c1ce",
               "name": "Jeffrey Zaslow",
               "profile_path": null,
               "id": 1530602,
               "department": "Writing",
               "job": "Book"
            },
            {
               "gender": 2,
               "credit_id": "5775cf7d925141674d001a5d",
               "name": "Bruce Berman",
               "profile_path": "/nXKlbRLV5aKzIW6XViCAiqWbxPk.jpg",
               "id": 1296,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5775cfadc3a36808f2001b8d",
               "name": "Jessica Meier",
               "profile_path": null,
               "id": 1643706,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "5775cfbe925141674a001ae7",
               "name": "Tim Moore",
               "profile_path": null,
               "id": 63946,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5775cfcfc3a3680911001ca7",
               "name": "Kipp Nelson",
               "profile_path": null,
               "id": 1643707,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5775cfdfc3a368090d001c91",
               "name": "Kristina Rivera",
               "profile_path": null,
               "id": 1643708,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "5775cffe925141674d001a83",
               "name": "Allyn Stewart",
               "profile_path": null,
               "id": 1521882,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5775d03ac3a36809020018d5",
               "name": "Geoffrey Miclat",
               "profile_path": null,
               "id": 935490,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5775d049c3a3680906001b63",
               "name": "James J. Murakami",
               "profile_path": null,
               "id": 795,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5775d055925141674d001ab4",
               "name": "Ryan Heck",
               "profile_path": null,
               "id": 1399447,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5775d063c3a368090d001cbb",
               "name": "Kevin Ishioka",
               "profile_path": null,
               "id": 6878,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 1,
               "credit_id": "5775d0709251416750001b8c",
               "name": "Deborah Hopper",
               "profile_path": null,
               "id": 461,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5775d0809251416750001b93",
               "name": "Luisa Abel",
               "profile_path": null,
               "id": 1322015,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 1,
               "credit_id": "5775d08cc3a3680906001b85",
               "name": "Elena Arroy",
               "profile_path": null,
               "id": 1643709,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5775d09a9251416741001b13",
               "name": "Debra-Lee Davidson",
               "profile_path": null,
               "id": 29065,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5775d0bbc3a3680911001d23",
               "name": "Patricia DeHaney",
               "profile_path": null,
               "id": 1417399,
               "department": "Costume & Make-Up",
               "job": "Hair Department Head"
            },
            {
               "gender": 0,
               "credit_id": "5775d0c8c3a36808fa001cba",
               "name": "Gary English",
               "profile_path": null,
               "id": 1643710,
               "department": "Costume & Make-Up",
               "job": "Key Hair Stylist"
            },
            {
               "gender": 0,
               "credit_id": "5775d0d8c3a368090d001cf6",
               "name": "Kimberly Felix",
               "profile_path": null,
               "id": 1525985,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5775d0e7925141674d001ae9",
               "name": "Donna Martin",
               "profile_path": null,
               "id": 1580972,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5775d11b9251416741001b45",
               "name": "Ashley McGuire",
               "profile_path": null,
               "id": 1643711,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5775d12dc3a3680911001d60",
               "name": "Ren Rohling",
               "profile_path": null,
               "id": 1332524,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5775d1389251416750001beb",
               "name": "Matthew Silva",
               "profile_path": null,
               "id": 236529,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5775d143c3a36808fd001e3f",
               "name": "Nico Sohn",
               "profile_path": null,
               "id": 1643712,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5775d154c3a36808fa001ced",
               "name": "Jose Zamora",
               "profile_path": null,
               "id": 1420642,
               "department": "Costume & Make-Up",
               "job": "Key Hair Stylist"
            },
            {
               "gender": 2,
               "credit_id": "5775d167c3a3680906001bfe",
               "name": "Tim Moore",
               "profile_path": null,
               "id": 63946,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5775d176c3a36808fa001cfb",
               "name": "Mark Scoon",
               "profile_path": null,
               "id": 1564997,
               "department": "Production",
               "job": "Executive In Charge Of Production"
            },
            {
               "gender": 0,
               "credit_id": "5775d1bc9251416744001b6a",
               "name": "David M. Bernstein",
               "profile_path": null,
               "id": 1643713,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5775d215c3a36808fa001d4c",
               "name": "Jeff Angelo",
               "profile_path": null,
               "id": 1643716,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 0,
               "credit_id": "5775d2269251416752001cbf",
               "name": "Kim Breece",
               "profile_path": null,
               "id": 1443947,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5775d2b8c3a368090d001de7",
               "name": "Anthony Carlino",
               "profile_path": null,
               "id": 1643717,
               "department": "Art",
               "job": "Leadman"
            },
            {
               "gender": 0,
               "credit_id": "5775d2cf9251416747001a83",
               "name": "Robert S. Dressel",
               "profile_path": null,
               "id": 1643718,
               "department": "Costume & Make-Up",
               "job": "Set Dressing Artist"
            },
            {
               "gender": 0,
               "credit_id": "5775d3129251416747001ab0",
               "name": "Matthew Lee Flory",
               "profile_path": null,
               "id": 1643719,
               "department": "Costume & Make-Up",
               "job": "Set Dressing Artist"
            },
            {
               "gender": 0,
               "credit_id": "5775d32e925141673d001e2d",
               "name": "Greg Gonzalez",
               "profile_path": null,
               "id": 1643720,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 0,
               "credit_id": "5775d34bc3a368090d001e25",
               "name": "Chryss Hionis",
               "profile_path": null,
               "id": 4909,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "578e0936c3a3681745002c7a",
               "name": "Tom Stern",
               "profile_path": null,
               "id": 460,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "57d621759251416f62003acd",
               "name": "Christian Jacob",
               "profile_path": null,
               "id": 1073096,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57d621949251416f59003d9f",
               "name": "The Tierney Sutton Band",
               "profile_path": null,
               "id": 1677930,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "584415169251416a74009202",
               "name": "Todd Komarnicki",
               "profile_path": null,
               "id": 52000,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "584c0450c3a3682c3a000cfe",
               "name": "Mitchell Ray Kenney",
               "profile_path": null,
               "id": 1323092,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584c046392514133bd00a941",
               "name": "Natalie Arango",
               "profile_path": null,
               "id": 1525977,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584c047dc3a3682c3a000d25",
               "name": "Zina Arthur",
               "profile_path": null,
               "id": 1720759,
               "department": "Costume & Make-Up",
               "job": "Seamstress"
            },
            {
               "gender": 0,
               "credit_id": "584c049292514133b300b4b7",
               "name": "Yafi Hoch",
               "profile_path": null,
               "id": 1720760,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "584c057ec3a368398b00b335",
               "name": "Matthew Jerome",
               "profile_path": null,
               "id": 1720772,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "584c0594c3a368397a00b698",
               "name": "Brett Springirth",
               "profile_path": null,
               "id": 1720773,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "584c05bac3a368397a00b6aa",
               "name": "Susan Malerstein",
               "profile_path": null,
               "id": 1434225,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "584c05de92514133b600b258",
               "name": "Eve Streger",
               "profile_path": null,
               "id": 935494,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "584c0624c3a368397a00b6dd",
               "name": "Stephen S. Campanelli",
               "profile_path": null,
               "id": 1377131,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "584c063ac3a368398700ad14",
               "name": "Denny Kortze",
               "profile_path": null,
               "id": 1597957,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "584c065192514133b900b2ab",
               "name": "Thomas Lappin",
               "profile_path": null,
               "id": 995189,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "584c0684c3a368397a00b712",
               "name": "Hans Bjerno",
               "profile_path": "/tzeE3ATzHWyEQH32GYeGuSgr1xz.jpg",
               "id": 1399071,
               "department": "Camera",
               "job": "Helicopter Camera"
            },
            {
               "gender": 0,
               "credit_id": "584c06b8c3a368397800aa10",
               "name": "Keith Bernstein",
               "profile_path": null,
               "id": 1181575,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "584c06d5c3a368398200ab4d",
               "name": "Ross Dunkerley",
               "profile_path": null,
               "id": 1181576,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "584c06e6c3a368398700ad7e",
               "name": "David Skutch",
               "profile_path": null,
               "id": 1393573,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 2,
               "credit_id": "584c06fd92514133b300b62e",
               "name": "Jason C. Fitzgerald",
               "profile_path": null,
               "id": 1472800,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "584c071392514133b100b30b",
               "name": "Eric Leigh",
               "profile_path": null,
               "id": 1720781,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "584c072ac3a368398700ad91",
               "name": "Chris Lumpkin",
               "profile_path": null,
               "id": 1720782,
               "department": "Lighting",
               "job": "Rigging Grip"
            },
            {
               "gender": 0,
               "credit_id": "584c07a2c3a368397e00b454",
               "name": "Richard Spriggs",
               "profile_path": null,
               "id": 1661325,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584c07c492514133a800a5fc",
               "name": "Steve Riley",
               "profile_path": null,
               "id": 935492,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584c07d7c3a3682c3a000eea",
               "name": "Bryan Litson",
               "profile_path": null,
               "id": 1720783,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584c07fcc3a368397500a74c",
               "name": "Barbara Holmes",
               "profile_path": null,
               "id": 1594640,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "584c080fc3a368397e00b485",
               "name": "Tyler Kehl",
               "profile_path": null,
               "id": 1395026,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "584c0824c3a368398200abe2",
               "name": "Sarah McMurdo",
               "profile_path": null,
               "id": 132626,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "584c083dc3a368398200abee",
               "name": "Michael Owens",
               "profile_path": null,
               "id": 1377130,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584c0850c3a368397800aad2",
               "name": "Aaron Weintraub",
               "profile_path": null,
               "id": 1415151,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584c089792514133a800a636",
               "name": "Katy Wood",
               "profile_path": null,
               "id": 1458578,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 0,
               "credit_id": "584c08ae92514133a800a641",
               "name": "Hugo Weng",
               "profile_path": null,
               "id": 1050930,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "584c08c192514133b600b3fe",
               "name": "John T. Cucci",
               "profile_path": null,
               "id": 1367493,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "584c08d792514133a800a652",
               "name": "Dan O'Connell",
               "profile_path": null,
               "id": 1338372,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "584c08f6c3a368397a00b875",
               "name": "Jason King",
               "profile_path": null,
               "id": 1428595,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "584c0909c3a368398700ae5c",
               "name": "Roland N. Thai",
               "profile_path": null,
               "id": 16994,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "584c0926c3a368398200ac45",
               "name": "John T. Reitz",
               "profile_path": null,
               "id": 1342626,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "584c093892514133b300b739",
               "name": "Tom Ozanich",
               "profile_path": null,
               "id": 1368866,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "584c094f92514133b900b41d",
               "name": "Bub Asman",
               "profile_path": null,
               "id": 375,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "584c097292514133a800a6a1",
               "name": "Erik Kaufmann",
               "profile_path": null,
               "id": 1409719,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "584c0984c3a368398200ac61",
               "name": "Adam Ohl",
               "profile_path": null,
               "id": 1407372,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "584c099ec3a368397500a7f9",
               "name": "Bob Peishel",
               "profile_path": null,
               "id": 1458583,
               "department": "Editing",
               "job": "Digital Intermediate"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 18.805416,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 363676,
      "vote_count": 2741,
      "budget": 60000000,
      "overview": "On 15 January 2009, the world witnessed the 'Miracle on the Hudson' when Captain 'Sully' Sullenberger glided his disabled plane onto the frigid waters of the Hudson River, saving the lives of all 155 aboard. However, even as Sully was being heralded by the public and the media for his unprecedented feat of aviation skill, an investigation was unfolding that threatened to destroy his reputation and career.",
      "similar": [
         87502,
         424,
         568,
         157336,
         676,
         2567,
         68718,
         10527,
         5559,
         172385,
         605,
         744,
         813,
         2320,
         10559,
         149870,
         7227,
         2924,
         306,
         1883
      ],
      "original_title": "Sully",
      "runtime": 96,
      "poster_path": "/h6O5OE3ueRVdCc7V7cwTiQocI7D.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/zHA0SV6jKuYz84FAgZbLFbLThsU.png",
            "name": "Kennedy/Marshall Company, The",
            "id": 7383,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Malpaso Productions",
            "id": 171,
            "origin_country": ""
         },
         {
            "logo_path": "/tVj6x1okqRtQjul2OYKpXrgx9zy.png",
            "name": "FilmNation Entertainment",
            "id": 7493,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Flashlight Films",
            "id": 65359,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         },
         {
            "logo_path": "/wzKxIeQKlMP0y5CaAw25MD6EQmf.png",
            "name": "RatPac-Dune Entertainment",
            "id": 41624,
            "origin_country": "US"
         }
      ],
      "release_date": "2016-09-07",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "The Untold Story Behind the Miracle on the Hudson.",
      "adult": false,
      "homepage": "http://www.sully-movie.com/#home",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Clint Eastwood"],
      "runtime": 96,
      "synopsis": "The film opens with Captain Chesley \"Sully\" Sullenberger (Tom Hanks) trying to maneuver a plane above New York City. The plane's engines have both failed, and the pilot is trying to find a safe place to land. Sully loses control and crashes the plane into a building, resulting in a fiery explosion. This is just a nightmare, and Sully wakes up sweating and gasping for breath. It's been barely a week when Sully successfully landed U.S. Airways Flight 1549 on the Hudson River, saving the lives of all 155 passengers in what the media has dubbed \"The Miracle on the Hudson\". However, Sully remains haunted by the incident. Sully and his co-pilot/friend Jeff Skiles (Aaron Eckhart) are called in to meet with a board of people investigating the incident. One of the men, Charles Porter (Mike O'Malley), questions Sully over basic things such as if he had gotten enough sleep, whether or not he had taken any drugs or alcohol, or if he has been having troubles at home. The big question is why Sully chose to land on the Hudson instead of simply returning to LaGuardia Airport. Skiles defends Sully's actions as he was right next to him when the incident occurred. It is argued that the left engine had been determined to be idle and still functioning, but Sully disputes that and says that he felt both engines die. Sully keeps in touch with his wife Lorraine (Laura Linney), who lives with their two daughters. Lorraine has been worried about Sully's well-being ever since the incident. The media also looks into the incident, with Sully being questioned by reporters. He sits for an interview with Katie Couric, who asks him what it feels like to be seen as a hero. Sully says he doesn't feel like a hero. Following the interview, Sully looks out the window and experiences another hallucination of his plane crashing into the city. We see a brief flashback of Sully as a teenager when he was first learning to fly under LT Cook (Jeff Kober). Sully and Skiles meet with the board again. They inform the pilots that several tests were run on a simulator that proved that it was possible and probable to return to LaGuardia. We go back to the day of the incident on January 15, 2009. Sully and Skiles take off, but roughly two minutes into the flight, a large flock of geese fly head-on into the engines, causing both of them to falter. Sully maintains contact with the people at the control center, but the flight is lost from the radar. Sully then warns everyone on board to brace for impact. The flight attendants mind the passengers and repeat instructions for them to be careful. Sully and Skiles then make their descent onto the Hudson. In the present day, Sully and Skiles make an appearance on David Letterman's show with the three flight attendants who were with them during the incident. Sully goes jogging through Times Square and runs by the base where an old plane that he flew rests. We see another quick flashback of him flying that plane over a field. Afterwards, Sully goes to a bar where the bartender (Michael Rapaport) gives him a drink named after Sully - grey goose with a splash of water. Sully then watches coverage of the incident on the TV. We see another flashback to that day, but with a more extensive look at the passengers. There's a woman with her elderly mother that wants to bring back a souvenir for her grandchildren. Two grown men are traveling with their father, and they just barely make it onto the plane before it departs. There is a woman with her baby and a polite man sitting next to her. We even meet the flight attendants joining the trip. As the plane malfunctions and begins its descent, the passengers brace themselves for the worst. Some are texting their loved ones, while others are holding on tight. The polite man holds the woman's baby for her. The plane lands on the river, and soon starts to fill up with water. Sully orders everyone to evacuate as the doors are opened and the rafts are inflated. A ferry team led by Captain Vincent Lombardi (playing himself) heads out into the Hudson to rescue the passengers, who have been separated onto both wings. At least two people have jumped into the freezing cold water, but both are recovered. The ferry team starts pulling people on board. Some people are brought to Jersey. One of the men that almost missed the flight calls his father, who is with his other son since they were separated, but they are elated to know that they're all okay. Sully is brought to a hospital, and he is told that all 155 souls on board had survived. He is later brought to a hotel to stay, and one of the employees gives him a big hug, leaving him stunned. He calls Lorraine to let her know he is okay, even though she has no idea just yet of what has happened until Sully tells her to turn on the TV with their daughters. Back in the present, Lorraine calls Sully in tears as it just hits her that he was one of the 155 people on board, and how terrified she is to realize that. At the film's climax, Sully and Skiles attend a hearing with the board and other officials to discuss the incident. Again, it is brought up that all test pilots in the simulators were able to successfully make it back to LaGuardia without a problem. Sully argues that what they did not take into account was the \"human factor\", in that it was a matter of life and death, and that none of the test pilots were under the same pressure that he and Skiles were facing. The directors run tests again with the apparent reaction time of 35 seconds (Sully repeatedly mentions that he acted within 208 seconds), which show that had the test pilots reacted under the same circumstances, they all would have crashed into the city if they tried going back to LaGuardia. Even attempts at making it to Teterboro Airport would have proved fatal. Everyone then listens to a recording of Sully and Skiles on the flight as they made their moves. It is enough to prove to the board that Sully and Skiles acted properly. Dr. Elizabeth Davis (Anna Gunn) comments that if Sully had been removed from the equation, everything would have gone wrong. Sully disagrees, saying that Skiles and the flight attendants also deserve credit for the landing. Davis asks Skiles what they would have done differently. Skiles replies that he would have done this in July. Everyone laughs. The final text states that it took about 24 minutes for the ferry team to rescue everyone from Flight 1549. The end credits feature photos from the real event.",
      "writers": [
         "Todd Komarnicki",
         "Chesley Sullenberger"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3263904/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTU5MzQwMzY3Ml5BMl5BanBnXkFtZTgwOTA3MzEzOTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Tom Hanks",
         "Aaron Eckhart",
         "Laura Linney"
      ],
      "reviews": [
         "Greetings again from the darkness. Society has a tendency to go to extremes – hero worship for those who probably don't deserve it and character assassination for those who have the gall to be less than perfect. Chesley \"Sully\" Sullenberger has experienced both. On January 15, 2009, Sully made the decision to land the crippled aircraft of US Airways flight 1549 right into a river \u0085 an event immediately labeled \"Miracle on the Hudson\". Surprisingly, this is the first film collaboration for Tom Hanks and director Clint Eastwood. Both have cinematic experience with true life stories and real people: Hanks most recently in Captain Phillips and Bridge of Spies; and Clint with American Sniper and J. Edgar. This one is the perfect fit as Hanks takes on a good man who takes pride in doing his job, and Clint brings to life a story that showcases the best of human nature. Tom Komanicki adapted the screenplay from the book \"Highest Duty\", co-written by Sully and Jeffrey Zaslow. Much of the attention is given to the doubts and uncertainty Sully experienced during the NTSB review. The scrutiny of his work by the committee (played here by the ultra-serious Mike O'Malley, Anna Gunn, Jamey Sheridan) left his career and reputation dangling, inspiring nightmares that are much worse than yours and mine. Certainly we are in awe of what Sully pulled off that morning, but as movie goers, we are anxious to see the plane crash/splash/landing. Clint comes through in breath-taking fashion. While it lacks the hysterics and drama of the upside-down plane in Flight, this re-creation is so realistic that we nearly obey the flight attendants repeated instructions of \"Heads down. Stay down\". Even the cockpit chatter, passenger evacuation, and first responder's (many of whom are real life folks, not actors) activities are played in matter-of-fact manner \u0085 more people just doing their job. We shiver knowing the icy Hudson River water is 36 degrees, and we feel Sully's anxiety as he desperately tries to get a final count \u0085 a count that he prays will hit 155. Aaron Eckhart plays co-pilot Jeff Skiles and has a couple of memorable scenes, and Laura Linney embraces the thankless role of telephone wife of Sully during the aftermath and hearings. We get a glimpse of Sully's background with flashbacks to his flight lessons at a Denison Texas private airfield, as well as a portion of his military service. Hanks is the perfect choice for a role that would have suited James Stewart just fine if it were the 1940's. The conflict here comes from the NTSB inquiry. Backed by computer simulators that show the plane could have coasted back to LaGuardia, we get the distinct feeling that the committee's goal is finding human error – naming a scapegoat (other than Canadian geese) for their \"lost\" plane. It's Sully who reminds us that the committee is simply doing their job \u0085 just as he was, Skiles was, the Flight Attendants were, and the first responders were. This is technically expert filmmaking. We know the ending, but are glued to the screen. Frequent Eastwood collaborator Tom Stern handles the cinematography, and like the acting and story-telling, the camera work avoids any excess or over-dramatization. The film provides one of the best examples ever of the duality of hero worship and intense scrutiny, and how a person can be a hero by simply doing their job. The closing credits show clips of the flight's reunion and every survivor would agree that the best among us allowed a continuation of life \u0085 something that could have gone to the other extreme.",
         "If there's one thing you can count on Clint Eastwood doing well, it's directing an emotionally heartfelt story. Sully continues Eastwood's success by giving us probably the most human drama of 2016. \"The miracle on the Hudson\" is the subject of this Eastwood drama, starring Tom Hanks, Aaron Eckhart, and Laura Linney. There will be plenty of obstacles with any film based on a true story, but with a film based on an event that lasted a mere 208 seconds, it's extra difficult. But Eastwood manages to pull a great story out of these unbelievable events that comes in just under 2 hours. Of course, the flight itself isn't the only hurdle that captain Sully went through, as he dealt with reporters, investigators, and the National Transportation Safety Board determined to diminish his heroic efforts. Who could possibly be better to play Captain Sully than the great Tom Hanks. Having wonderfully played another \"controversial\" captain back in 2013 as Captain Phillips, there was no doubt he could pull off a somewhat similar role. Boy does Hanks deliver. He always effortlessly pulls out the big speeches and powerful dialogue well, but I often find his more subtle acting to be more impressive. It's the moments when Sully is reacting to the big moments with only his facial expressions and body languages that give me goosebumps. Not many actors are able to bring me to the verge of tears just by a facial expression, but Hanks is one of them. Eastwood and his editors also deserve tons of credit for their work here. Much like Hanks' subtle acting, I love when Eastwood holds back the bombastic music (that can sometimes take you out of a story like this) and lets the audience choose how to feel by watching gorgeous cinematography and poignant acting and directing. This may be Eastwood's best directorial work since Million Dollar Baby. He understood exactly the moments to use and not music in order to pull the emotion out of his audience. Most of all, this film is a great display of the power of the human spirit. Everything about this film is grounded with humanity. No one seems fake. So often Hollywood is flooded with over-the-top filmmaking that can easily dilute the power of the film's message. Sully knows exactly what it's going for, and it does it to near perfection. +Eastwood back at the top +Hanks subtle acting +Power of human spirit 91/100",
         "\"Everything is unprecedented until it happens for the first time.\" Sully (Tom Hanks) On January 15, 2009, a decidedly un-cinematic hero, Captain Chesley \"Sully\" Sullenberger of US Airways, landed 155 souls into the Hudson River, safely, as he struggled with a plane crippled by birds in both engines. As we all know, the passengers and crew survived, so what does director Clint Eastwood bring to the big screen that could engage an audience knowing the blessed outcome? First, he brings Tom Hanks, not unknown to portray low-key heroes (see Bridge of Spies and Captain Phillips most recently), whose understated courage seems accurately to reflect the Sully we have come to know and see displayed with the credits. Second, Eastwood crafts one of the most believable crash and rescue scenes I have ever encountered. As in the authentic Hanks interpretation of the quiet Sully, the disaster is compelling and understated. No swelling or morbid music takes away from the terror. Because the simulations at the National Transportation Safety Board hearings were necessary to prove fault, the contrast between the NTSB creations and Eastwood's rendition of the real incident is starkly evocative of the film's attempt to get it all right. Even the NTSB's grilling Sully at the hearings, while it unsettlingly tracks his alleged errors in the \"Miracle on the Hudson,\" has a low-profile approach. It confirms Eastwood's and writer Todd Komarnicki's affirmation that everyone in the film is doing his and her job, from pilots, investigators, and rescuers to director and writer. Even Sully's wife, Lorraine (Laura Linney), in the ever-annoying wife-in-waiting-role, is stronger and more balanced than the stock character. Although the passengers are not always first-rate actors, they do seem sincere. However, it is Hanks's film with his stolid, no frills acting, followed by a supportive Aaron Eckhart as his co-pilot, Jeff Skiles. But then, that powerful under-acting is emblematic of the director himself, a lean craftsman who wastes no time in production and has no time for puffery. Although not Unforgiven, Sully is one of Eastwood's best and one of the best films of the year. After seeing this film, you may have a heightened respect even for flight attendants, who evidence a more sincere bravery than summer blockbuster heroes could ever do as that crew directs the passengers: \"Brace. Brace. Brace. Head down, stay down!\" If you see Sully in IMAX, your head will be up in the clouds and your heart too.",
         "This is based on a true incident from a few years ago, where a veteran pilot actually was able to land his plane in the Hudson river in NYC and with all on board surviving. It is a terrifically detailed but slow moving work by 86 year old living legend Clint Eastwood starring the Jimmy Stewart/everyman of our era, in two time - should have been three time -Oscar winner Tom Hanks as the quietly unheroic hero pilot. (You were robbed of the statuette in 2000 for \"Cast Away\", Tom. Who else could play opposite a volleyball for two hours and make it work?). I'm reminded of Eastwood's 2003 Academy Award winning \"Mystic River\" in that he deliberately takes his time in adapting the book, as he does here as well. The script is a little odd, shifting back and forth between the events of the day itself and the hearing to decide whether the pilot and co-pilot were at fault for not heading to one of the nearby airports. This leads to a little awkwardness during the first third of the film, but then works out just fine. We see the big event twice - The epic landing of the jet is more than worth seeing in and of itself. Aaron Eckhart, for once, gets to play a good guy, the co-pilot. How nice to see Delphi Harrington, a much underused actress, as the passenger in the wheelchair. She was marvelous as an intelligent, sophisticated woman in the long-gone soap opera Where the Heart Is and was also believable as a trashy Southern murderess on Guiding Light and as a trashy Southern prostitute on All My Children. Here she plays a somewhat stereotypical New York Jewish mother. As a daughter she gets Valerie Mehaffey of Desperate Housewives. Sully shows something rarely seen in movies these days, the simple heroism of ordinary people, like the ferry boat crew members who rescue the passengers from the plane. Be sure to stay for the credits, where you will see a reunion of many of the actual passengers and crew from the flight. And as Columbo would say, just one more thing - The last line of the movie is a hoot and got a big laugh! Highly recommended.",
         "What makes Sully exceptional is that Clint Eastwood lets the story tell itself. Specifically real with the water landing itself. Nothing is really taken out of content in the way Hollywood thinks and usually takes it. The event was dramatic enough without anything needed to be added to enhance that. Tom Hanks is a fine actor. Not the greatest performance, but it was cool that Hanks and Eastwood did a movie together. Sully gives us an in depth look at the miracle of the Hudson. Though the title does state that the we focus on Capt. Chesley \"Sully\" Sullenberger who did an amazing water landing on the Hudson in January of 2009, and got his 15 mins because of it, Eastwood shows us that even one man can see things in many different ways, as Eastwood goes through all those angles. I love Aaron Eckhart as Jeff Skiles, the co pilot who supported greatly the pilots decision. He was a great supporting actor for Tom Hanks. In the end this movie is about heroes, not just Sully but everyone involved in the US Airways Flight 1549 water landing. From the well trained flight attendances to the rescue police on the water fairy. Its about the 155 passengers and the their accounts of what happen. It's about how sometimes we forget how to treat a hero, but true heroes will always shine though, and Eastwood tells the story as real as possible knowing that he has an incredible story here.",
         "Running at a lean and spry 96min, Clint Eastwood's Sully isn't so much a clinical bio-pic in the traditional sense, but an absorbing showcase of a man's extraordinary professionalism in the face of danger. On Thursday, January 15th, 2009, the world witnessed the \"Miracle on the Hudson\" when Captain Chesley Sullenburger (Tom Hanks) glided his disabled plane onto the frigid waters of the Hudson River, saving the lives of all 155 aboard. However, even as Sully was being heralded by the public and the media for his unprecedented feat of aviation skill, an investigation was unfolding that threatened to destroy his reputation and his career. Tom Hanks underplays Sullenburger but in so doing he brings out the multi-layered human qualities in the man. This is about a man who has 42 years of flying experience and he knows the aircraft like it is the back of his hand. Here is a man who does his job to the best of his abilities and he does it well. He will tell you he is not a hero but simply a man who is just doing his job. From a man with no time he becomes the man of all time. However, he is shaken to his very core when the doubts start to set in as the NTSB rips apart his heroic maneuver. Is Sullenburger a hero or a fraud? The story rests on Tom Hank's abled shoulders who has built a reputation playing understated and reluctant heroes in Bridge of Spies and Captain Phillips. On first look Hank didn't seem to put on his acting hat, but after a night of rumination his character continues to stay with me. His sullenly insular and taciturn manner displays a fully functioning problem-solver's mind, calculating the probability of survival in that instance when the birds hit the plane engines. Thank goodness he trusts his instincts rather than the computer. Hank isn't the only star in the story. At 86, Eastwood has meticulously crafted an honest story we thought we already knew into a tense drama with little bell and whistle. His unfazed skill in storytelling is assured and Sully definitely belongs to the top tier of his pantheon of good movies that include Unforgiven and Million Dollar Baby. In Eastwood's hands, the film flies above the usual biopic tropes and it feels like a homage to a modest man who rose to an extraordinary occasion and a salute to professionalism. It is a wonder the story doesn't carry an ounce of jingoism and it is a superb amalgam of the loud and the silence and the human elements of a near air disaster. The final star is definitely the plane crash. For a home-theatre enthusiast, the visuals and sonics are a feast for the senses. We get to see the crash and its aftermath from every physical and emotional angle. I can't remember the last time I see a reenactment of a plane crash so visceral and real. This is the closest you will get to experience one without actually being in one. I didn't care much for Eastwood's last directorial effort American Sniper because it carried too many skull-numbing and blatant embellishments, but with Sully he has redeemed himself. This may feel like a straight-forward story but the use of Rashomon-resque plot manipulation transcends the film above the usual biopics that you would forget after a night's sleep. I didn't forget this one today.",
         "I am one of the lucky few who had the opportunity to get an advance premier screening for Sully at AMC IMAX Somerville, Boston ten days prior to the release. This is easily the best movie of 2016. I have been following the Jan 15 controlled ditching incident of US Airways Flight 1549 case for a while. Everything about this case was covered on TV and the hearings are uploaded on YouTube. I have watched nearly 5 hours of the footage on YouTube and I was skeptical before the film whether if it offers us anything new. I was mind-blown; the movie is truly an untold story. The drama, action and intensity is all along. It left me and many audience in tears. It feels realistic in the IMAX edition with great sound effects surrounding you. The screenplay of this film is unique, Client Eastwood is an outstanding director has outdone himself with this gripping tale. Tom hanks has been the heart of the film. The acting was top notch. I am sure his meetings with Chesley SUllenberger must have contributed something in the acting department. Aaron Eckhart as Jeff Skiles also did a great job with his subtle humor and great screen presence. He makes you wanting more of the character. Coming back to the facts, Client Eastwood has left what we all know because of the footages shown in YouTube and the hearings. Overall, great performances, superb screenplay, neat editing and fabulous visual and audio effects make this film easily the best in 2016. Above all, this one has a heart! 9/10",
         "On January 15th 2009, after a bird strike with the loss of two turbines, Captain Chesley \"Sully\" Sullenberger (Tom Hanks) and First Officer Jeff Skiles (Aaron Eckhart) land an Airbus A320 with 155 passengers on the Hudson River saving their lives. Sully is claimed a hero by the press and public; however the official investigation reports that one of the left engines was running at idle and not damaged. And the flight simulator indicates that it would be possible to land at LaGuardia or Teterboro. Sully has to defend himself to the commission; otherwise Sully has to defend his reputation and career showing new evidences of the incident. Will he succeed? \"Sully\" is another great film directed by Clint Eastwood with Tom Hanks in the lead role. These two names would be enough to show the quality of this movie. But the story is excellent, based on the biography of Sully and the screenplay keeps the attention of the viewer until the credits. In addition, there are Aaron Eckhart and Laura Linney in a support role. In the end, \"Sully\" is a great tribute to the hero of the Hudson River. Mt vote is eight. Title (Brazil): \"Sully: O Heri do Rio Hudson\" (\"Sully: the Hero of the Hudson River\")",
         "It was an aviation event the likes of which few, if any, in the world could ever recall happening. On January 15, 2009, US Airways Flight 1549, bound from New York's LaGuardia International Airport to Charlotte, North Carolina, was hit by a large flock of birds just thirty seconds after takeoff. The bird strike disabled and damaged both of the jet's engines; and though it managed to keep flight for another three minutes, there was no way it could return to LaGuardia, or make any attempts at an emergency landing at either JFK, Newark, or nearby Teterboro Airport in New Jersey. The flight's captain, Chesley \"Sully\" Sullenberger, made the split-second decision to ditch the aircraft in the Hudson River, rather than risk flying into any buildings. Incredibly, the aircraft, though damaged by the bird strikes and the water landing, stayed afloat long enough for rescue personnel to save the lives of all 155 people on that flight, an operation that took only twenty-four minutes in all. The incident has been into the highly engaging cinematic docudrama SULLY. Based on the book \"Highest Duty\" by Sullenberger and Jeffrey Zaslow, the film, as directed by Clint Eastwood (who some time back traded his acting career for one focused solely on direction, though he had been doing both on and off since 1971's PLAY MISTY FOR ME), focuses in on the pressures that Sullenberger, excellently played by Tom Hanks (as always), underwent in the months following the crash. The media attention was enormous, but it was also highly scrutinizing as well. And in those months, Sullenberger and his co-pilot Jeffrey Skiles (Aaron Eckhart) went before a seemingly endless battery of hearings conducted by both the Federal Aviation Administration and the National Transpiration Safety Board as to whether Sullenberger's judgment on that day was sound, given that flight simulations supposedly had shown that the plane could have accomplished either one of the four scenarios (return to LaGuardia; landing at JFK; Newark; or Teterboro) while achieving the same result that Hanks and Eckhart had achieved. But in the testimony the two men give, Hanks argues that the basic human element was totally left out of those scenarios. From the moment the bird strikes happened until US Airways 1549 ditched into the Hudson River, there were only 208 seconds (three minutes and twenty-eight seconds); and in that time, trying to fly the disabled craft onto a dry runway was totally unrealistic and could have resulted in the deaths of all onboard and even more on the ground. Since restaging the actual saga of Flight 1549 would be a matter of getting all the details right, helped out by Sullenberger's own book and his four decades worth of flight experience, it was really up to Eastwood's direction, and Hanks' ability to underplay, to get into the mindset of \"Sully\" as he dealt with all the media and government attention that he, his wife (Laura Linney), and Eckhart went through in those months following what the media had deemed the \"Miracle On The Hudson.\" Hanks deftly shows the struggles that Sullenberger faced, via flashbacks to that cold wintry day in the skies over the Big Apple, with respect to what he could have done differently (or what both the media and the government investigators think he could have done differently). But at no time during the actual FAA/NTSB hearings did Sully ever lose his cool and his composure. He merely pointed out that the human element needed to be taken into consideration, not just what some alternate computer simulation said could have been done, to facilitate the saving of everyone on Flight 1549; and the playback of the flight voice recorders clears up any questions as to the judgment and veracity behind Sully's decisions. That this saga, which, like 1995's APOLLO 13 (which also starred Hanks) and 2015's THE 33, had a hugely successful outcome, should have been made into a movie probably shouldn't surprise anyone. But just as importantly, and also just like those films, SULLY, thanks to Hanks' usual great Everyman portrayal of Sullenberger, the kind of heroism on display is that of common people, including Hanks, his crew, his wife, the passengers, and the rescue personnel of New York City, and not just some comic-book, super-patriotic depiction of heroism that too much of Hollywood has been about in the 21st century. Nothing about the saga of US Airways Flight 1549, or the resulting Miracle On The Hudson, was cut-and-dried; it was reality, and Eastwood and Hanks should both be commended for making it that way, and successfully so.",
         "First, the film itself: * technically perfect. What Clint Eastwood shares with Ron Howard is that they are both actors-turned-directors who consistently make technically perfect films. (Howard, on the other hand, was never voted \"sexiest man alive\" in his acting career. Just a trivia point...) * what they also share is a penchant for taking larger-than-life people and literally making them much-larger-than-life on the big screen. After this, you will feel like you have known Sully as long as his family. * in the presence of such directorial talent, it is easy to overlook the casting choices. In this case, I suggest that Hanks may not get the credit he is due. This may be the best performance of his career. He sets a deer-in-the-headlights tone early; and by mid-movie, the viewer starts to feel as paranoid as his character. Amazing performance. * recommended for multiple reasons, not the least of which is that it is one of the best films of the year. And now the esoteric part of the review: * have a friend, a university professor, who once explained to me, at some length, that the #1 most \"unnatural\" event in life is an MRI scan. You are placed immobile in a life-size cassette and then inserted into an appliance that bombards you with EM waves while deafening you with noise unlike you have ever heard before. Like a baby, you are completely dependent on outside help, and, if the machine failed, it is far from certain you could escape on your own. Yet this is a part of our culture, and the common wisdom is we should be grateful the tech exists in the first place. * the second most un-natural event in our culture? Air travel, he said. (You can do the comparisons on your own.) * the kicker is that my friend ended his dissertation by mentioning there are \"standing\" MRIs which do the same job and are more comfortable but expensive, so many hospitals and clinics avoid them. We are, after all, a society that is all about money. * watching the people leave the plane in the film I remembered my friend's strong views. A century ago, air travel was a very different experience. If you think about it, as is the case with the MRI, it is really all about the money.",
         "I think Clint Eastwood is very talented director and Tom Hanks is easily my favorite actor. He's just good in everything. That being said, I was going to wait to rent this movie because the subject didn't appeal to me very much. Ended up at the theater with a group of friends who wanted to see it, so that's what we saw. Put simply, it was just OK. Tom Hanks is always good (in my opinion) and that was still the case. He did really well and might get awards consideration. I don't think he reached the heights of his performances in Philadelphia, Cast Away, Forrest Gump, or Saving Private Ryan or even another bio-pic, Captain Phillips. He was very good and made the movie watchable. Aaron Eckhart was also pretty good. My problem with the acting is that I don't feel those characters would be very difficult to portray, so although they did a good job, it isn't impressive per se. I am all for creative license, but I think the choice for the antagonists in this film is borderline slander given how actual events panned out. That's all I will say about that. The plot honestly doesn't have much going for it. We already know how the flight ends and thus lose a great deal of dramatic suspense. Eastwood tries to work around this with how he structured the story, but it just felt forced. Three separate times, I believe, we end up in a flashback of the flight in question and it does not add anything to the story. It quickly grows old. I mean, technically, this film is impeccable. The editing, the cinematography, etc. Clint Eastwood knows how to shoot a movie. So I don't want to knock it too hard. I just feel like it is pretty forgettable. 6 stars is my standard rating for a movie that is well made, but I just didn't really care about. I do have to say that Aaron Eckhart's mustache is the star of the movie.",
         "Let me start off by saying that the crash and rescue scenes are very touching, the use of music very effective. But I could not help but think during the whole movie \"Why do I care if he made a mistake or not?\". The trailer pretty much gives you everything you will find out about the character Sully - there is little character development, I see no reason to sympathise with him, nor was I given any reason to understand what \"struggle\" he was going through - the phone conversations with his wife seem like an afterthought - we don't know what exactly are their family issues. The wife mentions losing a house - but there is no context. The daughters are never present on camera - why is Sully away from home and seem to have a strained/detached relationship with his family? Almost scene almost feels like they are created for a sake of it. Why the hotel scene when the only thing they do there is to say they're tired and then go out? For the large investigation committee present on screen, only two people have a voice. And their animosity towards the pilots are very contrived - only one reason was revealed in the causal chat between the two pilots \"insurance\". And after Sully raised the point about human reaction time - there is this sudden magical change in attitude of the two people - so drastic that the women who wanted to add a sentimentalist personal note to the pilots. Everything just feels so contrived, artificial - emotions just don't add up or make sense. The context is not clear. Given that we all know that no one dies in the incident, the movie failed to make me want to care about Sully and his reputation, given how little I know about him. If you're an American, I see the appeal of the crash and rescue scene, but other than that I don't see why this movie deserves the acclaim it received.",
         "There's obviously a lot of research and accuracy of facts that need to be considered when making a film out of a real life incident. Clint Eastwood once again shows he knows what he's doing when it comes to sitting in the directors chair. January 15th, 2009, Captain Chesley \"Sully\" Sullenberger landed an Airbus A320 in the Hudson River after it suffered dual engine failures from a bird strike. What he endures following the incident is a scathing investigation team hell bent on showing him he made a mistake and he could have in fact turned the plane around and landed it safely on one of the many runways available to him in New York. Tom Hanks, as always, plays a solid role and character and a very believable Aircraft pilot, although i felt at times he could have shown just a little more emotion in certain spots. Aaron Eckhart and Anna Gunn made good additions to the cast fitting into their roles nicely. The film itself, jumps all over the place, it starts straight away with a nightmare from our hero. we see the timeline of events is post- incident, then eventually goes back to the beginning of the flight before Sully even steps foot on the plane. I wasn't expecting the film to be structured this way and found it kind of annoying at first, but it doesn't at all affect the pacing. Clocking in at just an hour and a half, Sully is a good hero flick depicting the events of January 15th, 2009, because we learn everything we need to know in just that short space of time. Nothing feels overdone or over dramatized and I walked out of the cinema feeling thoroughly satisfied with what Eastwood managed to do with this story. Really good stuff! Fox.",
         "Clint Eastwood, his political views aside, might be wise to stick with comedy, like Space Cowboys (since he's too old to play Dirty Harry anymore), and leave the directing to better people. Are there any left in Hollywood? I realize that this movie was not meant to be a documentary, which is a genre that I often enjoy, and I also realize that Hollywood has to do what is best for their revenue, which often means sensationalizing \"true stories\", (Like the movie Race the Sun, about a good friend of mine, but almost totally fictitious) but we're talking about the Miracle on the Hudson here, it's sensational as it is. Granted, the intensity only lasted for 208 seconds (plus another minute or two to get out of the plane), but there is sooo much of the story that this movie could have told, but didn't, like the rescue, background of those involved, etc. All the confusing bouncing back and forth in the timeline, all of the distortion of the events, were beneath Tom Hanks acting abilities. And the portrayal of the NTSB was pure fiction. So much so, that they spoke out as soon as they heard about the movie. Search: bloomberg crash investigators pan their portrayal I still give the movie 4 stars, because Tom Hanks played his roll well (and the other actors tried, especially Aaron Eckhart), although Tom's heart didn't seem to be in this one. And if you don't care about accuracy, it was an OK movie. It's worth seeing once, I guess, with a grain of salt (or a mine), but unlike many movies in the same \"True Story\" genre, I doubt I'll watch this one more than once.",
         "Eastwood's directorial efforts are undeniably skillful dramas full of human resilience. Sully is no different, and may be his best in years. For some, that may be great news; for me, that's not saying much. Completely lacking in dramatic subtlety, Sully still somehow feels oddly distant and cold. On the other hand, its non-scifi-action-superhero-franchise thrills and intrigue are definitely a welcome reprieve after a long summer. Like an airline bag of peanuts, Sully's far from a delicious meal, yet it certainly helps pass the time. It's the harrowing true-story of a commercial-pilot-turned-national-hero successfully landing a plane on the Hudson River, saving everyone on board and potentially hundreds of NYC citizens. It's a stoic movie about a stoic man who is thrust into excitement. Playing the titular \"Stoic\"\u0085uh, I mean \"Sully\"\u0085is Hanks, who has taken a step-down in intensity, complexity and effectiveness from his other real-life-hero-on-the-water role in Captain Phillips. Instead of studying the psychology of an every-man experiencing sudden stardom through immense trauma, it hits fairly predictable biopic beats with on-the-nose and corny dialogue and performances. Luckily, the centerpiece plane crash and subsequent rescue is pretty fantastic. The great mixture of high thrills and drama told with grounded realism gives it a surprisingly honest and non-glorified portrayal. It's no accident this was released on 9/11, as that horrendous day played such an integral part in what made Sully such a beloved figure. People in NY buildings watching a plane fly low through their city, followed by the familiar humanity in the rescue boats, it's hard not to be moved. Those beautiful moments propel an otherwise bland movie that your grandparents will surely love.",
         "Boring. Very, very dull. Before anyone starts questioning anything, there were advance screenings at the local cinema, that's why I saw it early. Moving on. Who thought making this story into a film was a good idea? An event happened, everyone did their jobs, nothing went wrong. Why all the drama? Even the film just feels like a news story of the week type thing. I didn't know that much about this story so I went in hoping for more insight, but I learnt nothing. I knew going in that the plane crashed into the Hudson and the pilot did a good job. The film offers nothing beyond that. It is competently directed, as expected by Eastwood. I'm a little sick of the colourless visuals, although this wasn't nearly as bland looking as Jersey Boys nor as murky as the awful J Edgar. Hanks just does his usual thing pretty much playing himself in the lead role. There isn't much character development in this film, nor any truly memorable or resonant moments. The film lacks insight into the characters, I feel as if I could have had the same experience just reading a newspaper article based on this event. It's incredibly dry. I thought Flight with Denzel Washington was a very underwhelming film. And this was a bad version of that. Let that sink in for a little. At least there we had the story of him overcoming alcoholism. Eastwood really needs to pick films based on more interesting material, as he did until around 2008. It's pretty surprising to see such lacklustre output after films like Gran Torino, Letters From Iwo Jima, and Changeling. You know they're running low on material when they show the crash twice from the same perspective. I have no clue what Eastwood was going for there. Very strange. I'm sorry this review was so short - I just don't have much to say about this film.",
         "Sully Often biographies takes their time, mostly more than 2 hours or so but this one seems to be to the point and not far fetched, hats off to the editor. Sully brews a soft hearted characters through rough series of events which probably is the only reason why you root for the protagonist from the first frame of the movie; that and of course blend in by excellent execution and Tom Hanks. Clint Eastwood as always justifies each and every character and gives them enough space and range (even the passengers) holding the bits and pieces of the movie with the emotion that comes off it. Tom Hanks is as always magnificent in it and is supported strongly by Aaron through out the course of it. Sully's strength is its runtime which is short and to the point but the problem is that the material isn't sufficient for even that amount of time cornering the feature to rely only upon the performance by the actors and the final act of the interrogation which is the highlight of it.",
         "Who cares? That's the question I asked about halfway through Sully. First off, it's as predictable a story there is. It only occurred a few years ago and in the first ten minutes, it's confirmed the story is going exactly where you thought: there's no surprises. For entertainment's sake, Eastwood effectively has to throw in a dream sequence where the plane crashes into a building before Hanks wakes up. Plane crash movies have also been overdone. Wasn't Flight just a few years ago? It was much more compelling and more unpredictable. But then there's just been so many flight films. The one with Liam Neeson, the Grey where the plane crashes, and too many more to name. The thing about them though is at least they were about more than a predictable plane landing. Hanks is, well, Hanks. He's not Sully, and is far removed from his Oscar caliber wins for Forrest Gump and Philadelphia. Wow, look at him jog in those scenes! He's decent, but no way should he beat out Andrew Garfield for Hacksaw Ridge. Speaking of Hacksaw Ridge, another biopic true story this year, it actually has something to say and a reason behind it. There's no way Sully should win a nomination over it in any competing category (voters take note). It's not a bad film, but is incredibly \"run on the mill\", and like I thought before watching it, I still don't know why this was made into a big movie. It would've worked fine on Lifetime. The final half hour exits the clichs and saves it. 5.5/10",
         "For 208 seconds, Sully is saving the lives of all 155 souls aboard Us Airway Flight 1549 when he undertakes an emergency water landing in the Hudson River in January of 2009. He emerges a hero at a time when the U.S economy was in the crapper due largely to the actions of many greedy short-sighted men making horrible decisions with your money, and heroes were at a premium. The question is: how does this translate to a feature length movie? This can't stretch out two hours. You need drama, you need conflict, so how is this done? The conflict at the heart of the movie is one that pits humanity versus the computer. Or human error versus those that second guess. Or those that do are criticized by those who don't. For according to computer simulations, done in non-life or death situations, Sully could have managed to land the plane on a runway, at an airport, and not have it become a total loss in the Hudson River. And it is because of this that the authorities investigating the crash (just doing their jobs) try to sully the heroic act of Sully (sorry, bad pun.). We know how it ends, we know where it's going, and for what it's worth, Captain Chesley Sullenberger is without a doubt a hero of the highest degree. The inspiration that his cool-headedness under enormous pressure provided Americans is incalculable. I just wish the film had been able to communicate that a little better. I wanted there to be a resounding victory, a moment where you could cheer for the good guys. Unfortunately, the closest we came to this was the moment where Sully (played well by Tom Hanks, not my favorite actor but what can you do?) after proving his point about human speed and reaction time, says \"DO you need any more tests?\" I miss the days when Tom Hanks was not such a serious actor. But the fact that he plays the part without the audience overly thinking about the fact that this is TOM HANKS is a tribute to his talent. Eckhart does a great job as his co-pilot and Laura Linney is always great, though it would be better if she had more to do than talk to Sully on the phone. Overall, in terms of airplane related movies, I'd put \"Sully\" somewhere near \"Flight\" but not as good as \"Flight 93.\" Or even \"Airplane!\" But it's still good.",
         "Sully, 2016 *Spoiler/plot- A almost documentary like bio-pic about the events around the passenger plane emergency landing due to bird strikes in both engines that landed the aircraft in the Hudson River off New York City under the capable hands of Captain Sullinberger and his first officer and flight staff. *Special Stars- Tom Hanks, Aaron Eckhart. DIR-Clint Eastwood. *Theme- Computer simulations are often not correct in finding true results without including the unknown the human factor and actual emergency timing. *Trivia/location/goofs- Most shot in and around Hudson River front near New York City. *Emotion- A interesting story to tell about a potentially large scale airline disaster in New Your and the Eastern seaboard post the 9-11 attacks. The film was more like a news story than watching an experiment in dramatic cinema. That caused the film to be a slight disappointment. *Based On- The events of the 'Miracle on the Hudson\" news event during that time.",
         "The problem with the movie \"Sully\" is that it's about 208 seconds of action, and we all know in advance that he successfully landed the plane with no loss of life. The movie starts off by telling the audience that. So the only 'tension' in the movie is whether Capt. Sully is going to go from hero to villain if it's decided by the accident investigators that his decision to go for the Hudson rather than one of the nearby airports was the safer decision or not. Unfortunately, because the movie is based on Sully's own version of events, it looks at the everything from his point of view alone. If there was some background provided for some of the passengers, the audience might be a little more invested in the survival of everyone onboard. The movie's just over 90 minutes long, basically because there wasn't enough to pad it out any further. It's well acted, but that's the only thing going for it. The real event was much more thrilling.",
         "This film just didn't seem credible from the very beginning. Rule number one in screen writing is \"show, don't tell\". Yet the only thing Captain Sully, or anyone else for that matter, is talking about is their feelings. It felt like I was watching a live action Disney Channel TV-movie with the obvious, over-acting bad guys, that are coming after the morally strong and extremely likable good guy for \"no reason\". They want us to root for Sully so bad, that they compromise the integrity of the film. Why does it seem like the two investigators hate Sully? Why do they want to crush him? And suddenly, after realizing the painfully obvious (that a human takes longer to think and execute than a computer), they love him and give him praise in a personal note. It just doesn't make sense. Every single piece of dialog in this film is overly pathos garbage. I found my self turning in my seat from the cringe worthiness. It's clear that they wanted me to be moved by this film. They wanted it to portray humanity, and they might have succeeded; had the writer not been Todd Komarnicki, who did a job comparable to that of an intern staff writer on the Disney Channel.",
         "i think an 8th grader wrote this script. the bottom line is the entire \"conflict\" in this story is that the government agencies investigated the water landing. ummmmm...yeah. that is their job. the dialogue...wow....poor. the action scenes were OK, but the sound track was too loud and offensive. Look, make movies that people want to see. it is not really that difficult. there were probably a lot of stories around the people on the plane that went untold. we have all matured a little beyond the evil conspiracy by the big bad government plots. they are boring. tired. old. Somewhat like the director. don't waste your money. i only went because my in laws wanted to see it.",
         "The film started off OK but as the story developed, if was very slow and boring. I did watch it to the end because I always likes to see how the underdog beats the powerful opposition which, in this case, were investigators who had already made up their minds that the two pilots were 'guilty'. However, in the final part of the film, I found that the woman investigator's actions wrong and, IMO, she and her colleagues should have been investigated for ignorance and contempt. Why??? Well had Sully not questioned the number of times the pilots practiced their run, the investigation would have found them guilty. However, because Sully did question this, the simulator was rerun with new parameters and the pilots were then found to have acted correctly.... WHICH brings to me to my point. The investigator (Anna Gunn) then had the nerve and audacity to say that she had never met a pilot like Sully, his actions were heroic and so on. So either her views changed within about 30 seconds (which I severely doubt), or she knew he was heroic from the beginning but continued along her path of scapegoating etc. with her other investigator colleagues. So if the did indeed say those words then she/they should be investigated and if it was just artistic Hollywood licence, then it was really OTT."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": [
         "Flashlight Films",
         "Kennedy/Marshall Company, The",
         "Malpaso Productions"
      ],
      "summaries": [
         "On Thursday, January 15th, 2009, the world witnessed the \"Miracle on the Hudson\" when Captain Chesley Sullenberger, nicknamed \"Sully\", glided his disabled plane onto the frigid waters of the Hudson River, saving the lives of all 155 aboard. However, even as Sully was being heralded by the public and the media for his unprecedented feat of aviation skill, an investigation was unfolding that threatened to destroy his reputation and his career.",
         "On January 15. 2009, flight 1549 left New York but shortly after taking off there's an accident that wrecks the plane's engines; they were told to return to the airport. But the Captain Chesley Sullenberger whose friends call him Sully, decides that the plane won't make it to the airport so he chooses to land in the Hudson River. And even when none of the passengers was seriously injured, Sully finds himself under intense scrutiny by the NTSB, whose investigation reveals that the plane could have made it to the airport and one of the engines was still working. Sully still maintains the engines were out and if they tried to go to the airport they would have crashed.",
         "On January 15th 2009, after a bird strike with the loss of two turbines, Captain Chesley \"Sully\" Sullenberger and First Officer Jeff Skiles land an Airbus A320 with 155 passengers on the Hudson River saving their lives. Sully is claimed a hero by the press and public; however the official investigation reports that one of the left engines was running at idle and not damaged. And the flight simulator indicates that it would be possible to land at LaGuardia or Teterboro. Sully has to defend himself to the commission; otherwise Sully has to defend his reputation and career showing new evidences of the incident. Will he succeed?",
         "The Miracle on the Hudson, that is Captain Chesley \"Sully\" Sullenberger landing his damaged jet plane on the Hudson River and saving all 155 souls on board from a horrible fate, is seen as an incredible act of heroism from the dedicated pilot. However the National Transportation Safety Board seeks to ruin Sully's career by claiming the fact that his jet plane still had enough altitude and thrust to return to a safe airport in NYC. Will Sully be adored as a hero or a fraud?",
         "On 15 January 2009, US Airways Flight 1549 lost both engines shortly after takeoff. Thanks to the experience and skill of its captain, Captain Chesley \"Sully\" Sullenberger, all 155 passengers and crew survived when the plane landed on the Hudson River. This is the story of that incident, and its aftermath.",
         "The story of Chesley Sullenberger, an American pilot who became a hero after landing his damaged plane on the Hudson River in order to save the flight's passengers and crew."
      ],
      "budget": 60000000
   },
   "movielensId": 160980,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-09-07",
      "dvdReleaseDate": null,
      "directors": ["Clint Eastwood"],
      "runtime": 96,
      "movieId": 160980,
      "title": "Sully",
      "mpaa": "PG-13",
      "actors": [
         "Tom Hanks",
         "Aaron Eckhart",
         "Laura Linney",
         "Anna Gunn",
         "Autumn Reeser",
         "Holt McCallany",
         "Mike O'Malley",
         "Jamey Sheridan",
         "Jerry Ferrara",
         "Molly Hagan",
         "Max Adler",
         "Sam Huntington",
         "Wayne Bastrup",
         "Valerie Mahaffey",
         "Jeff Kober",
         "Chris Bauer",
         "Katie Couric",
         "Michael Rapaport",
         "Vincent Lombardi",
         "Cooper Thornton",
         "Noelle Fink",
         "Doris McCarthy",
         "Purva Bedi",
         "Christopher Curry",
         "Grant Roberts",
         "Graham Sibley",
         "Ann Cusack",
         "Patch Darragh",
         "Shaun Rey",
         "Shane P. Allen",
         "Justin Michael Woods",
         "Tommy McInnis",
         "Kyle Julian Graham",
         "Marc Chouen",
         "Jane Gabbert",
         "Lynn Marocola",
         "Blake Jones",
         "Kamron Leal",
         "Laura Lundy Wheale",
         "Michael Joseph Donlan",
         "Kelly L. Moran"
      ],
      "imdbMovieId": "3263904",
      "originalTitle": "Sully",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": [
         "mjKEXxO2KNE",
         "OsINvu5FYKg",
         "SJJCb7LnFpk",
         "6Tbkbx4Hz8Q"
      ],
      "plotSummary": "On 15 January 2009, the world witnessed the 'Miracle on the Hudson' when Captain 'Sully' Sullenberger glided his disabled plane onto the frigid waters of the Hudson River, saving the lives of all 155 aboard. However, even as Sully was being heralded by the public and the media for his unprecedented feat of aviation skill, an investigation was unfolding that threatened to destroy his reputation and career.",
      "tmdbMovieId": 363676,
      "avgRating": 3.77031,
      "releaseYear": "2016",
      "numRatings": 1391,
      "posterPath": "/h6O5OE3ueRVdCc7V7cwTiQocI7D.jpg"
   }
}