{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dc comics",
            "id": 849
         },
         {
            "name": "carnival",
            "id": 3473
         },
         {
            "name": "psychopath",
            "id": 6259
         },
         {
            "name": "joker",
            "id": 9537
         },
         {
            "name": "superhero",
            "id": 9715
         },
         {
            "name": "based on comic",
            "id": 9717
         },
         {
            "name": "descent into madness",
            "id": 11323
         },
         {
            "name": "torture",
            "id": 13006
         },
         {
            "name": "cruelty",
            "id": 14624
         },
         {
            "name": "justice",
            "id": 15108
         },
         {
            "name": "super power",
            "id": 33637
         },
         {
            "name": "dark",
            "id": 33783
         },
         {
            "name": "madness",
            "id": 41410
         },
         {
            "name": "batgirl",
            "id": 224298
         }
      ],
      "imdb_id": "tt4853102",
      "video": false,
      "title": "Batman: The Killing Joke",
      "recommendations": [
         366924,
         242643,
         379291,
         408220,
         123025,
         40662,
         142061,
         321528,
         297556,
         76589,
         183011,
         323027,
         251519,
         217993,
         16234,
         69735,
         45162,
         103269,
         14919,
         22855
      ],
      "backdrop_path": "/iYrE2zV1DfZ3l7Lh4frHzNwFncq.jpg",
      "revenue": 3775000,
      "reviews": [
         {
            "author": "Austin Singleton",
            "id": "57ab3aa992514110e400232c",
            "content": "Not even the voice acting could save this movie. Check out my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews/the-killing-joke-movie-review",
            "url": "https://www.themoviedb.org/review/57ab3aa992514110e400232c"
         },
         {
            "author": "Gimly",
            "id": "57c93ed7c3a3687ca90000fa",
            "content": "Shares the few weaknesses of the short comic it is based on, but adds a bunch of its own new weaknesses to try and get it up to a theatrical runtime and justify its cinema release.\r\n\r\nI think part of the reason the reception for _The Killing Joke_ has been so overwhelmingly negative is that the expectations were so high going in. But that wasn't without cause. It sees the long awaited return of both Kevin Conroy and Mark Hamill to their famed DC roles, and the comic it's based on is widely regarded as one of the better stories ever published by the company. And of these lofty expectations, _The Killing Joke_ falls short.\r\n\r\nHamill is great, and Kevin Conroy usually is as well. There are a couple of occasions that the latter slipped though. I don't know if he's rusty or just didn't care, but his voice performance is not 100%. The story essentially meets that of its source material, but rather than expand the existing story, they chose to awkwardly force an entirely different one in beforehand, to the point that this is essentially two episodes of two different shows, rather than a single cohesive movie.\r\n\r\n_The Killing Joke_ is a little gross and is not the return to form for DC Animation that we all had hoped it would be, but the final sequence is fantastic and I don't know that the movie overall deserves quite as much vitriol as it has had.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._",
            "url": "https://www.themoviedb.org/review/57c93ed7c3a3687ca90000fa"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bruce Wayne / Batman (voice)",
               "gender": 2,
               "credit_id": "56bde13b925141734d003689",
               "name": "Kevin Conroy",
               "profile_path": "/4MVApMiARrecuVjTCPfi6Z7biLW.jpg",
               "id": 34947,
               "order": 0
            },
            {
               "cast_id": 0,
               "character": "The Joker (voice)",
               "gender": 2,
               "credit_id": "56bde12c925141734d003684",
               "name": "Mark Hamill",
               "profile_path": "/fk8OfdReNltKZqOk2TZgkofCUFq.jpg",
               "id": 2,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Barbara Gordon / Batgirl (voice)",
               "gender": 1,
               "credit_id": "57033eb6c3a36822b800028c",
               "name": "Tara Strong",
               "profile_path": "/rFUZnJ4BaSaQVKW734xnUHSN9pm.jpg",
               "id": 15762,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Commissioner James Gordon (voice)",
               "gender": 2,
               "credit_id": "57033ec1c3a36822b200022f",
               "name": "Ray Wise",
               "profile_path": "/z1EXC8gYfFddC010e9YK5kI5NKC.jpg",
               "id": 6719,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Detective Harvey Bullock (voice)",
               "gender": 2,
               "credit_id": "5793e78e92514156e600269f",
               "name": "Robin Atkin Downes",
               "profile_path": "/pCnIQMMgrFc4hBOE4LJDdebqRZ4.jpg",
               "id": 130081,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Alfred Pennyworth (voice)",
               "gender": 2,
               "credit_id": "5793e7adc3a36828a600dad8",
               "name": "Brian George",
               "profile_path": "/g0bVyXsHDhRhd5WuQwRQDv2TkG9.jpg",
               "id": 58511,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Paris (voice)",
               "gender": 2,
               "credit_id": "5793e7c39251410d1200ef60",
               "name": "Maury Sterling",
               "profile_path": "/rSkzuJePHnnUSqkdC0rDv6GgTWe.jpg",
               "id": 65726,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Maroni (voice)",
               "gender": 2,
               "credit_id": "5793e7e3c3a368631c00cbe2",
               "name": "Rick D. Wasserman",
               "profile_path": null,
               "id": 106774,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Francesco (voice)",
               "gender": 0,
               "credit_id": "5793e814c3a36862cd00b962",
               "name": "John DiMaggio",
               "profile_path": "/4gEy7tWkh95mgfsiHmTuFQkeRkx.jpg",
               "id": 31531,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Carny Owner (voice)",
               "gender": 2,
               "credit_id": "5793e85ac3a36828a600db4e",
               "name": "Fred Tatasciore",
               "profile_path": "/lNe4zn9fJ302GehQVaFk5BNcGGM.jpg",
               "id": 60279,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5704429d9251415bb9000d94",
               "name": "Sam Liu",
               "profile_path": "/6YLCBYqgILXZNpHql8xxadZldXq.jpg",
               "id": 90367,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "570467e69251417dae0000f4",
               "name": "Sam Register",
               "profile_path": null,
               "id": 141043,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570467f89251417dae0000fd",
               "name": "Bruce Timm",
               "profile_path": "/2MaucKEFexM0MMcpsHHbDtDVZbk.jpg",
               "id": 34934,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "576fca11c3a3680a35006057",
               "name": "Brian Azzarello",
               "profile_path": null,
               "id": 113915,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "576fca47c3a36809d6005be7",
               "name": "Bob Kane",
               "profile_path": "/vuXwrlqaUydA4t5SFVdQkK9KsZL.jpg",
               "id": 3794,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "576fca67925141767b000fe9",
               "name": "Bill Finger",
               "profile_path": "/8YNi67GimJjHTmXR3nUhkEJGV95.jpg",
               "id": 198034,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "576fcab892514176e6001037",
               "name": "Kristopher Carter",
               "profile_path": null,
               "id": 497701,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "576fcacdc3a36847dd00675f",
               "name": "Michael McCuistion",
               "profile_path": null,
               "id": 1521139,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "576fcadfc3a3680a350060d6",
               "name": "Lolita Ritmanis",
               "profile_path": null,
               "id": 1376311,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "576fcaf3925141765700100f",
               "name": "Christopher D. Lozinski",
               "profile_path": null,
               "id": 1033619,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "576fcb04c3a3680a79005d1a",
               "name": "Wes Gleason",
               "profile_path": null,
               "id": 1641642,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "576fcb2c92514179360063da",
               "name": "Robert Hargreaves",
               "profile_path": null,
               "id": 1172888,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 2,
               "credit_id": "5793ea32c3a368457f00062a",
               "name": "Alan Moore",
               "profile_path": null,
               "id": 11449,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5793ea5ec3a368457f000642",
               "name": "Brian Bolland",
               "profile_path": null,
               "id": 1655167,
               "department": "Crew",
               "job": "Graphic Novel Illustrator"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 10.616768,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 382322,
      "vote_count": 618,
      "budget": 3500000,
      "overview": "As Batman hunts for the escaped Joker, the Clown Prince of Crime attacks the Gordon family to prove a diabolical point mirroring his own fall into madness. Based on the graphic novel by Alan Moore and Brian Bolland.",
      "similar": [
         155,
         272,
         30061,
         251519,
         14011,
         65291,
         40662,
         379291,
         13640,
         414,
         263115,
         49026,
         324849,
         1452,
         1924,
         141052,
         49521,
         209112,
         297762,
         69735
      ],
      "original_title": "Batman: The Killing Joke",
      "runtime": 72,
      "poster_path": "/zm0ODjtfJfJW0W269LqsQl5OhJ8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/l5zW8jjmQOCx2dFmvnmbYmqoBmL.png",
            "name": "Warner Bros. Animation",
            "id": 2785,
            "origin_country": "US"
         },
         {
            "logo_path": "/2Tc1P3Ac8M479naPp1kYT3izLS5.png",
            "name": "DC Comics",
            "id": 429,
            "origin_country": "US"
         }
      ],
      "release_date": "2016-07-21",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "The madness begins.",
      "adult": false,
      "homepage": "http://www.dccomics.com/movies",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Sam Liu"],
      "runtime": 76,
      "synopsis": "This animated film starts with Barbara Gordon/Batgirl (voice of Tara Strong) observing Bruce Wayne/Batman (voice of Kevin Conroy) meeting with Commissioner Jim Gordon (voice of Ray Wise). Gordon shone the bat-signal to call Batman due to a robbery in progress. Batman heads off to take care of it while Batgirl pursues the robbers herself. The getaway van is driven by two punks, one among them being Paris Franz (voice of Maury Sterling), nephew of Gotham City's biggest crime lord Carlos Francesco (voice of John DiMaggio). Batman chases the crooks in the Batmobile while Batgirl leaps onto the van. She blows the backdoor open, letting some other criminals shoots at Batman. Paris shoots at Batgirl, causing her to fall off the van. She and Batman end up catching one criminal, but Batman is upset with Batgirl for getting in the way and almost harming herself. Paris and his buddy meet with Francesco. He is pissed at his nephew for Batgirl's intervention, where four of Francesco's men were caught, as well as $100,000. Francesco orders Paris to get the money back, or he'll have him killed. Paris and his goons go to rob a warehouse. Batgirl finds them, which Paris was counting on since he's developed an infatuation with her. He sprays her with knockout gas, but she has enough time to knee him in the groin before hiding out in the vault. Paris and the others get away. After she comes to and the police arrive, Batman meets Batgirl on a rooftop. He expresses his concern for her work on the case and orders her to stay off it. This angers Barbara, making her feel like Batman won't trust her. The criminals are on their boat after a night with some prostitutes. Paris gets a call from Francesco, and when his buddy picks up the phone, he gets shot in the head. Outside the boat are four shooters on a motorboat. Paris and his other cohort make their getaway by rigging the boat to explode as the hitmen board it, killing them all. Paris sends a video message to Batgirl so she can go looking for him. Batman is with her while she watches it. He knows it's a trap, so he tells her to stay off the case. She doesn't listen and follows the clues, leading her to find another phone with a message from Paris. She is led to an apartment where she discovers Francesco's dead body. Two of Francesco's men show up, forcing Batgirl to flee. Batman arrives and starts kicking ass. Batman and Batgirl stand on a rooftop arguing. She is finally pushed over the edge and she begins to attack Batman. He defends himself but is quickly subdued. In the heat of the moment, Batgirl kisses him. She then takes off her cowl and suit, and they start to have sex. This later fills Barbara with regret. The next night, Batgirl calls Batman as he is driving to find Paris. The Batmobile gets hit with an RPG by the docks. Batman ejects himself to safety and is faced by a bunch of crooks. Batgirl shows up on her motorcycle. She finds Paris and beats his face to a bloody pulp, but stops before she kills him. Paris is arrested, but Batgirl realizes what Batman was saying in regards to his concern for her. She meets him as Barbara and tells her she is giving up being Batgirl. A while later, Batman meets with Detective Harvey Bullock (voice of Robin Atkin Downes) at a crime scene where four men have been found dead, all of them with big smiles on their faces. Batman knows this is the work of The Joker (voice of Mark Hamill). He and Bullock go to Arkham Asylum to meet with him in his cell. The Joker appears to be obscured in darkness. Batman tells him that this will end with one of them killing the other. The man doesn't respond and continues stacking playing cards. Batman grabs his hand and sees the man has white powder on his hand. He pulls the man into the light and sees he is not Joker, but a decoy. The real Joker is meeting with another man to buy out an abandoned amusement park for a sinister purpose. We see a flashback of Joker before he became what he is now. He was a struggling comedian tending to his pregnant wife Jeannie (voice of Anna Vocino). The two had been in financial troubles for a while, and he was trying to find a way to support his growing family. Bruce is in the batcave trying to figure out what Joker's motives are. Alfred (Brian George) tells him he can't save everyone. Barbara is with her father in his apartment. She hears a knock at the door, thinking it's a friend of hers. It's The Joker, holding a gun. He shoots Barbara in her abdomen and sends her crashing onto a coffee table in front of Gordon. Two of Joker's men come in and beat Gordon before taking him away. Another flashback shows Pre-Joker meeting with two gangsters at a bar as he tries to come up with some money. The gangsters want him to help them break into the chemical plant where he once worked so that they can pull off a heist at the card company next to it. They show Pre-Joker the mask they want him to wear, which is that of The Red Hood. Two officers find Pre-Joker at the bar and inform him that Jeannie has died in an accident. The man expresses grief and says he has no more reason to go through with the crime. The gangsters give him their condolences but insist that it's too late for him to back out now. Batman finds Barbara at the hospital. The doctor tells him that she will never be able to walk again due to the through-and-through bullet injury to her spine. Bullock also implies to Batman that Joker may have raped her. Barbara wakes up and tells Batman that Joker is trying to prove a point, and that Gordon is \"top of the bill\". Gordon is taken to Joker's amusement park where he is tortured by some of Joker's freak show henchmen. The freaks take Gordon onto a ride through a house of horrors as Joker puts on a performance with the other freaks. Gordon is forced to see pictures of Barbara nude and bloodied, with Joker's intention being to drive Gordon insane. The last flashback shows Pre-Joker and the gangsters getting ready to pull off the heist as Pre-Joker wears Red Hood's mask and cape. They engage in a shootout with security as Batman arrives on the scene. The gangsters die while Pre-Joker is startled by Batman. He trips over his cape and falls into a vat of chemicals. He is swept out through a pipe into the river. Once he gets out, he sees his reflection in a puddle. His skin is bleached white, his lips are red, and his hair is green. His mind then warps into insanity, and he is now The Joker. Batman finds a clue that leads him to the amusement park. He finds Gordon, who remains sane. As Batman heads to pursue Joker, Gordon tells him to capture him \"by the books\" to show that their way works. Batman follows Joker into the funhouse as he fends off the freaks who try to kill Batman. Joker taunts Batman by saying the world isn't worth fighting for and how one bad day can turn anyone insane, as it was one bad day that led Batman into becoming what he is now. The two of them fight until Batman throws himself and Joker out the window. Joker tries to shoot him, but the gun only pops out a \"click bang bang\" sign. Batman tells Joker that he doesn't want either of them to kill each other, and he offers to help him be better. Joker declines, saying it's too late for him. He then starts to tell a joke about two men escaping from a loony bin. After the punchline, both Batman and Joker start laughing together. During the end credits, Barbara is seen in a wheelchair. She goes into her room and onto the computer, where we see the Oracle logo, indicating that she has new work to begin.",
      "writers": [
         "Brian Azzarello",
         "Brian Bolland"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4853102/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTdjZTliODYtNWExMi00NjQ1LWIzN2MtN2Q5NTg5NTk3NzliL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Kevin Conroy",
         "Mark Hamill",
         "Tara Strong"
      ],
      "reviews": [
         "One of the most acclaimed graphic novels of all time has now come to the big screen. Not only is this one of the most acclaimed novels ever but it's one of the most controversial. The story is basically an origin tale for the infamous Batman villain, The Joker. When this movie was initially announced back at the beginning of 2016 there was some serious hype surrounding it. Especially when it received an R rating. One thing that really made me nervous though was how quickly this actually released. Obviously, it could've been in production long before it was announced back at the beginning of the year, but after seeing the film, I don't think that's the case. The first thirty minutes of the film is a kind of prelude involving, mostly, Batgirl. It talks about how she came to quit being said superhero and draws a thread between her and Batman. Now, this story is controversial for a reason. Not only does it explore tough themes but it shows the details of these horrible things. The story in the graphic novel is brutal, uncompromising, and pretty tough to get through. However the film is just the opposite. It tries hard to retell the story seen in the novel, yet any emotional drama is all but lost. This mainly has to do with the length of the film itself. Being only 80 minutes, it's rather short. As I said, the first thirty minutes revolves around Batgirl. And this segment of time is absolutely the worst to sit through. It's tedious, overly long, and so cliché and predictable that there's nothing remotely enjoyable. While, this part of the film is undoubtedly the worst from a storytelling standpoint, there are a number of things that remained consistently bad throughout. Most notably was the animation. From a studio like Warner Bros you'd expect some decent art work, but not here. The back drops nor art design is well put together. It's clunky, with no style to be found. It looks like they took the animation from a rough draft of the animated series and colored it in. This issue becomes even more clear whenever it attempts 3D animation. The other blaring issue that continues through the film is the music. Which is completely contrived and formulated to the point of it being so cliché that is, in fact not cliché. As the film ended, a crowd that once cheered for the lights dimming, was left in stunned silence. Not a good stunned silence like you get after watching 'Gone Girl', this type of silence is the kind where people don't know what they just saw. For me, this had to do with the complete lack of any emotional resonance. When it attempts to recreate the power of the novel it fails. It doesn't commit enough to the drama of the story. Even with its R rating it doesn't draw the same toughness the novel does. It lacks the rawness that the novel has to make it's audience queasy. It's not graphic enough to be disturbing and it's not lighthearted enough to be fun. It just bounces from scene to scene with little connecting one to another. The best way to describe it is that it goes from this scene to that scene and than it ends. That's about it. ​This is one film that should have been great. All the pieces are there. It has a great studio behind it, an excellent voice team, and a brilliant story. But it lacks the emotional power that the novel has. Even though it has its R rating it doesn't fully commit to it, or anything for that matter. Without coherent direction and the overall first draft vibe of the film it's hardly the experience we've been lead to believe it is.",
         "I'm not sure how to approach this movie. I wanted to like this movie I really did. I wanted to like everything about it. From its revival of the good old' Batman TAS to the voice actors to the sweeping soundtrack, the polished animation reflecting a dark Art Deco Gothic – whatever the hell you call it – STYLE. Maybe I was asking for too much but perhaps a little story on the side too. Pretty please? That being said, I also slapped a big 'REALISTIC Expectations' sticker over my eyes before watching the screen come alive. I knew this wasn't going to be as good as Batman: The Animated Series. But I was glad to have something reminiscent of that monolith of 1990's animation and storytelling. Boy was I in for a surprise. The core issue of this movie is not the A) story it chose to tell or B) how it told said story but rather C) the juxtaposition of a classic show's established world (including its location, characters and story) with a modern flavor. Telling a new story that kind of breaks the older established world we all fell in love with on the TV screen. Then yes we have the story itself, a dark telling of how the joker became to be, without Warner Bros. censorship. This complicates things a bit. So without further ado, let's go down the list! Issue #1: Old World with new rules that break it. Really jarring, adds a new dimension of sex that was apparently very crucial to the story (or not). Enter strong powerful female figure defined by her sexuality, hit on by every hot criminal she meets, then making kinky love to Batman on rooftops with creepy goblins looking over (\"it's only sex!\") Definitely not a shallow character, no shortage of hot gay library friends and definitely loads of problems like deciding which guy she wants to be with. Let's see what's behind door number one – BATMAN. Who is Batman? In this movie, he's pretty much a Zoltar of lazy story exposition. Says the most obvious things. Has no inner conflict. Has no fears. Has no emotions no feelings yet in the end we are supposed to feel his turmoil in fighting the Joker. Batman ladies and gents, is purely a device in this film. Batgirl was fan-service. And the movie spent a good 40 minutes setting up her love story to Batman when all of this information could've been relayed in a few key scenes! Why didn't this happen? Because the real star of the show got pushed out – the Joker! Wasn't the story about the Joker more than anything? He isn't a witty clever funny man anymore. Now he's just misunderstood and 10x darker than Nolan's version. Although voiced by Hamill, he doesn't even compare to the TAS Joker who lit up the screen. Going to credit this to mediocre writing. Obvious things (90% Batman lines), dumb things (35% Batgirl lines) and unfunny things (75% Joker lines) should not exist. Make your dialogue interesting and worth quoting! These flat characters, the story's misplaced focus on character and conflict arise from the core issues – the new Batman, complete with its sexy fan-service, empty brooding heroes and second-rate comic relief – just cannot exist in this world. A Killing Joke is a story of its own and if it takes time trying to break the Batman TAS, then it should've been in its own world. Dear Mr. Liu, please do not use Batman TAS for anything if you're going to give us something new. Just give us something new. This story could've been its own thing and it could've been great. Issue #2: Show don't tell. Pretty much a copy of the graphic novel panel by panel. Come on spice it up a bit give us different angles, close-ups and MOVEMENT. Show us what animation can do even if it's on a tight budget. Show us the wonder and essence of the world. Make us feel the DESIRE Batgirl has to work with Batman, let us hear the thunder and rain crashing down on everything show us the details that move us emotionally. When we see the Joker from afar talking to the police about his wife, give us those strong visuals that tell the story on their own instead of him flatly saying his wife is dead. Show his loss and his madness. Don't deliver lines at dramatic points. Don't make Batman aware and comment on his meta-role as a foil to the Joker – that's obvious and doesn't need to be in focus (even if in the original). Issue #3: Same story no insights. The Killing Joke is a very dark story and sometimes less is more. The Joker on his tirade fails to truly shock the audience. What he chose to do should've been the true horror of the story and presented as such so it sneaks up slowly on the audience. This could've been accomplished in so many creative ways. It was literally just given to the audience and rather quickly. In closing, it makes me think twice when an older 1993 movie like Batman: Mask of the Phantasm (highly underrated btw) outdoes The Killing Joke as a serious film with some substance to pack and scenes that tell a story on their own. I can't believe I'm saying this but the Joker was downright chilling in Phantasm and I watched that movie as an adult. It's not the inner fanboy leaking but a respect for the art. Watch Phantasm or Batman TAS if you're looking for a mature story that knows what it's doing. They may not have the newest animation or fan-service but it does have characters you'll care about and a story that will touch your soul.",
         "Goddamn it. I really wanted The Killing Joke to be DC Animation's return to greatness. The parts that are actually The Killing Joke are great, but I just can't ignore the first 30 minutes. It felt like a random episode of a completely unrelated Batman TV show. I get that they wanted to make Batgirl more sympathetic and an actual character in the movie, rather than just a plot point, but honestly, who cares? Who gives a crap about Batgirl? She doesn't matter, she's irrelevant to the story. The Killing Joke is supposed to be about Batman's relationship with The Joker. Instead, it felt almost as If Barbara Gordon was the main character. If they didn't want to just do a direct adaptation of the novel because it'd be too short, I get it, but find another way to expand it. But still, like I said, as soon as the actual movie starts, it's great. Hamill and Conroy were obviously great. They stole the show, specially Hamill. I didn't like Commissioner Gordon's voice though, it sounded weird. Overall, good movie, but it should have been great.",
         "OK... I'll be honest: I was waiting something great and I didn't get it. Maybe because of the very high expectations that the movie just couldn't reach. There was a couple of things that bothered me. I think the important part was too short (about 45 minutes), they gave too much emphasis to the Batgirl prologue, I mean, the Joker appeared 30 minutes after the movie initiated, for God sake! Yes, there was some things from that part that I thought were interesting, I'm sure some people will hate them though. I was very uncomfortable with the inconsistency of the art style, sometimes The Joker looked amazing, sometimes... not very good; besides, the animation was very weak in several scenes, I mean like 10 fps and that's unacceptable Mark Hamill and Kevin Conroy's work was the best of the movie, I can't complain about that. It was OK. But they could do it a lot better.",
         "It may seem like this is a high rating given the backlash DC animated The Killing Joke has received, however this is an averaged out rating.  In honesty this isn't a very good movie, despite the fact that when the filmmakers and adapter Brian Azzarello (do I hasten to call him a 'screenwriter' after this one credit?) stick to the original Alan Moore source it's a dark and involving delight. It's what comes before it, how they make it into a \"full movie\" that things fall apart.  This is a schizophrenic experience full of high highs, generic lows and some what the almighty Jesus bloody hell for good measure. And I get what they tried to do or felt they had to do as far as making it a complete experience as a 75 minute film.  Barbara Gordon, aka Batgirl, is more of a plot device in the comic (spoiler? Joker shoots and paralyzed her before kidnapping Commissioner for his amusement park nightmare games), so to flesh out her backstory with Batman is good. On paper.  Actually, not on this paper, as it turns into a half hour story where Batgirl is chasing after a ho-Hum \"charming\" criminal who I don't even recall in the comics (if he was in it he's certainly not memorable) and it's all here to make it a Batgirl story with Batman mostly as the ornery father figure... Which makes that 'thing' that happens between them so jarring; if this was squarely a batman/batgirl story theoretically it could go somewhere )I'm not saying it's a good idea in most any context, again those like Robin or Batgirl are more like the kids to Batman not those he gets uh down n dirty with).  But Azzarello crams it in where it doesn't fit and if anything makes the motivations for what comes in the actual Killing Joke story hamfisted.  Not to mention how it's presented is silly especially given what room is open with an R rating (the first for any Batman film, ironically you could show this to most kids 12 and up and it'd be fine). Despite this troubling and/or just typical Batman/Batgirl story that squanders potential with really delving into backstory the comic hinted at, or because of it, when that second half of the film kicks in to gear and we get the story of the comic it'S presented largely faithfully and the genius and power of that story comes through; the Joker as a 'sympathetic' being with his own origin story which, by the end, is satisfying as its own story and is brilliant as a circumspect narrative from an unreliable storyteller. I may also be a sucker for Hamill as the Joker but how can one not be when he always sinks his teeth in and makes him a real PRESENCE in a room?  Adding to this he creates a good, relatable voice for pre.transformation Joker in the flashbacks and we get drawn in to his story in large part because that voice acting comes through.  The animation is also top notch (as far as the limited budget allows), and some moments in that fun-house/amusement park are shown to be iconic for a reason; if you get any allusions to the Burton 89 Batman there's a reason for that. I think my high rating is due to finding that main story so compelling - what a hero or villain means when they have to face existential questions and how they relate to one another through \"one bad day\" (interestingly though Moore recently says he doesn't like his own work here I find he underrated it, that he got under the skin of these iconic figures to show them as people).  So I  wanted it to be great, and it flirts with being as strong as the first part of the Dark Knight Returns movie or even Mask of the Phantasm.  But that first half hour drags it into a murky, middle feeling where overall you come away saying 'it's alright, I guess,' with an ambiguous ending not landed with the weight that's required either.",
         "When \"The Killing Joke\" is actually about the source material, it's a decent adaptation. It's dialogue-faithful, the tone is good, and really, if they've gotten Conroy and Hamill as the two leads, you know they're taking this seriously. And that infamous scene is incredibly effective. But it's that first half-hour that doesn't work. It's tacked-on and certainly doesn't do Batgirl or Batman any favors (the latter of whom just seems a tad creepy). This is (for better or worse) the Joker's origin story, incendiary though it is, and I can understand why they'd want to flesh out Barbara's character; but it still doesn't work because Batman doesn't recall her horrific fate later on in the movie. She's no longer relevant beyond the shock value. The intentions were there, but it could've been done better. Within this running time, there are 45 minutes of good movie. Skip the first 30 and you don't miss a thing. 6/10",
         "First off, it's great to hear Kevin Conroy, Mark Hamill, Tara Strong and others from the '90s Animated Series reprising their roles. Pity it wasn't with better material. The script is, to put it kindly, uneven - occasional snatches of Moore's original dialogue jarring badly with Brian Azzarello's. This is the biggest problem with this piece. Azzarello writes like Azzarello, and Azzarello's OWN stuff (his crime and mob stories especially) is excellent - but his tinkering with other peoples' stuff is dire. His fleshing out of this story - almost all of the first half the film is an unnecessary prologue which objectifies Barbara Gordon/Batgirl and defines her purely in terms of her relationships with male characters - is unsubtle, and misses the point of the original piece. If I hadn't seen Azzarello's name on the box-cover I might have thought Frank Miller was involved! There is, of course, an element of objectification in the original story, as the brutalised Commissioner Gordon is forced to look at naked images of his paralysed daughter. This was shocking in '80s comics, and is still unsettling and unpleasant...which was rather the point: We should be uncomfortable. We should be outraged. As far as The Joker is concerned Babs IS an object. A means-to-a punchline. Collateral damage. He presents her damaged, naked form to her father BECAUSE it is so wrong that, by his reckoning, it MUST drive Gordon insane. We recognise, though, that the villain's skewed objectification of her is wrong, and, though driven to the edge, Gordon remains sane. It's a messy, brutal plot-twist which outraged many at the time, but it SHOULD outrage us. Setting Babs up as the sex interest of both the Batman (like a sloppy co-ed with a crush on her teacher) and of a disposable Joker- lite villain in the first half of Azzarello's script means that she is objectified by characters and audience alike, and this alters our reading of her as the tale develops.",
         "The complete first half hour was completely unnecessary, it may have intended to add emotional weight to when Barbara got shot, but the studio could have encapsulated that in a much better way. The main antagonist of the film failed to show up until half way through the movie which made the first half utterly boring. In addition, the needless sexualization of Batgirl and her 'special' relationship with Batman was also among the list of unnecessary items that were in this movie, this also contributed to ruining the characterization of Batman. The Joker was on point as one would usually expect. However, in summation the movie fails to capture the magic that the comic presented us with.",
         "I've always thought that The Killing Joke is actually not long enough and not quite suitable enough for big screen. This just proves it. There's a lot of padding to extend the run time. First 20-ish minutes are brand new stuff, not from the comic book. It deals with Barbara and her relationship with Batman. Also, they have sex. Yeah, so, moving on. I guess that new stuff had purpose to extend the run time and maybe add some more character to Barbara, to make the later stuff more impactful. But somehow it (new stuff) becomes totally disconnected from the rest. Again, the comic didn't have that much material to put into an hour plus long movie. So while it does fill the time, it doesn't add much or subtracts from the whole picture. Although, that sex scene was a bit unnecessary. There are few more fillers along the way and they are also in that \"nor adding, nor subtracting anything from the whole\" formula. Ending was a bit weird too. While it will be an eternal debate about \"did Batman strangled Joker or not?\", in the comic, that last page ended perfectly, they both laugh, then they both stop, and you can only \"hear\" incoming cop sirens. Here, similar, only we hear Batman weird laugh extending into fade to end credits. While a small thing, it kinda annoyed me. Also, there's a mid credits stinger, which was also out of place and felt a bit unnecessary. Now, it's nothing new that Alan Moore doesn't want to have anything with transferring his stories to big screen, here they skipped him completely and credited Brian Azzarello for story. I guess he did the best he could to expand the story to fit into an hour and 15 minutes animated feature. Only those fillers were kind of whatever. Voice acting and all that, Mark Hamill, Kevin Conroy, Tara Strong, Nolan North.. all the good stuff about that. Music, also fine. What I want to write a bit more about is animation. Now I'm aware how painful process of animating can be but here we got DC average animation to DVD/BR home feature - bit stiff, not much texture to the world and characters but passable. It could (should) be way better though. Directing was OK but I can't shake the feeling that a bit of quality directing and editing would make this thing a whole lot better. But it's OK. And that's the running theme here - OK. Good but not great. In the end it was just another DC animated straight to DVD/BR feature and not exactly suited for the big screen. I would be OK if they never made this, but I'm OK with this as well but it could be better, as I already said. I expected more, was fine with what I got... but... I expected more dammit.",
         "This movie is awful. As a stand alone movie, it's weak and ineffective. As an adaptation, it's a travesty. What should be a deep, poignant movie that reflects on the nature of good and evil, why we become what we become, whether free will exists and other fascinating themes, becomes a lame action movie full of fan service, bad writing, bad characterization and terrible pacing. This movie is doomed by a complete misunderstanding of what made the comic great, a bad writer and total lack of respect for its characters (especially Barbara Gordon). Everything great about the comic was done poorly or taken out. And all the additions are awful. A fan of the comic will hate it and a newcomer will just wonder why the hell the comic is considered a masterpiece, if this is the story people raved about for 30 years. Animation is decent and voice acting is good, so I gave it a 4/10 out of respect for those things. But this one of the worst things ever produced by DC.",
         "First, It is important to say that I'm not a geek, a huge HQ fan, or anything like that. So, if you want a review done by an expert, this is not the review for you. Otherwise, if you appreciate an honest review you can keep reading. Batman the killing joke is a great adaptation to the screens of a very successful HQ. The humanity that the plot line conveyed to the joker, mainly at the end of the movie, was surprising. This was the high point of the movie for me. His philosophy that states we should embrace the chaos through madness is well built and you can understand his answer to all the randomness around us. At the end of this movie, you will probably even feel bad for the guy. Perhaps, you might even been convinced that, as the joker says, \"we really are just one bad day away from being him\". Ps: English is not my first language, so don't mind the mistakes.",
         "Anti-climatic is my general feeling about the whole movie. After watching the movie I get the idea of it all, but I don't feel like my emotions were driven the right way to emotionally understand it as I watched it. I get that the first part was added to sort of familiarize the audience with Batgirl and get them emotionally involved, so that later on it will be a shock when the Joker shoots her, paralyzes her and sexually assaults her. The emotion the audience feels is what the Joker intends to exploit on Barbara, Gordon and Batman. Tempting them to part ways with their values and sense of justice, and accept rage and madness. Despite that, at the end they find a way to stand strong and prove the Joker they will not be like him. That's all fine with me, I think it's a very powerful Batman tale, but this movie doesn't really make it feel this way. The delivery is not quite right. The movie is R rated, but it has the tone of a PG-13 cartoon with the sudden bursts of the dark R rated elements that leave you not really knowing how to feel about it until you process it for a while. I don't understand why the sex scene between Batman and Batgirl. I'm fine with it. I think it's great if they wanted if they wanted to play out some romance angle between them, but they didn't. After seeing the rest of the movie, there was never any purpose for it at all. I'm thinking they just had it for cheap thrills. I don't like that there is a Joker backstory. I like the way it is left a mystery in The Dark Knight. We all can already imagine all sorts crazy things that could cause such wild madness, and that is better than having it revealed. There really was no need. The nature of his plan is enough to show us things from his perspective, that was the whole point. As I already mentioned, the movie has an anti-climatic PG-13 feel to it, so it took me a little while to process what happened to Barbara, and get my emotions into how horrific it is, but at the end it all plays out as it was not that big of a deal with Batman, Godon, and Barbara. I get that the point of the story is to say \"Don't let those horrible memories destroy the good in you, the joy, and turn you into a man like the Joker\", but I didn't see the process about it in this movie. Like I said, they all played it like it was no big deal, instead of it being something that is hard to cope with, and yet you do, because you must. Batman tells the Joker \"I don't want to kill you\", and I'm thinking: How the fu'ck do you not want to kill him? Batman is all about living with the anger and feelings of revenge, but never actually jumping into the abyss. They said it the beginning of the movie. I understood what they were TRYING to get me to feel and understand from this story, but I don't think they delivered it well for that to happen when I watched it.",
         "I was a fan of the graphic novel, so I will admit that already set a high bar to please me. I would never have considered watching it but for the voice talents of Hamill and Conroy. So I got comfortable and watched, hoping to be 'disturbed.' I was...but not in the manner which I had been expecting. It was FLAT. Like a soda you enjoy left open in a warm room allowed to lose every bubble of carbonation as well as achieve a temperature of lukewarm tepid. My mind wished I could somehow spit it out now. But no... It is there now. Any fond memories of the graphic novel...gone. Replaced with this. Keeping this \"spoiler free\" was extraordinarily easy as it is already a spoiled mire of good talent and incredible source material wasted.",
         "So obviously when i first heard about this movie, i was really pumped, and kept up with updates as it came closer to the release. I've always loved the PG-13 animated Batman movies, and of course I hear about this one's R rating I'm wow this is going to more amazing than any ever before it. So the time finally comes and of course I go to the one night theater showing. Strong start, love it, some good action, funny moments. But then I notice that all the bad guys say \"freaking\" quite often. Was this a prelude to the rest of the movie? Yes. It was. The R rating was a total scam. There's some brief bloody shots, like 2 actual curse words (mild too), an IMPLIED sex scene, an even what was to be considered the most controversial part of the original comic...was completely censored as well. It was PG-13 by my standards. \"The Dark Knight Returns\" and \"Assault on Arkham\" were both PG-13 and had WAYYY more blood, violence and language than this did. (Assault on Arkham also had more sexual scenes and still remained PG-13). It was just really disappointing. The plot was really loose too. When the movie ended I was like...\"wait what?\" There was no climax. The rising action just quickly crashed into the falling action and ended. This just goes to show that not every comic looks good on the big screen. Really the only thing I liked was the fact that Kevin Conroy and Mark Hamill were in it. Would I recommend it? It's worth a watch, I guess. Just as long as you go into it thinking, \"This is a PG-13 movie.\" If you want to watch something better as far as PG-13 Animated Batman goes, \"The Dark Knight Returns\" (not to be confused with \"The Dark Knight Rises\"), \"Assault on Arkham\", and \"Under The Red Hood\" are all three very amazing movies.",
         "I have been waiting for this movie since i saw the trailer. Movie is well designed and its very well plotted. Obviously it has some disturbing scenes, but that's what make this movie intense. It more about proving a point. Half the movie is narrated by Bat girl. Joker wants to prove a point and as always he fails. Its about madness. Which is not by choice. Epic rivalry between batman and joker, turns into a very mature understanding. But this is a point that they can not go back where they have started. The joker's past is a really sad. All and all its the one of the best DC movie. I am a Batman fan. Maybe i am biased. But who cares.",
         "review contains spoilers When i heard this adaptation of The Killing Joke was to have an added prologue focusing on Barbara Gordon, i was excited, because the main issue with Alan Moore's The Killing Joke is that the character most affected by the story is hardly seen, and used merely as a plot point. Unfortunately, the 30 minute prologue added to the film is the worst writing for a character i have ever seen. Basically, it boils down to this: Batgirl and Batman have sex. If you don't know the character of Barbara Gordon very well, this might not bother you. If you do, this might destroy the character completely, as well as destroy the character of Batman. What was meant to be a parental relationship becomes an extremely creepy attempt to justify an R rating. The fact that Barbara has feelings for Bruce ruins her character because the point of her is that she genuinely wants to do good. Now she appears to just want to look good in front of Batman. Even when Batman is off screen, he is all she seems to talk about. The once noble, caring, complex and likable Barbara Gordon has now become a shallow, sexually driven teenager. And Batman becomes a dirty old man. His anger with the Joker is no longer about a father figure angry about what was done to the young girl he cares for, now it becomes a story about a guy getting revenge for his girlfriend being hurt. This is so much less interesting and, again, creepy, and betrays the story and the fans of both Batman and Batgirl. This movie is an abomination. While the rest of the film almost faithfully adapts the original story (however, the animation was surprisingly poor. i've seen better on Cartoon Network), it is still tarnished, as it is put in the context of the first terrible 30 minutes, which change the dynamic that made the story great in the first place. instead of adding to the story, it takes away, while feeling completely unnecessary. This is the worst thing Brian Azzarello and Bruce Timm have ever put out, and while it's bad, i would not call them sexists for the treatment of the character (although the character is very much a stereotypical girlfriend, and it would be fair to say that Azzarello can't write women). This isn't necessarily a case of sexism, just blatantly bad writing.",
         "The ogn material this adaptation was based on, was released on 1988, by Alan Moore & Bryan Bolland. It was one of the most disturbing, nightmarish made in UK stories, that gave an even more psychish tone to Joker as a character and turned (unfortunately) eventually Batgirl into Oracle. The graphic novel is only 64 pages long, more like a special-sized story, thus DC decided to write more script, in order to be adapted into a full movie. And that is the breaking point. THE KILLING JOKE SHOULD BE A 30' SPECIAL, NOT THIS ABNORMAL SNOOZEFEST THAT LASTS OVER AN HOUR! They could adapt additionally another short Bat story and release the equivalent of \"Hulk VS\", in order to fill the disc time. Although we are years now in digital form and 60' is an ill- forgotten excuse for \"minimum time limit\". The first half of this raped adaptation is a generic adventure of Batgirl, in which... MAJOR SPOILERS AHEAD ...she is a young lady that feels useless and loves Batman. Thus, enter Batsex. These 30' theoretically supposed to make us love her character. Personally, it was horrendous and with a major luck of respect to her character. The worst Batgirl story ever. A young naive Batgirl that is useless and eventually bangs Batman as her mentor... Then, as of a sudden, Killing Joke strikes. The transition is awkward, bad and the tone is out of scale compared to the first half. OK, it is a good adaptation, but it is so uneven to the first half that you are already tired. Although, the frames sometimes have a pace problem. IN A NUTSHELL, it is a bad prolonged adaptation and you should skip the first 30' for your own mental sake.",
         "Although this movie is not perfect by any means, it adapts most of the short graphic novel into a decent animated movie. Performances are amazing as always with Mark Hamill blowing everyone away again. People are however furious with this scene that takes place between TDK and BG, which I don't really see an issue with. In the comics and on some traditional media I do feel some sort of tension between these two and even though it might be a little out in left field it doesn't ruin it at all. I personally really enjoyed the film as an avid comic book reader and fan of Batman. Everyone calm the f*** down, it's just a movie, and it's fine.",
         "Just saw this at the theater for a special screening and it was miserable. I never read the graphic novel but have heard a lot about it and loved the old animated series so I was excited. I heard the added some content to extend it to feature length, and it was immediately apparent that what they added was an incredibly dopey, poorly written, bland, and on top of all that offensively sexist intro plot introducing Barbara (aka Batgirl) that had nothing to do with the rest of the movie other than making us care about her character. The actual Killing Joke section had a couple good scenes (like Joker busting in on Barbara and Gordon) awash in a sea of cheap animation and really bad editing. The most cinematic parts were rushed and lifeless such as the Joker's \"climactic\" fall. They didn't build the tension or even show his reflection when he saw himself for the first time. The ending was probably the most awkward thing I have ever seen. Both scenes where Batman is like \"must we fight?\" are cringe-worthy. You can write this, George, but you can't say it. It ends with an awkward hug between them I guess and another example of hilariously bad pacing and editing. The whole thing just felt rushed and poorly directed. Mark Hamil's performance is awesome, of course, but he can't save this garbage or even elevate it to watchable. After seeing some of the frames of the graphic novel all I can say is what a waste of a great opportunity. With that source material and getting the band back together, this is about the worst possible movie that could be expected.",
         "I will begin by saying the New 52 Dc animated universe is a total crap bag,except Gods&Monsters which was not included in that universe but it is pretty recent so people might think it is. This comes from the same brilliant people who gave life to the best era of Dc animation and created the original and best DCAU.Mark Hamill returns to his iconic role as the crowned prince of crime and Tara Strong returns to deliver a strong part as Barbara Gordon/Batgirl/Oracle,and last but certainly no least Kevin Conroy returned as Batman/Bruce Wayne. First I will talk about the animated style since some people complained about it:it is modern,amazing and some scenes were literally taken out of the comic book and animated but without taking that effect away such as:The Joker going to the Gordon's apartment or him coming out of the factory and realising what he became and starting to laugh maniacally. The characters were represented great and it still gave The Joker the chance to say he prefers multiple origins for he is a man of mystery so all we saw was just a version of how it was,because no one can know the truth,not even The Joker himself because he denies reality and all logic for the sake of fun.This was his greatest scheme ever so far and he wanted to make Batman cross the line but did he fail?Did he succeed?It is open for interpretation.I felt for him,for the first time in my life when he proved some sanity saying it was too late for him to be friends with Batman.Batman had a darker tone,more serious and determined than ever and it was really terrifying seeing him laughing at the end.Barbara, as Bruce said, was just a child and until their sex scene she felt it all as a game and a chance to be with her lover,her idol,her teacher.The commissioner proved himself to be a strong man who kept his sanity in all of that carnival of madness. I feel the Batgirl backstory of almost 25 minutes was necessary and it was well chosen to portray her relationship with Batman and show that even if she was out there for three years she was not as ready as she initially thought. Overall it was a masterpiece to witness and I hope this movie will open a new Animated Movie Universe fo Dc for more quality stuff,lead by Bruce Timm,of course.",
         "It's been awhile since I read the graphic novel but when I found out they were making an animated movie based on the book, I was excited, I couldn't wait to see it then when I found out it was being shown on HBO & not The Cartoon Network like I expected it was going to be, I was even more excited.I thought it was going to be (For some stupid reason) exactly like the graphic novel.I guess it's true, the book is always better than the movie.Watching Batman: The Killing Joke was like watching an episode/movie of Batman: The Animated Series but with sex & extreme violence.This movie was not for the kids.Since it was more like watching Batman: The Animated Series, the sex & extreme violence felt unnecessary.It didn't add anything to the movie at all.If this movie was supposed to be based on the graphic novel then they should've stuck to the story.At times I also found the movie to be boring.When it was over, the only thing I felt was disappointment.There are kid friendly Batman animated movies that are a million times better than this 1.I suggest watching any of them or picking up the graphic novel instead",
         "i was hoping for something epic. ended up for something sub-par. this is not what the comic is. lots of it is offtrack. i don't mind a movie or a series this is not 100% accurate to the novel. but not when things gets mindless and stupid. the makers no doubt lack knowledge about batman. for example batman is like a 2nd father to batgirl. not her damn one night stand boyfriend. also batman looks and feels like a damn emotionless zombie. like what the hell is wrong with him? as i said i do not mind a movie or series not being 100% accurate to a the story. a few tiny changes is fine. but not when the main characters dramatically altered to a degree it doesn't make sense nor it adds value. also i want to add that the animation is very choppy especially in the beginning. like the animators don't give a damn. the action wasn't that good also. read the comic and skip the movie. it is much better trust me. do not ruin such a good story by watching this joke of a movie",
         "Much of the controversy around this movie surrounds the first half, so I am going to concentrate on that portion. People in the theatre I went to said they would have loved The Killing Joke, if not for the first half. I argue that the second half would not make any sense without the first. As perhaps one of the most famous hero and villain duos in all of fiction, it is easy to see Batman and the Joker as diametrically opposed in their approach to crime. I believe the first portion of the film serves to demonstrate some of these differences, especially Batman's tendency to control everyone/everything around him (as opposed to Joker's outright nihilism), and stands them on their heads. We start to see Batman as imperfect, and perhaps not so different from any Gotham resident. This imperfection serves to develop some of the sympathy we feel towards the Joker and his ultimate goal regarding his confrontation with Batman, regardless of his twisted techniques. Evidence of this comes with some of the Joker's quips, which come with a visceral laugh despite their macabre nature. The only area for potential complaint comes with the animation in certain scenes, though I'm not sure this was unintentional due to rushing for completion or due to intentionally demonstrating something quite \"off\" about the whole situation at hand. 4 out of 4 stars.",
         "(Warning: This review contains spoilers about the story, especially for those who haven't read the source material.) DC Animated productions, mostly headed up by the fantastic Bruce Timm, have had a series of hits, with great animated films such as Batman: Under The Red Hood, Batman: Year One, Flashpoint, Justice League: Crisis on Infinite Earths, and more. Even some of their generally lesser efforts are entertaining and still enjoyable. Timm also worked on the great Justice League animated series, Batman: Beyond, and of course the original Batman: The Animated Series, which helped pave the way for all of DC's animated productions. It goes without saying that Bruce Timm knows the Batman character and what drives him, and what Batman stories need to be told, so that's why this recent adaptation of Alan Moore's classic 80's graphic novel: The Killing Joke, is such a disappointment. If you haven't read the Killing Joke, do yourself a favor, and go ahead and do that now, if you're in any way a fan of the Batman character. It's not the most comfortable read, but gives insight to how dark the world of Batman is meant to be. The Killing Joke features a great misunderstanding of the themes of the story, and a lackluster and dull set of production values to go along with that thematic miss. The animation is the first thing that turned me off to this piece. Unlike the fluid fight scenes and lush colors of The Dark Knight Returns, or the sharp, defined shapes of Under the Red Hood, The Killing Joke has awful character designs and flat, bland colors, with vehicles rendered in a 3D that looks like bad Playstation 1 graphics. None of the fight scenes, which are often a crowning achievement for DC animated, have any intensity or true kinetic action to them. Whenever the characters are still, you can truly see the lack of detail in the designs, which makes the characters look very plain. As far as the story, the movie takes the worst possible turn you could by adding a whole 30 minutes of story and background centered around Batgirl that is plodding, dull, and feels like a totally different story and style than when they arrive at the Alan Moore material over halfway into the movie. They use direct dialouge from the Alan Moore material, some of which felt awkward and strange-sounding spoken aloud, especially contrasting with the much different sounding dialouge of the first act of the movie. One of the spoilers I'll mention here is this clunky first act ending in Batgirl having a totally out of place sex scene with Batman. I gave up hope on enjoying this animated film at that moment, since I knew they had totally departed from the comic book's vision of the story, already muddling the story with irrelevant events, and then making it worse by confusing the relationship of two of the characters. Batman and Batgirl have a parental relationship, like between him and Robin, where he mentors, trains, and sometimes keeps her in check, as Batman is an uncompromising character who always does things his way. This scene served no purpose in the story, and makes it seem as if he's going after the Joker because Barbara is his lover, not because of the tragic events that happen. On top of all of this, I didn't feel that the original novel's ambiguous ending translated to an animated format. They didn't build the tension of anything that happened in the movie, it all just kind of came and went. Even the fantastic voices of Kevin Conroy and Mark Hamill don't really have the same usual enthusiasm here. They still have a great sound for the characters, but the intense feeling you get from hearing those portrayals at their best, in past material, just wasn't here. I have to say that especially Kevin Conroy felt like he was phoning it in, which pains me to say as he is the definitive Batman voice in my opinion. The rest of the voice cast is forgettable, with some especially stilted lines from the actor playing Gordon, who's supposed to go through some very serious, harrowing events here. It's a shame that Bryan Cranston wasn't available again for the role. Overall, the poor animation, terrible and blundering writing, and the mediocre voices contribute to a very dull and flat telling of what should be a dark, disturbing, and uncompromising Batman story. What we're left with in return is a product that makes me think this story really should be left in the comics. Batman: The Killing Joke gets a 4 out of 10, only for the continued commitment of Conroy and Hamill. Let's hope that this isn't their final work together in these parts.",
         "Batman goes on the hunt for The Joker who is kidnapping and torturing Commissioner Gordon and his family in a similar way to his own descent into madness. One thing that immediately stands out about this film is how much it seems to want to be like the graphic novel that it is adapted from. This is because the dialogue seems like it has literally been taken from the novel itself and copied word for word, this is accompanied by animation that looks like it's just a moving version of panels from the original comics/ Killing Joke graphic novel. It basically seems to be a direct literal adaptation of Alan Moore's famous, classic novel. This might majorly stand out at the start of this film adaptation because the first 30 minutes of the film seem to be a bit slow and just a long build up and introduction to the lives of Batman and Batgirl/ Barbara Gordon and so later plot details are further understood or emotional pain for certain characters is deepened because of this connection with the characters. In fact the connection with the characters in this film isn't really that strong and at times they just seem to be there ,even Batman has this feeling when he is present in some scenes, this can also be said for the character of the Joker (voiced by Mark Hamill) he might be one of the best things about the film but he doesn't seem very understandable in his actions and motives until later in the film when his backstory ,if it is even his real one due to the character previously making up many different backstories making him more mysterious and in some cases creepy, is revealed and we see what his life was previously like and what drew him into the state of madness that has made him one of the most famous and iconic on-screen and comic book villains ever. As this is done the character of The Joker gets better and better and more enjoyable and the same can be said for the rest of the film as more is revealed and as more events unravel/ occur the pace gets quicker and the film gets better and more entertaining pulling the audience in and providing a more detective style superhero film which at times feels fresh, new and different. If you ignore the first 30 minutes then Batman: The Killing Joke is a fresh animated superhero film that not only shows a new side to the character of The Joker but puts him centre stage as the star of the show. Overall it might have a dodgy script and seem like a literal direct lazy adaptation at times but it's an enjoyable film with some highly entertaining moments. *** <-- Three Stars (Out of Five)"
      ],
      "genres": [
         "Animation",
         "Action",
         "Crime",
         "Drama",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Warner Bros. Animation",
         "DC Entertainment"
      ],
      "summaries": ["As Batman hunts for the escaped Joker, the Clown Prince of Crime attacks the Gordon family to prove a diabolical point mirroring his own fall into madness."],
      "budget": 3500000
   },
   "movielensId": 161354,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-07-21",
      "dvdReleaseDate": null,
      "directors": ["Sam Liu"],
      "runtime": 72,
      "movieId": 161354,
      "title": "Batman: The Killing Joke",
      "mpaa": "R",
      "actors": [
         "Kevin Conroy",
         "Mark Hamill",
         "Tara Strong",
         "Ray Wise",
         "Robin Atkin Downes",
         "Brian George",
         "Maury Sterling",
         "Rick D. Wasserman",
         "John DiMaggio",
         "Fred Tatasciore"
      ],
      "imdbMovieId": "4853102",
      "originalTitle": "Batman: The Killing Joke",
      "genres": [
         "Action",
         "Animation",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "uFflHmQHtiY",
         "ZQTqu1_iQkw"
      ],
      "plotSummary": "As Batman hunts for the escaped Joker, the Clown Prince of Crime attacks the Gordon family to prove a diabolical point mirroring his own fall into madness. Based on the graphic novel by Alan Moore and Brian Bolland.",
      "tmdbMovieId": 382322,
      "avgRating": 2.9664,
      "releaseYear": "2016",
      "numRatings": 253,
      "posterPath": "/zm0ODjtfJfJW0W269LqsQl5OhJ8.jpg"
   }
}