{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parody",
            "id": 9755
         },
         {
            "name": "spoof",
            "id": 11931
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "moving",
            "id": 18253
         },
         {
            "name": "new home",
            "id": 33467
         },
         {
            "name": "beverly hills",
            "id": 163047
         }
      ],
      "imdb_id": "tt4191580",
      "video": false,
      "title": "Meet the Blacks",
      "recommendations": [
         273621,
         253265,
         401061,
         6976,
         291874,
         397003,
         403232,
         413452,
         402370,
         55863,
         105379,
         185515,
         43814,
         209320,
         284550,
         449751,
         112687,
         369605,
         263945,
         455675
      ],
      "backdrop_path": "/d8TOaHhU8hwKI5Q2yHjzVvf26GX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Carl Black",
               "gender": 2,
               "credit_id": "56e466959251413269001482",
               "name": "Mike Epps",
               "profile_path": "/64S9zCFVzHoloRSzd7yd0covlhC.jpg",
               "id": 51944,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Lorena",
               "gender": 1,
               "credit_id": "56e4669e92514172c700196a",
               "name": "Zulay Henao",
               "profile_path": "/6iHWbkuHJpVp8wZTlJBnjfO8Kd9.jpg",
               "id": 81703,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "President El Bama",
               "gender": 2,
               "credit_id": "56e466a4c3a3685aa8003c67",
               "name": "George Lopez",
               "profile_path": "/9uqEWFpa7NfYaEESK3Kajokcwx.jpg",
               "id": 41798,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "James Clown",
               "gender": 2,
               "credit_id": "56e466ac9251416d400042bc",
               "name": "Mike Tyson",
               "profile_path": "/dENp2l4nk5wv6F0AT1iQ3pf4Os1.jpg",
               "id": 80757,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Key Flo",
               "gender": 2,
               "credit_id": "56e466b7c3a3685a960041fc",
               "name": "Charlie Murphy",
               "profile_path": "/emMzTjrwhrPr1m8gepw1bvqJb6A.jpg",
               "id": 17840,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Freezee",
               "gender": 2,
               "credit_id": "56e466bf92514109d80027e3",
               "name": "Andrew Bachelor",
               "profile_path": "/cz2Rhh5XYRbFidJRM65EMxZBJG0.jpg",
               "id": 1350469,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Tyrone",
               "gender": 2,
               "credit_id": "56e466c7c3a3685aa4003d9b",
               "name": "DeRay Davis",
               "profile_path": "/w2JYPRLwXhNCpxpJc2v4UQYyMv8.jpg",
               "id": 11827,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Parole Officer",
               "gender": 0,
               "credit_id": "56e466d1c3a3685a9e003fec",
               "name": "Lavell Crawford",
               "profile_path": "/v14PrUzfZUUZCZpyduDdnPJvLlD.jpg",
               "id": 564348,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Stranger",
               "gender": 0,
               "credit_id": "56e466dac3a3685a9000434b",
               "name": "Gary Owen",
               "profile_path": "/419tCojrRrEDhINC38wXuiUOTC4.jpg",
               "id": 214108,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "Allie",
               "gender": 1,
               "credit_id": "56e466e1c3a3685a9e003ff6",
               "name": "Bresha Webb",
               "profile_path": "/ymSAqpgPdBxiODIFzzOAEq0LizT.jpg",
               "id": 1377385,
               "order": 10
            },
            {
               "cast_id": 10,
               "character": "Klansman",
               "gender": 2,
               "credit_id": "56e466e99251416d400042c3",
               "name": "Paul Mooney",
               "profile_path": "/1Z47JEvyzlzIA1QsBNahZfvpUv8.jpg",
               "id": 81149,
               "order": 11
            },
            {
               "cast_id": 11,
               "character": "Carl Jr.",
               "gender": 0,
               "credit_id": "56e466f4c3a3685aa8003c75",
               "name": "Alex Henderson",
               "profile_path": "/ag9l7CODDrh176UC7cQhxkitRrx.jpg",
               "id": 1421229,
               "order": 12
            },
            {
               "cast_id": 12,
               "character": "Jim Smith",
               "gender": 0,
               "credit_id": "56e466ff92514103c5000a10",
               "name": "Phil Austin",
               "profile_path": null,
               "id": 1411198,
               "order": 13
            },
            {
               "cast_id": 13,
               "character": "Denis Strahan",
               "gender": 2,
               "credit_id": "56e4670992514172c7001975",
               "name": "Perez Hilton",
               "profile_path": "/opDjgsNlyDSbYE4LCHTv8P0oYVm.jpg",
               "id": 78588,
               "order": 14
            },
            {
               "cast_id": 14,
               "character": "Beautiful Girl",
               "gender": 0,
               "credit_id": "56e467119251415b5f002d20",
               "name": "Gloria Govan",
               "profile_path": null,
               "id": 1589833,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56e4672ec3a3685aa4003da4",
               "name": "Deon Taylor",
               "profile_path": null,
               "id": 119419,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56e4673492514103c5000a17",
               "name": "Deon Taylor",
               "profile_path": null,
               "id": 119419,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56e4673cc3a3685a90004358",
               "name": "Nicole DeMasi",
               "profile_path": null,
               "id": 1589835,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 4.611535,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 377587,
      "vote_count": 79,
      "budget": 0,
      "overview": "As Carl Black gets the opportunity to move his family out of Chicago in hope of a better life, their arrival in Beverly Hills is timed with that city's annual purge, where all crime is legal for twelve hours.",
      "similar": [
         9373,
         341006,
         10781,
         948,
         381288,
         588,
         9538,
         301846,
         74997,
         12662,
         434873,
         10185,
         294963,
         769,
         4638,
         1690,
         96,
         10285,
         19908,
         4141
      ],
      "original_title": "Meet the Blacks",
      "runtime": 90,
      "poster_path": "/aDln5KsEE0b4YDPRhvStziPwOmC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Hidden Empire Film",
            "id": 45431,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Freestyle Releasing",
            "id": 4616,
            "origin_country": ""
         }
      ],
      "release_date": "2016-04-01",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://meettheblacksmovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Deon Taylor"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Nicole DeMasi",
         "Deon Taylor"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4191580/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMzAxNDY3ODk3MF5BMl5BanBnXkFtZTgwMjYwNDA5NzE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Mike Epps",
         "Zulay Henao",
         "Alex Henderson"
      ],
      "reviews": [
         "What a waste of a great cast. I genuinely laughed about 10 times in the first 10 minutes of this movie. After that it was all downhill. I actually fell asleep 2 or 3 times. After this (you wish) nobody should ever again complain about Quentin Tarantino's liberal use of the N-word in his films. To say the N-word is gratuitously used in this film does disservice to the word gratuitous. I don't think there was an actual script for this flick. I think the producers thought they could put a bunch of pretty good comedians in this film and let them riff and watch the money roll in. They did not succeed. I'd be embarrassed to be credited with having scripted or directed this turd.",
         "Mike epps... with this movie he has proved proved he officially needs acting and comedy lessons. His acting is atrocious his ability to execute or tell jokes is practically none existent. Th \"movie\" itself is just a waste of time at best , its boring , its NOT funny at all terrible writing , bad casting , some of the worst acting and the attempts of comedy relief are painfully bad! Its one of the worst movies I've watched all year hands down and honestly its probably one of the worst films I've ever watched...... I wish i could say something good about this i really do , But calling this a comedy is a reach let alone a movie , its sad that anyone would let themselves be part of something they have to know is just a waste of every ones time and trash from the beginning. Money means more then quality , standards , being good at what you do and or love , integrity and especially more then helping others or making other happy... quite sad from any perspective or position in life. i'm only in my 20s and i realize the importance of those qualities and how that if even 1 in 5 people practiced that in there own life and simply learned to be passionate , do the best you can in every situation , have integrity, care for others , and hold ourselves to a higher standard. With that little effort this world would be as amazing as it is beautiful an vast! Imagine... Thats My Review - Take Care Everyone & God Bless ,I Hope We ALL Find Happiness in not only our personal lives but as a whole!Thats a Dream we can all embrace.",
         "I saw \"Meet The Blacks\", starring Mike Epps-The Hangover movies, Resident Evil:Extinction; Zulay Henao-If Loving You Is Wrong_tv, Takers; George Lopez-Spare Parts, Balls of Fury and Charlie Murphy-Are We There Yet?_tv, Night at the Museum. This is a parody of those Purge movies. You know the ones; they were about one day a year, any crime is legal for 12 hours. Mike plays a Chicagoan that comes into some money and decides to move his family out to Beverly Hills, thinking it will be safer among rich people. I know, it's a really thin plot device. The Purge is everywhere, right? Zulay, who is rather gorgeous in a Sofia Vergara way, plays Mike's wife. George plays the President, I think his name was something like El Bama- Hilarious, right? Charlie plays a guy from Chicago that follows Mike to get his hands on some of the money that Mike had come into. Most of the jokes are just dumb, unfunny or even stereotypical put downs of all types of races-they were equal opportunity insulters. There are a few cameos. I remember seeing Mike Tyson and Snoop Dogg. Overall, it's just not very good. It's rated \"R\" for language, violence, drug use and sexual content-no nudity-and has a running time of 1 hour & 30 minutes. I would not buy this on DVD. I would not rent it either. If you really think you want to see it, I would wait until it comes on cable.",
         "Well folks, I just wasted two hours of my time and the money to rent this stupid movie. Actually thought it would be funny based on a friend's recommendation. It started out okay, but just gets to be all the more lame and dull with non-believable action the entire way through. I kept waiting for it to get better, only wanting to get my money's-worth; yet just wasted time. Bad acting, bad plot, non-adventurous, and just plane lame. It's been a long time since I gave a movie a 1/10. Obviously I'm not the only one if the average rating is 3/10. Wish I'd done more research. Do yourself a favor and steer clear of this garbage.",
         "At this point if you are still trying to break down a parody movie from every angle and inspect it then you are wasting your time. Parody movies are literally designed to not be a good movie. The only thing it's for is to make you laugh. Everyone knows this so why every time a new one is made people expect more? Honestly these type of movies are for people who like to laugh and usually don't care how it turns out. I understand some of you may feel if it's a theatrical release then it should be at least worth the money but it's very hard to please everyone when it comes to music and art and it has always come down to a preference thing. I am giving this a 10 out of 10 because it made me laugh the whole time and that's all these movies are made for. I expected nothing else from it and I got nothing else from it.There was no great story line or amazing actors just good Ole parody humor.",
         "\"Rich people don't purge.\" Carl Black (Epps) has finally found a way out of Chicago and his dangerous neighborhood. He and him family movie into a huge mansion in a gated community in Beverly Hills. They are just settling in when the thing they most feared arrives. The Purge exists in the richest city in the country, and they are the only black family around. Things can only go bad. This is a strange movie. This is not really a spoof in the usual sense. This is really more of a remake of The Purge movie done as a comedy instead of a horror. Unlike the Scary Movie series it doesn't take from all other movies. There are some funny parts in this but it did seem to drag a little. The two biggest problems with this movie however were the over used cliché racist jokes. We get it, your black so even when crime is illegal you will get caught...very funny. The biggest problem with the movie though is that the actors didn't look like the wanted to be in this. That really hurt the comedy due to the fact that you almost felt sorry for them. Overall, Some people will enjoy this but as for me the movie was only funny in some parts, and only because I saw the original Purge. I give this a C.",
         "The thing some people don't get about these movies is they're SUPPOSED to be dumb. But that doesn't make it any less funny. The movie was absolutely hilarious. It had me cracking up at many points and as far as parody movies go this is probably the best one I've ever seen. To anyone reading these reviews and see all the negativity, DO. NOT.LISTEN. You can't know how much you'll like a movie based on reviews from people who didn't like it. It was amazingly funny, and definitely worth the money to go see. In fact, I'm going to go see it again today. A haunted house, and all the scary movies (well, maybe except the first one.) Don't hold a candle to this movie. The only bad thing I have to say is there were a good few points in the movie where I was thinking \"PICK UP THE GUN!!\" All in all I loved the movie. and id urge anyone to ignore IMDb's rating and go see it yourself. they don't know anything...",
         "The folks who think it is dumb, racist, chauvinistic, lots of overused clichés, are wrong in my opinion. It is a really fun movie to unwind after a hard days work, i recommend it truly, especially to age 16-35, older folks would smirk at it, but they love to watch films like Mission impossible or James Bond. This is great movie in all. Made me smile. Now, in saying that, having seen movies like the purge, resident evil, saw movies, meet the parents, walking dead, this movie indeed takes a lot from those , that's why this movie is semi- called a parody. Seems similar to scream 2, scream 3, pretty clever graphics for a crazy family horror comedy. Was at one point thinking it was set near sun, was filmed in a hot weather. In this age of politically correct movies and countless re-makes and dynasty franchise blockbusters this is a nice departure into the world of silliness and craziness , which is a lovely thing and we should rejoice about that fact.",
         "So Meet the blacks is a parody of film, the Purge. Most of the comedy that I'm seeing comes from the fact that they are giving the same message as the Purge only being a lot more up front about it. The Blacks stumbled upon some money and moved from the ghettos of Chi-Town to a luxurious space in Beverly Hills, where they thought they made it to a social status that made them immune form the annual purge, but of course when it begins, guess who all the purgers on the block come after. In all fairness, the neighborhood's dislike of the new family lowering their property value is the least of the Blacks' worries. It's works as a look on social commentary the same way the Purge did. It also works better if you think of it as a series of sketches on a comedy show. Not every sketch is good but I got some laughs from George Lopez who played president La Bama ( a Mexican parody of President Obama). The great Charlie Murphy who plays the gangster the blacks stole money from to movie to Beverly Hills, and Mike Tyson who does not need to try hard to be funny. Also like to give a shout out to the the gorgeous Latina they got to play Step-MILF Mrs. Black. From the moment she came on the screen her only job was to be eye candy and she did the job well and excelled. I'm taking the movie for what it is. It's not Scary movie it's Scary movie 5 (which also features Iron Mike). It's not going to win any awards or gain an critical acclaim, but it made me laugh. Job well done.",
         "Every once in a while we have a movie that thinks its a comedy because we have a cast of characters being abhorrently racist to one another, because we all know, racism is hilarious!!! Especially when it's the same ethnicity doing it to one another.... After obtaining a great deal of money, the patriarch of a black family decides they should move from Chicago to a posh neighbourhood in Beverly Hills. However, they are soon terrorised by home intruders who want them out of the affluent community....... Trying to be a spoof of The Purge movies, the film is one of the poorest films of the year, going back to the dark ages of British seventies sitcom by just throwing every racist joke and innuendo at the screen and hope that everyone gets a laugh, because it's self deprecating because we are doing it to one another. And it's totally rubbish, from the opening credits right until the promise of a sequel, nothing whatsoever raises more than eyebrows in disbelief. Epps plays your Atypical stereotype by shouting really loud, swearing every second, and saying a racial slur about every minute. Epps, you should be ashamed of yourself, this stuff was getting old when Bob Hoskins had a problem having Denzel Washingtons Heart in Heart Condition (and that's 26 years ago). Otherwise, it's just an incoherent mess, we have different people arrive into the house every five minutes trying to kill the titular family because the patriarch is nothing more than a poisonous thief, who has basically ripped off everyone he has ever met. And he's our protagonist!! When a film is struggling, they have to reference a topical film series, and with everything that is happening in the world at the minute, The Purge films are prime rib. So the one homage we have of the original Purge isn't effective, nor funny, and guess what, it ends with a racist slur!!! It's this sort of film that pulls cinema back ten years, Snoop Dogg should stay away from films. Yes, he was mildly diverting in Starsky & Hutch, but this is worse than Soul Plane. Avoid like the plague. It's racist filth and should never have seen the light of day.",
         "Meet The Blacks is a very funny comedy! I was a little pessimistic at first, I was afraid it would be too stereotypical but it had me in tears from beginning to end. It's a great parody of the movie The Purge (which I also loved by the way). The story: Carl Black moves his family to Beverly Hills thinking there's no annual purge there (a night where anybody can get away with murder); Shout out to Mike Epps, Lil Duval and Bresh Webb who are shining in this film! I did not really know Lil Duval but his role is hilarious! A lot of comedy legends are also appearing: Charlie Murphy, Paul Mooney...even Snoop Dogg is in it! Great job for a low-budget and independent film! I recommend anyone who wants a good laugh to go see it!",
         "Have you ever seen a movie that represents reality poorly? Ah, well. It is a comedy, right? I like Mike Epps, but this film might as well have been a cartoon. There were a few short laughs; The biggest laugh by far was Mike Tyson's brief role. He had me rolling. The rest of the comedy was based on \"stuck in the 1930's\" style racist humor. White people are represented as universally villainous and overtly racist; Which is supposed to be a joke, but the lines just seem so unnatural that there is no way it could sound authentic. Its like someone went through the film in post production and tried to ad-lib some racist white people from books written a century ago. I was mostly disappointed in the comedy, bored by the action, and even a great scene with Charlie Murphy couldn't raise the bar on this film. The kids were annoying, the family was deranged, and Mike Epps himself seems too old for the sh*t-head gangsta roles he always seems to get. Casually dropping the N-bomb while looking disinterested and lanky was his main appeal in most films and I think the amusement of that character has run it's course. Mike, you can play roles where the character has an IQ over 70, I promise! Err...I assume you can.",
         "It has good actors, a good budget, and is funny throughout. It's good entertainment, it doesn't deserve a 2.6 IMDb rating which it has at the time of this review. It deserves about a 6 at least. It's not a hilarious movie at all, but it would be funny to average movie goer. If you like funny movies and merely want to be entertained, it should give you plenty of that. If you are a film critic, you're going to cringe as you watch this movie. That's because film critics are totally different than average movie goers.",
         "I saw the movie and it was so bad. I understand why Mike Tyson support's Donald Trump because this movie is full of xenophobic and racist remarks apparently to be a comic parody. Don't waist time to even take your kids to this movie because it sets a very hard line on race in this country. I had to take my kids out of the movies because they were shocked to see this.First of all, it's another one of those stupid spoof movies. Trust me, I've seen some so-so spoof movies and let me tell you. There's more sh*tty spoof movies than so-so. Meet The Blacks will leave you without words because you will feel dumb.Please, the Purge is already bad enough. This one's trying to be the comedy-friendly version of the Purge... which is completely (not) horrifying.",
         "I barely laughed. I barely succeeded to sketch a smile. Mike Epps tries to be goofy, but he doesn't make it in the end and the rest of the characters are there just to fill the gaps. I think the movie had to only focus on one genre and not to be both a creepy-drama and a comedy. All the things got messed up and it resulted more in an unsatisfied & unhappy audience. At least these are the feelings that this movie left me.",
         "The Movie Is So bad. No Acting Plus Mike Tyson is not an Actor . He is Just a Hateful person and due to recent comments he made about Boxer Manny Pacquiao. We from the Phillipines support our hero Manny. Double standard by Tyson. last movie with him featured in it. Due to his Rape conviction Tyson is banned to travel to some countries so it is very interesting for him to be in this Movies and critique the current president. Did Tyson really cared about the feelings of the woman he raped. Lets not forget about Mike Tyson who supports Donald Trump and Tyson made very bad comments about president Obama to. I wouldn't pay the bootleg guy at the beauty shop $5 for that movie. To bad he didn't retire with Grace and SILENCE.",
         "After watching this film and seeing both sides of the argument. I was left (again) on the fence but a little bit to the good side. A pretty interesting purge parody movie, about a family moving to Beverly Hills during the purge and then getting ransacked. Obviously people will argue that this film is \"racist\", as per usual, and to some extent it kind of is, and obviously during the purge, everyone wants to kill them. But because its a comedy film, we should take everything as satire with a pinch of salt. From my point of view, its a funny comedy that made me laugh quite a lot, and i see no downside apart from the alleged \"racism\". This means, its not for everyone. But at the end of the day, my words to you are: If your easily offended, don't watch it. If your not, then why not give it a shot?",
         "Man this movie was funny as hell. Anyone that says it isn't is probably a trump supporter. I enjoyed it. It was great to see the cameos that they put in there. If you watch black comedies or any black movies, you would know all the people in it. 34 years old, I could tell who everyone was, even the brother at the end with the glasses. It was a good fun movie. Wasn't demeaning towards white at all. If anything they make fun of black people more than anyone. I think it is what this country needs, just a good laugh, without everyone trying to oppress one another. I hope they make a 2nd one, and I'll watch that one too. its definitely not a 2.3 or whatever its listed as here. there is a distinct pattern with black movies or TV shows. Its almost as if an organization is purposely ranking them so low, while Meet the Fockers enjoys a 9 haha. Its stupid. But that's to be expected. Anyway, check it out. Ad if you don't want to, oh well who cares? not me.",
         "Meet the Blacks\" is a horror comedy that spoofs the \"Purge\" movies. A wealthy African-American family moves into an upscale neighborhood in Beverly Hills and instantly are subjected to racial discrimination. The director lampoons this concept and has the purgers be people the protagonist owes money to. Though I found the film sporadically funny, I thought it wasn't really trying at all and instead tried to see how hard it could spoof \"Scary Movie.\" The humor is scatological and is embedded in puerile, inane humor that is so dumb and pointless it actually becomes somewhat funny. The script is laughable at best and features some of the cheesiest lines I've seen. It does everything that a horror comedy is supposed to do except have believable acting, realistic humor, and a halfway decent plot. Source: http://www.huludb.com/movies/1562977-meet-the-blacks",
         "Now I don't usually go for comedies but my boyfriend wanted to watch it. I know this movie is supposed to be stupid and funny, but I just found it to be stupid and annoying. I mean, I guess it had a few moments but they were few. I didn't really find it funny. But everybody's sense of humor is different.",
         "Carl Black (Mike Epps) absconds with drug money as he takes his family to lie low in a gated community in Beverly Hills. Being a dead beat, Carl has a lot of people looking for him leaving behind including baby mommas. On the night of \"The Purge\" they all come looking for him, even the clown ( Mike Tyson) he stiffed from his kid's birthday party. This is a spoof of \"The Purge\" and perhaps needed a better title. The bulk of the humor is racial and inter-racial as we contrast red bones vs. black people. I would suppose the African-American community will enjoy this comedy more than I did. While the film had its moments, the humor grew old with all the accidental and misdirected deaths. Guide: F-word. No sex or nudity. Zulay Henao in swimsuit for eye candy.",
         "Don't listen to the ones who want to try so hard to deny black culture from having anything. This movie is funny and it will be a classic just like Friday. The fact that people are saying it's bad is just utter hate and jealousy. Watch the movie for yourself and don't let this movie fall to the same fate that they try to put Space Jam just because it has a successful black main character. Check the movie and check the box office numbers. Black people just don't go on IMDb so they can't defend the movie and every one who leaves those ignorant comments don't understand the culture. Mike Epps isn't a sell out so he's not going to be in movies wearing suit and ties or playing Police like Kevin Hart or Ice Cube.",
         "I rate it a 6/10 because it was an OK movie it wasn't bad and it wasn't too good but it is a good re-watch for me i give it that the only parts i didn't like it the movie were like when they didn't say that many funny jokes i only laughed like 3 times thru the whole movie and that's unusual for me but everything good in the movie was that it lives up to the name and it lived up to a way the purge was but there wasn't much bad or good but i do think it was OK i would say buy it just don't buy the blu-ray it ain't that worth it unless it goes down a little bit but all and all its and OK movie i think that if you watch it you will watch it again.",
         "Just since the beginning of this century, filmmakers have asked us to meet the Parents, the Fockers, the Spartans, the Robinsons, the Browns, the Patels, and, every Sunday morning on network TV\u0085 the Press. Personally, I have taken part in most of those \"meets\" – and generally enjoyed them, to varying degrees. Next, we are encouraged to \"Meet the Blacks\" (R, 1:30). Like most of those other examples, this meeting is intended to be comedic in nature and, like the example of \"Meet the Spartans\" (2008), this meeting is a parody of an earlier cinematic encounter. You see, \"Meet the Browns\" is also known as \"The Black Purge\". You can think of the movie this way: What if the 2013 film \"The Purge\" were re-staged with a black family? We're talking the first of the Purge movies – as in taking place in an upscale neighborhood, but where a single family of color lives. Get the picture? The next question is, will you \"get\" the movie? Carl Black (Mike Epps) has suddenly, uh\u0085 come into some money. He (VERY) quickly moves his family from Chicago to a mansion in Beverly Hills. His new wife, Lorena (Zulay Henao, a Columbian actress, playing a sexy Mexican woman and looking like a younger, less-Latina Sofia Vergara), his self-centered teenage daughter, Allie (Bresha Webb), his nerdy young son, Carl Jr. (Alex Henderson) and Carl's ex-con, sex-obsessed cousin Cronut (Lil Duvall) are enjoying their new home – and wondering how and why they ended up here. Lorena is struggling to get Carl's kids to accept her as part of the family, Carl Jr. keeps to himself wearing a vampire costume and sending his remote-controlled toys around the house from a secret hideaway in his closet, Allie is secretly meeting with her boyfriend, Freezee (Andrew Bachelor), who rode a bus from Chicago to surprise her, and Cronut is busy \"fixing\" Carl's new SUV, sexually harassing Lorena and breaking into Carl's safe, helping himself to Carl's secret stash of cash and weed. Carl gets the family out of the house to walk down their street and meet some of their new neighbors (including Phil Austin, Kate Enggren and Perez Hilton), but Carl's timing leaves something to be desired. The Blacks have moved into their new mansion just in time for the annual national Purge – a night of terror during which citizens are free to release aggression, right wrongs and get rid of \"undesirables\". All crime is legal for 12 hours – including murder. Even as President El Bama (George Lopez) announces the beginning of the Purge in a televised address to the nation, Carl assures his family that people don't purge in nice neighborhoods like theirs. He's trippin'. Just as in the film \"The Purge\", even rich people aren't safe from others who are purging, and the family home is soon invaded by criminals, masked strangers and even their own neighbors. But remember, \"Meet the Blacks\" is a parody of that film\u0085 focused on a black family in an otherwise white neighborhood – and Snoop Dogg is involved in the production. So, instead of a family having to fend off jealous neighbors and other anonymous purgers, the Blacks have to contend with people like a drug dealer, a creditor (Mike Tyson), a repo man, a process server, an unhappy president of the homeowner's association and some racist neighbors. \"Meet the Blacks\" is a semi-humorous, half-way decent parody. The mixture of the plot from \"The Purge\" and the fish-out-of-water / racially-oriented comedy is full of possibilities, but not very successfully exploited by up-and-coming director Deon Taylor and the writing team of Mr. Taylor and Nicole DeMasi. What is exploited are racial stereotypes of several different kinds and common racial epithets. If you're not offended by those kinds of terms or sources of humor, you may well enjoy this film. Personally, I found it sometimes funny, sometimes offensive and mostly just mildly amusing. \"C+\"",
         "No scary movies anymore? Sound fine, but I reckon we get this instead. And while it does have to say something about racism in America (yes still a thing), it also gets repetitive and sort of boring in its attempts to make fun of the Purge series. The Purge is now so over the top, it should be easy to make fun of it. Way easier than what we see here and while there are some fun ideas thrown at you, not many stick (pun intended). There are a lot of guest appearances, one in particular by Charlie Murphy, that might be uncomfortable for some to watch, considering the fact he recently passed away. But those feelings aside, it does not really have the quality to entertain fully as it could"
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": ["Hidden Empire Film Group"],
      "summaries": [
         "The Black family is getting out of Chicago in hopes of a better life. After Carl Black (Mike Epps) comes into some unexpected funds, he takes his family and leaves the hustling lifestyle behind for something better. Carl, his new wife Lorena (Zulay Henao), son Carl Jr., daughter Allie Black (Bresha Webb) and cousin Cronut (Lil Duval) pack up and move to Beverly Hills. Turns out, Carl couldn't have picked a worse time to move. They arrive right around the time of the annual purge, when all crime is legal for twelve hours.",
         "As Carl Black gets the opportunity to move his family out of Chicago in hope of a better life, their arrival in Beverly Hills is timed with that city's annual purge, where all crime is legal for twelve hours."
      ],
      "budget": 900000
   },
   "movielensId": 161588,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-04-01",
      "dvdReleaseDate": null,
      "directors": ["Deon Taylor"],
      "runtime": 90,
      "movieId": 161588,
      "title": "Meet the Blacks",
      "mpaa": "R",
      "actors": [
         "Mike Epps",
         "Zulay Henao",
         "George Lopez",
         "Mike Tyson",
         "Charlie Murphy",
         "Andrew Bachelor",
         "DeRay Davis",
         "Lavell Crawford",
         "Gary Owen",
         "Bresha Webb",
         "Paul Mooney",
         "Alex Henderson",
         "Phil Austin",
         "Perez Hilton",
         "Gloria Govan"
      ],
      "imdbMovieId": "4191580",
      "originalTitle": "Meet the Blacks",
      "genres": [
         "Comedy",
         "Horror"
      ],
      "youtubeTrailerIds": ["oqrrL8_lU5g"],
      "plotSummary": "As Carl Black gets the opportunity to move his family out of Chicago in hope of a better life, their arrival in Beverly Hills is timed with that city's annual purge, where all crime is legal for twelve hours.",
      "tmdbMovieId": 377587,
      "avgRating": 2.28571,
      "releaseYear": "2016",
      "numRatings": 14,
      "posterPath": "/aDln5KsEE0b4YDPRhvStziPwOmC.jpg"
   }
}