{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "mother",
            "id": 456
         },
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "twin sister",
            "id": 1608
         },
         {
            "name": "magic",
            "id": 2343
         },
         {
            "name": "adoption",
            "id": 2393
         },
         {
            "name": "darkness",
            "id": 3762
         },
         {
            "name": "sister",
            "id": 5923
         },
         {
            "name": "uncle",
            "id": 6464
         },
         {
            "name": "dead father",
            "id": 168468
         },
         {
            "name": "another world",
            "id": 213756
         }
      ],
      "imdb_id": "tt0467421",
      "video": false,
      "title": "Twitches",
      "recommendations": [
         46169,
         61717,
         32293,
         34204,
         27621,
         37609,
         24801,
         34560,
         4641,
         27850,
         115626,
         34205,
         14008,
         124117,
         62527,
         22084,
         22371,
         13968,
         52699,
         26267
      ],
      "backdrop_path": "/9wiw45VvmBSLo80TJidF9qAqTwd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Alex Fielding / Artemis",
               "gender": 1,
               "credit_id": "52fe441bc3a368484e00fd07",
               "name": "Tia Mowry",
               "profile_path": "/atRWNsm7gIBreEDNCfP8uvLnib.jpg",
               "id": 87569,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Camryn Barnes / Apolla",
               "gender": 1,
               "credit_id": "52fe441bc3a368484e00fd0b",
               "name": "Tamera Mowry",
               "profile_path": "/ppSYROJ7tkz5pHTJ1sRiMuoGHdN.jpg",
               "id": 87570,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Miranda",
               "gender": 1,
               "credit_id": "52fe441bc3a368484e00fd0f",
               "name": "Kristen Wilson",
               "profile_path": "/c1OmYimnJkLyRYNBHyieRpJXa4J.jpg",
               "id": 31029,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Thantos",
               "gender": 2,
               "credit_id": "52fe441bc3a368484e00fd13",
               "name": "Patrick Fabian",
               "profile_path": "/qVBTTDdWkMaElKx77VFz8zy3Noq.jpg",
               "id": 58791,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Illeana",
               "gender": 0,
               "credit_id": "52fe441bc3a368484e00fd17",
               "name": "Jennifer Robertson",
               "profile_path": "/hdTs9HYNdBBNe8W8wACXXm4BSv6.jpg",
               "id": 87571,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Karsh",
               "gender": 2,
               "credit_id": "52fe441bc3a368484e00fd1b",
               "name": "Pat Kelly",
               "profile_path": "/yWh1w0HZOBWCULaigSewi2V8uzg.jpg",
               "id": 87572,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Lucinda",
               "gender": 1,
               "credit_id": "52fe441bc3a368484e00fd1f",
               "name": "Jessica Greco",
               "profile_path": "/vvdI4a0qk0OjvEsPwHlnqsLUrFU.jpg",
               "id": 87573,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Beth Fish",
               "gender": 1,
               "credit_id": "52fe441bc3a368484e00fd23",
               "name": "Jackie Rosenbaum",
               "profile_path": null,
               "id": 87574,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "David Barnes",
               "gender": 2,
               "credit_id": "52fe441bc3a368484e00fd27",
               "name": "Arnold Pinnock",
               "profile_path": "/gwS8LNLcDeeOOcrpJM7C6s66lav.jpg",
               "id": 87575,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Emily Barnes",
               "gender": 1,
               "credit_id": "52fe441bc3a368484e00fd2b",
               "name": "Karen Holness",
               "profile_path": "/8oHU4uwOJqyFL3nE8bs4gf3N6zq.jpg",
               "id": 80405,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Nicole",
               "gender": 0,
               "credit_id": "52fe441bc3a368484e00fd2f",
               "name": "Jessica Feliz",
               "profile_path": null,
               "id": 87576,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Aron",
               "gender": 2,
               "credit_id": "52fe441bc3a368484e00fd33",
               "name": "David Ingram",
               "profile_path": "/dNdlqWiGfcp0vsvLiLx2Li87t3k.jpg",
               "id": 87577,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Housekeeper",
               "gender": 1,
               "credit_id": "52fe441bc3a368484e00fd37",
               "name": "Kathryn Haggis",
               "profile_path": null,
               "id": 59195,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Loud Man",
               "gender": 0,
               "credit_id": "52fe441bc3a368484e00fd3b",
               "name": "Albert Howell",
               "profile_path": "/hlQw6k8BAlgCgLaC4cTjvLhVLXZ.jpg",
               "id": 87578,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Salesgirl",
               "gender": 1,
               "credit_id": "52fe441bc3a368484e00fd3f",
               "name": "Natalie Krill",
               "profile_path": "/iXcAX1tDHeWwmD8BI4htTdV3Z2p.jpg",
               "id": 87579,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe441bc3a368484e00fd45",
               "name": "Stuart Gillard",
               "profile_path": "/1UiNFzqnyvCGkr1ha5czRIouXxr.jpg",
               "id": 76418,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe441bc3a368484e00fd4b",
               "name": "Melissa Gould",
               "profile_path": null,
               "id": 87580,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe441bc3a368484e00fd51",
               "name": "Dan Berendsen",
               "profile_path": null,
               "id": 87581,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 6.880259,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21481,
      "vote_count": 104,
      "budget": 0,
      "overview": "Twins separated at birth, Camryn and Alex meet by chance for the first time on their 21st birthday and discover they're witches with the power to save their homeland of Coventry from the evil that threatens it. But when Camryn leaves Alex to face the darkness alone, will Coventry be doomed? Or will the sisters multiply their magic by standing together?",
      "similar": [
         129,
         433,
         347882,
         27022,
         8392,
         8967,
         2454,
         411,
         587,
         671,
         672,
         675,
         767,
         2758,
         10693,
         76492,
         159824,
         68728,
         44683,
         11544
      ],
      "original_title": "Twitches",
      "runtime": 86,
      "poster_path": "/vp5vsNH5JpoI9lBkrdCUBbfVdU4.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Disney Channel",
         "id": 3213,
         "origin_country": ""
      }],
      "release_date": "2005-10-14",
      "vote_average": 5.5,
      "belongs_to_collection": {
         "backdrop_path": "/dQXRd7YyAtuslFCGOsY7i4bKG0z.jpg",
         "name": "Twitches Collection",
         "id": 263106,
         "poster_path": "/604AzmRITkNJD4MyNzkO6KFlEUw.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stuart Gillard"],
      "runtime": 86,
      "synopsis": "Identical twins, Alex Fielding and Camryn Barnes (Tia and Tamera Mowry) were separated shortly after their birth in an otherworldly magical kingdom called Coventry and quickly sent to Earth to escape the dangers of an evil force. Unaware of each other's existence, the girls are adopted by two different families and grow up in opposite worlds - Alex lives in a small one bedroom apartment with a working-class mother while Camryn lives in a mansion and wants for nothing. When the girls are reunited on their 21st birthday their powers start to form and their birth mother Miranda (Kristin Wilson), who thought her precious daughters were dead, can sense they are alive. While Alex and Camryn struggle to discover and accept the truth about their past and the extent of their magic, they set out to find their birth mother to get the answers they are looking for.",
      "writers": [
         "Melissa Gould",
         "Dan Berendsen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0467421/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTMzMzEwNTA1NV5BMl5BanBnXkFtZTcwNTY4MzMzMQ@@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "Tia Mowry-Hardrict",
         "Tamera Mowry-Housley",
         "Kristen Wilson"
      ],
      "reviews": [
         "In the magic realm of Coventry, the twin sisters Artemis and Apolla are saved by their protectors Illeana (Jennifer Robertson) and Karsh (Pat Kelly) from the Darkness and brought to another dimension. They are adopted by different families but in their twenty-first birthday, their protectors force them to meet each other. Alex Fielding (Tia Mowry) lost her mother three months ago and is alone seeking a job while Camryn Barnes (Tamara Mowry) lives with her beloved wealthy parents. Once together they find that they have magic powers and they should return to Coventry to save their biological mother and their kingdom from the Darkness. \"Twitches\" is a naive family entertainment with good messages in the end. The predictable and forgettable story is a typical product from Disney studios, full of the usual clichés of good versus evil and darkness versus love and more recommended for children. My vote is five. Title (Brazil): Not Available",
         "This is definitely one of the to-watch movies on Disney Channel. I just finished watching it and am now watching the encore presentation. It has a very good plot, a lot of exciting twists, some hidden links, plenty of comedy, and characters you just can't miss. Upon just starting to watch the movie it won't make too much sense, but if you keep watching it makes more and more sense. There is some sobriety in the movie, so watch out, but it is mostly just good comedy. If you have seen the premiere of Sister, Sister, the show on Disney Channel, you can relate this to that, and I think that is what the writers were going for. I have a good feeling that this is one of the DCOMs(Disney Channel Original Movie) that will make it to DVD. Only select DCOMs have ever made it to DVD.Some of the people in this movie you might recognize from other movies, but you can figure that part out by yourself. Toward the end of the movie and during it, a little, it gets a bit lame, but who am I to judge. I give this movie a 10.",
         "\"Twitches\" is a great movie to see. Tia and Tamera Mowry have done a wonderful job and I was really impressed with them (like always). I am not going to tell you what \"Twitches\" is about because it is your job to see the magic of \"Twitches\" come to YOU. It really is a good movie and especially great for Halloween so settle yourself down in a comfy chair and get some popcorn and enjoy this \"magical\" movie and see if has the flavor for you and many others. I will say it is a is a movie you shouldn't miss and if you are a big fan of Tia and Tamera Mowry then you will totally flip out when you see them in this movie so go ahead and check it out and you never know when in the end you might say \"that movie was really great\" because I know I did!",
         "This movie was radically different from the book series. The plot was a jump from the time the twins meet to the end of the series, and the speed of events made the whole story confusing. The differences between the two were not obvious enough, and the story was not in depth enough. The only part of the movie I enjoyed was the cast, all of whom are terrific actors. However, while I enjoyed their performances, I was disappointed that Karsh was not old, Ileana was not self-centered, and Evan and the six-pack were completely missing from the movie. Also, it does not seem likely that with the twins living in the same city, they would not have even run in to each other by their 21st birthday. I was incredibly shocked at the contrast between the movie and the books.",
         "i usually don;t like Disney Channel Original Movies that much but i loved this one and i have been a fan of Tia and Tamera Mowry since Sister, Sister originally aired on UPN nd ABC. Tamera is a maturing as an actress even though i don't watch on a regular basis i love the parts of Strong Medicine i have seen. but i digress usually the Disney Channel Movies are just the same storyline different characters but i loved this and i am hoping they make merchandise because i would love to by a pendant set like the ones in TwiTches.i nearly cried at the end. Alex and Cameron are great characters i wish i had read these books. oh well. occasionally Disney Channel Makes something great. i enjoy Tia and tamera also because they're roughly the same age i am. Melissa",
         "We all need a fantasy and magical movie. This movie was really good and Tia and Tamera were magical on screen. Illena and Karsh were so funny, Kristen Wilson shined as Miranda. Lucenda and Beth were awesome and Mr and Mrs. Barns were perfect and the music was great to listen to and Thanos was really good. The special effects were amazing and it needed more magic. Twitches is great to watch anybody, if you want to watch a fantasy movie or if you want to watch a magical mystery movie then this movie is for you. I recommend anybody to watch it especially preteens or kids. The location is great and i loved the scene when Alex and Camyrn were playing around with their magic, it was so funny, especially turning karsh into a monkey. I give this movie a 9/10 rating.",
         "I was quite disappointed with this movie. I had read all the books and had enjoyed them quite a lot. When i saw the movie i was excited. I wasn't when the movie was finished. It was rather insulting. The movie was nothing what so ever like the books. It really disappointed me!! The characters name were all the same but there personalities were different.. The characters of ilena and karsh really got me angry they are not at all like that in the book, neither are marinda and thantos. If i was the writer of the books i would have been mortally insulted. If you're going to make a movie based on a book at least have the characters the same, or even the plot... It was a terrible movie to watch.!!",
         "I really enjoyed this movie. I've read the first novel of the series, and while it wasn't too much like it (I haven't finished the series), I like the movie. If it wasn't based off a series, it would have been very good. It still is. I was hoping it would be more like the series. I'm still a fan of the movie. It's actually one of my favorites. I'm a 22 year-old who loves it. I bought it on DVD. Totally worth seeing. I would have liked to have seen more of their powers that are in the novels, but I'm still happy with it. If you're into fun, witchy movies, you'll like it. Must see. Especially at Halloween. I watch it year round.",
         "I really enjoyed this film and found it to be funny and entertaining, but feel that the book series was poorly represented. It seemed that everything in the series was entirely changed for the movie and believe me there's one long list of changes. The main thing is that none of the characters in the book were represented well in the movie. The main one's are the twins who are supposed to be white, I just think to have Tia and Tamara was wrong; there was no mention or appearance of Cam's brother Dylan and Alex's telekinetic power was removed. Also Karsh and Thantos appearances were switched, Karsh is supposed to be old and Thantos middle-aged with a facial hair. I was really thrilled that the series was going to be made into a movie, but now that I have seen this movie and its representation I am very displeased. If you are going to turn a book into a movie, you have to keep in context with it and not change it around to suit your needs. There have been great series that have been turned into movies (ie. LOTR and Harry Potter)that have 90% stayed with the book, without TOTALLY changing them. I wish the writers and crew would've at least did their homework and read some of the book series and done the same with this movie. From what I've heard and the way it ended, it's been planned to make a TV series continuing from the movie. If they do I hope they make some serious changes or else many loyal fans will feel the same way I do and be disappointed.",
         "This movie is so bad I feel I can actually hear my daughter's brain melting as she watches it. An idiotic story line, coupled with pathetic acting, results in a movie that insults the viewer's every sense. I know the intended audience is preteen, but that does not mean the movie makers should have free license to ensure that the viewers become idiots in adulthood. I am almost beside myself with disgust. I blame Disney. Their movies and TV shows have become so excruciatingly trite, cutesy and devoid of any cultural value. I firmly believe that Walt Disney is turning in his grave at the drivel that comes out under his name these days. Not content with this cultural miscarriage, they went ahead and made a sequel. You have to wonder why the makers of this film seem to hate us so much.",
         "those of you who actually liked this movie must be like 12 or have never read the entire series. So Many things are wrong with it that the entire thing sucked. First of they had Karsh as a grumpy middle aged guy when he is supposed to be a wise elderly mentor for Ilena (Guardian) and the girls (Tracker). Ileana is supposed to be Vain Self absorbed shown easily through her \"Catch phrase\" for lack of a better term \"Call me goddess\". They entirely left out half of the cast such as 4/6 members of the 6-pack, Cam's Brother (Dylan), Evan (Alex and Lucinda's Friend), The entire town where Alex was supposed to grow up, Alex's Personality she is supposed to be a skater chick and the like. And also half of the plot line. I personally am insulted that that movie made it do DVD and the halloweentown movies didn't although Halloweentown High was a bit of a stretch it was a necessary fill in for them to continue and Return to Halloweentown was a success.",
         "This movie is horrible! If anyone has ever read even one of the books, you should realize that they completely screwed this up! I don't particularly like Disney to begin with, but this just throws the entire company down the tubes. Sorry if you like the Mowry twins, but they weren't right for the part, and gave a complete and totally different cast to the storyline. First off, the movie kills the entire plot line. Not only do they keep Karsh alive, but they match up Karsh and Illeana. Normally, I wouldn't complain about the amount of romance, but this is overkill. Karsh is around two or three hundred years old. Illeana is around thirty. Secondly, they didn't mention anything (to my knowledge) about any of the trials these girls went through in order to get to defeating Thantos. They don't give much on the other characters that help the story along, nor gave much on the girls' backgrounds. On the whole, it was really badly made, and I think, for those of us who are older than the average 8th grader, it gave the entire series a bad name. But then, each to his own. Make your own decisions. But I would suggest reading the books. For more information on the books by Randi Reisfeld and HB Gilmore, go to http://www.scholastic.com/titles/twitches/. ~Captain Nightheart",
         "I was a fan and reader of the books, which are awesome. This movie is great- for a Disney movie, a typical Disney movie. It is funny and cute, but that isn't like the books. I could go on and on with comparing- my sister's already heard all I thought as we watched this one and the second movie, and as I'm finishing up the series (going on the 10th book). If they made a movie or three or four (or how many it takes) to go along the books, then I'd like that. Not Disney though.. Heck, even a mini-series if done properly might be okay. But this movie is just not the same as the books. I hate the chant-phrase \"It's your birthday, It's your birthday\", and so I don't like when they say that. Personally, that's just lame. Tia and Tamara are getting older, but are great actresses but I liked and still like Sister, Sister... but although there acting isn't so bad (though it annoys me when they look at each other and scream... if I'm that scared enough to scream like that, I'm not going to look at my sister then scream...) this isn't their best acting. Sister, Sister to me is more real. So though its a funny, cute and magical movie (though not a lot of magic), I'd read the series that it is based off of if you haven't already. (And the sequel... well I like it more but still, like most sequels based off books, like The Cheetah Girls 2, falls even more away from the books then this first one).",
         "This movie is a horrible representation of the book. I can't believe that the authors even let them make this movie. The book was already doing great, then Disney Channel ruined it. I don't think I will ever watch it again!! The only thing the same about the book and the movie is the characters, that they are twin witches, and that they were separated at birth!! They can't even say T Witches right they said ta witches it really is tee witches!! If I ever meet the screen writers or the director they will get an ear full!!!!!",
         "Before the Sprouse twins arrived at Disney Studios, the Magic Kingdom had Tia and Tamera Mowry and at the height of their sister act career they did Twitches and its sequel Twitches Two for Disney. They still have careers, but I think they're concentrating on being wives and mothers. The girls are from another dimension in an enchanted kingdom called Coventry. They were separated at birth and given to different adoptive human parents, they still feel a connection and something missing. Their real mother is the Queen of Coventry and she's now married to her late husband's brother. At the age of 21 the two discover each other and while they like the idea of having their lives now explained the two have trouble getting together to fight the evil known as the Dark Shadow. That's the best part of the film, the concept of this nameless, formless evil is really frightening. I think some of you will note similarities with The Parent Trap, The Corsican Brothers and of course Hamlet in the genesis of this film. Some may find others. It's a nice mix, the girls are wholesome and attractive and this is a frightening film as much within the Disney G rated parameters as it can be.",
         "Twitches is a movie that has a kind heart and easygoing sentiment, which makes criticism and mediocre reception a bit disheartening. The film isn't particularly harmful, is very often silly, redundant, but always has its heart in the right place along with having the ability to be cherished by kids who grew up with it or a new generation of Disney Channel audiences. But film criticism - at least on my end - won't be as kind as I was hoping for Twitches. It's a pretty bland, frothy film, with little conflict, subpar special effects (especially considering its $20 million budget, which is absurdly large for a Television movie), and boring leads with little talents outside of having the looks to be on TV. The film could be an effective poster-child for describing the cinematic equivalent of flat soda. The film stars Tia and Tamera Mowry from TV's Sister, Sister (one of the many TV shows from the nineties my generation fetishizes). They star as Alexandra and Camryn, respectively, two magical twin sisters who were separated at birth when a war on their homeland of the Coventry claimed the life of their father. When their guardians transport them to the land where magic is non-existent - also known as Earth - the girls are raised in separate homes and have no idea of each others existence. Alex grows up quietly, with few friends and a mother who died recently. Meanwhile, Camryn is blessed with an upper-class lifestyle and a talent for drawing. The two girls celebrate their twenty-first birthday on Halloween, and run into each other at the mall. They are astounded by the fact that they look very similar to each other and are informed by those same aforementioned guardians of their life back in the Coventry. The girls both knew of the Coventry in some way, but never knew what its connection was. For example, Camryn thought it came directly from her mind when she was drawing. Now, in a time of total chaos, the sisters must restore the Coventry The sisters Mowry have the looks and charm to be on Television, but, as demeaning as it is to say, do not have the acting capabilities. Their performances are carried largely by smiles and perky attitudes, while their dialog is largely given nothing but a wooden justice. It also doesn't help that Stuart Gillard's direction is rather flat and, for some baffling reason, the four writers who joined forces to create this film couldn't breed some considerable life into its material. The production is either hopelessly cheesy, depressingly boring, or in search of a direction in between lax and flashy. Twitches works as serviceable Disney-fare, and doesn't possess any ridiculous characteristics many kids shows/movies are known to possess today. But, if anything, if this and Hocus Pocus prove anything it's that witches aren't that interesting, and very few directions may work to make them a viable point of interest in film. Starring: Tia Mowry, Tamera Mowry, Kristen Wilson, Patrick Fabian, Jennifer Robertson, and Pat Kelly. Directed by: Stuart Gillard.",
         "I think that this movie was brilliant,(sure the ending was a bit cliché,and they changed it from the book),but what are you gonna do eh? Also Karsh and Iliana Totally perfect for each other they do say Opposites attract!!! But the whole thing about love and being unlimited, that made me wrench!It kinda spoilt the whole movie!!!!!!!!!!!!!!!!!!! But it still was a excellent movie with awesome actors,with a capital a! I for one would love to have magic powers and Karsh as my protector also having Tia and Tamera Mowie as Alex and Camyrn ingenious.Plus the special effects were pretty cool but it could use a bit more razzle dazzle and more spells from the movie.But it is definitely a must-watch film on Disney channel!every one who loves a bit of magic and sparkle should OWN this!!!I do...GO TWITCHES,GO TWITCHES,GO TWITCHES...IT'S YOUR BIRTHDAY,IT'S YOUR BIRTHDAY!",
         "Twitches is another sad cheesy film. The plot I found was stale and feeble. The basic plot without giving anything away is two girls reunite on their 21st birthday after being adopted by two different families blah, blah they unite to fight the evil called the 'Darkness'. I won't tell you what the Darkness in fear of spoiling but if your over 15 you may smirk at what you see. The film is really, really predictable 20minutes in the film and you'll already have the story summed up. With the cheesy joke here and the failed drama there it is eventually twitches. This film is really for young girls, I saw it at my 12 year old cousins' house they liked it and I was appalled. Boo Twitches, Boo Twitches",
         "An absolutely wonderful movie featuring twin sisters Tia and Tamera Mowry. There are many, many absolutely hysterical lines and it will have you rolling around laughing. Mostly the acting is top-notch however there are a few corny lines. A great movie to watch as a family with a few kinda creepy parts which make it a unique movie for Disney. The all-around quality of 'Twitches' matches the greatness of 'Now you see it...' I highly recommend seeing this ASAP. I promise you'll enjoy it! The sisters reach their peak in their acting career with this and hopefully they will keep on getting better and better. Two thumbs WAAAYYY WAAAYYY UP!",
         "Overall this movie was really lacking what makes T*Witches \"magical\" for lack of a better term. This movie lacked the depth of the books and was made into a hokey comedy. After waiting years for this I am very displeased at what they have done to the books. It makes the books look corny and hokey, but they aren't. If you haven't read the books I suggest them to you, I think many will enjoy them more than this poor excuse for a movie \"based on them\" more like extremely loosely based on them. They probably should of went for the ages in the books since that's what Disney's age group target is around. They should of stuck to one of the books, or something. Actually I think they should of done a TV series it would of made more sense. The movie was not the most horrible thing I've ever seen but they could of done so much better with the material presented, or actually read the books! Or maybe have the authors come in and fill them in on the books if they don't have time to read them for the movie. It just sucks that this is what T*Witches fans have waited for years for, and this is what they get and it's all they will get. Which totally does, suck. I want to see the 5ft 4in, gray eyed, auburn haired, 14-16 year old twins from the books. I want to see their adventures played out, but I guess that'll never happen. :frowns: I guess I'll just re-read the book series when I get done with the book I'm reading and make my own movie in my head...",
         "Twitches was a fairly good movie. I'm currently twelve and have always liked to watch Halloween movies and this one is no exception. If you've ever watched sister, sister the way they meet is similar, of course from the commercials long lost twins separated then brought together. It's definitely one of the better DCOMs and it will probably be one of the few to make it to DVD. The ending is pretty obvious as the story goes on, but it's a good story all the same. A few parts made me laugh while others were dare I say boring. The characters were great for the movie and I really enjoyed watching it. I'm sure if you like magical movies like harry potter, you will like this as well.",
         "This television movie was great from start to finish. I feel the producers picked a great cast as you could see there was tremendous flow. The script was witty and what you would expect from a TV movie whose prime audience would be that of a young person. I am sure there are many children out there waiting for the next episode as the book has done extremely well. Stand Outs. Both Mowry Sisters did an awesome job, they made the movie very enjoyable. They had great energy and it showed in their body language. Nicole (Jessica Feliz), the little sister in the first scene. Where did this little girl come from. Cute and very talented. She will be a star for sure.",
         "OK, so there are a lot of movies based on books, and they are usually much worse, but this one is an exception: its is just utterly terrible!!! The T*Witches series were my favorite books growing up, and I read them again and again and again. I know them inside and out. So I also know that this movie hardly follows the same storyline at all. The girls are supposed to be resentful of each other. In the first book on the series, they almost hated each other, and when they met, they didn't even want to admit the other looked like them. And they were also only 14, and it wasn't their birthday. And they weren't even purposely brought together. They just happened to run into each other at a fairground where Alex worked. Alex was always more of a punk with brightly colored hair, and Cam is more of a prep. Karsh is supposed to be black, and VERY old! And Thantos isn't really that evil. In fact, in one of the books near the end of the series, he actually saves Cam from drowning. I haven't even seen the whole movie, and I don't ever plan on finishing it! The books I loved were a total sell out to some annoying \"Sister Sister\" Disney actresses. So you played twins on a Disney Channel show (that also sucked)? That doesn't mean you have what it takes to take on the roles of Artemis and Apolla! I would have actually preferred the Olsen Twins. At least in some of their movies they actually explored what most of us call \"acting.\"",
         "I have to say that I have never before read the books or anything about twitches until I saw the movie but I think it is the worst movie ever! The idea of the movie was great but everything else was crap! The time from the girls meeting to all the drama was so accelerated that my head was spinning so fast. As a matter of fact everything in the movie seemed to happen so fast. I love Tia and Tamara mowry in sister sister and even other movies but they seemed out of their depth in this movie because their acting was horrid and ghastly. From the comments by the other members of this website, I can only begin to imagine how far the movie steered away from the original books and i think that is such a shame as the storyline had so much potential. When will people learn that when making a movie based on a good book, don't change too much, because chances are that people like it that way! Needless to say, I cringed throughout the entire movie and i am not going to subject myself to that torment again. Fool me once, shame on the makers of the movie, but fool me twice, HUGE shame on me for being so gullible and idiotic!",
         "This movie is totally different from the books,but I still think its great to watch and children will never know the difference. I think that this movie with Tia and Tamera Mowry is really amazing and is a great Disney movie and I am looking forward to the second movie as well as others. Just to spoil the movie a little Thantos the twins uncles wants to kill them,but also married the girls mom and killed their dad and thousand of others in the movie but in the book he let his brother kill the girls father. Wow maybe I spoiled too much.Anyway to spoil a little more of the movie from the book is that in the book Illeana and Karsh are just friends and Karsh watches over the young minded witch.In the movie Karsh isn't an old man but younger and they both date each other, Illena is still absent minded but isn't at all bossy as she is in the book. Karsh is also way to goofy in the movie and not a bit serious as in the book except for a serious face in the movie."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": ["Disney Channel"],
      "summaries": [
         "In the magic realm of Coventry, the twin sisters Artemis and Apolla are saved by their protectors Illeana and Karsh from the Darkness and brought to another dimension. They are adopted by different families but in their twenty-first birthday, their protectors force them to meet each other. Alex Fielding lost her mother three months ago and is alone seeking a job while Camryn Barnes lives with her beloved wealthy parents. Once together they find that they have magic powers and they should return to Coventry to save their biological mother and their kingdom from the Darkness.",
         "Two teen witches who were separated at birth and were adopted by two different families meet on their 21st birthday and must use their powers to save the world in which they were born, where their birth mother still lives."
      ],
      "budget": 0
   },
   "movielensId": 164163,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2005-10-14",
      "dvdReleaseDate": null,
      "directors": ["Stuart Gillard"],
      "runtime": 86,
      "movieId": 164163,
      "title": "Twitches",
      "mpaa": "PG",
      "actors": [
         "Tia Mowry",
         "Tamera Mowry",
         "Kristen Wilson",
         "Patrick Fabian",
         "Jennifer Robertson",
         "Pat Kelly",
         "Jessica Greco",
         "Jackie Rosenbaum",
         "Arnold Pinnock",
         "Karen Holness",
         "Jessica Feliz",
         "David Ingram",
         "Kathryn Haggis",
         "Albert Howell",
         "Natalie Krill"
      ],
      "imdbMovieId": "0467421",
      "originalTitle": "Twitches",
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Fantasy",
         "TV Movie"
      ],
      "youtubeTrailerIds": ["W4ruy5AYbkw"],
      "plotSummary": "Twins separated at birth, Camryn and Alex meet by chance for the first time on their 21st birthday and discover they're witches with the power to save their homeland of Coventry from the evil that threatens it. But when Camryn leaves Alex to face the darkness alone, will Coventry be doomed? Or will the sisters multiply their magic by standing together?",
      "tmdbMovieId": 21481,
      "avgRating": 3.29688,
      "releaseYear": "2005",
      "numRatings": 32,
      "posterPath": "/vp5vsNH5JpoI9lBkrdCUBbfVdU4.jpg"
   }
}