{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "sword",
            "id": 1938
         },
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "ambition",
            "id": 3734
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "betrayal",
            "id": 10085
         },
         {
            "name": "werewolf",
            "id": 12564
         },
         {
            "name": "gothic",
            "id": 33505
         },
         {
            "name": "uzi",
            "id": 159932
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "urban gothic",
            "id": 232469
         }
      ],
      "imdb_id": "tt3717252",
      "video": false,
      "title": "Underworld: Blood Wars",
      "recommendations": [
         12437,
         834,
         173897,
         52520,
         277,
         311324,
         68735,
         274854,
         121856,
         47971,
         343611,
         205584,
         290595,
         324670,
         377264,
         68737,
         278924,
         47933,
         308531,
         282035
      ],
      "backdrop_path": "/PIXSMakrO3s2dqA7mCvAAoVR0E.jpg",
      "revenue": 81093313,
      "reviews": [
         {
            "author": "Gimly",
            "id": "5844cd0392514167640100cf",
            "content": "Visually has a lot of the things _Underworld_ is known for, but in terms of quality? Well if you liked _Awakening_, you'll like this. Because they're basically the same film. I for one liked neither.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._",
            "url": "https://www.themoviedb.org/review/5844cd0392514167640100cf"
         },
         {
            "author": "Frank Ochieng",
            "id": "586235ddc3a3681a6f03cca1",
            "content": "Some things will never change within the tedious and surprisingly long-running sci-fi/horror saga **Underworld** film franchise. The vampires will still feature sharp fangs that can pierce a hardened leather sofa with one bite and the werewolves will be hairier than the local women’s wig shop. Of course the curvaceous heroine of this Gothic gumball machine of a flick–_Love & Friendship’s_ Kate Beckinsale–will predictably wear leather-clad attire that will cling to her shapely body tighter than a preschooler hanging on to his mother’s leg because he is scared to enter the classroom for the very first time. What also is expected not to change anytime soon is the sluggish intrigue, overblown supernatural creatures acting more obnoxious than your drunk Uncle Jake wearing a bra at the family cookout and Beckinsale’s womanly warrior Selene acting as the badass bloodsucking babe out to mediate the conflicting forces that persist. Yes folks…you heard correctly that this is the fifth installment of the **Underworld**  universe that sits there and makes its presence known with all the force and feisty relevance of unwanted luggage left at the airport.\r\n\r\nFirst-time feature director Anna Foerster (from TV’s “Outlander”) takes a crack at instilling some frolicking freshness in the turgid, cheesy **Underworld: Blood Wars**–a banal B-movie confection that Dracula would refuse to acknowledge even if there was a free showing at the local blood bank. Relentlessly flat, unimaginative and woefully recycled, **Blood Wars** offers nothing inviting or challenging for its aforementioned fifth time around the block and should have resisted the need to go beyond its 2003 Len Wiseman-directed release nearly fourteen years ago. Nevertheless, the devoted fanboys gave battleground beauty Beckinsale a theatrical movie gig (along with the rising popularity of the vampires/werewolves craze in cinema) that has lasted for an impressive long time as inexplicable as that sounds. However, lasting power does not necessarily mean a hill of beans with the one-note notion of a former orphaned vampire gal transforming into a beastly butt-kicking wrecking ball as the fatal feuding between the Lycans (a.k.a. “lycanthrope” or werewolves) and vampires escalates to a new level of chaos. Sure, Selene is not exactly as convincingly clever or calculating as Aliens’ Ripley (then again who is, right?) but she certainly is cut out of the same generic cloth as _Resident Evil’s_ Alice (for which pre-dates the **Underworld** experience as well as offering a longer string of sequels).\r\n\r\nFoerster assures that **Underworld: Blood Wars** wastes no time in getting to the punchy antics of its silly-minded action sequences–some mired in empty-headed fun while other takes are needlessly monotonous. Screenwriters Cory Goodman and Kyle Ward stock up on the fluffy cliches of this toothless tease of a frivolous fable as the thin plot flies every which way more than Beckinsale’s golden locks during a heated scuffle. Sophomoric dialogue, formulaic confrontations and the dullness of opposing fierce factions set aside **Blood Wars** does make reasonable usage of its lethal leather-wearing lass Selene/Beckinsale in eye-rolling combat and the CGI visuals are engaging when not looking choppy in some instances. The fact that Selene has to negotiate some compromise for either side does introduce some slight sense of tension amid the roguish warfare and Beckinsale sells this quite accordingly to a certain degree. However, **Blood Wars** will definitely serve as comfort junk food for those legions of followers that have familiarized themselves with Selene’s jolting journey as she maneuvers through the manic mess that involves her blood-thirsty species taking on the hellish hairballs that are the defiant Lycans.\r\n\r\nFor first-time **Underworld** viewers or the casual crowd they will witness an under-cooked, ridiculously trite terror tale of an actioner that is sure to leave **Blood Wars** as nothing more than a false sense of second-hand stimulation. A generic exercise in the making, Foerster’s brooding bombshell in Beckinsale’s Selene is serviceable for a fifth go-around but that is really not saying too much given that the material never seems to revolve her from some of  her past misadventures through the four previous **Underworld** entries. The supporting players–such as Charles Dance’s elder vampire Thomas, Theo James’s David (the male Selene perhaps?), Lara Pulver’s Semira and Tobias Menzies’s Marius–are accomplished performers in their own right but they add little atmosphere to the hackneyed hedonism that toils within this supernatural stupor.\r\n\r\nNo need to put the stake through the heart of these returning vampires and werewolves because they have proven time in and time out over again that the sultry Selene and her creature feature bickering buddies are not budging anytime soon after almost fifteen years of conjuring up surreal nonsense. Kinda makes you consider putting a stake through your own chest, huh?\r\n\r\n**Underworld: Blood Wars** (2017)\r\n\r\nLakeshore Entertainment\r\n\r\n1 hr. 31 mins.\r\n\r\nStarring: Kate Beckinsale, Theo James, Charles Dance, Tobias Menzies, Lara Pulver, James Faulkner, Clementine Nicholson, Peter Andersson\r\n\r\nDirected by: Anna Foerster\r\n\r\nMPAA Rating: R\r\n\r\nGenre: Sci-Fi/Horror/Action & Adventure/Fantasy\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** (2016)",
            "url": "https://www.themoviedb.org/review/586235ddc3a3681a6f03cca1"
         },
         {
            "author": "ColinJ",
            "id": "58a50ff7925141654b001c5e",
            "content": "You know what to expect by now.\r\n\r\nThis series has been going on so long now that this movie almost comes across as a throwback, since it's still drenched in all the post-MATRIX visual cliches.\r\n\r\nBeckinsale is as remarkably photogenic as ever, but the camera never lingers on her face for more than about two seconds. The running time is as tight as her costume, and it feels rushed.\r\n\r\nWe have a few decent fight scenes but the gunplay is just a mush of noise with very little in the way of cool choreography.\r\n\r\nStill, there's fun to be had watching the gore and all the scenery-chewing that's going on.",
            "url": "https://www.themoviedb.org/review/58a50ff7925141654b001c5e"
         },
         {
            "author": "StbMDB",
            "id": "591f10359251414a57032e1c",
            "content": "This franchise was a thing back then when the Matrix phenomenon was at force but now a days they should let it rest, otherwise a cluster of nonsense, much like the Resident Evil movie franchise, it is sure to become. \r\n\r\nIn other words the movie ain't that bad but this entry is just franchise milking at this point.\r\n\r\nI wouldn't mind if it would be made a video game franchise though.",
            "url": "https://www.themoviedb.org/review/591f10359251414a57032e1c"
         },
         {
            "author": "Per Gunnar Jonsson",
            "id": "595614989251416914035101",
            "content": "I think it is fairly safe to say that if you did not like any of the other installments in the Underworld movie series then you will not like this one.\r\n\r\nAs usual with these kind of movies it is one where you preferably switch of most higher brain functions before watching and just sit down and enjoy the show. The movie is certainly not a masterpiece when it comes to story and script. Actually the script is, at times, fairly crappy. There are for example a sequence were the Lycans are attacking the stronghold castle of the Vampires and the script writer taught it was a good idea to just let them drive straight into the center of the castle and breach the door before they got challenged. What the f…?\r\n\r\nOn the whole the script is a typical Hollywood B-movie concoction that holds little merit. If this would have been the first movie in the series I think there would never had been a series made at all.\r\n\r\nSo why did I like it then? Well, even if the script is nothing to write home about it is not a total disaster and it serves as an excuse to provide 90 minutes of good entertaining Vampire vs Lycan action. Plain and simple.\r\n\r\nOf course Kate Beckinsale is a good reason for liking the movie as well. Her moving around in her intimidating (and good looking) skintight clothes slashing up Lycans in various creative ways makes up for some of the not so stellar script. I probably pissed of a bunch of feminists there but it is not really like a care about that.\r\n\r\nThe action and the CGI is reasonably well done and another reason to like the movie. Actually, come to think about it, Kate Beckinsale, the action and the CGI is pretty much the reasons I liked this movie.\r\n\r\nThey could have selected a more charismatic bad guy though. For most of the movie I felt Marcus was bland and even a bit dull.\r\n\r\nIt is not the best movie in the series but it does not exactly shame the series either. For me, I have to rate my enjoyment of it as above average compared to movies in general.",
            "url": "https://www.themoviedb.org/review/595614989251416914035101"
         },
         {
            "author": "Reno",
            "id": "59976854925141403a001efe",
            "content": "**The mission Eve has begun!**\r\n\r\nLike any guys from before the 90s, I was too a big fan of Beckinsale. There's no one can match her beauty, even to her age of today. That does not mean all her films are good. She has stopped doing good films a while ago. Every time when her films get released, I was hoping for her comeback like the old days, either a pure drama or an action film. No, not this film. It is what, the fifth in the franchise and the feature film debut for the directress of the television series.\r\n\r\nAs always, worth watching for Kate. The story continued, and it focused on the remaining vampires fighting for their survival against their arch-rival, Lycans. That's where the Selene caught between. But this time, it was about looking for her daughter, Eve, who holds the key to the future of these immortals. So the action begins where everybody clashes, racing towards their destination.\r\n\r\nThe first three were the good ones. This and the previous ones were downgraded the decent series. The makers are already working on the sixth. Definitely not expected, after seeing this particular film. But I hope it comes back to the original course with good story, actions, graphics and all. This was simply based on one liner, and the rest of the film leaned towards the stunt sequences. Okay to watch once, but I'm not sure worth of spending 90 minutes for it. So if you want to, then it is good to keep update to follow when the time comes to try the next ones.\r\n\r\n_4/10_",
            "url": "https://www.themoviedb.org/review/59976854925141403a001efe"
         },
         {
            "author": "DanDare",
            "id": "59bdc9dc925141350b01e440",
            "content": "Kate Beckinsale is back as Selene in Underworld:Blood Wars. Director Anna Foerster helpfully recaps the Underworld franchise, useful as they are in main forgettable films apart from the vision of Beckinsale in skin tight black leather.\r\n\r\nBlood Wars also gives us a lovely vision of Lara Pulver's treacherous vampire Semira in a dress that is just about held up by tape on her breasts.\r\n\r\nThe Lycans led by new leader Marius are slaughtering vampires are on the brink of victory. Marius pursues Selene as he needs her daughter's blood. \r\n\r\nSelene meanwhile has tried to make amends with the vampire elders with the help of David and his father but soon finds herself betrayed.\r\n\r\nThe plot is rather silly and illogical, the action is at least fast and furious, the CGI is a little cheap looking.",
            "url": "https://www.themoviedb.org/review/59bdc9dc925141350b01e440"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Selene",
               "gender": 1,
               "credit_id": "5590bec89251412963001c9f",
               "name": "Kate Beckinsale",
               "profile_path": "/jlleQafwnW1j0mvxJLiqnNL2mYh.jpg",
               "id": 3967,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "David",
               "gender": 2,
               "credit_id": "5590bed5925141325f000faa",
               "name": "Theo James",
               "profile_path": "/hLNSoQ3gc52X5VVb172yO3CuUEq.jpg",
               "id": 587020,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Marius",
               "gender": 2,
               "credit_id": "568564969251414ecb00d88e",
               "name": "Tobias Menzies",
               "profile_path": "/bXUpxFsIowySRyyqchaE1XprptI.jpg",
               "id": 10920,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Semira",
               "gender": 1,
               "credit_id": "568564c0c3a36860e901bef5",
               "name": "Lara Pulver",
               "profile_path": "/ve68vtNYVXmKjzn81zKhI7TWEvy.jpg",
               "id": 213083,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Varga",
               "gender": 2,
               "credit_id": "5685648492514131df019420",
               "name": "Bradley James",
               "profile_path": "/4XAtJsz67pmpIsCQ9SBKfqayk2d.jpg",
               "id": 154689,
               "order": 4
            },
            {
               "cast_id": 91,
               "character": "Vidar",
               "gender": 2,
               "credit_id": "58d190d4c3a36838e900e3f2",
               "name": "Peter Andersson",
               "profile_path": "/lWbWHUMAeEmTuNyXBMSzqzCbFOc.jpg",
               "id": 21193,
               "order": 5
            },
            {
               "cast_id": 90,
               "character": "Cassius",
               "gender": 2,
               "credit_id": "58d1907d9251411af400f4b8",
               "name": "James Faulkner",
               "profile_path": "/hIXsvwjcSwwn9elGLOCOD51M7Nb.jpg",
               "id": 9140,
               "order": 6
            },
            {
               "cast_id": 92,
               "character": "Lena",
               "gender": 0,
               "credit_id": "58d191059251411aef00efcd",
               "name": "Clementine Nicholson",
               "profile_path": "/zCKVo2bekHS6bxkEgNI1aXqHFRE.jpg",
               "id": 1781402,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Alexia",
               "gender": 1,
               "credit_id": "57ca6b3c9251413514000221",
               "name": "Daisy Head",
               "profile_path": "/33JAZTxDWj646mxdW1HksqHOsiY.jpg",
               "id": 1070886,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Gregor",
               "gender": 2,
               "credit_id": "568564ac9251412e5201a97e",
               "name": "Oliver Stark",
               "profile_path": "/5XrJkxXtqoy1fnur95MTDPY8K3p.jpg",
               "id": 1283871,
               "order": 9
            },
            {
               "cast_id": 8,
               "character": "Thomas",
               "gender": 2,
               "credit_id": "5685646e9251414ecb00d886",
               "name": "Charles Dance",
               "profile_path": "/bLT03rnI29YmbYWjA1JJCl4xVXw.jpg",
               "id": 4391,
               "order": 10
            },
            {
               "cast_id": 85,
               "character": "Vampire Council #1",
               "gender": 0,
               "credit_id": "58d18a61c3a36838d500cca4",
               "name": "Zuzana Stivínová",
               "profile_path": "/s58uq6wYFHok0lCHngE3NJHxer9.jpg",
               "id": 544246,
               "order": 11
            },
            {
               "cast_id": 86,
               "character": "Vampire Council #2",
               "gender": 2,
               "credit_id": "58d18a789251411aef00eaf5",
               "name": "Brian Caspe",
               "profile_path": "/1fDVsCwZOwp97Pdl7q743seHCMP.jpg",
               "id": 25730,
               "order": 12
            },
            {
               "cast_id": 88,
               "character": "Vampire Council #3",
               "gender": 0,
               "credit_id": "58d18bd69251411ae800f2df",
               "name": "Jan Nemejovský",
               "profile_path": "/nD9R9fPvTejXCIcP6OwdVDNNkyE.jpg",
               "id": 183737,
               "order": 13
            },
            {
               "cast_id": 89,
               "character": "Amelia",
               "gender": 1,
               "credit_id": "58d18c61c3a36838e900e0c7",
               "name": "Sveta Driga",
               "profile_path": "/smts5tqPs9wZjX49lCcsXIJbJFT.jpg",
               "id": 1781392,
               "order": 14
            },
            {
               "cast_id": 87,
               "character": "Lycan Pack Leader #1",
               "gender": 0,
               "credit_id": "58d18acd9251411acb00eb43",
               "name": "Dan Bradford",
               "profile_path": "/yPUG9ktvrzH96YFbNxQRGOeKIC6.jpg",
               "id": 1781390,
               "order": 15
            },
            {
               "cast_id": 17,
               "character": "Lycan Pack Leader #2",
               "gender": 0,
               "credit_id": "5808c9189251410d8e008f76",
               "name": "David Bowles",
               "profile_path": "/9zxCUoNM1nfoHgAUooepG8fIsFQ.jpg",
               "id": 993074,
               "order": 16
            },
            {
               "cast_id": 117,
               "character": "Lycan Pack Leader #3",
               "gender": 0,
               "credit_id": "59e2574b925141635c001f20",
               "name": "Tomas Fisher",
               "profile_path": null,
               "id": 1905751,
               "order": 17
            },
            {
               "cast_id": 118,
               "character": "Lycan Pack Leader #4",
               "gender": 0,
               "credit_id": "59e259c1c3a3687c6e001e6f",
               "name": "Rostislav Novák ml.",
               "profile_path": "/uFDF4CdDDV1j38w3Y4SRmWQL9Z.jpg",
               "id": 1350051,
               "order": 18
            },
            {
               "cast_id": 13,
               "character": "Tech Lycan",
               "gender": 1,
               "credit_id": "56d70b1f9251414291001dab",
               "name": "Eva Larvoire",
               "profile_path": "/Aq96CWP3Pub2CdWSNbL5eaTwRt0.jpg",
               "id": 1585399,
               "order": 19
            },
            {
               "cast_id": 102,
               "character": "Lycan Underling",
               "gender": 0,
               "credit_id": "59b1b3d9925141079d08a36f",
               "name": "Jiri N. Jelinek",
               "profile_path": "/iAUSldpxhrFOPeNxuttujlfYabM.jpg",
               "id": 1883799,
               "order": 20
            },
            {
               "cast_id": 94,
               "character": "Black Lycan Sidekick",
               "gender": 0,
               "credit_id": "58d193169251411af400f6a2",
               "name": "Marielle Tepper",
               "profile_path": "/9jSqJnGC6B3FIWszo5trA0h2hu.jpg",
               "id": 1781409,
               "order": 21
            },
            {
               "cast_id": 93,
               "character": "Lead Death Dealer",
               "gender": 0,
               "credit_id": "58d192309251411ab500f7e7",
               "name": "Jordan Haj",
               "profile_path": "/fmN40T8ZrUhPvWeqVDYGIcIE5GR.jpg",
               "id": 1781403,
               "order": 22
            },
            {
               "cast_id": 103,
               "character": "Death Dealer",
               "gender": 0,
               "credit_id": "59b1b4c7925141078a091148",
               "name": "Daniel Pietrucha",
               "profile_path": "/oVlq3oKVQQRKKypTZ5CqTRsgvKL.jpg",
               "id": 1883800,
               "order": 23
            },
            {
               "cast_id": 119,
               "character": "Vampire Cadet #1",
               "gender": 0,
               "credit_id": "59e25b01c3a3687c37002086",
               "name": "Jakub Kropáček",
               "profile_path": null,
               "id": 1623514,
               "order": 24
            },
            {
               "cast_id": 104,
               "character": "Vampire Cadet #2",
               "gender": 0,
               "credit_id": "59b1b6acc3a3681fcc036b01",
               "name": "Sára Arnsteinová",
               "profile_path": "/t56cLCb45FshMDy9dXgqKLsWOCC.jpg",
               "id": 1883803,
               "order": 25
            },
            {
               "cast_id": 120,
               "character": "Cello Vampire #1",
               "gender": 0,
               "credit_id": "59e25e029251416360002689",
               "name": "Irena Morisakova",
               "profile_path": null,
               "id": 1905788,
               "order": 26
            },
            {
               "cast_id": 121,
               "character": "Cello Vampire #2",
               "gender": 0,
               "credit_id": "59e25e21925141635c0027cb",
               "name": "Terezie Kovalova",
               "profile_path": null,
               "id": 1905789,
               "order": 27
            },
            {
               "cast_id": 122,
               "character": "Cello Vampire #3",
               "gender": 0,
               "credit_id": "59e25e31c3a3687c50002836",
               "name": "Tomas Fingerland",
               "profile_path": null,
               "id": 1905790,
               "order": 28
            },
            {
               "cast_id": 123,
               "character": "Cello Vampire #4",
               "gender": 0,
               "credit_id": "59e25e4092514163600026d8",
               "name": "Jakub Mayer",
               "profile_path": null,
               "id": 1905791,
               "order": 29
            },
            {
               "cast_id": 124,
               "character": "Society Vampire #1",
               "gender": 0,
               "credit_id": "59e25e5b92514163b3002765",
               "name": "Denisa Krskova",
               "profile_path": null,
               "id": 1905792,
               "order": 30
            },
            {
               "cast_id": 125,
               "character": "Society Vampire #2",
               "gender": 0,
               "credit_id": "59e25e6dc3a3687c60002453",
               "name": "Simona Simkova",
               "profile_path": null,
               "id": 1905793,
               "order": 31
            },
            {
               "cast_id": 126,
               "character": "Society Vampire #3",
               "gender": 0,
               "credit_id": "59e25e7bc3a3687c180027e7",
               "name": "Daniel Vojtech",
               "profile_path": null,
               "id": 1905794,
               "order": 32
            },
            {
               "cast_id": 127,
               "character": "Control Room Vampire",
               "gender": 0,
               "credit_id": "59e25e95c3a3687c60002488",
               "name": "Jared Doreck",
               "profile_path": null,
               "id": 1397133,
               "order": 33
            },
            {
               "cast_id": 128,
               "character": "Nordic Vampire #1",
               "gender": 0,
               "credit_id": "59e25eb0c3a3687c500028df",
               "name": "Lukas Vydrzal",
               "profile_path": null,
               "id": 1905795,
               "order": 34
            },
            {
               "cast_id": 129,
               "character": "Nordic Vampire #2",
               "gender": 0,
               "credit_id": "59e25ec892514163a00027e4",
               "name": "Lukas Krampera",
               "profile_path": null,
               "id": 1905796,
               "order": 35
            },
            {
               "cast_id": 130,
               "character": "Nordic Child #1",
               "gender": 0,
               "credit_id": "59e25edc925141635c0028bd",
               "name": "Adam Vosecek",
               "profile_path": null,
               "id": 1905797,
               "order": 36
            },
            {
               "cast_id": 131,
               "character": "Nordic Child #2",
               "gender": 0,
               "credit_id": "59e25ef792514163a0002820",
               "name": "Agatha Hofmanová",
               "profile_path": null,
               "id": 1905798,
               "order": 37
            },
            {
               "cast_id": 132,
               "character": "Nordic Child #3",
               "gender": 0,
               "credit_id": "59e25f09c3a3687c28002856",
               "name": "Anezka Nosková",
               "profile_path": null,
               "id": 1905799,
               "order": 38
            },
            {
               "cast_id": 15,
               "character": "Safehouse Lycan",
               "gender": 1,
               "credit_id": "5808c89e9251410d8e008f28",
               "name": "Alicia Vela-Bailey",
               "profile_path": "/kVuyn6sS7ZSBlXVjjxq0LSE3k4I.jpg",
               "id": 1186027,
               "order": 39
            },
            {
               "cast_id": 4,
               "character": "Eve (uncredited)",
               "gender": 1,
               "credit_id": "55c8fba59251413fcd000057",
               "name": "India Eisley",
               "profile_path": "/njL744BT8mz9jf2TxcZDnSOEZFb.jpg",
               "id": 221116,
               "order": 40
            },
            {
               "cast_id": 16,
               "character": "Hybrid Michael (uncredited)",
               "gender": 0,
               "credit_id": "5808c8cac3a36874cd009124",
               "name": "Trent Garrett",
               "profile_path": "/w9J2snV7QI71B5F7rCxfPqeS7GU.jpg",
               "id": 1440179,
               "order": 41
            },
            {
               "cast_id": 133,
               "character": "Lycan (uncredited)",
               "gender": 0,
               "credit_id": "5a1e8b200e0a264cc10763e0",
               "name": "Martavious Gayles",
               "profile_path": null,
               "id": 1660249,
               "order": 42
            },
            {
               "cast_id": 134,
               "character": "Lycan in Tunnel (uncredited)",
               "gender": 0,
               "credit_id": "5a1e8b3892514103330764fb",
               "name": "Miroslav Lhotka",
               "profile_path": null,
               "id": 1506768,
               "order": 43
            },
            {
               "cast_id": 135,
               "character": "Lycan (uncredited)",
               "gender": 0,
               "credit_id": "5a1e8b49925141033307650a",
               "name": "Richard William Romanov",
               "profile_path": null,
               "id": 1931981,
               "order": 44
            },
            {
               "cast_id": 136,
               "character": "Lycan (uncredited)",
               "gender": 0,
               "credit_id": "5a1e8b610e0a264cbc07b127",
               "name": "Junes Zahdi",
               "profile_path": "/96AWXSOZt4rHJV0CZ1T1cOxv0RH.jpg",
               "id": 1502670,
               "order": 45
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "5590be5ac3a3684349004046",
               "name": "Anna Foerster",
               "profile_path": "/nZNzWyFZwZgsaPd9bFn6s4sNAfN.jpg",
               "id": 402272,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55c8fbb9c3a3681dd9000068",
               "name": "Kevin Grevioux",
               "profile_path": "/3ht6uH2XMultxyUISAPftBYHwiB.jpg",
               "id": 3952,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "55c8fbc692514177c40002f9",
               "name": "Danny McBride",
               "profile_path": "/qpI6uEVCVTQbkAZbAxEukkuJmd7.jpg",
               "id": 1248221,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "55c8fbd292514177cc00031d",
               "name": "Len Wiseman",
               "profile_path": "/8YblO53JkrcfiZ4I2uy8yGimLxn.jpg",
               "id": 3950,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "589d01c5925141207100000e",
               "name": "Kyle Ward",
               "profile_path": null,
               "id": 118413,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "5808ca919251410f9d00920a",
               "name": "Anna Foerster",
               "profile_path": "/nZNzWyFZwZgsaPd9bFn6s4sNAfN.jpg",
               "id": 402272,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5808caa5c3a368752b0089c7",
               "name": "Skip Williamson",
               "profile_path": null,
               "id": 3955,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5808cabc925141033e00954b",
               "name": "David Kern",
               "profile_path": null,
               "id": 1203578,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5808cad09251410f9d00922e",
               "name": "Gary Lucchesi",
               "profile_path": "/zQRUANlcJXa1TFVoCYK1vjIMmEh.jpg",
               "id": 3953,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5808caebc3a36874ea008084",
               "name": "Tom Rosenberg",
               "profile_path": null,
               "id": 68602,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5808caffc3a368733200837f",
               "name": "Len Wiseman",
               "profile_path": "/8YblO53JkrcfiZ4I2uy8yGimLxn.jpg",
               "id": 3950,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5808cb10c3a368752b008a0c",
               "name": "Richard S. Wright",
               "profile_path": null,
               "id": 3954,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5808cb33c3a368664b0091be",
               "name": "Michael Wandmacher",
               "profile_path": null,
               "id": 60102,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5808cc299251410fe3008f15",
               "name": "Peter Amundson",
               "profile_path": null,
               "id": 10833,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "584d3dffc3a3682acd00b63e",
               "name": "Julie Hutchinson",
               "profile_path": null,
               "id": 1626017,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "584d3de8c3a3682ac500ab93",
               "name": "Karl Walter Lindenlaub",
               "profile_path": null,
               "id": 8677,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "584d3e0f9251411e3800a25a",
               "name": "Maya Kvetny",
               "profile_path": null,
               "id": 1466699,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "584d3e41c3a3682ada00a068",
               "name": "Laura Windows",
               "profile_path": null,
               "id": 1435623,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "584d3ee7c3a3682ac500ac17",
               "name": "Nevin Seus",
               "profile_path": null,
               "id": 1360111,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "584d3ef89251411e2f00a106",
               "name": "Brian McNelis",
               "profile_path": null,
               "id": 1363083,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584d3f099251411e3100a291",
               "name": "Eric Craig",
               "profile_path": null,
               "id": 1555693,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "584d3f2cc3a3683dae001f8f",
               "name": "Ondrej Nekvasil",
               "profile_path": null,
               "id": 962085,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "584d3f40c3a3682ac500ac39",
               "name": "Bryce Tibbey",
               "profile_path": null,
               "id": 1554737,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "584d3f62c3a3683dae001fa4",
               "name": "Katerina van Gemundova",
               "profile_path": null,
               "id": 1398908,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "584d3f9cc3a3682aca00a9b1",
               "name": "Martin Vackár",
               "profile_path": null,
               "id": 1404356,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 1,
               "credit_id": "584d3fae9251411e26009f46",
               "name": "Bojana Nikitović",
               "profile_path": null,
               "id": 1052870,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "584d3fddc3a3682acd00b732",
               "name": "Sarka Zazvorkova",
               "profile_path": null,
               "id": 1483847,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584d3ff0c3a3682ada00a114",
               "name": "Nina Moravcova",
               "profile_path": null,
               "id": 1721315,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "584d40009251411e35009dfe",
               "name": "Jirí Trier",
               "profile_path": null,
               "id": 1721316,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "584d409ac3a3682ad70095d9",
               "name": "Jaromir Sedina",
               "profile_path": null,
               "id": 1398934,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 2,
               "credit_id": "584d40b59251411e3100a36f",
               "name": "Larry D. Horricks",
               "profile_path": null,
               "id": 1408825,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "584d40cf9251411e2c00a5f3",
               "name": "Alex Kornreich",
               "profile_path": null,
               "id": 1451882,
               "department": "Camera",
               "job": "Additional Camera"
            },
            {
               "gender": 0,
               "credit_id": "584d40e0c3a3682ada00a18d",
               "name": "Dan Balzer",
               "profile_path": null,
               "id": 1721319,
               "department": "Camera",
               "job": "First Assistant Camera"
            },
            {
               "gender": 0,
               "credit_id": "584d41009251411e3b00a58a",
               "name": "Gary Winter",
               "profile_path": null,
               "id": 1721320,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "584d416ec3a3682acd00b819",
               "name": "Matt Weaver",
               "profile_path": null,
               "id": 1452998,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "584d41849251411e2c00a652",
               "name": "Justin Brunett",
               "profile_path": null,
               "id": 1721325,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "584d41939251411e2f00a239",
               "name": "Ngan Chung",
               "profile_path": null,
               "id": 1721326,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "584d41a49251411e2c00a665",
               "name": "Meghan Grube",
               "profile_path": null,
               "id": 1721327,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "584d41bdc3a3682ad40096a6",
               "name": "Fraser Page",
               "profile_path": null,
               "id": 1721331,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "584d41ce9251411e2900a430",
               "name": "Jaco Pretorius",
               "profile_path": null,
               "id": 1721333,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "584d41de9251411e3b00a616",
               "name": "Erica Robinson",
               "profile_path": null,
               "id": 1721334,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "584d41f9c3a3682ac500ada1",
               "name": "Jared Krichevsky",
               "profile_path": null,
               "id": 1660722,
               "department": "Visual Effects",
               "job": "Creature Design"
            },
            {
               "gender": 0,
               "credit_id": "584d420f9251411e35009f01",
               "name": "Paul Janssen",
               "profile_path": null,
               "id": 1440909,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584d42209251411e2f00a27f",
               "name": "Andrew Zink",
               "profile_path": null,
               "id": 1721336,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584d424d9251411e3100a42f",
               "name": "Josh Simmonds",
               "profile_path": null,
               "id": 1721337,
               "department": "Visual Effects",
               "job": "VFX Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584d42659251411e3100a448",
               "name": "Eva Peschkes",
               "profile_path": null,
               "id": 1721338,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "584d4278c3a3682ad70096ad",
               "name": "Ludek Vomacka",
               "profile_path": null,
               "id": 1721340,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "584d4293c3a3683dae002165",
               "name": "Michael Gilbert",
               "profile_path": null,
               "id": 1717741,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "584d42a59251411e2f00a2cd",
               "name": "Holger Hummel",
               "profile_path": null,
               "id": 1452627,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 2,
               "credit_id": "584d42b89251411e35009f76",
               "name": "James McQuaide",
               "profile_path": null,
               "id": 3958,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "584d42ca9251411e3b00a6a4",
               "name": "Jamie Hallett",
               "profile_path": null,
               "id": 1472788,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584d42de9251411e3b00a6b2",
               "name": "Michael Landgrebe",
               "profile_path": null,
               "id": 1427572,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "584d42fec3a3682aca00ab7a",
               "name": "Vanessa Lapato",
               "profile_path": null,
               "id": 1425343,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "584d43119251411e2900a4de",
               "name": "Lauren Hadaway",
               "profile_path": null,
               "id": 1437193,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 0,
               "credit_id": "584d432a9251411e3b00a6e9",
               "name": "Michal Holubec",
               "profile_path": null,
               "id": 1338845,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "584d43439251411e3b00a6fa",
               "name": "Christopher S. Aud",
               "profile_path": null,
               "id": 1392131,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "584d43579251411e35009fcf",
               "name": "Chris Diebold",
               "profile_path": null,
               "id": 1338482,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "584d436a9251411e3800a507",
               "name": "Jeff Sawyer",
               "profile_path": null,
               "id": 1417516,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "584d437f9251411e3b00a727",
               "name": "Michael Babcock",
               "profile_path": null,
               "id": 1417514,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "584d4396c3a3682aca00abd7",
               "name": "Tony Lamberti",
               "profile_path": "/jQTxQeV6n6zjRYDgyxiQzUx08Kq.jpg",
               "id": 13179,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "584d43adc3a3682ac500aeac",
               "name": "Michael Babcock",
               "profile_path": null,
               "id": 1417514,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "584d43f7c3a3682ad7009792",
               "name": "Jaime Leigh McIntosh",
               "profile_path": null,
               "id": 1635484,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "584d441fc3a3682ac7009d2e",
               "name": "Natasha Lees",
               "profile_path": null,
               "id": 1568901,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "584d4432c3a3682ad400980d",
               "name": "Chase Aston",
               "profile_path": null,
               "id": 1721345,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "584d444c9251411e2900a5b1",
               "name": "Davina Lamont",
               "profile_path": null,
               "id": 1569347,
               "department": "Costume & Make-Up",
               "job": "Makeup Designer"
            },
            {
               "gender": 0,
               "credit_id": "584d446c9251411e2c00a851",
               "name": "Siggy Ferstl",
               "profile_path": null,
               "id": 1638160,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "589d0170c3a3681165003665",
               "name": "Cory Goodman",
               "profile_path": null,
               "id": 120119,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "589d01f6c3a3684f6a000021",
               "name": "Cory Goodman",
               "profile_path": null,
               "id": 120119,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "592c21599251413b8a07362f",
               "name": "Petr Richter",
               "profile_path": null,
               "id": 1825671,
               "department": "Art",
               "job": "Property Master"
            },
            {
               "gender": 0,
               "credit_id": "592c21e79251413b4a074da3",
               "name": "Bart de Haan",
               "profile_path": null,
               "id": 1825672,
               "department": "Camera",
               "job": "Russian Arm Operator"
            },
            {
               "gender": 0,
               "credit_id": "592c2222c3a368782d06ee51",
               "name": "Karel Fairaisl",
               "profile_path": null,
               "id": 592772,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "592c22709251413ba006dcb7",
               "name": "Luka Antonic",
               "profile_path": null,
               "id": 1825673,
               "department": "Costume & Make-Up",
               "job": "Costume Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "592c2285c3a368782d06eec1",
               "name": "Veronika Metzova",
               "profile_path": null,
               "id": 1699499,
               "department": "Costume & Make-Up",
               "job": "Key Costumer"
            },
            {
               "gender": 0,
               "credit_id": "592c22f4c3a36877bc07e3b4",
               "name": "Monika Hlavatá",
               "profile_path": null,
               "id": 1773339,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "592c23529251413b8a073820",
               "name": "Alexandre Cancado",
               "profile_path": null,
               "id": 1746433,
               "department": "Visual Effects",
               "job": "2D Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "59e24ef1c3a3687c28001408",
               "name": "James McQuaide",
               "profile_path": null,
               "id": 3958,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "59e24f0192514163ad001373",
               "name": "Eric Reid",
               "profile_path": null,
               "id": 52790,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "59e24f7a9251416388001490",
               "name": "Henry Winterstern",
               "profile_path": null,
               "id": 3956,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "59e24f89c3a3687c6e0012ff",
               "name": "Ben Waisbren",
               "profile_path": null,
               "id": 6874,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "59e2501bc3a3687c37001423",
               "name": "Matthew Stillman",
               "profile_path": null,
               "id": 4856,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "59e2502bc3a3687c6e0013e4",
               "name": "David Minkowski",
               "profile_path": null,
               "id": 4854,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "59e2503c925141635c001672",
               "name": "Jackie Shenoo",
               "profile_path": null,
               "id": 1626015,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 1,
               "credit_id": "59e2521ac3a3687c600016a8",
               "name": "Suzanne M. Smith",
               "profile_path": null,
               "id": 1398505,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "59e254119251416364001b64",
               "name": "David Kern",
               "profile_path": null,
               "id": 1203578,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "59e25426c3a3687bdd001c04",
               "name": "Richard S. Wright",
               "profile_path": null,
               "id": 3954,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "59e2553f92514163b3001cb6",
               "name": "Paul Barry",
               "profile_path": null,
               "id": 1127472,
               "department": "Directing",
               "job": "First Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "59e25568c3a3687c28001c83",
               "name": "Megan Shank",
               "profile_path": null,
               "id": 1905737,
               "department": "Directing",
               "job": "Second Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 21.307051,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 346672,
      "vote_count": 1846,
      "budget": 35000000,
      "overview": "Vampire death dealer Selene fends off brutal attacks from both the Lycan clan and the Vampire faction that betrayed her. With her only allies, David and his father Thomas, she must stop the eternal war between Lycans and Vampires, even if it means she has to make the ultimate sacrifice.",
      "similar": [
         24,
         140300,
         12437,
         2907,
         18239,
         277,
         605,
         604,
         834,
         8966,
         24021,
         50619,
         52520,
         62213,
         123553,
         55292,
         252171,
         9053,
         8202,
         9502
      ],
      "original_title": "Underworld: Blood Wars",
      "runtime": 91,
      "poster_path": "/nHXiMnWUAUba2LZ0dFkNDVdvJ1o.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "",
            "iso_639_1": "km"
         },
         {
            "name": "Український",
            "iso_639_1": "uk"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Lakeshore Entertainment",
            "id": 126,
            "origin_country": ""
         },
         {
            "logo_path": "/bz6GbCQQXGNE56LTW9dwgksW0Iw.png",
            "name": "Screen Gems",
            "id": 3287,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Sketch Films",
            "id": 7738,
            "origin_country": ""
         }
      ],
      "release_date": "2016-11-28",
      "vote_average": 5.3,
      "belongs_to_collection": {
         "backdrop_path": "/2gSaXagD9ZCuBHOsXF4tvtW7Djd.jpg",
         "name": "Underworld Collection",
         "id": 2326,
         "poster_path": "/aK8qq0X0pZbf5ncE3JLQ27hdC4F.jpg"
      },
      "tagline": "Protect the Bloodline",
      "adult": false,
      "homepage": "http://www.underworldbloodwars-movie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Anna Foerster"],
      "runtime": 91,
      "synopsis": "The film starts with a recap of the previous 'Underworld' films. The vampire Selene (Kate Beckinsale) has been a death dealer for thousands of years in the war against the lycans (werewolves). She was betrayed by the vampire elder Viktor (Bill Nighy) and later met and fell in love with Michael Corvin (Scott Speedman), who would become the first vampire-lycan hybrid. Selene and Michael's daughter Eve (India Eisley) is the first pureblood hybrid. Selene was forced to keep Eve in hiding to keep her safe as she went to look for Michael. Without Michael, Eve, or her coven, Selene feels alone as both vampires and lycans are hunting her. The lycans have a new leader named Marius (Tobias Menzies). Selene rides her motorcycle as she's being pursued by a group of lycans. She battles the men as they morph into their wolf forms, just as David (Theo James) arrives to help her. He shoots one of the lycans in the foot as an incentive to send a message to Marius, but David also ends up getting shot. David's father Thomas (Charles Dance) arrives at the home of the Eastern vampire coven, where he is greeted by Varga (Bradley James). Varga brings Thomas to Semira (Lara Pulver), a high-ranking vampire in the coven. They discuss the growth of Marius's lycan army and the destruction of the Western coven, with the main concern being to prevent a potential full-scale lycan attack. Semira also hoped to succeed Viktor as an elder after Selene killed him, and she, along with a vampire leader named Cassius (James Faulkner), wants to prosecute her for it. Marius meets with his group in their hideout. He lays out a plan of attack so that the lycans can destroy the vampire's sanctuary, but Marius also wants Eve's blood to gain a great power. Thomas speaks before Cassius and the other vampire council members to convince them to allow Selene to train new death dealer recruits. After Selene helps take the bullet out of David, they are found by two vampires who escort them back to the sanctuary, where Selene is introduced to the recruits and is told she will teach them how to fight against lycans. Meanwhile, it is revealed here that Semira and Varga are secret lovers, with Semira conspiring to get rid of Selene and the others leaders in order to step up as a vampire elder. Selene begins her training with the recruits. She teaches them that lycans are vulnerable in their wolf forms because they are unable to use weapons. Varga demonstrates combat with Selene, but he overpowers and incapacitates her. He then shoots all of the recruits and burns them. Varga and Semira frame Selene for killing them. She and David run, and Thomas helps them get out. Semira catches them and kills Thomas in front of David before he and Selene escape. Semira sends a vampire named Alexia (Daisy Head) out to find Selene and David. Alexia meets with Marius, as they are engaged in a forbidden affair. She tells Marius about Selene's escape and how the other vampires are closing in on him and his clan. Selene and David head to the sanctuary of the Nordic vampire coven. They meet Lena (Clementine Nicholson) and her father Vidar (Peter Andersson). Vidar reveals to David that his mother was Amelia (Sveta Driga), one of the original vampire elders alongside Viktor. David doesn't believe it as he always thought his mother abandoned him. Vidar gives David a sword made of pure silver that was Thomas's greatest weapon. Selene feels shame for herself since she was unable to take care of Eve and considers herself a failure as a mother and warrior. As David talks to her, she gives him a vial containing Amelia's blood. The lycans eventually find the sanctuary and begin to attack. The vampires fight back as Selene and David try to help. David manages to slice one lycan in half with his father's sword. Marius finds Selene and fights her on the ice. He demands to know where Eve is. Alexia impales Selene with a sword. She licks the blood off of it and sees Selene's memories, confirming to Marius that she really doesn't know where Eve is. Selene sinks into the icy waters. Lena later recovers Selene and begins to revive her. Back in the Eastern coven, Semira drinks a large glass of Selene's blood to absorb the same kind of power she has. Alexia returns to give Semira more information, but Semira quickly learns of Alexia's affair with Marius, and she slits her throat as a result. David goes to confront Semira and the council. He tells them that he is Amelia's son. Knowing his claim would be challenged, he gives Cassius the vial with his mother's blood. Cassius drinks it and sees Amelia's memories, confirming the truth that David is the last pureblood. Semira orders Varga to kill David, but he has shifted his allegiance to the rightful leader. Varga orders Semira to be detained. Marius and his army soon storm the house, leading to a climatic bloody battle between the vampires and lycans. The lycans break open the windows, leaving the vampires exposed to light and burning them. Lena and her own army arrives and join the fight. Selene returns, now more powerful (and with highlights and a fur coat for some reason) after her revival. She fights against Marius once more while David takes on Semira. After a bladed duel, Semira is exposed to the sunlight but is now immune. She isn't immune, however, to David's sword as he runs it through her head and kills her. Meanwhile, Marius morphs into a gigantic wolf creature. He is wounded and some of his blood hits Selene's mouth. She sees into his memories and learns that Marius found Michael and murdered him. Selene manages to rip Marius's spine out, ending him for good. Selene and David interrupt the continuing battle to show Marius's severed head to the lycans, forcing them to retreat. Selene, David, and Lena are then initiated as the new vampire elders. Selene thinks that for now, she may have found peace. The film ends with a brief clip of Selene seeing Eve walking on the ice outside the Nordic coven's sanctuary.",
      "writers": [
         "Cory Goodman",
         "Kyle Ward"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3717252/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjI5Njk0NTIyNV5BMl5BanBnXkFtZTgwNjU4MjY5MDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Kate Beckinsale",
         "Theo James",
         "Tobias Menzies"
      ],
      "reviews": [
         "I enjoy (good) vampire movies, dark movies, good screenplays, good production, good screenplay, good cinematography and characters like Selene. This means I really enjoyed the first three Underworld movies, provided we ignore the prequel which was no more than acceptable. It also means that this movie ruined the franchise for me. Production was poor and clearly quite low budget (reuse of the same footage on a few occasions, etc.), the script was inadequate and, while Anna Foerster has put in some credible performances in TV, this was quite poor. Len Wiseman, or even Mårlind and Stein, could conceivably have turned this into a movie worthy of the franchise. There is also a hole in the plot worthy of a B-grade horror. SPOILER ALERT. And here comes the spoiler: The very premise of the movie is that Semira's coven is impregnable and Marius would be foolish to attack it without the blood of Selene's daughter. The werewolves specifically state that they \"looked for any weaknesses and there are none\". Then, later on in the movie, with no such blood, the werewolves walk in there like they own the place and it is clear that they would have taken the coven has it not been for the arrival of a transformed Selene with significant backup. The entire first 80% of the movie is rendered superfluous in one scene. SPOILER ENDS And so the great Underworld franchise goes out with a whimper. Neither Kate Beckinsale nor the character of Selene deserved this, some heads should be hung in shame.",
         "These movies were never made for Oscar consideration, I understand that, but the first three at least tried something. Creating some kind of mythology, war between vampires and lycans. Solid concept for the fans of these types of films that offer a bit of story and focus more on action and gore. First Underworld, released back in 2003, is pretty solid action-horror film. Sequel, Underworld: Evolution expanded the origin story for these species, while Underworld: Rise of the Lycans served as prequel, giving us idea how and why the whole grudge between vampires and lycans started. Then came 4th film, Awakening, solid concept but lame execution. Very forgettable film, even for Underworld fans. And now we have Blood Wars, 5th and worst in the franchise. Nothing in this movie works. Action, the strongest point in these types of films, was so poorly edited and is completely boring. Overall, movie is so badly directed and edited, filled with lame dialogue and shameful acting. Even the effects were not that great, with so many cringe worthy moments. Such a disaster.",
         "I am a HUGE fan of the Udnerworld franchise and have been looking forward to this for so long so I am truly sad that my review is not better than this. Here's what I feel is wrong with this movie. 1. Marius - who is he, where did he come from? The explanation for his power came too late, too little to care and he was not as scary as previous Underworld villains. So is the other vamp chick who is supposed to be power hungry, kind of underwhelming at best. 2. Movie is way too short and too rushed. Everything is introduced too quickly and fits into the puzzle too easily. We have never heard of this Nordic vamps till now. There's no continuity, no cohesion. Its like its trying to bring something new BUT this is no. 5 or no. 6? 3. The white hair vamps. Seriously I thought the elves from LOTR is doing a crossover. 4. Selene went into the water metamorphosis and they didn't even bother to show her experience. Suddenly she's back from the other end of the world so fast and all ready super powered. It doesn't make sense and we don't understand her journey. 5. The CGI is really quite bad. 6. The whole point of the movie is all about finding Eve's blood and they attacked just fine without it. If Eve is not even going to make an appearance then talking about her for more than half a movie just feels like a plot filler. 7. Suddenly that other guy is the heir to the throne. Where did that come from?? I think the writers think this is going to be so cool but not if it likes a pie in the face kind of idea. Shock value goes whoa not huh? 8. Selene was invited to train vamps and I think it barely lasted a few mins of training before the treachery was unearthed. Could they not let the training last maybe a few days before they started juicing her? 9. Semira's right hand man never showed any indication that he might betray her but suddenly he did. Some build up would be great. 10. The elves need more screen time! Kate Beckinsale and Theo James were still awesome but they could have used some better scenes to instill a better relationship. The movie was fun, entertaining and but it fell flat and it left me feeling all empty inside and for that reason, I am SAD.",
         "It's Kate Beckinsale again in tight leather! Come on people, pop in the Blu-Ray or stream it and load up the popcorn. Take off the critic's thinking cap for a night. Don't expect too much with a sophisticated plot or story line. Do expect some Lycan ass-kicking from Selene as usual, and enjoy the movie for what it is - a war between vampires and werewolves. The CGI could have been better, but did I not mention Selene/Kate in tight leather?",
         "The trailers already gave me some hints, I simply refused to believe until I saw it. That the Underworld movies are for the better part, dead and buried. Yes. The action is still there, as is the gore. Betrayals are still alive and kicking. And the old vampire/lycan grudge is also present. But is Underworld still Underworld...? Unfortunately no. Kate Beckinsale try as she may, she can't carry the movie alone, nor do I believe anyone was expecting her to. I was expecting that they'd finally replace Scott Speedman as Michael, with another one of literally dozens of possible and better choices. And finally bring the whole family together, into the fight. But to my terrible surprise they simply killed off Michael. The way it was done was terrible to say the least. At the end of Awakening, Eve, is finally able to see through her father eyes. And we know that he simply escaped the facilities. But now in Blood Wars, we were given another (conflicting) take on what happened that makes absolutely no sense. So Michael exits the cryo chamber, severely weakened and finds himself captured by Marius. Taken to another place where Marius then proceeds to seemingly shoot him in the head, and strung him up head down to drain Michael of all his blood. Which he then uses to make himself into more of a Wolf-Man than a Lycan. So, Michael is dead, and Selene for the most part from being considered an outcast through several events (and movies), she ends up basically where she started. Again a member of the Vampire Coven. Now risen to the degree of Elder together with David. David (Theo James) try as he might, is no Michael nor do I believe that's his purpose. In fact the story at a certain point seems to try and connect him with maybe one of this movie biggest, if not the only, good surprise. Lena! Lena (Clementine Nicholson) is without a doubt one of this movie greatest assets. And if this was a movie about the next generation, and Michael and Selene daughter, I could see her character portrait as Clementine portrayed hers. Eve does make an appearance in the end. But the movie had all but basically drained my last ounce of hope. To me without Michael there's no more Underworld. I got to confess. When Selene was giving her usual movie ending speech, I always hoped that we'd see that Eve had found her father, given some of her blood to him, and even killed a bunch of Lycans and placed their bloody bodies on top of Michael, and from that experience, as Selene had been changed/improved by her trials of ice, so too had Michael evolved into a new form. And both father and daughter were on their way to find Selene. But no. The movie was at its best, mildly entertaining, with some interesting fight scenes, that weren't even that great. We got plots inside plots, and twists inside twists. But the core and heart of the franchise is in my opinion, dead! So see it if you want to. But don't expect anything outstanding or exhilarating about this movie. In some ways it actually manages to be poorer than Awakening.",
         "I love this series BUT the scriptwriters are making the plots pitiful. Selene is becoming more predictable and considering she's the #1 Lycan Killer she's showing a soft side. I would recommend seeing this ONLY IF you're an avid fan but DON'T pay full price! Good: Selene continues to show skills and gets some new ones. Continuity of characters. Storyline remains consistent. Bad: Compacting too much of the story-line just too keep action flowing. Inconsistent displays of vampire strength and powers. Ease of vampire gullibility At least we can expect at least one more film to give them a chance to bring it up to par, sigh...",
         "Lacks everything that made the original and sequels interesting. Poorly cast actors especially Pulver, too much use of guns with lack of physical fight scenes, no gore, bad script, uninteresting dialogue, overall weak story line, irrelevant flashbacks, lack of vampire elders or any character depth in werewolves removes the lore and legend that made the franchise interesting. I did not care who lived or died and honestly feel i am owed an hour and 31 minutes of my life. Maries might of well as been called Mario and adorned himself in a red cap and overalls would of been just as threatening. Absolutely no character depth what so ever which is polar opposite to the first films in this franchise. DO NOT WASTE YOUR TIME IF YOU LIKE UNDERWORLD YOU ARE BETTER OFF NOT SEEING THIS IT IS A TRAVESTY AND MIGHT AS WELL OF STARRED DANNY DYER.",
         "After the disappointment that was Awakening I didn't go see this movie with high expectations, but I came out surprised. The movie is totally fine. Does it have some poor CGI and bad actions scenes? Absolutely. But it also has some quite brutal and \"Whoa\" moments. What surprised me the most was the story which actually references a lot of the past movies, expands the lore and ties some loose ends nicely. Critics will absolutely destroy this movie but if you are a fan of the series or just want to throw some popcorn in your face watching a fun movie, you should definitely check it out. Did I mention Kate Beckinsale still kicks ass?",
         "I had to watch this one twice as first viewing I thought The movie was not cool at all.my 2nd viewing always like to see films twice see if I missed anything,what I missed was this is a v good additional movie to the franchise,Kate Beckinsale was her awesome best being the death dealer she is.don't expect much Change but there are a few surprises she gets to have a few different powers and the great coven of vampires got some good characters in it with a few twists all in all if you like these films there is not much to complain about so sit back and enjoy underworld blood wars,if like me you cant get enough of Selene dealing death to Lycans.",
         "I watch the Underworld movies for pure action, a little bit of story, and seeing a bad chick kicking butt. As far as girl power movies go, the Underworld franchise is one of--if not--my favorite. Underworld: Blood Wars was, of course, more of Selene (Kate Beckinsale) being the bad B in black. She was still on the lam hiding from both Vampires and Lycans. She had to deal with Marius (Edmure Tully err uh Tobias Menzies) this new and improved Lycan leader and Thomas (Tywin Lannister err uh Charles Dance) an old guard Vampire. The movie offered me what I was looking for. I'm not some Vampire or Lycan purist. I don't mind their story being retold in different ways or their core attributes being altered as well. Did they get after it? Were there some ooh and aah moments? Yes and yes. I found myself oohing and aahing a few times (or more correctly saying OH and DAM!). I will say that there was one drawback. The last installment was 2012, five years ago--the one before that was 2009 and the one before that was 2006 and the one before that was 2003. My point being that, whereas Selene does do a narrative recap at the beginning it wasn't nearly enough to totally refresh my memory on who everyone was and why they all hate her. I'd seen all of them but only once and it wasn't like I memorized characters or even the central theme of the four previous episodes. This movie was still able to stand on its own even with the brief synopsis of how she got to the point she was at. It's a solid movie that can be viewed all on its own if one should choose to.",
         "I can say this one, is one of the best movies of the saga Underworld, is a good action movie, with a good story. If you have seen all the previous movies of underworld you will love this one, because is like a fresh restart, but without deleting all the past like happened in Terminator Genesys (I hated) and is well written. This time vampires and werewolves are amazingly organize, and the story continues in a good way. You can go to see this one without any fear, you wont regret it.",
         "Goes without saying from the rating I really enjoyed the movie. When it comes to the underworld series, I pretty much liked all of them so far (Awakening was a big meh but still OK). So lets just start by saying the obvious, if you didn't really liked any of the movies in the series so far, you will not like this. Second thing, if you really loved and are a fan of the series, you might also have some problems with the movie if you over analyze the plot, since there are some good sized plot holes when looking over the entire events that happened in the previous movies. That all being said, the movie was pretty damn fun. Great action scenes, some pretty awesome locations to shoot in and in my opinion a pretty satisfying ending if this is the last in the franchise. Again, there are some plot holes in there, but I just got straight past them and was never bored during the entire movie.",
         "I don't get all the critical hate for this movie. What did anyone expect? It's frickin' Kate Beckinsale in latex!!! What could be better? This is terrible to admit, but I would pay Redbox $1.50 to watch Kate Beckinsale cook breakfast if she was dressed in her latex catsuit. But this movie is frickin' awesome! Sword hacking, vampires flying around, werewolves transforming into monsters, and (spoiler) Kate gets resurrected and comes back with frosty tips and new magic powers. I almost didn't watch this because of all the bad reviews, but it's the same old greatness as all the other films. Keep them coming! Kate Beckinsale is 43 years old and never looked better, plus she kicks @$$ with Euro ultra-violence. When (spoiler) Semira (Lara Pulver) gets stabbed through her mouth from behind as she enjoys the sun for the first time was almost as great as the ending as Kate says \"I have lived for a thousand years, and I may live a thousand more...\" I hope she does. :)",
         "The Underworld movies are not classics, but if you enjoy hammy acting, vampires, werewolves and Kate Beckinsale in skin tight leather kicking ass then they can be a lot of fun. Blood Wars is an end game of sorts, although it still leaves room for more films if the money men think it worthwhile. It would be a decent ending if they decide to close the chapter on this franchise now. The plot is quite straightforward, there's some decent action and fight scenes and a few new characters and creatures introduced, and it doesn't drag on too long and outstay its welcome. Charles Dance lends some gravitas to the cast, and Lara Pulver has a lot of fun as the power crazed Semira, while Kate Beckinsale is as youthful and badass as ever. If you enjoy the Underworld series then I'm sure you'll find this a decent addition.",
         "I really liked this latest installment to the Underworld franchise. As a matter of fact, I like them all, but I really loved the new setting in this one. The directing, writing, cinematography/VFX were all top notch. Kate Beckinsale and Theo James were once again incredible in their roles, as was the rest of the cast. The special effects though were very well done and more evident in this film more so than previous films. It's an 8/10 from me!",
         "In the 2006 film CLICK (a throwback to a strange era when Adam Sandler was considered one of the most bankable stars in Hollywood) a very hammy Chris Walken, playing the Devil, takes a moment to tell Sandler (playing the husband) of Beckinsale, in all seriousness, and with a straight face, \"Your wife is smoking hot.\" Which in a nutshell explains the staying power of Underworld I, a film I have seen perhaps 8 times so far. It combined a kickass script with great action sequences and featured Kate as perhaps the sexiest vampire in film history. Flash forward through several sequels (too many) and we still have Kate ... but little else. One of the worse scripts in recent memory, so bad it verily fails the late Roger Ebert's \"20 minute test\" (if a film fails to hook up in the first 20 minutes, leave the theatre). Horrible story, horrible characters, and overall a pretty rotten movie. Advice -- go see the first one all over again. You'll thank me in the morning,",
         "I still remember seeing the first Underworld in the theatre and enjoying it very much, though I didn't see any of the subsequent films at the cinema, only on DVD. I re-watched them in preparation for seeing this film and, as it stands, the original's still the best, with Evolution and Rise of the Lycans vying for second and third place, alternating between the two depending on my mood, while Awakening remains my least favourite. I'm afraid Blood Wars isn't much better. Whilst the fourth film felt like it was just non-stop gory action with little to no story, this film seems to have the opposite problem. Gorehounds needn't fear, there's still some quality violence (most of which the Lycans seem to wind up on the receiving end of, like being split in half and having their spines ripped out). The main problem is the vampire politics are brought to the forefront. The other problem? Super sexy latex-clad vampire Death Dealer, Selene, feels as though she's no longer the focus of her own franchise (though at least she gets some memorable lines/moments). Let's be honest, most people come to see Kate Beckinsale rocking the black latex catsuit like nobody else can. So it remains a mystery as to why the writers appear to be slowly phasing out her character. Please note filmmakers: These films wouldn't be worth continuing without Ms. Beckinsale. Some tend to dismiss her acting ability, but she's what's held this franchise together. So it's disappointing her character is absent for what feels like long stretches. Blood Wars begins like Awakening did, with Kate's/Selene's voice-over (now with added echoing repeating what she's already said!) and clips from the previous films...though, really, if you haven't seen the others, why're you even here? Theo James's David character from Awakening has a much more expanded role this time (now fully replacing Scott Speedman's Michael as the franchise's male lead. Yes, Michael's dead. Barring some future \"We only SAID he was dead/were only pretending!\" reveal pulled out of the writers' arses, the Smurf is no more). Whether you're a fan of David or not will likely contribute to your enjoyment of the film, as he seems to take over the movie from Selene for significant portions. I'll miss the Selene/Michael relationship, but am not opposed to David's character helping Selene, though it might rub some the wrong way how his backstory/ancestry's delved into so deeply it almost feels like *he's* the film's main star. Those who paid attention to the first films will appreciate references to a certain character who had minimal screen time, yet plays an important part in this film's storyline, while everyone else will be left wondering, \"Who?\". The blood of Selene and her daughter, Eve (who's referenced aplenty but only appears in the film's closing seconds), also proves important, as there's much exchanging of said blood between different characters. Other than Selene and David, the only significant returning character is Charles Dance's Thomas. Whilst not as memorable as Bill Nighy's Viktor, an actor of his caliber lends some weight/credibility to proceedings. His relationship with his son and heretofore untold connection with a past long-dead character is given prominence. Playing well off Dance is Lara Pulver, sporting constantly changing hairstyles as Semira. They do what they can with the material they're given. Semira's character also provides a cautionary tale in why you shouldn't treat your henchman/lover like crap, as we see play out between her and Bradley James' Varga. Outlander's Tobias Menzies, as Lycan Marius, isn't given anywhere near the complexity of his character from that series, as here he's mainly just another complication in an already rather convoluted story. Nor is his relationship with vampire, Alexia, given much depth...though at least Daisy Head is quite striking, so you don't forget her character. Also memorable on account of their physical appearance are the Nordic Coven, the best of which is Lena (resembling a vampire Daenerys Targaryen). She kicks major arse with a sword and shield (apparently the Nordic Coven *do* bring swords to gun fights), plus also possesses a \"teleport\" ability of sorts. For a newcomer, Clementine Nicholson fares better with what little she's given compared to others who're given more. She also plays an important part in Selene's physical transformation (including her picking up that handy teleportation ability) to becoming 'more' than she already is...which is just as well, as poor Selene's put through the wringer this time around. It pained me seeing our heroine beaten up/knocked down more than ever, but allowed for a triumphant return, stronger/faster/better than ever...and now with white blonde highlights in her jet black hair. The last couple of films' over-reliance on CGI versus the practical effects for the Lycans of the earlier films is to the movies' detriment, as the CGI creatures just aren't as impressive (and in the case of the Marius man-wolf creature, rather laughable/dredging up bad memories of the Scorpion King from The Mummy Returns...though not quite THAT bad). Note for future movies: Refrain from going half/half, either human or full beast is the way to go. Clearly this isn't intended as the franchise's final film, but assuming another one does indeed happen, that probably *should* be the last. The earlier Underworld films weren't exactly 'high art', but they felt like they had more substance to them than these last two. Given how much time was devoted to Eve previously, it's strange she's mainly absent here (perhaps she'll play a more significant role in the next movie?). I feel the franchise lost something after delving more into the world of men, but at least this one LOOKS more like an Underworld film than Awakening did (though the music/score's sadly lacking Wedard's 'Leidenschaft'). Say what you will about Len Wiseman, but I feel these later films' direction have suffered from his absence. My main hope for the next movie? That the filmmakers remember who this franchise's star is and give Beckinsale/Selene the attention/importance/prominence she deserves.",
         "If you're reading this review, I take it you're actually considering watching the fifth installment of an action-horror vampire/werewolf franchise; so, this is not for those who will be pointing fingers at 'originality' or 'depth' of the script, right? Okay. Taking the movie as it is, its purpose and audience in mind, I can definitely say it delivers: way better than the last one (Underworld Awakening), Blood Wars is highly entertaining, never boring, extremely fast-paced and the Selene we have here is less robotic and more developed than we've seen her before. That, in itself, is saying something! It also expands the story a bit; it doesn't feel like a \"been there done that\" at all. If I hadn't seen the trailers, I would be actually mildly surprised at some of the twists & turns of the movie. That, my friends, is also saying something! By the end of the movie, I'm sure that fans will be pleased to see that there's still plenty of life left for the franchise. And even if you're going in for the first time - which is unlikely - you're probably going to understand and be able to enjoy the film as a stand-alone adventure. That's saying a lot!",
         "I don't understand why people don't like this movie. I wonder what they expect when they go in. It's a great story line: 1. Selene finds out about a few things that are important for her about her story that we all know. 2. A very cool thing happens to her and the movie is interesting and has action from the very moment it starts. 3. No sappy romantic anything. 4. Very entertaining. 5. Keep in mind that this is fantasy and its goal is to keep you entertained. I can't wait to see what happens next since the end means there have to be other things following. It cannot end just like that.",
         "Underworld is one of the most underrated action film series. Even though the sequels open with a synopsis, you have to watch all the movies in succession to fully understand and appreciate the storyline. The third film, Rise Of The Lycans, was a prequel. The fourth one, Awakening, was okay, but this fifth installment, Blood Wars, with a different writer-director team reminds more of the first three films that I enjoyed the most. Kate Beckinsale still looks fantastic for her age. Or she could be a real vampire. I look forward to the next chapter in Underworld.",
         "So,clearly this has been a cash out. I've seen some bad movies,this doesn't top them,but still.. It was a,somewhat,decent action movie,but not a good fantasy/vampire genre one. Many scenes top the wtf list,but when in less that a minute they find themselves off a moving train,then suddenly onto horses,and then walking made me burst in laughter for what i was witnessing. Terribly bad acting,really,from each and everyone of the main characters except the protagonist,plot holes so obvious and numerous that made you lost track of what you were watching,the film lacked coherence and the feel of a vampire movie. I've read it was bad before going to see it,i didn't expect it to be so hideous. Honestly,who brings the swat in a vampire/werewolf fight,and who bothers to all the trouble getting a gun that can pierce walls inside the building? Like...can't it do that from the outside? Kill as many as you can and make it hard for the enemy to maneuver,before even entering the battle? And that is only the tip of the iceberg. The decisive battle was laughable,and that is said being polite. Waste of time,waste of money,waste of a good franchise.",
         "Underworld: Blood Wars is not as good as underworld evolution, but this doesn't mean it's terrible. I do actually prefer this installment to the first underworld. Kate Beckinsale is still good as seline. And Theo is good as David. The action sequences are well constructed for the most part, pretty much the same as the previous installments, guns galore, bullets flying everywhere, kicking and punching, so the fans of action will certainly not be disappointed. The dialogue is alright, it's not overly cheesy, which is kinda typical in these types of films, but it's also not anything that'll win any major awards. The plot follows up after awakening and I thought the plot was executed pretty well, it keeps your attention all the way through. And there is a remembrance of Michael and his character is alluded to on several times, which I loved because I really liked his character. If you're an underworld fan, you'll enjoy this movie and I certainly did. 7/10.",
         "This movie is disaster. All the previous series Specially first 3 were so good. But this one has ruined all of it. Acting , script everything was so bad. the worst thing was whole movie so rushed. No proper time was given even to one scene. Even the fighting scenes are worst. Suddenly the vampires have become so weak that they cant even move. and Lycans have become super powerful. We seen that vampire cant be killed so easily just by stabbing or simple bullets but in this movie they have shown vampires even weaker than humans. Then whole story don't make any sense. From where villain came how he got his whole army. And worst of all people standing in front of each other and shooting and nobody is getting hit . I mean what was that ? where is common sense in these movies.? Just the worst vampire movie. Total waste of money and time.",
         "I had high hopes for this movie and had been waiting impatiently for it. And it was worth the wait. Got some surprises that had me going, \"Holy cow, never saw that coming.\" I love that in a movie. I really appreciated the review in the beginning. That helped ground me again,even though I watched all of them again in preparation for this one. And probably will again. Kate did a great job as Selene and still kicks butt with the best of them. In Awakenings, I wasn't really into David's character. But in this movie, I think his role grew nicely. More depth and character development made me like him even more. And learning about his past got me more invested in him as well. They rounded his character off nicely, and I'm interested to see where they take it. What intrigues me is that they left a lot of room for future movies. I sure hope Kate signs on for more, because she's pretty much why I watch these.",
         "Me my friends were originally going to see Star Wars Rogue, but got there late, and saw that Underworld was playing, so we're like meh whatever let's see. I seen them all but barely remembered anything except that it was about some vampire vs werewolf war. My friends went in with no info about any Underworld movies. End result, it was a fun super action packed movie that had some fight moments that will make you go \"OHHH SHITT\", majority of all the characters were hot as hell, and in the hour and half we weren't bored once as it was just fight scene after fight scene with little moments of dialogue to further the story. If you're looking for some in depth Oscar worthy movie, this ain't it. If you just want to grab a snack and watch some great fight scenes involving swords, guns and cgi monsters, you'll have a blast."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": [
         "Lakeshore Entertainment",
         "Screen Gems",
         "Sketch Films"
      ],
      "summaries": [
         "The next installment in the blockbuster franchise, UNDERWORLD: BLOOD WARS follows Vampire death dealer, Selene (Kate Beckinsale) as she fends off brutal attacks from both the Lycan clan and the Vampire faction that betrayed her. With her only allies, David (Theo James) and his father Thomas (Charles Dance), she must stop the eternal war between Lycans and Vampires, even if it means she has to make the ultimate sacrifice.",
         "The war between the Vampires and the Lycans wages on with the Lycans led by Marius are close to defeating the Vampires. He thinks if he can get the hybrid daughter of Vampire Death Dealer Selene, her blood will be the key to defeating the Vampires once and for all. But when they attempt to capture her, they fail and she tells one of them to tell Marius, she doesn't know where her daughter is; her daughter has cut ties with her. At the same time, Semira, Vampire Elder implores Thomas, another elder and father of David, Selene's ally to convince the Council of Elders to give Selene whom they deem a traitor, amnesty so that she could train new Death Dealers to deal with the Lycans. They grant it and send word to Selene who comes and trains the aspiring Death Dealers. It's when she battles one of Semira's people, that he subdues her with a toxin that paralyzes her. Semira then has her man kill the trainees with Selene's weapon. She then reveals she wants Selene for her blood. Eventually David learns of what Semira is doing and tries to get Selene away and takes her way to the only other Vampire stronghold there is. Eventually Marius learns of this and sets out to find Selene and find out for sure if she knows where her daughter is. And it's while they are there at the stronghold that David learns the truth about his lineage.",
         "The outcast Selene is hunted down by the Lycans led by the powerful Marius that wants her daughter Eve and by the vampires seeking revenge for the death of Viktor and Marcus. Out of the blue, she is attacked by Lycans but David helps her but is wounded. Meanwhile, the ambitious vampire Semira convinces David's father Thomas to plead to Cassius and the council of their coven to forgive the skilled Selene to train the new Death Dealers. He succeeds, but Selene and David are betrayed by Semira and her lover Vargas and David witnesses Semira killing his father. They have to flee to seek shelter at the Nordic Coven Vador where David learns the truth about his mother. When the sanctuary is invaded by Marius and the Lycans, Selene fights Marius that wants to know Eve's whereabouts. Who will win the fight?",
         "As the relentless war against the hordes of the bestial Lycan Clan rages on and the truthful allies have shamelessly turned to enemies, once an Elite Death Dealer and now a betrayed and despised pariah, Selene is caught in the middle of a bloodthirsty and ancient war. Inevitably, with the Western Coven utterly destroyed and her daughter Eve, the first pure-blood hybrid, hidden from the world and herself, Selene is hunted down by both Lycans and Vampires alike. Moreover, with the intention to possess Eve's vital blood to create an invincible hybrid army, the Lycans who have regrouped and replenished in the meantime, head to destroy the Vampire's final sanctuary. Who can stand in their way?",
         "Vampire death dealer, Selene (Kate Beckinsale) fights to end the eternal war between the Lycan clan and the Vampire faction that betrayed her."
      ],
      "budget": 35000000
   },
   "movielensId": 166558,
   "movielens": {
      "languages": [
         "English",
         "",
         "Український"
      ],
      "releaseDate": "2016-11-28",
      "dvdReleaseDate": null,
      "directors": ["Anna Foerster"],
      "runtime": 91,
      "movieId": 166558,
      "title": "Underworld: Blood Wars",
      "mpaa": "R",
      "actors": [
         "Kate Beckinsale",
         "Theo James",
         "Tobias Menzies",
         "Lara Pulver",
         "Bradley James",
         "Peter Andersson",
         "James Faulkner",
         "Clementine Nicholson",
         "Daisy Head",
         "Oliver Stark",
         "Charles Dance",
         "Zuzana Stivínová",
         "Brian Caspe",
         "Jan Nemejovský",
         "Sveta Driga",
         "Dan Bradford",
         "David Bowles",
         "Tomas Fisher",
         "Rostislav Novák ml.",
         "Eva Larvoire",
         "Jiri N. Jelinek",
         "Marielle Tepper",
         "Jordan Haj",
         "Daniel Pietrucha",
         "Jakub Kropáček",
         "Sára Arnsteinová",
         "Irena Morisakova",
         "Terezie Kovalova",
         "Tomas Fingerland",
         "Jakub Mayer",
         "Denisa Krskova",
         "Simona Simkova",
         "Daniel Vojtech",
         "Jared Doreck",
         "Lukas Vydrzal",
         "Lukas Krampera",
         "Adam Vosecek",
         "Agatha Hofmanová",
         "Anezka Nosková",
         "Alicia Vela-Bailey",
         "India Eisley",
         "Trent Garrett",
         "Martavious Gayles",
         "Miroslav Lhotka",
         "Richard William Romanov",
         "Junes Zahdi"
      ],
      "imdbMovieId": "3717252",
      "originalTitle": "Underworld: Blood Wars",
      "genres": [
         "Action",
         "Fantasy",
         "Horror"
      ],
      "youtubeTrailerIds": [
         "rKHL5PyAPzs",
         "Jgj9Znp76PE",
         "FtbM_W9iNjg"
      ],
      "plotSummary": "Vampire death dealer Selene fends off brutal attacks from both the Lycan clan and the Vampire faction that betrayed her. With her only allies, David and his father Thomas, she must stop the eternal war between Lycans and Vampires, even if it means she has to make the ultimate sacrifice.",
      "tmdbMovieId": 346672,
      "avgRating": 3.12687,
      "releaseYear": "2016",
      "numRatings": 335,
      "posterPath": "/nHXiMnWUAUba2LZ0dFkNDVdvJ1o.jpg"
   }
}