{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "flying",
            "id": 334
         },
         {
            "name": "inventor",
            "id": 1436
         },
         {
            "name": "dance",
            "id": 1691
         },
         {
            "name": "opera",
            "id": 2199
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "life's dream",
            "id": 7393
         },
         {
            "name": "ballet",
            "id": 10551
         },
         {
            "name": "orphan",
            "id": 13014
         },
         {
            "name": "statue of liberty",
            "id": 159716
         },
         {
            "name": "kids",
            "id": 161155
         },
         {
            "name": "eiffel tower paris",
            "id": 164889
         },
         {
            "name": "19th century",
            "id": 207928
         },
         {
            "name": "3d",
            "id": 209714
         }
      ],
      "imdb_id": "tt2261287",
      "video": false,
      "title": "Ballerina",
      "recommendations": [
         335797,
         332210,
         136799,
         137116,
         295693,
         277834,
         423453,
         25475,
         75258,
         333667,
         365942,
         10198,
         13179,
         241259,
         294272,
         297270,
         268531,
         44683,
         175112,
         368940
      ],
      "backdrop_path": "/yfRWtsCVDiYnfrZ8ndL3G2WMHid.jpg",
      "revenue": 2351359,
      "reviews": [{
         "author": "Reno",
         "id": "591b6091c3a3683a9306d70b",
         "content": "**Dreaming's easy, but chasing it needs all the effort.**\r\n\r\nWell, I praise a lot, particularly the European animations for preserving the 2D animation. That does not mean they lack behind in 3D format. The recent film 'The Little Prince' was the perfect example of a quality 3D animation outside Hollywood. Pars with Disney, Pixar standards. Technically, as well as the story contents. But the quantities are very less and also making it a bit expensive. So they usually prefer producing it in the English language for the wider/international market, keeping North America particularly in mind. This is a French English-language film that co-produced by Canada.\r\n\r\nThis is a nice film, that particularly targets little kids and mostly the girl audience to inspire Ballerina. Cute characters and scenes, but very familiar story. Shares lots of similarities with 'August Rush', except the field of interest. I am not an expert or know all about Ballet, but some of the parts involving them were turned me off. I know the gravitation force is irrelevant in animation since they're not real world to comply with science, but maybe I'm being an adult and knowing that stuff might have influenced me to think that way. It reminds me I'm really an adult, though this film should be watched as a kid despite whatever you are. However, nothing affected me from enjoying it.\r\n\r\nIt sets in the 80s of the 19th century France. At the time when Eiffel Tower and Statue of Libery were on the construction, a poor orphan girl named Felicie escapes orphanage with another boy to pursue her dream to be a ballerina. Then they arrive in Paris, and very soon they find their separate ways to achieve the goals. Not all smooth sail, especially for her. So she takes the opportunity that comes her way, even after knowing it was wrong to do.\r\n\r\n> ❝You have something that she can only dream of: passion!❞\r\n\r\nFrom there, with all the complications tailing her, how far she could go to make her dream come true. Which also includes the amount of dedication put on her undertaking to meet the expectations of her trainer, rivals and many others. And to show the world the interest is not simply based on enthusiasm, but willingness to sacrifice anything for it. Her journey from nothing to the edge of something new to define her life is the film that briefs for just short of 90 minutes.\r\n\r\nThis is not another 'Billy Elliot'. Animations are usually comedy, fantasy and musical, but recently the adventures and science fictions are surging. I don't remember I ever have seen an animated dance flick. Not the classical dance, not in the modern 3D animation format. The closest one was a decade old 'Happy Feet'. So that makes it is a unique product and comes under a must see for all the animation fans. But the storyline is predictable and many sequences were intentionally dragged to be cliché. Because it works, particularly if they're aiming for the younger generation who haven't seen many films in their lives. Only we the grownups whine.\r\n\r\nMost of the voice-over artists are well known Americans actors which boosted the film. The character combinations are good. It brought the variety, especially slightly to ride off the main theme in a few occasions. Like the boy's interest in inventing things which were other major parts of the twist and turns in the narration. It is not a great animation if it was from Hollywood, but coming from France and the theme it focused on, the effort must be appreciated. Overall a much better film than what the average reviews and ratings around the internet says. It is a ballet film means not those who love it should watch it, but those target audience should not miss it. That means generally worth a watch, but not for everyone.\r\n\r\n_7/10_",
         "url": "https://www.themoviedb.org/review/591b6091c3a3683a9306d70b"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Félicie Milliner (voice)",
               "gender": 1,
               "credit_id": "569d02889251415e600035c5",
               "name": "Elle Fanning",
               "profile_path": "/cbFVl9NWREa0xD2vW9Z3J4ursiu.jpg",
               "id": 18050,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Victor (voice)",
               "gender": 2,
               "credit_id": "569d0299c3a36858c3003544",
               "name": "Dane DeHaan",
               "profile_path": "/spQ5AlolOGxSZWwnNELrs4ezs9z.jpg",
               "id": 122889,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Odette (voice)",
               "gender": 1,
               "credit_id": "576c3c4cc3a3687577000ad6",
               "name": "Carly Rae Jepsen",
               "profile_path": "/9imicSlNXJb090e3GziXkIDG6H5.jpg",
               "id": 1239482,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Camille Le Haut (voice)",
               "gender": 1,
               "credit_id": "576c3c53c3a368755b000d37",
               "name": "Maddie Ziegler",
               "profile_path": "/fSHoQXSBe6T1l900AK7QhB04BvM.jpg",
               "id": 1483976,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Mustachioed Creep (voice)",
               "gender": 2,
               "credit_id": "58e9b21c925141351f02f12b",
               "name": "Mel Brooks",
               "profile_path": "/ndFo3LOYNCUghQTK833N1Wtuynr.jpg",
               "id": 14639,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Regine Le Haut (voice)",
               "gender": 1,
               "credit_id": "5886a75e9251411974000331",
               "name": "Julie Khaner",
               "profile_path": "/eLT4pSbWzGzh2RwI2SIe0vPQlXS.jpg",
               "id": 12487,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Merante (voice)",
               "gender": 2,
               "credit_id": "5886a7679251411974000336",
               "name": "Terrence Scammell",
               "profile_path": null,
               "id": 170369,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Director of Opera (voice)",
               "gender": 2,
               "credit_id": "599be8609251410e5a00e3bc",
               "name": "Joe Sheridan",
               "profile_path": "/q8NbSOBGuduFZDJaPlQX108draa.jpg",
               "id": 12983,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Rudolph / Mathurin (voice)",
               "gender": 0,
               "credit_id": "599be877c3a368228c00da78",
               "name": "Tamir Kapelian",
               "profile_path": null,
               "id": 1209880,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Dora / Rosita (voice)",
               "gender": 1,
               "credit_id": "599cd3b1c3a36827f000c020",
               "name": "Elana Dunkelman",
               "profile_path": "/g44vFquGwz7wpnhkDiGwSsO2vIy.jpg",
               "id": 1725473,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Regine / Mother Superior / Felicie's Mother (voice)",
               "gender": 1,
               "credit_id": "5a1bc830c3a3680b8f04f1e3",
               "name": "Kate McKinnon",
               "profile_path": "/jzgiKHmkhxhvELnq9ccDkFc8Ynn.jpg",
               "id": 1240487,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Luteau (voice)",
               "gender": 2,
               "credit_id": "5a1bc83c0e0a264cbc05121b",
               "name": "Mel Brooks",
               "profile_path": "/ndFo3LOYNCUghQTK833N1Wtuynr.jpg",
               "id": 14639,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "569d02f1c3a36858c6003a78",
               "name": "Eric Summer",
               "profile_path": "/jpQXNM5dpJTlkXDmlmfldPS9lQK.jpg",
               "id": 1316783,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58e9bf8f9251414b2802a09a",
               "name": "Eric Summer",
               "profile_path": "/jpQXNM5dpJTlkXDmlmfldPS9lQK.jpg",
               "id": 1316783,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "58e9bf3a925141354c030bb5",
               "name": "Éric Warin",
               "profile_path": "/14UdKmsmxNu73rPmKbZpef00YuM.jpg",
               "id": 1792483,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58e9bf58925141281906c690",
               "name": "Laurent Zeitoun",
               "profile_path": null,
               "id": 142982,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "58e9c02992514134eb031c7d",
               "name": "Carol Noble",
               "profile_path": null,
               "id": 1792484,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 14.687204,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 342473,
      "vote_count": 646,
      "budget": 30000000,
      "overview": "Set in 1879 Paris. An orphan girl dreams of becoming a ballerina and flees her rural Brittany for Paris, where she passes for someone else and accedes to the position of pupil at the Grand Opera house.",
      "similar": [
         10545,
         20352,
         407655,
         9325,
         11224,
         196867,
         394823,
         82695,
         313369,
         12545,
         1826,
         17917,
         12614,
         15157,
         15739,
         17663,
         8079,
         2897,
         15016,
         14873
      ],
      "original_title": "Ballerina",
      "runtime": 89,
      "poster_path": "/60ZhK1FstSkC9Ms8lRWaTPm55kD.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Main Journey",
            "id": 91331,
            "origin_country": ""
         },
         {
            "logo_path": "/qvtEf5tM9IAEJUUhX9EcBl12Fhr.png",
            "name": "Caramel Films",
            "id": 6623,
            "origin_country": "CA"
         },
         {
            "logo_path": null,
            "name": "Quad Productions",
            "id": 7038,
            "origin_country": ""
         }
      ],
      "release_date": "2016-12-14",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Life's greatest adventures begin with a single... Leap!",
      "adult": false,
      "homepage": "http://www.ballerinafilm.co.uk/",
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Eric Summer",
         "Éric Warin"
      ],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Eric Summer",
         "Eric Summer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2261287/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BZjEzMmFlNWUtYTFhOC00ZDMxLTllZmItZjc3ODMwNTk2ZmNlXkEyXkFqcGdeQXVyNTY2ODgzODg@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Elle Fanning",
         "Dane DeHaan",
         "Carly Rae Jepsen"
      ],
      "reviews": [
         "Being a lifelong fan of animation and ballet, 'Ballerina' seemed very appealing to me. Plus who doesn't love an underdog/person who wants to succeed at something they love against adversity story. While not up there with my favourite animated films, or one of my favourite films of 2016, 'Ballerina' is nonetheless charming with a lot of delights. It will delight the younger crowd, but fellow ballet fans will also be charmed and there should be enough for adults to find value. 'Ballerina' is much more than a film for \"little girls\" or \"just for kids\" and does a good job telling a type of story that would be relatable to anybody. Coming from somebody who overcame disabilities and bullying and wanted to sing professionally and get training and experience, it took a long time but I got there and have not looked back, 'Ballerina' clicked with me. Of course 'Ballerina' isn't immune to flaws. The story is very familiar and does get predictable, while the characters are very likable but slightly skim-surface archetypes. However, this may seem very nit-picky and can easily be ignored by people and only problems for the toughest of critics. Aside from these, there were also reservations with some of the soundtrack and one voice cast member. The music is often beautiful and infectious, with some genuine enchantment, but could have done with more classical music choices and less pop. A good deal of the pop tunes are very catchy, but more Tchaikovsky would have suited the film better and been more dynamic and a few others grate. Dane DeHaan doesn't sound right as Victor and doesn't fit, sounding too mature for a character clearly intended to be much younger, either he should have tried to sound younger and more boyish or the character should have been voiced by somebody in his late-teens. However, the animation is very good, often excellent, especially in the beautifully studied and meticulous background details and the intricate and graceful choreography that synchronises with the music very well and shows animators that have clearly done their homework. As said, the soundtrack does mostly work, while the script makes a real attempt to appeal to both children and adults (being a family film) and, with a nice mix of humour, pathos and life values and never being over-complicated or childish, it does succeed. The story, even with the familiarity and predictability, goes at a neat pace and as well as having a lot of charm and heart the messaging never comes over as preachy and very much valuable. It is also easy to see why anybody would find it inspiring and easy to relate to, as a young adult both were very easy for me. Even though archetypal, the characters are still likable, the title character has her flaws but it is easy to quickly warm to her. The voice acting, DeHaan aside, is strong, with Elle Fanning and Carly Rae Jensen bringing emotion and spirit to their characters and Maddie Ziegler stealing the show. In summary, a familiar film but a very charming one and one to be seen without prejudice. 7/10 Bethany Cox",
         "Something tells me there's more to the film than just a wannabe ballerina setting out to achieve her dreams. I could be very wrong but I believe his to be a personal accomplishment for French director/screenplay writer Eric Summer who comes from Brittany himself, where this story starts at an orphanage in 1879. Enlisting the talent of French animator who was partly responsible for one of my favourite animated movies, Belleville Rendez-vous, Éric Warin sits alongside Summer in the director's chair and what they give us is a delightful underdog story. The focus of the story is on Félicie, voiced by Elle Fanning, an ambitious yet rebellious orphan girl who dreams of becoming a dancer, constantly attempting to flee the orphanage to Paris, in pursuit of her ambition. She's not alone in either dream-chasing or escaping the orphanage. Victor, voiced by Dane DeHaan, an obvious admirer of hers also wishes to leave to become a famous inventor, so the two of them embark on an adventure finally reaching Paris and with various strokes of good fortunate, end up where they both want to be. The voices don't necessarily match their characters, DeHaan being far to old (apologies, 30 isn't old, but...) to voice a teenage orphan. Pop singer Carly Rae Jepsen does a fine job of voicing broken ballerina, Odette, but I'm most impressed with Sia's music video dancing star, Maddie Ziegler, voicing the spoilt, stuck-up Camille. It has all the ingredients of a simple yet pleasing underdog story with some impressive and enticing animation. The dances themselves are superbly gracefully and the details are brilliant. There's troublesome emotions, difficult choices and quite a few triumphs with a clear message of never giving up and what ever you do, do it with heart. It's predictable but that's forgivable being a children's film. It's loaded with touching gestures and typical twists that make the film memorable but is equally loaded with unnecessary silliness and feels a little rushed in places, possibly to keep children's attention. It's not a musical but the soundtrack that accompanies the film really stands out with some great tracks from Magical Thinker, Chantal Kreviazuk and Camila Mora. Klaus Badelt does a graceful and enchanting score that does well to stand alone from Tchaikovsky's ballet greats of Swan Lake and the Nutcracker. It's good sign not hearing any disturbances for the young audience and my God-Daughter seemed to enjoy it giving a little dance at the end. It's far from perfect but there's some great scenes and you can see the effort was put in. It's good light-hearted entertainment for the whole family. Running Time: 8 The Cast: 6 Performance: 7 Direction: 7 Story: 8 Script: 7 Creativity: 8 Soundtrack: 9 Job Description: 9 The Extra Bonus Points: 0 69% 7/10",
         "Well, I praise a lot, particularly the European animations for preserving the 2D animation. That does not mean they lack behind in 3D format. The recent film 'The Little Prince' was the perfect example of a quality 3D animation outside Hollywood. Pars with Disney, Pixar standards. Technically, as well as the story contents. But the quantities are very less and also making it a bit expensive. So they usually prefer producing it in the English language for the wider/international market, keeping North America particularly in mind. This is a French English-language film that co-produced by Canada. This is a nice film, that particularly targets little kids and mostly the girl audience to inspire Ballerina. Cute characters and scenes, but very familiar story. Shares lots of similarities with 'August Rush', except the field of interest. I am not an expert or know all about Ballet, but some of the parts involving them were turned me off. I know the gravitation force is irrelevant in animation since they're not real world to comply with science, but maybe I'm being an adult and knowing that stuff might have influenced me to think that way. It reminds me I'm really an adult, though this film should be watched as a kid despite whatever you are. However, nothing affected me from enjoying it. It sets in the 80s of the 19th century France. At the time when Eiffel Tower and Statue of Libery were on the construction, a poor orphan girl named Felicie escapes orphanage with another boy to pursue her dream to be a ballerina. Then they arrive in Paris, and very soon they find their separate ways to achieve the goals. Not all smooth sail, especially for her. So she takes the opportunity that comes her way, even after knowing it was wrong to do. ❝You have something that she can only dream of: passion!❞ From there, with all the complications tailing her, how far she could go to make her dream come true. Which also includes the amount of dedication put on her undertaking to meet the expectations of her trainer, rivals and many others. And to show the world the interest is not simply based on enthusiasm, but willingness to sacrifice anything for it. Her journey from nothing to the edge of something new to define her life is the film that briefs for just short of 90 minutes. This is not another 'Billy Elliot'. Animations are usually comedy, fantasy and musical, but recently the adventures and science fictions are surging. I don't remember I ever have seen an animated dance flick. Not the classical dance, not in the modern 3D animation format. The closest one was a decade old 'Happy Feet'. So that makes it is a unique product and comes under a must see for all the animation fans. But the storyline is predictable and many sequences were intentionally dragged to be cliché. Because it works, particularly if they're aiming for the younger generation who haven't seen many films in their lives. Only we the grownups whine. Most of the voice-over artists are well known Americans actors which boosted the film. The character combinations are good. It brought the variety, especially slightly to ride off the main theme in a few occasions. Like the boy's interest in inventing things which were other major parts of the twist and turns in the narration. It is not a great animation if it was from Hollywood, but coming from France and the theme it focused on, the effort must be appreciated. Overall a much better film than what the average reviews and ratings around the internet says. It is a ballet film means not those who love it should watch it, but those target audience should not miss it. That means generally worth a watch, but not for everyone. 7/10",
         "Tired of watching modern dance movies that has you say: Another one of Hollywood street dancer groups with all its acrobatics that must have come from America's got talent aiming for Hollywood that tosses aside the traditional dance of Ballet? Produced at L'Atelier Animation in Montreal, Canada, Ballerina (2016) is majestic at all levels from the animation to the story itself. A basic story of a young orphaned girl Félicie (Elle Fanning) who dreams to become a ballerina leaves with her friend Victor (Dane DeHaan) who also has a dream that of becoming a famous inventor, both go to Paris to meet their destiny. What makes this a beautiful animation is that the story is not bogged by irrelevant metaphors or irony that distracts from the story that would have us distracted to the relevance of the movie based on something that could happen anywhere such as achieving one's goal. One does not say during the film that this scene is ridiculous that it diverts us from the message. A success indeed. First of all, the story itself. Set back in the 1800's where Paris is growing and where all hope is possible and notwithstanding the fact that Félicie (Elle Fanning) will take the identity of another person Camille Le Haut (Maddie Ziegler) is not new in the move world. Yet, the story progresses logically to have her be discovered as a fraud. What Merante (Terrence Scammell) sees in Félicie when he discovers the truth is what he sees in himself, one with passion. As a fact when he says to Camille and Felicie why they dance, in his harshness in his selection of candidates lies his humanity. He doesn't insult Camille but asks her why she dances? Here we have the theme: Are we born to dance or do we become dancers that can be applied in all aspects of society? Are we born with a gift or do we become the gift? Secondly, the choreography is absolutely amazing. It compares with all the acrobatics seen on America's got talent or in movies such as Rocky Balboa. Remember his training against this Russian guy? We see two types of training, the natural versus the mechanical training using modern equipment. What about the competitive choreography between the two girls? Superbe! If the film gave me shivers three times then I admit to the success of the film animation to have struck a chord in me. And, if my grandchild was able to relate to his life one scene which was the union of Félicie and as Odette (Carly Rae Jepsen) and which has also brought me back to when I bought tickets to the Ballet then I consider this animation a true marvel to which I give 10/10.",
         "I'm going to keep this short with a list of positives and negatives; Positives: It looks beautiful, both the settings and the movements. Negatives: Horrible story. Terribly written dialogues, characters and comedy. The action scene at the end makes no sense and comes out of nowhere. The moral of the story seems to say that it's OK to cheat and lie, for as long as you have passion everything will work out. Music that doesn't fit the scene, mood or time-frame. Horrendous voice acting, going for \"star power\" instead of talent.",
         "Although there are many children's movies in recent memory that appeal to aspiring singers, the offering of films and even television shows for aspiring dancers is dismal. It's not like there isn't an audience. How many millions of young girls across the world take ballet classes? \"Leap!\" offers an alternative to recent children's movies like \"Sing\" to cater to all the aspiring dancers and ballerinas among us. \"Leap!\" truly captures the magic of Paris at the turn of the century. As far as an animated film can anyways. The scenes of Paris's cobblestone roads and the Eiffel tower under construction are mesmerizing. Although the animation isn't necessarily top-notch for 2016, it is decent enough to be entertaining. \"Leap!\" tells the tale of an orphan from Brittany named Félicie, a fierce and strong spirited redhead who strongly resembles Anastasia from the iconic 1997 flick in both appearance and backstory. Félicie is an orphan who doesn't know her parents or origins. Her only link to her past is a music box with a dancer which sparks a passion for dance that leads her on a journey to Paris where she steals the identity of a cruel aristocrat's daughter named Camille Le Haut to join the Paris Opera Ballet in her place. She is accompanied by an aspiring inventor named Victor who becomes Gustave Eiffel's assistant and almost names the Statue of Liberty, \"The Statue of Puberty\". While the story of \"Leap!\" isn't exactly unique, the best part of the narrative is the girl positive message. Although there is a chosen romantic lead for the main character, this side-story doesn't overshadow the broader story of overcoming adversity and rivalry. The lack of romance in the film makes it more realistic and puts it in stark contrast to Disney's usual offering. Felicie and her rival ultimately compete for the role of Clara in The Nutcracker. Guided by her mentor, the retired dancer Odette, Felicie overcomes her lack of formal training and becomes very talented. At one point, Odette tells Felicie, \"Build on this. Feel your anger and your pain and your sorrow and your joy, and put it all into your dance. Live the music, feel it. Every note, every sound, every harmony needs to have your body vibrating from the end of your hair to the tips of your toes. And then, and only then, will you take her down\". The rivalry between Félicie and Le Haut culminates in a final fight scene that occurs on the top of the Eiffel tower. Overall, adults may find \"Leap!\" enjoyable on its own. But it is definitely made for kids. At least the soundtrack was on point. From classic ballet music to Demi Lovato and modern pop. If you have a daughter, or son for that matter, who has ever shown interest in dancing or ballet. Then your child simply must watch this movie. Another one like it won't come out for a while. That makes it a parental obligation.",
         "Im a huge fan for animation, I heard about this movie and didn't really know what to expect. What I got was a beautiful movie with the positive messages of chasing your dreams and never giving up on them no matter how hard things may seem. I do kinda wish the subplot of victor could have tied in more with the main focus of Felicie but it is what it is, I ain't complaining. Finally, It was hilarious and very charming too. Perfect for families. Enjoy the movie!",
         "I saw this just few days ago in a local theater. In brief: The good: + Great visuals + Nice music + Cool story The bad: - Teen pop in a music about classical ballet! - Daisy Dukes-like pants in a 1900 France? So generally I enjoyed the movie. It is sort of Cinderella story. My little one did not wanted to see it, so I went alone. However, this is a movie about classical ballet. There are few moments, where they actually are supposed to dance on a classical music background, so in the beginning of the movie there is a scene with the music from Swan Lake, in the middle of the movie there is a ballet school with classical music background and in the end, the final scene is supposed to be showing The Nutcracker, however on this one they play (*drumroll please*) ... CHEESY TEEN POP!!! Yep, that's right - we get ballerinas dancing ballet, supposedly on the music of the Nutcracker, but instead there is some cheesy teen pop! This is the major fail I talk about. Seriously, you cannot ruin a movie in such a bad way normally. No idea what talent you need to come up with such a stupid idea. Instead play the Nutcracker music for a minute until the credits start to flow, then transition to the teen pop. Would be much better, but no - they failed it. Also - in 1900 France they show us a girl wearing leggings and something similar to daisy dukes on top. Hellooooo? Reality check here? There is no such a girl, even in Paris in 1900s which would wear such a thing. But again - in general the movie is fun and amusing, despite the few horrible moments I mentioned. It is also little surreal, as they show some pretty cool flying, but it's a cartoon after all, so I don't mind the daisy dukes so much (but I seriously do mind the music!). Bring your kids, enjoy!",
         "Leap! is a great film with a big meaning. This film teaches it all - honesty, perseverance and the importance of practice, family, believing in yourself, believing in your dreams and passion. Felicie makes a lot of mistakes during her journey, which set her back, but that doesn't stop her from continuing to push through. The story begins when Felicie and her best friend, Victor escape from an orphanage. They take a train to Paris so that Felicie can attend a dance school there and Victor can become an inventor. They arrive in Paris without any money. During their journey, they encounter many challenges. As Felicie meets new people, a love conflict arises as well as a conflict with a wealthy lady who is pure evil and wants to crush Felicie's dream. A wealthy woman Regine (Kate McKinnon) is cruel, rude and arrogant, but a boy with a crush on Felicie protects her from Regine. McKinnon makes Regine sound totally wicked in a bad but great way. The boy, Victor (Natt Wolf) is portrayed as a timid, but an optimistic and caring friend. The animation in this film is spectacular! It is very detailed and their mouths move with the words they are saying so well the animated characters seem real. The voice acting is spot on. The voices are filled with emotion and an inspiration to the audience, including me. My favorite part is when Felicie watches a ballerina at the French dance school. She takes just one look at the ballerina's dance and knows she wants to dance and that she can dance. You can really see Felicie's passion for dancing right there. The whole movie is all about passion and the movie will inspire viewers to follow their dreams. The message of this film is to follow your dreams. It show how, in order to succeed, you have to work very hard, believe in yourself and have passion. Felicie is an exemplary role model. Leap! is a very inspirational film with a very important lesson and a pleasure to watch. I give it 5 out of 5 stars and recommend it for ages 3 to 18. Adults will love this movie as well. I really enjoyed watching this film.",
         "Ballerina is a great french-Canadian animation film about 2 waifs who escape their orphanage and go to Paris to reach their dreams & never give up, Félicie (Elle Fanning) with a passion a natural talent for dance & Victor (Dane Dehaan) an inventor. Beautiful music, landscapes & sceneries, a Belle Époque tale that involves the construction of the Eiffel Tower & the Statue of Liberty. A kindly maid & a distinguished professor manage her to succeed. A movie for the whole family.",
         "Two French orphans escape to 19th century Paris. One dreams of being a famous Ballet performer. The other dreams of being an inventor. Obviously, the heroine becomes a true hero, with the help of the inventor. This is great children's movie, also very enjoyable for a father. In 3D it is more exciting to watch than Rogue One in IMAX. The setting in the 19th century Paris is excellent. Gustav Eiffel lived then and there, need I say more? The French movie is really the best Christmas holiday feel-good movie, that you need to end 2016. Still worthwhile watching 2017 onward, though.",
         "It's late 19th century. Felicie (Elle Fanning) and Victor (Dane DeHaan) are best friends at an orphanage. She dreams of dancing and he helps her escape to Paris. She finds her way to the National Academy of Music and is taken in by crippled caretaker Odette (Carly Rae Jepsen). Cruel Regine runs the ballet school and Camille (Maddie Ziegler) is a snooty aggressive little girl trying to be a ballerina. Felicie steals Camille's invitation to Mérante's class who is picking the new Clara in The Nutcracker. Victor tells her that he's working for Eiffel who is busy building his tower and the Statue of Liberty. The animation is functional. This Canadian-French production is equivalent to Illumination Entertainment level. It's fine but not anything ground breaking. The characters are fine. There are the plucky kids against great odds and villains and other archetypes. The story is also fine but a few changes would have helped. Felicie stealing the letter is probably the main mistake. It puts her on the wrong side and lets Camille off the hook. Camille should be bullying the other girls to force them out. Felicie can still learn from Odette and Mérante can simply invite her into the class after the tavern dance. The plot can arrive at the same place without compromising Felicie. It's also off when she sleeps through her audition putting her at fault once again. The dance off is actually quite exhilarating but the climaxing gets a second unnecessary trip around. A Hollywood studio would make everybody an animal and this would probably sell a lot better. Sing is not much better and it made over $600 million. Non-Hollywood doesn't have the formula yet. They don't know how to market and make a modern family-oriented animated movie.",
         "So basically you can escape an orphanage, steal an identity and become a super talented ballerina (even if you couldn't properly stand up on just one leg) in just a few weeks, yeah, that's completely reasonable. I mean, I know It's a movie, but this is just too unreal. Anyway, kids will like it.",
         "\"Ballerina\" is a French/Canadian co-production in the English language that world premiered in October and is now being released in all kinds of countries and here in Germany as well. Americans still have to wait until early March. The co-director and also one of the three writers is Eric Summer, so he was probably the man most in charge of this 1.5-hour film. It is set a long time ago and tells the story of a young girl who dreams of becoming a ballerina. I liked how they referenced the time this film plays by historic context, for example the unfinished Eiffel Tower, the fact that they had motorbikes, but no airplanes or the Statue of Liberty. This was pretty nicely done and also has a bit of an educational purpose. Besides that, the film's strongest side is probably the animation. This is really a beautiful movie for the most part and very nice to look at. This also refers to the female main character and it's impossible not to cheer for her when she tries to live her dream. This is also crucial as, if we are honest, the story is pretty generic and predictable. But that's not a problem if you cheer for the girl throughout the entire movie. Her best friend brings some nice comic relief and also the friend of the bets friend in the second half. It's a sweet little story. The dance instructor (voiced by Joachim Llambi in the German version eurgh...) feels like an animated French version of Dieter Bohlen and the casting show context of the film may not really have helped matters overall, especially as we don't find out about the other contestants. We just see them eliminated one-by one. But these are just minor flaws, just like the fact that the film is sometimes too melodramatic for the sake of it, like the murder attempt at the end, the fire reference about the lady in crutches, the orphanage background, the way she falls several times at the big finale of the competition etc. If you look at the film from a certain perspective, it is actually slightly depressing. But there are also several uplifting moments for sure, some of the pretty memorable and emotional, like when she sees the ballet dancer for the first time. Or when she hugs her instructor at the very end. In general, a film full of hugs. It's a movie that has a lot to do with making the right decisions. Maybe the film suffers a bit too much from character being either completely positive or negative, even if I think with the final (realistic?) change in mind of the other girl they may have made up for it a bit. And I also believe that her instructor somehow deserves her own film with all the vague information we get about her life. Maybe it will be made some day. Who knows. Now back to this one here, there is also a nice song by Sia included in here and this was maybe the best music moment from the film. Fittingly, Maddie Ziegler voices one of the main characters, even if not in the dubbed version I watched. The German voice for the main character by the way comes from Maria Ehrich from the Rubinrot film and sequels. As for this animated film here, there is some good, some not so good, but nothing really great or really bad I must say. Maybe the hug moment between Félicie and the instructor was the best of the best. All in all, it's one of the better animated films of 2016 and I would have been fine with an Oscar nomination, but the film was completely shut out by awards bodies. Then again, maybe it has to wait until next awards season to receive some recognition. If you have daughters who already are interested in ballet and dancing, then this film and the main character will probably win them over completely and keep the idea of becoming a professional dancer in their heads for a long long time.",
         "An orphan girl dreams of becoming a ballerina and flees her rural Brittany for Paris, where she passes for someone else and accedes to the position of pupil at the Grand Opera house. Ballerina is not just a good looking animated film but it's also a very important one with a beautiful message inside of it which is to never give up on our dreams plus the characters are very good written and interesting especially Felicie and even the characters that at first seem bad and evil such as Camille they do have a good heart inside of them and as the film progress that good heart truly becomes a much bigger part of the plot and the story and overall Leap is just an interesting movie with good characters, animation and most of all messages that your kids will definitely enjoy.",
         "A story about an orphaned girl and her aspiring inventor friend escaping the orphanage to pursue their dreams. Decent, enjoyable, cliché with a hint of Karate Kid in it. I am quite happy to watch it from the beginning to its very end, but only one thing I can't stand, which is Carly Rae Jepsen's voice. I imagined Odette wouldn't sound like that. It's completely unexpected, not in a good way. It lacks passion and charisma of one who used to be the prima, the best ballerina. Her job at portraying Odette is the only thing that holds me back from re-watching this film, which is such a shame because the story and the animation are worth watching twice.",
         "I was so excited to take my daughter to see this movie, as she is about to start taking ballet classes herself. I was EXTREMELY disappointed and left after only viewing about a half hour. The characters were rude, called each other names, and treated each other poorly. I am sad that this is the reality of today's movies. I was hoping it would be an uplifting story about someone who worked hard and didn't give up on their dreams. It just wasn't so.",
         "I don't know where to begin with this movie. It was almost perfect and the soundtrack is just lovely. There are a few tiny anomalies and the evil witch/mother character was a little too close to the annoying female villains in the popular Barbie movies from a decade ago, but the graphics are really breathtaking and I love that there's a solid moral to the story, and a real female empowerment message. We loved it. I can't say more or it will spoil the effect. Sit back with the AC and your favorite snack. Don't miss a second of it. If you teach a dance class for kids ages 4-10 it might be a nice year-end treat to watch as a group or to gift the first-year student who has made the most progress this year. :)",
         "The idea of a little girl or boy wanting to do ballet is not new. Making an animated film around the passion of Ballet is new as far as I know. I hadn't even seen a single trailer for this but took my daughter to see it. Simply put, it was fantastic. Other reviews mention that it's stereotypical with shallow characters but it IS a children's film and it has such a terrific message behind it. The unique background of France and early 19th Century Paris makes this an adventure that is outside of the normal run of the mill children's film. Yes I suppose it is predictable and as far as characters or moral it's not new but you know sometimes it's nice just to see something nice! Ballerina (now renamed Leap) is not this year's runaway hit but it was a sweet, cute, fun time at the movies. The cast is very good. The characters aren't unique but that doesn't mean they are relatable and fun and easy to connect with. Elle Fanning perfectly voices the hard headed dreamer Felicie. She is a wonderful hero for young girls and boys alike. Her passion for dance is really endearing. Dane DeHaan is adorable and perfect as her best friend (carrying a flame for her) the inventor Victor. The two characters together are perfection and their very light romance adds to the story. Carly Rae Jepsen is fantastic as the former dancer turned mentor Odette, Julie Khaner, Terrence Scammell and Tamir Kapelian round out some of the best of this case. They all fit their roles very well. Perhaps the film is finding some trouble finding it's demographic. I think it might appear to be aimed at older children when in fact I think very young children might enjoy it even more. The backdrop of Paris and the excitement of the ballet and some of the animated dancing scenes are really fantastic. The \"Rocky\" type montage of Felicie honing her dance skills was fantastic. Co-Directors Eric Summer (also wrote the film) and Eric Warin are not full of animated experience so that makes this outing all the more impressive to me. I think someone with more experience in the genre might have really been able to tweak and edit this to perfection BUT that's not to say the Erics did a bad job. I think they did a great job and I will add this to my daughter's film collection the moment it comes out. I enjoyed it very much. 8/10",
         "Unless you're 8 or under this movie was much too predictable. Elle and the boy delivered their lines with conviction. The others just sounded like they were reading. When the plot and the characters are so predictable, the acting with the voices must be over the top to bring it up. This didn't happen in my opinion. I also didn't think the fake-it-till-you-make it message was very positive. It pretty much describes half of Hollywood celebrates but don't subscribe to that notion. You're either good enough on your own merits or you're basically a scam artist faking it. I didn't agree with the need for the orphan to pretend she's someone else. So for that notion, along with the performance of inexperienced cast, I give this movie a 2.",
         "The most Beautiful animation movie ever ! I adore, adore, adore, adore, adore this movie, it's delightful and absolutely Divine !!!!!!!!!! Ten out of Ten. This magical movie was surely made by a Great Team and also with True Love and Great Passion and that's all it takes to make this Wonderful and Marvellous movie. It's Pure, full of Talent, Grace and Magic.This Mesmerizing Film is worthy of the Oscars and it represents with the utmost Beauty and Justice the most Noble and the most Precious Soul of The Loving Citizens of France, a very Talented, very Tender, very Artistic, very Kind and very Good-Hearted People. That's a True Masterpiece. I cried a lot as I was watching every detail, every delightful scene of this extremely Beautiful movie.You deserve the very top rating for you have made this movie with True Love and Passion, just like The Stars of this Magical Film. Much more than a very cute and very nice movie, Ballerina is a Praise to Beautiness, Kindness, Dedication and Friendship. Follow Your Dreams with Passion and someday they will surely some True. Absolutely Divine !!!!!!!!!!",
         "Grade: A- Rating: PG, 89 minutes In a Nutshell: This gorgeous family-friendly film paints Paris with an incredibly charming stroke, created by the L'Atelier Animation Studio in France. You're easily transported back to 19th Century France. I love titles that have double meanings. While the orphan Felicie's dream was to produce the incredible leap she had seen a ballerina make once, the film also encourages us all to take a leap of faith and hard work to make our dreams come true. Uplifting theme: Passion Dream big and take action. You are unique. Don't let anyone tell you that you're nothing. Persistence, hard work, tenacity Things I liked: Catchy theme song. All of the music was infectiously good and included a lot of lovely songs unfamiliar to Americans, as well as a few faves like \"Suitcase\" by Sia, and \"Confident\" by Demi Lovato. Carly Rae Jepsen voices Odette, and also sings and wrote several of the songs. The scene where Victor tells Felicie about his first day in Paris was hilarious. Excellent animation stops and sequences. Felicie's training sequence was really cute and as inspirational as any sports movie training montage. Elle Fanning voices Felicie, whose dream it is to dance in the Nutcracker Ballet. Elle Fanning actually performed in The Nutcracker 3D (2010 movie). Maddie Ziegler voices Camille. She's a dancer in real life, having appeared on Dance Moms in 2011. Victor was voiced by Dane DeHaan in the international version of the film. Nat Wollf was used in the American release. It's well balanced in comedy, magic, and drama. The ballet battle between Felicie and Camille before the big evening performance was adorable and hilarious. It feels like a European animation, because, it is. Originally, it was entitled \"Ballerina\", which is the version I first saw. It was choreographed by Aurelie Dupont and Jeremie Belingard. The dancing animation in the beginning felt a little off, but by the end it was perfect. The film appears to have a deeper origin. Director and writer Eric Summer also comes from Brittany where the story begins. Things I didn't like: Some of the animation looked rushed and out of sync, particularly in the beginning. The underdog plot isn't unique, but it's still very sweet. Most of the characters are thin archetypes. Some critics don't like the fact that pop music is played, insisting it should all be classical ballet music like Tchaikovsky, but that didn't bother me at all. I actually liked it. Other critics complain that the filmmakers didn't do their research for historical accuracy. For example, were there motorcycles in France in the 1800's as this movie supposes? It turns out that yes, there were in the later half of the 1800's, just about the same time the Statue of Liberty was being built. Funny lines: \"Thank you Mother Superior. And may I just say that you're looking very superior today?\" – Victor \"Who is that?\" Felicie (Elle Fanning) \"Rudy.\" – Dora (Elana Dunkelman) \"From the top boys' class, holder of the best cheekbones at the Opera award. I love him. He's so blonde and shiny.\" – Nora (Shoshana Sperling) \"How is that pick-up line working for you?\" – Felicie \"I am loving your apron!\" – Victor \"Paris! City of romance. City of Dreams! City of Romance! City of Pigeons!\" – Victor Interesting lines: It's when you're tired you start to progress.\" – Odette (Carly Rae Jepsen) \"Tired is for losers.\" – Regine (Julie Khaner) \"There's a difference between being ready and being ready to do it well. That's why we train every day.\" – Odette Tips for parents: This is an enjoyable film for all ages. It's funny, sweet, and inspiring. Several fart jokes. Your little ballerina daughter will be very inspired and want to see the Nutcracker Ballet. I really like how the movie features two children with dreams, who don't just fantasize about what they want to do, but are willing to work hard to achieve it. No profanity. Some bullying. Some animated moments of peril. MOVIE REVIEW MOM @trinaboice",
         "Good storytelling serving a very classic plot. Predictable? Yes, but no more than Frozen or Tangled. After all, it's a familiar film, not a thriller. The important thing is that the script is able to keep audience's interest all the film long. The 3D work is very remarkable, taking into account the rather limited budget (I've seen movies over 100 Mio failing to achieve that quality by far). Both the Paris environments and the characters deserve the highest score. Particularly, the character design is a bit too much Disney, but nicely done anyway, with beautiful rigging, clothing and hair dynamics. The animation work in the dance scenes is outstanding. Lightning and texturing is absolutely a wow. In a nutshell, L'atelier achieved a little master piece, joining high levels of realism without renouncing to all the expressive resources one can expect in a pure cartoon film. And, what is more important, all that impressive technical deployment is seamlessly put to the service of the storytelling. But, more than that, seeing the face of the attendants to the session, including my daughter, other kids and other parents, leads me to score this film with a 8. After all, audience is king, beyond any other consideration.",
         "I really liked the movie! I gave 10 points to the movie! This was the film that gave me an impetus to have my childhood dream come true and I started learn ballet dancing! I've been enchanted by the movie to this day! I'm just sorry you did not get all the movies on the album! Is there still a slight chance that a Deluxe album will be added to it?",
         "This film tells the story of two orphans, who dream about escaping to Paris and live their dream. Within hours of their escape, they have realised their dream as one makes it to a ballet school, and the other becomes an inventor. \"Ballerina\" has a sweet story about two orphans who refuse to be looked down upon. Through hard work and perseverance, they live their life to the full. It is an inspiring story, with enough adventures and love story to spice up the journey. The ballet moves are nice, the characters are lovely and the \"chicken wings\" are funny. Even the evil rich woman is evil in a good way. The only thing I wish could change a little is that the film plays songs from other singers too, apart from Carly Rae Jepsen. I like Carly, but it gets tiresome when every single song is by her. I guess I am a little traumatised by \"Home\", which is like an extended music video for Rihanna. \"Ballerina\" is a way better animation film, but it would have been even better if there were songs by other singers too."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Comedy",
         "Family",
         "Musical"
      ],
      "productionCompanies": [
         "Quad Productions",
         "Main Journey",
         "Caramel Film"
      ],
      "summaries": ["An orphan girl dreams of becoming a ballerina and flees her rural Brittany for Paris, where she passes for someone else and accedes to the position of pupil at the Grand Opera house."],
      "budget": 30000000
   },
   "movielensId": 167620,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2016-12-14",
      "dvdReleaseDate": null,
      "directors": [
         "Eric Summer",
         "Éric Warin"
      ],
      "runtime": 89,
      "movieId": 167620,
      "title": "Ballerina",
      "mpaa": "",
      "actors": [
         "Elle Fanning",
         "Dane DeHaan",
         "Carly Rae Jepsen",
         "Maddie Ziegler",
         "Mel Brooks",
         "Julie Khaner",
         "Terrence Scammell",
         "Joe Sheridan",
         "Tamir Kapelian",
         "Elana Dunkelman",
         "Kate McKinnon",
         "Mel Brooks"
      ],
      "imdbMovieId": "2261287",
      "originalTitle": "Ballerina",
      "genres": [
         "Animation",
         "Adventure",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [
         "oGC8-s1Eiqo",
         "a166o4om9OA",
         "FsNJBRDbZBE"
      ],
      "plotSummary": "Set in 1879 Paris. An orphan girl dreams of becoming a ballerina and flees her rural Brittany for Paris, where she passes for someone else and accedes to the position of pupil at the Grand Opera house.",
      "tmdbMovieId": 342473,
      "avgRating": 3.1875,
      "releaseYear": "2016",
      "numRatings": 56,
      "posterPath": "/60ZhK1FstSkC9Ms8lRWaTPm55kD.jpg"
   }
}