{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "tattoo",
            "id": 331
         },
         {
            "name": "spy",
            "id": 470
         },
         {
            "name": "extreme sports",
            "id": 2006
         },
         {
            "name": "airplane",
            "id": 3800
         },
         {
            "name": "secret agent",
            "id": 4289
         },
         {
            "name": "parachute",
            "id": 4300
         },
         {
            "name": "swimming pool",
            "id": 8181
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "back from the dead",
            "id": 12415
         },
         {
            "name": "free fall",
            "id": 234496
         }
      ],
      "imdb_id": "tt1293847",
      "video": false,
      "title": "xXx: Return of Xander Cage",
      "recommendations": [
         311324,
         343611,
         337339,
         173897,
         278924,
         121856,
         11679,
         308531,
         335988,
         302699,
         324552,
         282035,
         305470,
         7451,
         274854,
         324542,
         274857,
         293167,
         346672,
         249070
      ],
      "backdrop_path": "/zv4acOMTPoplVLKo4FaoqAseSDx.jpg",
      "revenue": 346147658,
      "reviews": [
         {
            "author": "Frank Ochieng",
            "id": "5886aeabc3a368371e000748",
            "content": "Words cannot express how incredibly overwrought, insipid, hyperactive and foolishly exaggerated the third entry into the action-packed _XXX_ film franchise is in the nonsensical and numbing operative spectacle **XXX: Return of Xander Cage**. Monosyllabic muscle-bound action star Vin Diesel revisits the rollicking and roguish skin of athletic spy/sports enthusiast Xander Cage in yet another splashy yet sophomoric throbbing thrill-ride that only diehard Diesel fanboys will swallow with unapologetic fervor.\r\n\r\nWhen in doubt Diesel knows where his bread is buttered in terms of his secured box office appeal. The pumped-up performer has initiated the hoopla with a couple of popular action flicks in the past only to leave them briefly before deciding to return front and center. Diesel has done this tactic with the inexplicably desired _The Fast and the Furious_ movie series as well as the aforementioned _XXX_ offerings (actor/singers Tyrese Gibson and Ice Cube inherited the big screen honors in replacing the absent Diesel in these energized ditties respectively). Now Diesel is called into service once again to capitalize on the extreme spy genre while satisfying those thrill-seekers whose thirst for the James Bond and Jason Bourne action-grabbers may be perceived as relentlessly mild as the acrobatic antics of the hip Bald Bold One looks to overshadow his competitors in daunting dumbness.\r\n\r\nBottom line: who the heck was cramming for the ridiculous return of the attention-getting Xander Cage other than the motivated machismo of star/co-producer Diesel strutting his all-too-familiar slick shtick in an empty-minded vanity project that is jumpier than a kangaroo with the hiccups? There is nothing like playing to the convoluted escapism and exploiting the loyal demographics that continue to get a charge out of Diesel’s boisterous brand from the _Fast and Furious_ enterprise that still sizzles for some and fizzles for others. Nevertheless, this espionage eyesore features Diesel’s Cage at his best…and that is not saying much. He is as smooth as ice soothing your ailing tonsils. Check. He is a chick magnet to the highest degree. Check again. He can turn his biceps and brawn into an invaluable weapon for the safety of his country and comrades. Double check and then some. Overall, we get it…Xander Cage is a badass without boundaries and daredevil Diesel and his on-screen cohorts wants to reinforce such titillating tripe. Go figure.\r\n\r\nGranted that **XXX: Return of Xander Cage’s** sole purpose is to play into the pulsating popcorn pleasure of its audience while expecting one not to take the excitable escapades too seriously. Still, the tired formula for this particular genre in general (not to mention a Vin Diesel-starring vehicle) feels utterly uninspired and recycled despite the ambitious showcasing of active triggers that include high-wire skiing through the woods, dirt bike surfing, daring skateboarding prowess while clinging to the side of a moving bus and oh yeah…a lot of colorful butt-kicking tactics to boot. The highly stylized lifestyle of the free-wheeling Cage is by-the-numbers hedonism–cause havoc, conquer the lovely ladies hormonal for his suave affections and come off looking cool this side of 70’s knockoff bad motherf&%$# private eye John Shaft in taking care of business. Great spy work if you can conjure it up for indiscriminate action junkies wanting to engage in this souped-up silliness without rhyme or reason.\r\n\r\nFor those not quite familiar with the Xander Cage “mythology” he was an extreme sports talent that had been recruited by NSA head honcho Augustus Gibbons (Samuel L. Jackson) to utilize his competitive skills and abilities undercover. Now Cage is back in the saddle as he horses around on yet another challenging assignment that finds him butting heads with a trio of baddies in Deepika Padukone’s Serena, Donnie Yen’s Xiang and Tony Jaa’s Talon–a threatening threesome experimenting with dangerously rigging outer space satellites or something to that trivial effect. Of course the crafty Cage–beyond wily and reckless–is often reigned in by the likes of his superiors including Agent Jane Marke (Oscar and Emmy nominated Australian actress Toni Collette needlessly toiling away in this toothless contraption of a spy thriller).\r\n\r\nDirector D.J. Caruso (2016’s “The Disappointments Room”) merely goes through the motions with this disjointed spy caper that flexes its moronic muscles without offering much else to the preposterous proceedings. The displayed dialogue in a Lucky Charms cereal commercial has more credibility than the words leaving the lips of the featured players in this woefully generic actioner. Diesel, who has shown some promise as an actor in previous critical fare from yesteryear such as 2000’s _Boiler Room_ and 2006’s _Find Me Guilty_ has since played it safe and relied on the frivolous “sure thing” with the repetitive Furious installments and other fluffy movie projects that had diminished his potential in Hollywood beyond the brainless blow-em-up cinema that he finds automatic comfort in churning out as a cinematic safety net.\r\n\r\nAlthough they say that a single “X” usually marks the spot it takes triple X’s to disprove this theory when welcoming back the chaotic coolness that is Diesel’s detached dude in cocky-minded Xander Cage–the sensationalized showboat that should have left his debuted one-dimensional adventurous tendencies back in 2002.\r\n\r\n**XXX: Return of Xander Cage** (2017)\r\n\r\n(c) **Frank Ochieng** (2017)",
            "url": "https://www.themoviedb.org/review/5886aeabc3a368371e000748"
         },
         {
            "author": "DanDare",
            "id": "59091c50c3a36835fc001071",
            "content": "Just as Vin Diesel bailed out of the first The Fast and the Furious Sequel, he did the same for the sequel to xXx.\r\n\r\nHowever after some years Diesel is back as extreme sports star turned spy Xander Cage in this daft but slightly entertaining film which has an incomprehensible plot, a smug star and even some dodgy CGI here and there.\r\n\r\nThe plot is some bad guys want the Pandora Box which can control spy satellites and it is Cage and his team's mission to retrieve it. However we just know everyone around is just treacherous so they should all watch their backs.",
            "url": "https://www.themoviedb.org/review/59091c50c3a36835fc001071"
         },
         {
            "author": "Per Gunnar Jonsson",
            "id": "593e693e92514105e202e8ba",
            "content": "I must confess that I did have higher hopes for this movie. I’m not sure what the script writers was up to when writing it but they really seem to have a very low opinion of the audience’s intelligence. Either that or it was written for a very young audience.\r\n\r\nThere were parts of the movie that was quite fun to watch but on the whole it was pretty much a mess. It is a shame because it had quite a bit of promise. The core of the plot was not too bad although I really wish that Hollywood writers would stay away from plots involving computer gadgetry. Their knowledge in that area simply stinks. Thus the gadget that the entire movie was spun around was simply stupid.\r\n\r\nUnfortunately another core plot element was the crooked CIA (or whatever department it was supposed to be) boss that of course had to do some senseless backstabbing just to prolong the movie. Tiresome, overused and boring. I know, I know with fucktards like Comey I guess one could say that it would not be too far from the truth but it is still tiresome, overused and boring.\r\n\r\nSince I am on a rant anyway let’s go on to the various stunts and special effects. It is a long time since I watched a movie where the stunts were so obviously and totally overdone and unrealistic. I mean, they were unrealistic to the point where I started to wander if it was a slapstick comedy I was watching.\r\n\r\nAll of this really dragged down the movie … a lot!\r\n\r\nOn the good side. I did like many of the wacky characters. It is a shame that many of their wacky moments were less of a comic relief due to the above mentioned silliness but instead felt like the more serious moments in the movie.\r\n\r\nVin Diesel, well I watched this movie because I am a Vin Diesel fan so of course I liked him. He is his usual badass and kick ass self. He is also surrounded by a bunch of badass (and wacky as I mentioned before) characters. I quite liked the ensemble. The guy who seems to collect crashes is rather silly but fun in a strange way. I did like the gun girl a lot.\r\n\r\nHowever, apart from quite a few fun and/or cool scenes the movie as a whole did not cut it. In my opinion it was ruined by a substandard script devoid of any form of intelligence. I would go as far as to say that the writers were incompetent pure and simple. I was almost giving it three stars because there was many parts I liked but in the end … no, there is no way I could justify more than two stars for this mess.\r\n\r\nReally a shame. I would have liked to see more xXx movies but after this one I’m not sure anyone will bet money on that.",
            "url": "https://www.themoviedb.org/review/593e693e92514105e202e8ba"
         },
         {
            "author": "Reno",
            "id": "59ac9c00c3a3682c0a03819a",
            "content": "**A new franchise is on making!**\r\n\r\nI was very happy when I heard about a sequel is on the development of Vin Diesel's one of the career early films. I was a teenager, and I remember celebrating it in the theatre with my friends. But, like the T2, it was too late for a sequel. Most of other franchises are going for spin-offs in the similar case. Anyway, it was good to see the original character back in the action. Although not liked changing the title logo. The original is evergreen.\r\n\r\nWell, the story continued as the same gap between the first and this film. I thought the original concept was like solo action hero kind, but in here, it became a multi-starrer. Like most of the similar themed action film series, it tried to add variety of characters, including clichés like computer hackers and a boss to handle those rogue guys. But there were too many Triple Xes.\r\n\r\nThe story was okay. It only wanted to make a comeback, like a re- introduction of everything. I liked the diversity in the film characters. The casting was from around the world, picking the best team like Donnie Yen from HK, Tony Jaa from Thailand. But I did not understand why Donnie was speaking in Mandarin, instead of Cantonese.\r\n\r\nFrom all I did not like Deepika. Yes, she's the real Indian beauty, but not a good actor, especially for actions, she's unsuitable. I would have preferred Priyanka in here. They two should have switched the films between this and 'Baywatch'. Jaa, I did think he had in him his witty character display. He was a completely different person in this. The rest of the guys were too not bad at all, particularly that stunt guy was awesome.\r\n\r\nWhen it comes to the action sequences, not some, many were totally impossible. Surely not the really performed stunts they were. Simply a special effects, and it was too much to take on. Because they were not realistically appealing to accept. Those include, non-snow mountain skiing, ocean wave bike surfing, you add it. The good news is, it was okay for watching once, but I'm anticipating the next part to be a game changer in the franchise.\r\n\r\n_5/10_",
            "url": "https://www.themoviedb.org/review/59ac9c00c3a3682c0a03819a"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Xander Cage",
               "gender": 2,
               "credit_id": "52fe4751c3a36847f812f0f1",
               "name": "Vin Diesel",
               "profile_path": "/7rwSXluNWZAluYMOEWBxkPmckES.jpg",
               "id": 12835,
               "order": 0
            },
            {
               "cast_id": 136,
               "character": "Darius Stone",
               "gender": 2,
               "credit_id": "5879cbd5c3a3681bf10045ed",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Agent Augustus Gibbons",
               "gender": 2,
               "credit_id": "52fe4751c3a36847f812f0f5",
               "name": "Samuel L. Jackson",
               "profile_path": "/AvCReLikjzYEf9XjTQxbv3JWgKT.jpg",
               "id": 2231,
               "order": 2
            },
            {
               "cast_id": 20,
               "character": "Jane Marke",
               "gender": 1,
               "credit_id": "56c5eb66c3a3680d540030f3",
               "name": "Toni Collette",
               "profile_path": "/oMps1ZPH3dHmqZmrpZcRiyUBgA.jpg",
               "id": 3051,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Adele Wolff",
               "gender": 1,
               "credit_id": "5690a9e49251414565001741",
               "name": "Ruby Rose",
               "profile_path": "/yH11h8nvhtzyiLGfg9exJdAqhVr.jpg",
               "id": 1246972,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Serena Unger",
               "gender": 1,
               "credit_id": "5687aac992514169d000e0ac",
               "name": "Deepika Padukone",
               "profile_path": "/kBGmOExBHwbVZDmGegGx3qZWw89.jpg",
               "id": 53975,
               "order": 5
            },
            {
               "cast_id": 36,
               "character": "Nicks",
               "gender": 2,
               "credit_id": "580acf00c3a368295b005283",
               "name": "Kris Wu",
               "profile_path": "/gwtLPwmv54umE5RhtDOEWzahmy.jpg",
               "id": 1390948,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Xiang",
               "gender": 2,
               "credit_id": "56c5eb7cc3a3680d5200302a",
               "name": "Donnie Yen",
               "profile_path": "/vlKBbOc0htUsDGvcxeULcFXDMRo.jpg",
               "id": 1341,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Talon",
               "gender": 2,
               "credit_id": "5687aabf92514169d000e0a7",
               "name": "Tony Jaa",
               "profile_path": "/qq0uXKe3aKaAE04QQ0BvbbFFufF.jpg",
               "id": 57207,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Rebecca 'Becky' Clearidge",
               "gender": 1,
               "credit_id": "5690a9c392514145630017a1",
               "name": "Nina Dobrev",
               "profile_path": "/7Oc4jOZHWNYozxBxKdQr0NxoGjS.jpg",
               "id": 19961,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Tennyson Torch",
               "gender": 2,
               "credit_id": "56c5ebec9251415469000b8c",
               "name": "Rory McCann",
               "profile_path": "/zYNJIN6fEXAkLz2APQduYxvGxI1.jpg",
               "id": 3075,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Ainsley",
               "gender": 1,
               "credit_id": "56c5ebaec3a3680d3e0033cb",
               "name": "Hermione Corfield",
               "profile_path": "/65ibJtD4piMDPLcB1deyeKYlDDy.jpg",
               "id": 1345419,
               "order": 11
            },
            {
               "cast_id": 40,
               "character": "Paul Donovan",
               "gender": 2,
               "credit_id": "581e488dc3a36806ff00ed16",
               "name": "Tony Gonzalez",
               "profile_path": "/cXi8CuEgHAo5kU0T9pbuL207uVK.jpg",
               "id": 129205,
               "order": 12
            },
            {
               "cast_id": 26,
               "character": "Hawk",
               "gender": 2,
               "credit_id": "57b826229251410d980054c8",
               "name": "Michael Bisping",
               "profile_path": "/ofeuLzoKQ7FRE7XEiEcPaZarsfE.jpg",
               "id": 78909,
               "order": 13
            },
            {
               "cast_id": 37,
               "character": "Lola",
               "gender": 1,
               "credit_id": "581e48009251410a0400ede4",
               "name": "Ariadna Gutiérrez",
               "profile_path": "/lE9aC50U5JY3rX5AAY1QKH0dvY6.jpg",
               "id": 1668243,
               "order": 14
            },
            {
               "cast_id": 38,
               "character": "Red Erik",
               "gender": 0,
               "credit_id": "581e48139251410a1800eac0",
               "name": "Andrey Ivchenko",
               "profile_path": "/af2WqhxG069kjExMWfKB7kM0BMR.jpg",
               "id": 1008235,
               "order": 15
            },
            {
               "cast_id": 137,
               "character": "Jonas",
               "gender": 2,
               "credit_id": "590cbe489251414e920018f6",
               "name": "Shawn Roberts",
               "profile_path": "/2pzr8yoBCOnDnaS0iUxraBfZ7SR.jpg",
               "id": 81097,
               "order": 16
            },
            {
               "cast_id": 140,
               "character": "Lazarus",
               "gender": 2,
               "credit_id": "590cc0ccc3a36864d4001b35",
               "name": "Nicky Jam",
               "profile_path": "/eJaqs0qIwclvcgUOvmVo0jp3Lc6.jpg",
               "id": 1688196,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "CIA Director",
               "gender": 2,
               "credit_id": "56c5eb8e9251415475000cbd",
               "name": "Al Sapienza",
               "profile_path": "/rWTWUwOcNj5SsLb9FS3dbseosWv.jpg",
               "id": 154917,
               "order": 18
            },
            {
               "cast_id": 31,
               "character": "Ainsley's Girl",
               "gender": 0,
               "credit_id": "57b93e7892514141e30039fd",
               "name": "Helena-Alexis Seymour",
               "profile_path": "/agTiP5pWbfOjMcwh2x5AlVYoccj.jpg",
               "id": 1668665,
               "order": 19
            },
            {
               "cast_id": 32,
               "character": "Ainsley's Girl",
               "gender": 1,
               "credit_id": "57b93e80c3a3685c15003721",
               "name": "Megan Soo",
               "profile_path": "/x03T8XmllOe8uJe1sDzOSC1AZ58.jpg",
               "id": 1668666,
               "order": 20
            },
            {
               "cast_id": 138,
               "character": "Ainsley's Girls",
               "gender": 0,
               "credit_id": "590cbec79251414e92001944",
               "name": "Kristen Kurnik",
               "profile_path": "/g4btfBqZx5Jwo4XjnTPJIvpl70A.jpg",
               "id": 1811040,
               "order": 21
            },
            {
               "cast_id": 139,
               "character": "Ainsley's Girls",
               "gender": 1,
               "credit_id": "590cbf66c3a3686519001764",
               "name": "Bailey Rose King",
               "profile_path": "/u8EUgELY6pokFWYvmsIAH6ox4XX.jpg",
               "id": 1811045,
               "order": 22
            },
            {
               "cast_id": 143,
               "character": "Ainsley's Girls",
               "gender": 0,
               "credit_id": "590ccaed9251414e8d001fe0",
               "name": "Pilar Cruz",
               "profile_path": "/t4PIfCX9vPgseCU230AkPGdeMWh.jpg",
               "id": 1811101,
               "order": 23
            },
            {
               "cast_id": 141,
               "character": "Friendly Man",
               "gender": 2,
               "credit_id": "590cc1dbc3a36864d4001bba",
               "name": "Charles Carroll",
               "profile_path": "/5sGsNA3iVsjt3vXxNH5aK3P7toG.jpg",
               "id": 60287,
               "order": 24
            },
            {
               "cast_id": 142,
               "character": "Swat Captain",
               "gender": 0,
               "credit_id": "590cc2069251414e92001af8",
               "name": "Héctor Aníbal",
               "profile_path": "/5PU9da9gJrZFizL0teCm7YCosPT.jpg",
               "id": 1676666,
               "order": 25
            },
            {
               "cast_id": 148,
               "character": "Minister",
               "gender": 0,
               "credit_id": "590ccd83c3a368646b0023c1",
               "name": "Curtis Fletcher",
               "profile_path": "/jJczsHzXOfkodsPrPDDAdOO4Hx.jpg",
               "id": 1811110,
               "order": 26
            },
            {
               "cast_id": 144,
               "character": "Chinese Politico",
               "gender": 2,
               "credit_id": "590ccb8f9251414e890020ae",
               "name": "Terry Chen",
               "profile_path": "/jrzqH7uKK8goyAJcXuKz8DdCAbS.jpg",
               "id": 11677,
               "order": 27
            },
            {
               "cast_id": 145,
               "character": "Catwalk Partiers",
               "gender": 0,
               "credit_id": "590ccbabc3a36864c6001ff9",
               "name": "Jenny Itwaru",
               "profile_path": "/jQNyHvtZvhjF855vkrdAdPgZllA.jpg",
               "id": 1811104,
               "order": 28
            },
            {
               "cast_id": 153,
               "character": "Catwalk Partiers",
               "gender": 0,
               "credit_id": "590cd37cc3a36864d40026b6",
               "name": "Julie Abcede",
               "profile_path": "/ipq8ggMzukvaoG81qDqe5kqHjnP.jpg",
               "id": 1811118,
               "order": 29
            },
            {
               "cast_id": 152,
               "character": "Catwalk Partiers",
               "gender": 0,
               "credit_id": "590cd369c3a368651900228f",
               "name": "Josh Pagcaliwangan",
               "profile_path": "/aWN0w9G7hYhi6T8jMYpFPtBlxmR.jpg",
               "id": 1741103,
               "order": 30
            },
            {
               "cast_id": 146,
               "character": "Himself",
               "gender": 0,
               "credit_id": "590ccc52c3a368650a001f80",
               "name": "Nyjah Huston",
               "profile_path": "/amCueaW7BjGjS4iHBw61Z3WJNKY.jpg",
               "id": 928413,
               "order": 31
            },
            {
               "cast_id": 39,
               "character": "Himself",
               "gender": 2,
               "credit_id": "581e486b9251410f0600db10",
               "name": "Neymar Jr",
               "profile_path": "/auKQN8SIhNv5ywNgHgeQqWIlY5X.jpg",
               "id": 1328983,
               "order": 32
            },
            {
               "cast_id": 147,
               "character": "Herself",
               "gender": 0,
               "credit_id": "590cccc99251414edb002157",
               "name": "Roberta Mancino",
               "profile_path": "/mxb6LyYYzntJYNpWmUW02BNfWhV.jpg",
               "id": 132420,
               "order": 33
            },
            {
               "cast_id": 149,
               "character": "Herself",
               "gender": 0,
               "credit_id": "590ccdc89251414e920021a0",
               "name": "Nina Buitrago",
               "profile_path": "/b7KvKcMnBrn5bvwo2gyqPMdFrtu.jpg",
               "id": 1811111,
               "order": 34
            },
            {
               "cast_id": 151,
               "character": "Herself",
               "gender": 0,
               "credit_id": "590cd1a4c3a368650a002293",
               "name": "Dani Lightningbolt",
               "profile_path": "/9Kk5X24TyCBBxqLJ8W4L4b2YFmh.jpg",
               "id": 1811115,
               "order": 35
            },
            {
               "cast_id": 150,
               "character": "Newscaster",
               "gender": 0,
               "credit_id": "590cd1029251414e80002443",
               "name": "Courtney Friel",
               "profile_path": "/roWgIqIvWU3OPYRuFzvgNVkTt6G.jpg",
               "id": 1244170,
               "order": 36
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5687ac459251414ecb0141a2",
               "name": "D.J. Caruso",
               "profile_path": "/dLSaCHhZ4zfimzCz11JdcTZC4SA.jpg",
               "id": 40256,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57b93eeb92514141ae00376e",
               "name": "Rich Wilkes",
               "profile_path": null,
               "id": 53345,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "5687ac6bc3a3684bcc024684",
               "name": "Neal H. Moritz",
               "profile_path": "/cNcsEYmoS4niCz3UkVAA09dUIob.jpg",
               "id": 11874,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5693ca5bc3a3687b48000027",
               "name": "Jeff Kirschenbaum",
               "profile_path": null,
               "id": 29400,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5693ca6b9251415c2d000041",
               "name": "Joe Roth",
               "profile_path": "/lUtmB3mtMPrA5hhoEwZBeX1U5uL.jpg",
               "id": 18311,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "5693ca849251415c2d000044",
               "name": "Samantha Vincent",
               "profile_path": null,
               "id": 90635,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5693ca989251415c30000028",
               "name": "Vin Diesel",
               "profile_path": "/7rwSXluNWZAluYMOEWBxkPmckES.jpg",
               "id": 12835,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57b828efc3a36834e800b7b3",
               "name": "Russell Carpenter",
               "profile_path": "/zhcM8RBTC8goTfJT3TbraeO1x5n.jpg",
               "id": 8523,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "57b93ed79251413f0600378b",
               "name": "F. Scott Frazier",
               "profile_path": null,
               "id": 1187860,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58419be99251417d5f008634",
               "name": "Gloria S. Borders",
               "profile_path": null,
               "id": 3992,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "58419c0ec3a36865bb00876d",
               "name": "Scott Hemming",
               "profile_path": null,
               "id": 1717404,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "58419c2ac3a36865c90084c8",
               "name": "Kimberly A. Tillman",
               "profile_path": null,
               "id": 20359,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "58419c499251417d5f008673",
               "name": "Lyn Lucibello",
               "profile_path": null,
               "id": 1457895,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "58419c659251417d4d008422",
               "name": "Karen Jarnecke",
               "profile_path": null,
               "id": 1403390,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "58419cbac3a36865bf00835f",
               "name": "David Crispino",
               "profile_path": null,
               "id": 1717327,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "58419ce4c3a36865c600749f",
               "name": "Denis Dvoryankin",
               "profile_path": null,
               "id": 1717406,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "58419d039251417d500085ea",
               "name": "Shane Richards",
               "profile_path": null,
               "id": 1717408,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "58755ae0c3a3684c09001b01",
               "name": "Miguel Fernandez",
               "profile_path": null,
               "id": 1334178,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "58755af19251412f41001d0e",
               "name": "Anne McCarthy",
               "profile_path": null,
               "id": 9545,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "58755b04c3a3684c1e001af4",
               "name": "Edna Lerebours",
               "profile_path": null,
               "id": 1301657,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "58755b22c3a3684c15001c5f",
               "name": "Morgan Robbins",
               "profile_path": null,
               "id": 1591168,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "58755b3f9251412f3c001cd0",
               "name": "Mark Sussman",
               "profile_path": null,
               "id": 184314,
               "department": "Production",
               "job": "ADR Voice Casting"
            },
            {
               "gender": 0,
               "credit_id": "58755b53c3a3684c1e001b20",
               "name": "Patty Majorczak-Connolly",
               "profile_path": null,
               "id": 1535105,
               "department": "Production",
               "job": "ADR Voice Casting"
            },
            {
               "gender": 0,
               "credit_id": "58755ba5c3a3684c18001e5a",
               "name": "Daniela Saioni",
               "profile_path": null,
               "id": 143972,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "58755bb99251412f3f001b68",
               "name": "Shane B. Scott",
               "profile_path": null,
               "id": 1393407,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "58755bff9251412f3c001d44",
               "name": "Charles Taylor",
               "profile_path": null,
               "id": 1530192,
               "department": "Crew",
               "job": "Armorer"
            },
            {
               "gender": 0,
               "credit_id": "58755c309251412f4b001bcb",
               "name": "Kyle Clausen",
               "profile_path": null,
               "id": 1437315,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "58755c439251412f3c001d7c",
               "name": "Matthew Llewellyn",
               "profile_path": null,
               "id": 1328758,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "58755c569251412f47001b84",
               "name": "Kevin McKeever",
               "profile_path": null,
               "id": 1027022,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "58755ca9c3a3684c12001d44",
               "name": "Renee Fontana",
               "profile_path": null,
               "id": 1530194,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 1,
               "credit_id": "58755cc4c3a3684c12001d58",
               "name": "Alex Kavanagh",
               "profile_path": null,
               "id": 51035,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "58755ce99251412f47001bba",
               "name": "Vicente Parada",
               "profile_path": null,
               "id": 1736643,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "58755d909251412f44001dc9",
               "name": "Karen Lee",
               "profile_path": null,
               "id": 1714352,
               "department": "Costume & Make-Up",
               "job": "Costume Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "58755db79251412f3f001c5e",
               "name": "Greg Hopwood",
               "profile_path": null,
               "id": 1736646,
               "department": "Costume & Make-Up",
               "job": "Costume Illustrator"
            },
            {
               "gender": 0,
               "credit_id": "58755e279251412f3c001e78",
               "name": "Wayne Godfrey",
               "profile_path": null,
               "id": 1736647,
               "department": "Costume & Make-Up",
               "job": "Key Costumer"
            },
            {
               "gender": 0,
               "credit_id": "58755e45c3a3684c15001e54",
               "name": "Cindy Rosenthal",
               "profile_path": null,
               "id": 1202851,
               "department": "Costume & Make-Up",
               "job": "Key Costumer"
            },
            {
               "gender": 0,
               "credit_id": "58755e579251412f44001e4b",
               "name": "Janice Skinner",
               "profile_path": null,
               "id": 1736648,
               "department": "Costume & Make-Up",
               "job": "Key Costumer"
            },
            {
               "gender": 0,
               "credit_id": "58755f159251412f3c001efa",
               "name": "Michael Carella",
               "profile_path": null,
               "id": 1408679,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "58755f4b9251412f4b001d5f",
               "name": "Ian Anderson",
               "profile_path": null,
               "id": 1105218,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "58755f65c3a3684c1800209e",
               "name": "John Holosko",
               "profile_path": null,
               "id": 1345862,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "58755f8ac3a3684c15001f0b",
               "name": "Jason Vieira",
               "profile_path": null,
               "id": 1717325,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "58755fa9c3a3684c0f001c78",
               "name": "Keith Murphy",
               "profile_path": null,
               "id": 1736652,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "58755fcfc3a3684c0f001c8e",
               "name": "Tom Comet",
               "profile_path": null,
               "id": 1736653,
               "department": "Crew",
               "job": "Drone Operator"
            },
            {
               "gender": 0,
               "credit_id": "58756003c3a3684c15001f61",
               "name": "Angelo Colavecchia",
               "profile_path": null,
               "id": 1399927,
               "department": "Camera",
               "job": "Steadicam Operator"
            },
            {
               "gender": 0,
               "credit_id": "5875603ac3a3684c0b002073",
               "name": "Michael Gibson",
               "profile_path": null,
               "id": 1404850,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "5875604cc3a3684c09001dfd",
               "name": "Justin M. Lubin",
               "profile_path": null,
               "id": 1387186,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "587560a19251412f3f001e07",
               "name": "Michael Galbraith",
               "profile_path": null,
               "id": 1419268,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "587560bfc3a3684c09001e41",
               "name": "David Emmerichs",
               "profile_path": null,
               "id": 1398970,
               "department": "Camera",
               "job": "Second Unit Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "587560f5c3a3684c180021c9",
               "name": "Robert Settlemire",
               "profile_path": null,
               "id": 1463764,
               "department": "Camera",
               "job": "Underwater Camera"
            },
            {
               "gender": 0,
               "credit_id": "587561099251412f3f001e52",
               "name": "Peter Zuccarini",
               "profile_path": null,
               "id": 71127,
               "department": "Camera",
               "job": "Underwater Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5875612f9251412f360020c5",
               "name": "Byrd Dickens",
               "profile_path": null,
               "id": 1736655,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "58756152c3a3684c1e001e5a",
               "name": "Patrick Krauter",
               "profile_path": null,
               "id": 1736656,
               "department": "Camera",
               "job": "Dolly Grip"
            },
            {
               "gender": 0,
               "credit_id": "58756179c3a3684c12001ffe",
               "name": "Richard Emerson",
               "profile_path": null,
               "id": 1736657,
               "department": "Camera",
               "job": "Key Grip"
            },
            {
               "gender": 0,
               "credit_id": "587561bb9251412f41002118",
               "name": "Samuel Kosub",
               "profile_path": null,
               "id": 1736658,
               "department": "Lighting",
               "job": "Lighting Technician"
            },
            {
               "gender": 0,
               "credit_id": "5875627b9251412f3c0022a5",
               "name": "Robert Lydecker",
               "profile_path": null,
               "id": 1639827,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "587562dbc3a3684c1b0021d4",
               "name": "Brian Tyler",
               "profile_path": "/22QWiNJj03amY6GT1QPUs7dbdcB.jpg",
               "id": 6041,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "587563c19251412f3f001fe1",
               "name": "Vincent Sullivan",
               "profile_path": null,
               "id": 1425969,
               "department": "Costume & Make-Up",
               "job": "Hair Department Head"
            },
            {
               "gender": 0,
               "credit_id": "587563e29251412f44002217",
               "name": "Carol Hartwick",
               "profile_path": null,
               "id": 1425970,
               "department": "Costume & Make-Up",
               "job": "Key Hair Stylist"
            },
            {
               "gender": 0,
               "credit_id": "58756400c3a3682b2b000012",
               "name": "Alastair Muir",
               "profile_path": null,
               "id": 1736659,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "5875641892514179e2000020",
               "name": "Allan A. Apone",
               "profile_path": null,
               "id": 102343,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "58756434c3a3682b22000031",
               "name": "Ashley Rocha",
               "profile_path": null,
               "id": 1736660,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5875644ac3a3682b3300004d",
               "name": "Debra Denson",
               "profile_path": null,
               "id": 1158052,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "58756468c3a3682b0200004d",
               "name": "Roxy D'Alonzo",
               "profile_path": null,
               "id": 1437798,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5875647ec3a3682b2b00007c",
               "name": "Jo-Ann MacNeil",
               "profile_path": null,
               "id": 1364792,
               "department": "Costume & Make-Up",
               "job": "Makeup Designer"
            },
            {
               "gender": 0,
               "credit_id": "587564b1c3a3682b33000087",
               "name": "Steve Newburn",
               "profile_path": null,
               "id": 1736662,
               "department": "Costume & Make-Up",
               "job": "Prosthetic Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "587564eec3a3682b06000085",
               "name": "Sean Sansom",
               "profile_path": null,
               "id": 1701157,
               "department": "Costume & Make-Up",
               "job": "Tattoo Designer"
            },
            {
               "gender": 0,
               "credit_id": "5875fd15c3a3682b10006f9b",
               "name": "Trey Harrell",
               "profile_path": null,
               "id": 1736871,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5875fdabc3a3682b06005a33",
               "name": "Daniel Baker",
               "profile_path": null,
               "id": 1725767,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5875fdc292514179e0006c90",
               "name": "Nick Bernardi",
               "profile_path": null,
               "id": 1649522,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5875fddac3a3682b0a005fe8",
               "name": "Amanda H. Campbell",
               "profile_path": null,
               "id": 1736872,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5875fdf292514179e2006b39",
               "name": "Annelie Dangel",
               "profile_path": null,
               "id": 1736873,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5875fe0992514179f2006bc9",
               "name": "Danielle Davis",
               "profile_path": null,
               "id": 1736875,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5875fe2292514179e2006b5a",
               "name": "Chelsea Mirus",
               "profile_path": null,
               "id": 1736876,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5875fe3992514179e600674e",
               "name": "Sina Sultani",
               "profile_path": null,
               "id": 1736877,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5875fe54c3a3682b0a00601f",
               "name": "Adam Pere",
               "profile_path": null,
               "id": 1590409,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5875fe8192514179e0006d01",
               "name": "Joyce Au",
               "profile_path": null,
               "id": 1709127,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5875feb3c3a3682b06005a8d",
               "name": "Cecilia Marin",
               "profile_path": null,
               "id": 1736878,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5875fecb92514179ec00664b",
               "name": "Thomas Nittmann",
               "profile_path": null,
               "id": 1394750,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5875fee392514179e60067a8",
               "name": "Luke Groves",
               "profile_path": null,
               "id": 1736879,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5875fef992514179f5006873",
               "name": "Ian Cope",
               "profile_path": null,
               "id": 1484198,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5875ff0d92514179e0006d41",
               "name": "Björn Mayer",
               "profile_path": null,
               "id": 1442151,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5875ff2392514179e9006915",
               "name": "Jasen Nannini",
               "profile_path": null,
               "id": 1736880,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5875ff48c3a3682b2b00712c",
               "name": "Eric Robinson",
               "profile_path": null,
               "id": 1736881,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5875ff6092514179e9006931",
               "name": "Loeng Wong-Savun",
               "profile_path": null,
               "id": 1736882,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5875ff7f92514179ef006a6f",
               "name": "Marc Banich",
               "profile_path": null,
               "id": 1736883,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5875ff96c3a3682b06005b00",
               "name": "Peter Chesney",
               "profile_path": null,
               "id": 9621,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5875ffb4c3a3682b0a0060b1",
               "name": "Adam Heinis",
               "profile_path": null,
               "id": 1720806,
               "department": "Crew",
               "job": "Special Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5875ffca92514179e600681d",
               "name": "Laird McMurray",
               "profile_path": null,
               "id": 14923,
               "department": "Crew",
               "job": "Special Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5875ffebc3a3682b2200688f",
               "name": "Lluís Rivera",
               "profile_path": null,
               "id": 1405363,
               "department": "Crew",
               "job": "Special Effects Coordinator"
            },
            {
               "gender": 2,
               "credit_id": "5876007092514179f2006d0d",
               "name": "Daniel Saxlid",
               "profile_path": null,
               "id": 1399862,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 2,
               "credit_id": "58760081c3a3682b02006795",
               "name": "John C. Stuver",
               "profile_path": null,
               "id": 1387183,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "5876009892514179e6006880",
               "name": "John T. Cucci",
               "profile_path": null,
               "id": 1367493,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "587600ac92514179e600688d",
               "name": "Dan O'Connell",
               "profile_path": null,
               "id": 1338372,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 2,
               "credit_id": "587600c3c3a3682b020067b1",
               "name": "D. Chris Smith",
               "profile_path": null,
               "id": 1393857,
               "department": "Sound",
               "job": "Foley Editor"
            },
            {
               "gender": 0,
               "credit_id": "587600efc3a3682b2200690f",
               "name": "Ann Scibelli",
               "profile_path": null,
               "id": 1392083,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "5876010092514179e0006e35",
               "name": "Peter Staubli",
               "profile_path": null,
               "id": 1404217,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "5876011292514179f2006d5b",
               "name": "David Werntz",
               "profile_path": null,
               "id": 1393382,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "5876012892514179e0006e49",
               "name": "Jessie Pariseau",
               "profile_path": null,
               "id": 1435643,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 2,
               "credit_id": "5876013ec3a3682b0a006159",
               "name": "D. Chris Smith",
               "profile_path": null,
               "id": 1393857,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "5876016792514179ec00677d",
               "name": "Ron Bartlett",
               "profile_path": "/AmFG81joHLkvnh4Io20TdCCBk8P.jpg",
               "id": 16177,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "5876019992514179ef006b92",
               "name": "Elizabeth Hitt",
               "profile_path": null,
               "id": 1412721,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "587601b7c3a3682b0200681f",
               "name": "Joe Ken",
               "profile_path": null,
               "id": 1412722,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "587601e292514179e2006d3b",
               "name": "Jennifer Stellema",
               "profile_path": null,
               "id": 1736884,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "592c299e9251413ba006e280",
               "name": "Zack Haskell",
               "profile_path": null,
               "id": 1736654,
               "department": "Camera",
               "job": "Aerial Camera"
            },
            {
               "gender": 2,
               "credit_id": "5a0fb7d3c3a3686286023316",
               "name": "Post Malone",
               "profile_path": "/iEiu7QhZsqXyBctfr2SlpEuqCZi.jpg",
               "id": 1821863,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5aa71cca0e0a263dca014926",
               "name": "Lil Yachty",
               "profile_path": "/roVuFlFUPIljklTMpJcoFiGoIkI.jpg",
               "id": 1997029,
               "department": "Sound",
               "job": "Songs"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 27.868509,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47971,
      "vote_count": 1835,
      "budget": 85000000,
      "overview": "Extreme athlete turned government operative Xander Cage comes out of self-imposed exile, thought to be long dead, and is set on a collision course with deadly alpha warrior Xiang and his team in a race to recover a sinister and seemingly unstoppable weapon known as Pandora's Box. Recruiting an all-new group of thrill-seeking cohorts, Xander finds himself enmeshed in a deadly conspiracy that points to collusion at the highest levels of world governments.",
      "similar": [
         954,
         56288,
         818,
         37834,
         37724,
         36955,
         816,
         302699,
         646,
         681,
         708,
         36669,
         207703,
         27576,
         206647,
         9486,
         857,
         213,
         49517,
         8697
      ],
      "original_title": "xXx: Return of Xander Cage",
      "runtime": 107,
      "poster_path": "/yNsdyNbQqaKN0TQxkHMws2KLTJ6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rox Productions",
            "id": 88943,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": "/pMyhOBd3sCiLzBlmIopdJkcUFtn.png",
            "name": "Revolution Studios",
            "id": 497,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "One Race Films",
            "id": 7154,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Maple Cage Productions",
            "id": 88944,
            "origin_country": ""
         }
      ],
      "release_date": "2017-01-13",
      "vote_average": 5.5,
      "belongs_to_collection": {
         "backdrop_path": "/g9Q2dmbxd1F2hHB5VslPbqGM1JV.jpg",
         "name": "xXx Collection",
         "id": 52785,
         "poster_path": "/omRo1Pw4phlELRgYOQ7RyAlccLt.jpg"
      },
      "tagline": "There are no more patriots, just rebels and tyrants.",
      "adult": false,
      "homepage": "http://returnofxandercage.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["D.J. Caruso"],
      "runtime": 107,
      "synopsis": "The film opens with a satellite falling out of orbit and hurtling toward Earth. In Brazil, Augustus Gibbons (Samuel L. Jackson) is trying to recruit Neymar, Jr. in a restaurant for a position as the next xXx agent. Neymar declines because he doesn't see himself as a hero. Moments later, a thief enters and tries to rob the place with a gun. Neymar grabs a napkin dispenser and kicks it at the guy's head. Gibbons is excited and starts trying to get Neymar in the program, but the satellite crashes down and blows the place up. At the CIA headquarters, Jane Marke (Toni Collette) is telling her colleagues about what caused the satellite to crash: a military device known as Pandora's Box. The people that crashed the satellite can use Pandora's Box to bring any other military satellite down like a warhead. Meanwhile, four people - Xiang (Donnie Yen), Serena (Deepika Padukone), Talon (Tony Jaa), and Hawk (Michael Bisping) - infiltrate the headquarters and start taking out all the agents one by one. Xiang is quick with his hands and feet, and he swipes Pandora's Box from them. The team makes their escape. Marke then tells her superior that Gibbons knew someone who could handle these guys. Xander Cage (Vin Diesel) has been living in the Dominican Republic. He skis from a tower and picks up a skateboard from some people in town before riding his board to fix an electrical issue that allows everyone to view the soccer game. Xander then goes home to his girlfriend Lola (Ariadna Gutierrez), and then leaves her some love-making. Xander goes to Santo Domingo and notices something suspicious. An American man sits next to him on a bench and leaves a bag on the ground. Xander opens it and sees a bomb inside. Immediately, a SWAT team comes in and tells Xander to not move, then to get on his knees. Xander starts being a smartass to annoy the captain. Marke steps out and admits to everything being a ruse, which Xander knew about already. Marke starts trying to get Xander to rejoin the xXx program and mentions that Gibbons is dead. Xander joins Marke in a church as they discuss the situation with Xiang and his team. Xander isn't eager to rejoin the program as he has been enjoying his self-imposed exile, but he mentions someone he knows in London that can help. In London, Xander meets his friend Ainsley (Hermione Corfield), who helps him track down Xiang and his team to a location in the Philippines. He then spends time with Ainsley's girls for some \"undercover work\". As Xiang and his team are hiding out, Serena approaches him about Pandora's Box. She knows that they are being hunted and she wants to destroy the device, but Xiang says they need it for what they want to do. Marke brings on a Special Forces team led by Paul Donovan (Tony Gonzalez) to help Xander. He and Donovan do not get along, and Xander ejects Donovan and his team from the plane while they're attached to a cargo load with a parachute. Xander says he doesn't want these guys watching his back, so he picks a few people who he does trust. We first meet Adele Wolff (Ruby Rose) as she appears to be hunting a lion. In reality, she is stalking out a trio of hunters set to harm the lion, but Adele shoots the three of them in the leg and leaves them to be chased by the lion. Xander calls her first. Next is Tennyson Torch (Rory McCann), a mad driver with a record 198 crashes to his name. Finally is Nicks (Kris Wu), a DJ that serves as a great distraction. The three are brought in to meet with Xander and Marke to go over the mission. They aren't interested at first, but eventually decide to join. The team meets Becky Clearidge (Nina Dobrev), a hyper tech specialist that gives the team some fresh gear like bionic gloves. The team arrives in the Philippines to a hideout run by a man named Lazarus (Nicky Jam). Xander gives him 22.5% of their ammunition in order to gain entrance to the place. It looks like a nightclub with people dancing and playing music. Xander approaches Serena as Nicks plays DJ to distract Talon from following Xander. After some \"foreplay\", Xander meets Xiang. The three of them sit down as Adele is up in a tree with her rifle waiting for a chance to make her move. Xiang takes out some grenades in a game of Hot Potato to see how quick Xander is. Xander learns that Xiang and his team are xXx agents with their own agenda. Moments later, a team of Russian soldiers storms the place. Xander and Xiang's teams spring into action. Adele shoots the goons and then follows the others as Xiang and his team get away. Later on, Xander chases after Xiang on motorcycles that are equipped to surf on water. They ride through the waves as Xander tries to take Pandora's Box. He succeeds, but when he gets back to shore, Serena shoots and destroys it, then decides to join the xXx team. Marke informs the team that Pandora's Box was used to destroy a Russian stadium. The one Xander took was just a prototype. The team realizes that someone in the CIA was in on the plot to help Xiang. They review footage of when Xiang broke into the headquarters, and Xander sees that Director Anderson (Al Sapienza) was the only person not to flinch when Xiang arrived. The team tracks down Xiang and his team. Xander chases Xiang on the streets while Tennyson brings Adele, Nicks, and Serena to chase after Hawk, which leads to them crashing vans (which sets Tennyson's record to 200 crashes). Xander and Xiang fight one-on-one before Xander continues chasing Xiang to a warehouse. They end up helping each other avoid the gunmen before they reach Anderson. Adele is in a building across the street trying to get a shot on Anderson, but can't see with the thermal reading because the heat is cranked up. Anderson admits he crashed the satellite that killed Gibbons. Xander stands by the window and tells Adele to \"read between the lines\". He holds up his fingers and makes an opening for Adele to shoot Anderson in the head. Marke and her men recover Pandora's Box and they apprehend Xiang. As they are leaving on the jet, Marke gets a phone call and says to Xander that the xXx program has been shuttered, so the agents must be eliminated. She reveals her true intentions and shoots Xander three times. She then sends for an extraction team to get Xander and Xiang's teammates, but they quickly discover the team are a bunch of hitmen sent to kill them. Both teams join forces to fight back. Adele and Serena shoot at the villains, and even Becky gets in on the shooting (albeit a bit clumsy). They are then joined by Darius Stone (Ice Cube), the last xXx agent recruited by Gibbons back in 2005. He comes in with a grenade launcher and blows up the villains. On the plane, Xander recovers thanks to some armor. He and Xiang team up to fight Donovan and his goons. Donovan breaks out the bionic gloves and starts punching all the equipment on the plane as Xander dodges the punches. They fight in the bathroom, and Donovan punches the toilet, causing him to burst a hole in the plane that Xander pushes him out of. Marke uses Pandora's Box to send a satellite to the safe house to kill the teams. She shoots Xiang but he notices her foot is stuck on a strap. He pulls a parachute open and sends Marke falling out of the plane. Xiang falls out with his own chute. Serena calls Xander to inform him that the satellite is headed their way. Xander flies the plane in the direction of the satellite kamikaze-style. He runs and jumps out of the plane before it collides with the satellite. He lands safely using a cargo load. Once at the bottom, he stomps on Pandora's Box, destroying it for good. Xander and Serena kiss, and then Darius pulls up in Xander's old car. The two xXX men meet for the first time. The now larger team attends Gibbons' funeral. Xander is up at the top when he is visited by none other than Gibbons himself. He faked his death once again and is keeping a low profile. Gibbons is also glad that Xander is back in action. He tells Xander all he has to do is \"kick some ass, get the girl, and try to look dope\". Gibbons leaves with Neymar while Xander continues to watch the service.",
      "writers": [
         "Rich Wilkes",
         "F. Scott Frazier"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1293847/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMzcwMjkxMzQ3NV5BMl5BanBnXkFtZTgwMzgyNDA5MDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Vin Diesel",
         "Donnie Yen",
         "Deepika Padukone"
      ],
      "reviews": [
         "Sometimes an hour and 40 minutes of non-stop action is not as much fun as it sounds like. On the other hand, films are supposed to entertain and there is more entertainment here than meets the eye. This reviewer's scorecard, humbly submitted: CONS: * Toni Collette completes her mission to distance herself as far as humanly possible from Muriels Wedding 1994. Wish she hadn't even tried. * I thought these sort of goofy semi-spoof spy films (where even the writers are not 100% sure whether to play it straight or for laughs) ended with OUR MAN FLINT in 1966. Oops. I was wrong. * writing, editing, directing all could have been turned up a notch. Looks like a big rush to get it out there so it could start spinning off cash. PROS: * Sam Jackson, an actor who film historians of the future will designate the \"most overexposed\" actor of our generation, gets only a walkon and then is blown up. Finally someone got the memo! * stars Vin Diesel, one of the most reliable action figures of our era. This is not in the class of Riddick or Pitch Black, but Vin commits to every role and does not hold back. * some really nice stunts. You will think of them fondly when you leave the theatre. * introduces Canadian Nina Dobrev to a wider audience. The line to join the fan club starts at the back of the room. And when membership closes, we can start a brand new one for Deepika Padukone. * any movie -- repeat, ANY -- that advances Donnie Yen's English language career is a plus. And worthy of our support. (Donnie's English is way better than Jet Li's was, and I wish him many more western roles.) * the final action sequence, the climax, runs about 20 minutes and is sort of engaging. BOTTOM LINE: Not as bad as the reviews suggest. Not in line for an Oscar either.",
         "I'm not quite sure why Xander Cage returned, I just wish he hadn't. This movie is so low brow, you might mistake it for a caterpillar. It's devoid of anything that looks like a plot or decent character development. Instead its cheesy show off time with lots of tat's, juvenile bravado, sparkly overstated jewelry and guns from \"da hood\". This is a film that feels, in my opinion, like it was made by a 15 year old nick-named \"flipper\" (as in hamburger flipper) and his gormless, pimply friends. We all know thats not true but you get the idea. In short a genuinely excruciating experience that puts the S in Stupid.....one out of ten from me.",
         "Been cursing myself to have watched such mindless video game movie. Deepika Padukone is completely misfit and she looks awkward for most of the screen time. Vin Diesel should stick to Fast and Furious franchise, 2002 XXX was much better. Rest of the star cast is assembled to just please the producers \"Shanghai Movies\". There is no story, no screenplay, improper acting, it seems like director has wasted his most of the time in VFX labs than on actual story and screenplay. Disgraceful start to 2017, if you want to watch mindless graphical action, better play video game. Disappointed to the core, save your time, money and if you still want to see then be ready to curse yourself...backed by big production house, critics and fake reviews will start floating soon appreciating the movie, beware.",
         "There is no story build up in this movie - and the action scenes are unbelievable ~ aka too many bulls#it and impossible unrealistic sequence. The \"glorification of Xander Cage\" is way too arrogant to a point that your passion and interest for the character simply fades away. After the movie, I have less respect for the character that Vin Diesel plays. If you are the type that likes to watch the action sequences; you might enjoy this.",
         "How do you make a hit film? It's simple. Cast some of the biggest stars in the industry and you are halfway through, add a lot of mindless action, do some promotional stunts (like Vin wearing a Lungi and dancing on a Hindi song) and you are done. Audiences are bound to go crazy. I have never been a fan of any of the XXX films but this one I watched for Deepika. But Oh My God, what was I thinking? This film is awful beyond measure. There is nothing to watch. I mean it's the same thing you must have seen at least a hundred times by now. Same clichéd story, same mindless action sequences and people reading their lines like they are mannequins who have been brought to life my some magic. Even the origami did a way better job in Kubo and the two strings and they are made out of paper, mind you. People are saying Deepika was good and I completely disagree. I can say that she did a good job with action sequences but her acting was pathetic. In fact there were only one or two people who actually tried to act. So, don't waste your money on this awful experience. If you are watching it for Deepika then drop your plans. The screen time she gets is longer than I anticipated but nothing good comes out of it. It is another of those meaningless action films that you forget the moment you walk out of the Cinema. There are better movies playing in theaters that deserve your money instead of this crap. Do something meaningful with your money.",
         "With foreign investments, it did not indicate that the production house had to add in so many unnecessary foreign elements into the movie. Is it even necessary to start off the story in a Chinese restaurant? Where was the link? Foreign elements should be added if they were needed to tell the story and not simply just to please the foreign investors. They only make the story weaker. The story line of the movie was ridiculously unbelievable, and the screenplay was absolutely disappointing. The lines were so pale and redundant. It lacked what a big blockbuster movie should have. No explanation was given for many scenes, and it became very puzzling and exaggerating. This was not a small budget movie, but it turned out to be one brainless movie.",
         "This movie was awful and a massive waste of time. Physics is apparently non existent. The NSA guards are worse than storm-troopers at shooting. A huge cast but no character development at all and you get no idea of their names as well. The plot makes no sense at all. The acting is all over the place as well. Flying planes, flying cars, flying people and even a goddamn flying boat. Then there are people who definitely should have been killed but still they stay alive and then there are people who died and I don't know how. Overall, one word that perfectly describes this movie is 'pretentious'. It tries to define what's cool and what's not but fails miserably. I wanted to write a sarcastic post about this one, but this stupid movie doesn't deserve that. I hope everyone sues the crap out of the producers for creating such a godawful movie.",
         "I cannot believe I actually paid to watch this utter tripe. It is possibly the worst film I have ever seen in my life. If you've any sense do not waste your money like I did. Some of the scenes are just ridiculous. Donne Yen must have been totally desperate for the money considering some of the great films he has made in the past. The female characters are as you would expect very attractive but do not make up for the awfulness of this film. Vin must be sat at home thinking OMG why on earth did I actually make that film as he probably doesn't need the money. The only good part of the film was near the end. The best part of the film was when it had finished and I could get out of the cinema. Honestly I repeat DO NOT WASTE YOUR MONEY.",
         "This is by far the worst movie of 2017 so far.Nothing in this movie makes any sense.No spoilers,but the first scene and the last scene infuriated me. The only remotely entertaining thing in this movie was if you saw it in IMAX.Otherwise,this movie is a mess and I hated every second of this movie.You might be saying that I just hate silly fun guilty pleasures and I'm not fun.Actually,I love those kinds of movies. This just wasn't one of them.",
         "I watched the other XXX films and really enjoyed them. Yes you know its going to be a 'daft' movie and not something to take seriously.. a bit of fun. Something to turn your brain off to watch. With this movie you would need to remove your brain to watch. Its just to stupid for words. I have not seen this silly kind of kung-fu action in ages and its so dated now. Its something you would have watched back in the 80's and even then it was laughable. We all know these action figures do the impossible and survive but these people can put super heroes to shame just like in the latest fast and the furious its gone to far and we now have superheros instead of just heroes. I think if this trend continues instead of Tom Cruise dangling from ropes in mission impossible he could just hover there instead. Also what is with all the scantly dresses women all over the place and some parts I thought I was watching some soft porn movie rather than an action movie. I am a red blooded male and love women as much as any man but come on do we need it rammed down our throats all the time its cheesy, sleazy and not needed and getting very boring. I could only think Vin Diesel who I enjoy watching in movies such as the first fast and furious movies (before they got silly) and stuff live pitch black has got desperate for some money to be in this.",
         "I and two friends of mine spent a lot of money between us to watch this movie today on the day of its release. Apart from wanting to watch Deepika, I had enjoyed the original XXX movie (this one is a sequel), plus I am a huge fan of Vin Diesel. However I came out of the theatre in a state of total shock! In my life I have watched thousands of movies, be it from Hollywood or Bollywood or from other parts of the country and the world. But today, and I am putting this down in writing, I got to see the worst movie of my entire life so far!! Yes really, I know what I am saying! So please please please ... try not to watch this movie ... it is so bad that it will make you want to cry. Or it will actually put you to sleep, like with the guy behind us in the theatre who was actually snoring within the first half hour itself! The movie has no story. It is not exciting as action films are meant to be, because the action itself is very cartoonish and very boring. It does not even have a proper climax, because it doesn't actually have a real villain who can pose a bit of a challenge to the hero! Yes it has several stunts, but you get to see most of them in the various trailers of this movie on YouTube. Let me put it another way: the best action scenes in this film are very very bad copies of scenes from the Matrix movies, and the two James Bond movies GoldenEye and Die Another Day. Plus the direction too is horrible, which results in many dialogues not being properly audible, poorly lit scenes, extremely erratic editing, poor acting ... or no acting, cos a lot of guys simply standing around doing nothing is not really acting ... this list is endless! Last but not the least: Deepika Padukone! Though I have always liked her until now, I still say it is not worth spending money to go and see her in this movie. Firstly her English sounds terrible over here. I have earlier heard Deepika speak English on TV and she sounds smart enough. So why is she speaking with a distinct South Indian accent in this movie ... when her name here is Serena Unger and not Meenamma from Chennai Express ... I mean could she not point out to the director that it would sound ridiculously out of place? Also her role is pretty small and her character is poorly etched out ... and so she doesn't really get a chance to act. And as for her looks in this movie, well, she easily looks much more prettier or glamorous in most of the Hindi films that she has starred in. So is this a movie review? Naw, it is more of a warning! Because XXX: Return of Xander Cage is so bad that it is not even a time pass movie. I score it a 1 ... out of 1000!",
         "Never mind the horrible acting and gratuitous gushing about how hot Vin Diesel is (at age 50 with sagging arms.. or whatever), how all the girls want to have sex with him and he's happy to oblige because he's Xander Cage who wears a fur coat in the summertime, the plot of this movie is about a device that can decode anything (seems to be a frequent theme these days, this has to be the 4th or 5th movie I've seen that has a device that decodes anything) and it's being used to crash satellites into the Earth with pinpoint accuracy. Now I don't work at NASA or Space-X and I don't have a degree in aerospace engineering, but I am pretty sure you cannot guide a satellite through re-entry to a pinpoint location on the Earth. Even if you could, it's not like it would be a hydrogen bomb like this movie portrays. It would disintegrate and land all over the map in pieces. But no, it gets sent to earth like it's being fired from a rail gun. The orbital decay would take forever even with assistance. Then you have the stunt where Xander has jumped, sans parachute (because parachutes are for wimps) from a plane that he was able to get positive thrust to weight ratio on (basically a C5 sized plane full of cargo and electronics) to accurately intercept a falling satellite and yet was still able to run out of the plane somehow and freefall, and somehow catch up with a cargo container of which had a fouled chute. He freed the chute just seconds before it hit the ground, and it created an explosion, yet out he walks like a boss. Then of course Ice Cube has pinpoint accuracy with a grenade launcher with grenades that have a very small blast radius. Rewind back to the highway battle where Donnie and Xander are fighting and suddenly the guy who jumped 200 meters (distance between buildings IRL)through a glass ceiling, and took out a room full of spec ops guys with ease, has trouble fighting an old broken down Xander Cage. This is the same Donnie Yen who couldn't be shot by a dozen security specialists in a small room but could be shot by one old woman who he knew full well was pointing a gun at him. The bad guy... wait, what? Who was he? Did it matter? The beach/island where the super duper secret assassins go seems to be in South Beach Miami, all the bars and live music and such.. and so hard for them to find. What was the crazy guy's role, to crash a car? Really? I almost vomited in my mouth when Vin kissed the Indian girl. He's like old enough to be her grandpa. So now you can drop a fully automatic weapon and it just discharges a full magazine and doesn't even spin around? So you can rip out a high voltage electrical conduit and plug it into a device to power it up, like it's a USB phone charger? So motorcycle tires have enough tread to act as propellers? Wouldn't it have been easier to just have wet bikes? So a motorcycle with a combustion engine and normal intake can run underwater? So a group of Delta Force soldiers can be hooked up to a cargo block without any of them knowing it, while Xander is walking around them? So you can jump from 100+ feet to the ground and as long as you have skis you'll be OK? So 3rd world countries have skateboards that use bearings that can survive 50mph rides down winding paved roads? So they have an airplane that can circle the globe x number of times without needing to refuel but they land it every few minutes? So somehow a mechanical device that attaches to your forearm increases the strength in your upper arm and chest to create stronger punches? So a 90lb woman can scale a tree with a 20lb sniper rifle and hold it steady with her off hand for 30 minutes while using the scope to watch the crowd, as she's hanging by sheets from the tree? What was up with DJ guy? Oh look, a talented night club DJ who people just like, he'll be an asset. Movie sucked, really really really hard. I think they knew it, and laughed after they made it wonder who was stupid enough to watch it. This guy..",
         "Has it really been 15 years since we last saw Vin Diesel as Xander Cage, jumping off mountains and beating up the bad guys across the globe? Why yes it has. Only a few years later, we got a 'xXx' sequel with Ice Cube in the spotlight, rather than Vin Diesel. It was stated in the sequel that Vin Diesel's character was killed off, leaving Ice Cube to pick up the pieces and become the action star in the early 2000s. Now, it's 2017 and Vin Diesel makes $1 billion dollar 'Fast and Furious' movies, so Hollywood finally gave the greenlight to another 'xXx' film that has Diesel returning as Xander Cage, despite the fact that he's already dead. These things don't matter with this third installment, titled 'xXx: Return of Xander Cage'. Directed by D.J. Caruso ('Disturbia', 'Eagle Eye'), this third sequel takes its cues from the over-the-top action moves of the late 80s and nineties and never looks back. None of the film makes any sense, but then again it's not supposed to. This is a very dumb film, yet it's highly entertaining and very fun from start to finish. Luckily, the film knows exactly what it is and even pokes fun at itself, which makes 'Return of Xander Cage' very tolerable and will even have you laughing out loud throughout. Yes, Xander Cage is very much alive and jumping off towers with no parachutes and skiing down rocky mountains with ease. He is brought in by the CIA to track down a device called 'Pandora's Box' that can spy on anyone at anytime, and even bring down space satellites like missiles and kill people. Xander teams up with a group of other xXx's and come across yet another group of xXx's, including Donnie Yen (I'm one with the force, the force is with me) and Thai master Tony Jaa, who might as well be Michael Jackson in this role. Every other character has there special trait and skill, including being a deejay, crashing vehicles and telling social media about it, and even a tech guru who makes Lincoln jokes and has a safe word. It's all silly, dumb, and so much fun. Luckily, the film never slows down or tries to be serious at any point in time. Every action beat and fight scene would have any superhero die a horrible death in an instant, but this is 'xXx' with Vin Diesel, and nobody dies, let alone get a scratch on their face, even when there is a fist fight in the middle of a highway with tons of on coming traffic. There are for sure some funny performances, but I want to talk about Vin Diesel. I don't understand how this guy gets work. He is literally the worst actor in the world. He is good as a voice actor who can say a few lines, but good God. It's literally painful to watch him on screen, and every time he's on screen here (mind you, he's shirtless most of the time), he is just wretched and awkward. I don't get it. Every time he's on screen, you just wish one of the other characters had screen time instead. Other than that, this film is quite fun, action-packed and ridiculous, which in this day and age, it's good sometimes to turn off your brain and enjoy the grand spectacle. Will there be more 'xXx' films in the future? It looks like it and that's not a bad thing. RECOMMENDED!",
         "The score on IMDb is ridiculously inaccurate. This is not a metaphysical interpretation of life in a drama. This is XXX. This is Xander Cage at his best! The action is well shot and over the top as expected. The jokes are cheesy and perfectly timed. Minor spoilers, there are some cameos and they nailed them! The support cast in a movie like this sometimes ends up being annoying or getting in the way. Not so in this one. Every character is unique, fun, has the right amount of screen-time, and does not annoy. There is no drama or tension, nor does there need to be. This is not meant to be \"The Departed.\" This is a super fun action flick where you can just smile and watch Vin Diesel nail another awesome flick out of the park. Some people complained about the new cast feeling out of place. Not so, they did an amazing job. I feel this movie revived the XXX franchise and am already hungry for another one! Again!",
         "This movie was pretty awful on so many levels. First, Diesel seems to sleep walk through his lines and scenes. The slight tilt of the head and cute smirk got old after the first 5 minutes. Donnie Yen's fight scenes were really good, and that's about the best this film brings. The writing was atrocious. The snarky, too-cute and cliché lines at every turn. I didn't know if I was watching a movie or reading the one-liner comebacks from a comedy show. It's too bad because this movie had a good cast. Toni Colette needs to stick to heavier roles; she looked out of place in this role. And more Samuel Jackson. I've been hoping for better films to come out of the new China-owned studios, but so many have disappointed lately. Maybe Jet Li could have saved this film, I'm not sure.",
         "Physics be damned. Vin Diesel proves that natural science has no hold over Xander Cage (Vin Diesel), an NSA agent who was previously thought to be dead but is found and brought back out of hiding in order to save the world from falling satellites. Someone within the NSA stole a device known as Pandora's Box that controls every satellite orbiting Earth and uses it to cause them to fall one by one to Earth. The government is obviously freaking out about it. Xiang, played by Donnie Yen, and his gorgeous partner Serena, played by Deepika Padukone, are out to stop it from falling in government hands. Xander is caught between the NSA and the blacklisted agents and must choose who he trusts if he's going to obtain Pandora's Box before all the satellites are destroyed. The plot wasn't bad. It was actually very entertaining. One thing I loved about the film was that governmental wasteful spending was poked fun at numerous times. Jane, played by Toni Collette, was the agent that recruited Xander. At one point, Xander scoffs at the technology and says to Jane, \"No wonder America's in debt trillions of dollars. Do you really need all the gadgets to catch this guy?\" Jane replies by saying, \"Oh, we don't need them. But it makes the catching more fun.\" I wonder just how true that statement is. The acting was much better than the previous films, however, there's still room for improvement. Donnie Yen was by far my favorite out of all of them. His martial arts were astounding. I'd love to see him face off with Jackie Chan sometime. The next best was Ruby Rose, who played super sniper Adele Wolff. She loved, lived, and breathed weaponry. Ruby was insanely badass and I can't wait to see her in her next two action films this year (Resident Evil: The Final Chapter and John Wick: Chapter 2). Last, but certainly not least, there's the bubbly and funny Nina Dobrev who took a complete 180 degree turn from her more serious role in The Vampire Diaries. She was an absolute delight and I look forward to seeing what she does next. Overall, I was more than impressed with the film. It wasn't perfect but at least it had a coherent plot unlike the other two. The action was impressive. There were some stunts that I had never seen before. There were times when you couldn't tell what was CGI and what was real which just added to the intensity and fun. The film gets a 3.5 out of 4.",
         "I was visiting Mumbai and had time to kill so stumbled upon this on.I have seen the reviews and so went in the theater with little expectation.But I was not disappoint at all.First I ll tell you what this movie is not about.This movie is not for people expecting an intelligent plot or having loads of 007 type cool gadgets.This movie is fun and refreshing.Lots of cool and catchy dialogues.good action.Acting is good overall. Deepika is adorable,Vin diesel is as always smooth and kicking . Humour is in plenty. I don't understand why all the average reviews.Probably because people these days expect every to have a Nolan type of fell to it. This movie is fun and you will find your sell happily spending the two or so hours.Go for it.",
         "DISCLAIMER: I haven't seen the first movie, but did watch the second movie. Who doesn't love the VIN-TASTIC Vin Diesel. From Fast and Furious, to Riddick, Vin Diesel became a household name for action movies in these recent years. Most of Vin Diesel's movies are great, and this was no exception. The plot follows Xander Cage, long thought to be dead, was brought back in action as he and his group tries to retrieve the Pandora's Box, a dangerous device that can take down any satellites in the world. From the very first scene, you know this would be a wild adventure filled with insane action and one liners. The characters are great and all were memorable. Vin Diesel is back as the great Xander Cage, and basically he's good at everything. Donnie Yen is also great as Xiang. Deepika Padukone, the currently number one actress in India is also memorable as the female lead. Others such as Ruby Rose, Kris Wu (Yes, it's former member of EXO, Kris!),Tony Jaa (It's a surprise, I don't know he's also in this movie!), Nina Dobrev, and many others are also memorable. Although appearing for a short time, Hermione Corfield, the 90th Most Beautiful Face in 2016 (If you know TC Candler's list, then you know what I'm talking about) makes a well done performance as well. Sam L. Jackson, as always gave a great performance though I want to see more of him. Also, a shout-out for one great cameo from Neymar Jr. himself. Ice Cube also makes a surprise appearance as Darius Stone, the Triple X from xXx: The Next Level/State of the Union, making the second movie not so neglected. The action is some of the most insane stunts I've seen. There was also a few funny bits in the movie, making the movie not so serious. Even with an all star cast, a great load of action, and a few good jokes, there were some issues. One, the first part of the movie has some uncomfortable scene, which, as the name implies, makes me uncomfortable. Two, There were some plot holes in the movie, like: *SPOILER ALERT* HOW THE HECK SAM L. JACKSON AND NEYMAR STILL ALIVE AFTER BEING HIT BY A FALLING SATELLITE + EXPLOSION?!. *END OF SPOILER* Three, some of the CGI's are clearly noticeable. And four, is the writers running out of ideas? I mean it's okay having this movie a few twists and turns, but *SPOILER ALERT* making the government a bad guy is an idea gone old. The last stunt is clearly a rip-off from Uncharted 3 (DISCLAIMER: I don't play any of the Uncharted main series, I know it because I see the playthroughs). And making Sam L. Jackson fake his own death? Again? He's done it already in Captain America: The Winter Soldier, why he had to do it again? *END OF SPOILER* Even with all the issues in the movie, the good has overcome the bad. Overall, this is the movie perfect for action movie lovers, absolutely Vin-tastic, and definitely enjoyable.",
         "I do not know why everyone hates this movie. No one goes to see Vin Diesel and thinks, \"Citizen Kane caliber performance coming up.\" This is a great Saturday afternoon action film. There is not too much CGI and no stupid comic book characters. This is not Sicario, but it's not Transformers either. I have seen much worse. They say, \"January is where movies go to die.\" The distributors of this movie knew it had enough strength to survive. Do not listen to the Hatters. Donny Yen is great, Tony Jaa's part is too small, but good. Deepika and Ruby look delicious, and Vin looks real good for being nearly 50! Give XXX a shot, you will have fun.",
         "To be honest, my expectations was really low entering the cinema because of some of the reviews I read here. Only to realize many bad reviews where fake..what they said did not even happen in the movie, many Vin Diesel haters putting 1 star ratings to drag the scores down. I will keep this spoiler free. The movie is action-packed from start to end, an incredible action scene happens within the first 10 minutes. The dialogues was also really funny, and my whole cinema roared with laughter several times. It is definitely a good popcorn entertainment, just like the Fast & Furious series. Donnie Yen stole the movie with his role, his screen presence is extraordinary, and audience cannot wait for the next scene with him. His acting is on point, his action scenes are so fast....that it is as fast as 8 years ago when he was in Ip Man/Flashpoint/SPL. It doesn't take much time before you start cheering for the villain - which is him. Deepika's accent was a little out of place, but her performance was okay. Of all the female characters, Nina Dobrev & Ruby Rose performed the best, and overshadowed Deepika. Just like how Donnie Yen overshadows Vin Diesel every time both of them were on screen together. Overall a good movie, with interesting dynamics and a story-line that does not have much flaw. It is better than the Expendables in my opinion. My only regret? I did not watch it in IMAX 3D so probably going to re-watch it.",
         "As the name indicates, a successor of original XXX. Movie is fine; action stunts, plots, all watchable and enjoyable for once. Only thing that irritates is Deepika Padukone's dialogue delivery. Every time her role comes up, it's like she's narrating a story like a granny. If filming an Indian actress was the only demand then Priyanka Chopra would've been much better.",
         "just out of cinema, such a waste of time and money. there is literally nothing right in this movie. all casts are acting the worst, no connection, no action, extremely over exaggerated. most characters tried to be funny but they really acted bad, although they are good actors, specially Donnie yen and Tony Jaa. fan of xxx series will definitely get disappointed, it is not even one/tenth as good as previous ones. I do not recommend it to anyone. I think they put so many famous movie stars for the cash only. don't waste your money, more importantly your time on this one.",
         "About time someone has made Triple xXx Sequel it's ABOUT TIME IN 15 YEARS between sequel everyone bashed xXx State of Union (2005)13 years ago Ice cube witch i liked still because i am fan of ice cube but i can handle it well but this movie 2017 i would say it's a lot better then second xXx State of Union. it's so good to have Vin diesel back in sequel besides doing Fast and furious franchise & Riddick Franchise because they were always wanna to do xXx sequel to bring back Vin diesel it's great lucky it was wasn't replacement and Vin Diesel is back come on i thought this was expected for fans ? that's why everyone hated second movie. i was always waiting for sequel to come for longtime now it's about time. the only thing i would be surprised about Jet Li was going to cast as Donnie Yen character Xiang it would be great but Jet Li dropped out who knows anyway here's Donnie yen still great to see him back in Hollywood movie but i wanna see his own Hollywood movie always. the cast is so great but expect i don't like actress Toni Collette why ?? she is most terrible actress in planet makes me so bored on screen but thank god she is not in movie she is only in it for 5 or 10 minutes in movie that's it she is not part of it at all. The actors were more part of it witch is great like everyone knows Vin Diesel is in all movie as always skateboard, motorbikes everything you name it !! and new cast is good expect for Toni Collette similar thing in movie they Graphic credits like suicide squad or any movie when they introduce the characters. Xiang (Donnie Yen) and his team Talon, Serena Unger, Hawk Were breaking into CIA Building to steal \"Pandora's Box\" has been stolen Jane Marke wants Xander Cage (Vin Diesel)to get him involved they can't catch these guys because they are like ghosts so the are going to get similar case Xander cage is hiding in some Location in Spain doing Crazy Stunts with ice skating when there's is no snow but anyway it's he doing that in bushes and woods going down their then he gets the skateboard rides all the way down see a lot cool stunts to it a lot cool things still everything is talks about first movie when he defeated Anarchy 99 but the thing they don't talk about character Yelena at all like Xander Cage left her in Bora Bora ??? it didn't explain about her character at all. so anyway i am not going to explain anything about Samuel L Jackson character because i never want spoil the movie for people to read review just please go watch movie then you know what i mean. how Xander survived ??? SPOILER never wanted to write it. so anyway Jane wants Xander to have team i am like ?? why does he need a team ?? it's fast and furious 5 ?? Come on Xander cage works alone i love his new attitude's that's the only thing i can deal the problems in this movie but the thing is he doesn't need a team to work on mission in first movie. the team Adele Wolff, Nicks, Tennyson Torch ? come on why can't they hire better actors to be his team ?? these is eh they aren't action stars i expect like Cast UFC Fighters expect you have Hawk (Michael Bisping)Ice Cube is cameo in movie he is not in it as much he is in it in almost of end of movie witch is GREAT to have him back. the action scenes were so good i loved action scenes so much little bit of shaky cameras not much witch is good buy hey the story and action is a lot better then Stupid and clumsy remake point break (2015) unless this has a lot better and different and cgi is a lot better and first movie had great cgi there is a lot great fight scenes in martial arts Donnie yen is acting more speaking English is a lot of proofing and Tony Jaa is usually he is more in it then fast 7 i would say he's character is a lot more better then fast 7 because he didn't do much in it. but in this yeah there is a lot of great fight scenes with stunt doubles for Tony Jaa crazy stunts. Deepika Padukone is OK she is not annoying at all but she is OK not fan noting much to say about her so as ruby rose playing sniper girl i would say she a lot better then Toni Collette. (Nina Dobrev) Becky play's the character like Michael Roof may rest in peace that's why he is not back she play's annoying well not annoying like you wanna punch her in face like Michael Roof Character Toby Lee Shavers but she is female version of that character giving all guns and spy equipment staff you have pretty cool staff in film. a lot of enjoyable fun action scenes in film unrealistic scenes like fast and furious franchise a lot that. the story is just simple and it's great movie great to have it back but don't worry about the haters they are so wrong for hating this movie ?? it's still great you have most of events from first movie noting wrong with this movie just has all action for action fans people just don't understand who knows what they want in their opinion for movie believe go and see it if you seen First 2 Triple X movies then see this. it's so good can't wait for Xander cage and Darius Stone teaming up together.",
         "I rate a movie based on how much I enjoyed it while watching it. Let me tell you, there is not a dull moment in this film. Do not pay attention to people who suggest there is no story or overuse of VFX... It is an all out action movie, it requires very little \"Story\", remember John Wick? Deepika Padukone makes her debut in Hollywood. A well known actress in India. She makes no effort in faking an American accent. She plays her character with conviction and originality. The rest of the stars fit perfectly in their respective roles. Vin owns his character as\"XxX\" the action sequence for Donnie are AWESOME. Tony Jaa is hilarious haha. Shoutout to Nina Dobrev for being the cutest character and the funniest at the same time. So, go out watch the film and enjoy.",
         "I admit, I am a movie aficionado. I watch at-least 1 movie every weekend in the theaters. I have generously contributed to the well being of the industry regardless of how taxing it has been on my yearly budget. But I have never regretted spending my money until now. Hands down, this is the most worthless movie I have watched in the last decade and I want my money back. To stoop this low in terms of a story-line. Sorry, my mistake, there is no story. I have seen school plays better written than this movie. Make no mistake, this entire ensemble has been cast to just mint money. The dismal acting by some very bright stars of the movie industry makes you wonder as to why they would agree to a movie like this. The movie starts with an attempt at Neymar Jr. being recruited into the XXX program by Samuel L Jackson eating noodles for breakfast, then he is supposedly killed by a falling satellite. A gang of assumed super villains (which includes Deepika Padukone) then steal a box that can control satellites and crash them into the earth like kamikaze bombs only to find out, its not the actual box! Omg, surprise! Need I say more? Do you see where this stupid plot is going? My question to DJ Caruso. WHY? JUST WHY? #Pathetic"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Thriller"
      ],
      "productionCompanies": [
         "Huahua Media",
         "Maple Cage Productions",
         "One Race Films"
      ],
      "summaries": [
         "Extreme athlete turned government operative Xander Cage (Vin Diesel) comes out of self-imposed exile, thought to be long dead, and is set on a collision course with deadly alpha warrior Xiang (Donnie Yen) and his team in a race to recover a sinister and seemingly unstoppable weapon known as Pandora's Box. Recruiting an all-new group of thrill-seeking cohorts, Xander finds himself enmeshed in a deadly conspiracy that points to collusion at the highest levels of world governments.",
         "Xander Cage is left for dead after an incident, though he secretly returns to action for a new, tough assignment with his handler Augustus Gibbons."
      ],
      "budget": 85000000
   },
   "movielensId": 167738,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2017-01-13",
      "dvdReleaseDate": null,
      "directors": ["D.J. Caruso"],
      "runtime": 107,
      "movieId": 167738,
      "title": "xXx: Return of Xander Cage",
      "mpaa": "PG-13",
      "actors": [
         "Vin Diesel",
         "Ice Cube",
         "Samuel L. Jackson",
         "Toni Collette",
         "Ruby Rose",
         "Deepika Padukone",
         "Kris Wu",
         "Donnie Yen",
         "Tony Jaa",
         "Nina Dobrev",
         "Rory McCann",
         "Hermione Corfield",
         "Tony Gonzalez",
         "Michael Bisping",
         "Ariadna Gutiérrez",
         "Andrey Ivchenko",
         "Shawn Roberts",
         "Nicky Jam",
         "Al Sapienza",
         "Helena-Alexis Seymour",
         "Megan Soo",
         "Kristen Kurnik",
         "Bailey Rose King",
         "Pilar Cruz",
         "Charles Carroll",
         "Héctor Aníbal",
         "Curtis Fletcher",
         "Terry Chen",
         "Jenny Itwaru",
         "Julie Abcede",
         "Josh Pagcaliwangan",
         "Nyjah Huston",
         "Neymar Jr",
         "Roberta Mancino",
         "Nina Buitrago",
         "Dani Lightningbolt",
         "Courtney Friel"
      ],
      "imdbMovieId": "1293847",
      "originalTitle": "xXx: Return of Xander Cage",
      "genres": [
         "Action",
         "Adventure",
         "Crime"
      ],
      "youtubeTrailerIds": [
         "mspnr56tnLA",
         "-ziu6JzJTZ0",
         "SnAWEDD021E",
         "HPlgYeR-f1E",
         "UO4p2c8lUWM",
         "GyQmD1OUZOQ",
         "tCdva4euVF0",
         "pzjxm80GSLM",
         "iygwVL4TxXE",
         "ZHbx90e6WzI",
         "qq1SbW08WE8",
         "5osHMtXbghQ",
         "WA3tXhKsa6w"
      ],
      "plotSummary": "Extreme athlete turned government operative Xander Cage comes out of self-imposed exile, thought to be long dead, and is set on a collision course with deadly alpha warrior Xiang and his team in a race to recover a sinister and seemingly unstoppable weapon known as Pandora's Box. Recruiting an all-new group of thrill-seeking cohorts, Xander finds himself enmeshed in a deadly conspiracy that points to collusion at the highest levels of world governments.",
      "tmdbMovieId": 47971,
      "avgRating": 2.84098,
      "releaseYear": "2017",
      "numRatings": 327,
      "posterPath": "/yNsdyNbQqaKN0TQxkHMws2KLTJ6.jpg"
   }
}