{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "inventor",
            "id": 1436
         },
         {
            "name": "invention",
            "id": 3338
         },
         {
            "name": "scandal",
            "id": 3692
         }
      ],
      "imdb_id": "tt0118836",
      "video": false,
      "title": "Chairman of the Board",
      "recommendations": [
         157036,
         95730,
         26626
      ],
      "backdrop_path": "/czvKQcMyzFYBJUIPcwiPx6a2yIV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Edison",
               "gender": 0,
               "credit_id": "52fe44859251416c91013973",
               "name": "Scott 'Carrot Top' Thompson",
               "profile_path": "/qjuUAVQF57M66iuX3GOGFaTlYjp.jpg",
               "id": 96010,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Natalie Stockwell",
               "gender": 1,
               "credit_id": "52fe44859251416c9101397d",
               "name": "Courtney Thorne-Smith",
               "profile_path": "/dc3irZzXWPcpd88v9qxV7kMqnQR.jpg",
               "id": 55277,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bradford McMillan",
               "gender": 2,
               "credit_id": "52fe44859251416c91013981",
               "name": "Larry Miller",
               "profile_path": "/xA8zCxNrwtamLaLWNBkLyX5tGtU.jpg",
               "id": 1211,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Armand McMillan",
               "gender": 2,
               "credit_id": "52fe44859251416c91013985",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Freemont",
               "gender": 2,
               "credit_id": "52fe44859251416c91013989",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Harlan Granger",
               "gender": 2,
               "credit_id": "52fe44859251416c9101398d",
               "name": "Jack McGee",
               "profile_path": "/jSl2RKRaJvtRoS3T5HSw4xeNdwy.jpg",
               "id": 10489,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mr Withermeyer",
               "gender": 2,
               "credit_id": "52fe44859251416c91013991",
               "name": "Taylor Negron",
               "profile_path": "/l641HJtE8WSjWAJGHAer5Hx89SG.jpg",
               "id": 37043,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Grace Kosik",
               "gender": 1,
               "credit_id": "52fe44859251416c91013995",
               "name": "Raquel Welch",
               "profile_path": "/dEr7QkkgOqCwH1uc5VXzTxDveAv.jpg",
               "id": 21462,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Toby McMillan Gate Guard",
               "gender": 0,
               "credit_id": "5825b6239251417b210092f3",
               "name": "Fred Stoller",
               "profile_path": "/e6SNPg0VwUPlzeni9zRSMbGAIKZ.jpg",
               "id": 1223828,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe44859251416c91013979",
            "name": "Alex Zamm",
            "profile_path": "/wjhqVO41S4tdZGtEal71yI56xlj.jpg",
            "id": 88077,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.336604,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31535,
      "vote_count": 14,
      "budget": 0,
      "overview": "A surfer becomes the head of a major company.",
      "similar": [
         105,
         165,
         196,
         9487,
         3082,
         59108,
         342473,
         9928,
         274479,
         19,
         664,
         162,
         199,
         158852,
         394823,
         9354,
         11158,
         109451,
         6589,
         11425
      ],
      "original_title": "Chairman of the Board",
      "runtime": 95,
      "poster_path": "/p4ZkJG5iTrZYKNQKEM1PQYYsYTl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "101st Street Films",
         "id": 54684,
         "origin_country": ""
      }],
      "release_date": "1998-03-13",
      "vote_average": 2.5,
      "belongs_to_collection": null,
      "tagline": "Work sucks!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alex Zamm"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Al Septien",
         "Turi Meyer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118836/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjUxMDAyMzUyNV5BMl5BanBnXkFtZTcwNDE4MTMyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Scott 'Carrot Top' Thompson, Courtney Thorne-Smith, Larry Miller | See full cast and crew »"],
      "reviews": [
         "A few weeks ago I watched Carrot Top's Chairman of the Board on HBO. This is not just the worst movie I've ever seen, it's the worst movie that's ever been or ever could be. There's a notorious scene in John Waters' Pink Flamingos where the drag queen Divine picks up an actual piece of dog feces and eats it. That is a Capraesque delight compared to the moment in COTB when Carrot Top leans in to kiss actress Courtney Thorne-Smith. Indeed, Thorne-Smith deserves an honorary Oscar for not vomiting her small intestines the second Top's fish-underbelly skin came within Taser range of her lips. I have spent the better part of my life a happy-go-lucky atheist, endlessly circling an epistemological cul-de-sac, foolishly content in the delusion that naught but unremarkable randomness and the caprice of evolution govern our planet and our lives. I write this now as a careworn and grudging theist, cursed with the metaphysical certainty that God exists and that there must indeed be a reckoning. Only a literal hell can restore to the universe a sense of order and return to our souls - souls thirsting for justice for humanity, for cable subscribers everywhere, and not least of all for Courtney Thorne-Smith - a small measure of peace. Indeed, Mr. Top's crushingly unfunny \"film\" is a long, jagged scar across our collective unconscious. It is your hopes and dreams replaced by a dying, weeping child crushed and all at once bereft of breath in your unconsoling - and inconsolable - embrace. It is blood in your stool on the eve of your wedding day. It is an unaccounted-for prosthetic eyeball swimming languidly in your vegetable pad thai. It is happiness itself blotted forever from the cosmos. Carrot Top is the worst human being who has ever lived or ever will live. Stalin? What's a pogrom here or there? Pol Pot? The killing fields are the sweet songs of seraphim heard within the fragrant bosom of your lover compared to this dread offering. Hitler? Europe, she recovered by and by. There is no Marshall Plan for the pain and ruin we Chairman of the Board survivors must endure the sad remainder of our now-squalid lives. Not only are there no - no - laughs in this movie, this film will steal laughs from the rest of your life. It represents a debt that can't be repaid - not now, not here, not in Superman's Bizarro World, not in a far, future galaxy run by countless trillions of nanorobots singularly programmed to wipe away forever the stain of this film, a film that is now irretrievably etched in thousands of banshee-screaming layers of space-time. What's done is done. Though every cell of your body may cry out in anguish and every ribbon of DNA struggle mightily against an unslakeable urge to rip itself asunder, there can be no peace - not for you, not for your children, not for your children's children. Satan, to put it all too bluntly, has won. The collective efforts of millions of preachers, doctors, philanthropists, inventors, kings, queens, philosophers and humble servants of God throughout history are but piffle and dreck. At Carrot Top's official Web site, www.oh-my-god-why-am-i-typing-this/someone-please-take-my-e yes-out-with-a-melon-baller/and-fill-the-raw-moist-sockets-with-m olten-pig-iron/lest-the-next-thing-i-see-be-carrot-tops-shiny-disgus ting-head.org/index.html, Carrot Top offers 8-by-10 glossies of himself for 10 bucks apiece. If deep within the 342 pages of legislation comprising the USA PATRIOT Act there had been a provision for abolishing the civil liberties and reproductive rights of all purchasers of the graven image of this execrable amalgam of Ed Gein-lampshade skin and circus peanut-colored horror, I for one would have been happy to donate every last dollop of fat and tallow in my belly, buttocks, thighs and shanks to grease the skids for fascism once and for all. But alas, the right to be screamingly unfunny and to slobber to horrifying effect on attractive blond actresses is a long-recognized pillar of our democracy. The right to enjoy watching this sort of thing is similarly entrenched, as is the right to watch dwarf-tossing, to view pornography in which midgets peeing is the central theme, and to stare at the noonday sun. Still, though I've never met a Carrot Top fan, they are presumably out there. According to his Web site, he performs in Las Vegas a lot. Believe me, I would prefer to see a Siegfried and Roy show in which their tigers break loose and devour half the audience and the better part of my lower torso. In fact, Carrot Top came to my home town earlier this year. Some poor reporter at our local paper had to write a feature story on him. Knowing that writing anything about Carrot Top that doesn't completely savage him is akin to being one of the PR flacks assigned to spin the Bhopal thing for Union Carbide, I can sympathize with this poor fellow. But not that much. For when it comes to Carrot Top, his stupid AT&T commercials, or that steaming pile of offal Chairman of the Board, you are either with us or you are with the terrorist. Suffice to say, you're better dead than red.",
         "This might cost me my life, but I'm willing to let the world know about the evil that goes on in this country. Five years ago, unnamed officials in this government decided upon the answer to the upcoming overpopulation problems that plague the future. They needed to get rid of the lowest levels, the poor, stupid, and scared. Essentially the same idea Hitler had. But this Holocaust wasn't as obvious as the one the Germany perpetrated generations ago. They decided to draw all of the unneeded masses to one place where they would be gassed. They would set one of these areas up in every town in the ghettos. To draw only the stupid and deranged, they would offer free passes to the worst film ever made. This is where Carrot Top comes in to the picture. They gave him his own film. Purchased a trained monkey from the circus named \"Alex Zamm\" to direct it. Spent as much as it took to make it as bad as possible. Ruined the reputation of decent actors like Courtney Thorne Smith, Larry Miller, and Jack Warden (previously punished by being in the Problem Child series) who opposed the governments agendas for years. They just wrote a sequence of horribly clichéd scenes that allowed Carrot Top to improvise (I hope?) his sterilizingly bad comedy. Then they would pump in the gas. It was going to be a simple and quick executions. The bodies buried in Greenland. Thousands flocked, thousands died, no one knows. Fear them, they show us Carrot Top everyday on TV to numb us, to stupefy us, to keep us dumb and easy to oppress. I must go, the government has probably traced my wearabouts through my IP address by now, I must flee Berlin! Down with the regime!",
         "It's tempting to call CHAIRMAN OF THE BOARD \"Pee-Wee Herman IS The Hudsucker Proxy,\" but that would be a terrible insult to both Mr. Reubens and the Coen Bros. In any case, can we please enact a moratorium on idiocy? Carrot Top is...a surfer dude who strikes up a brief friendship with tycoon Jack Warden. When the old fart dies, Mr. Top is left the (cue title) of his huge invention corporation. But fart's nephew wants the seat at the head of the table, and he'll become the boss if the company stock drops too far. (Did Joel and Ethan settle out of court, or were they paid off while this movie was being filmed?) Despite some nifty doo-dads and an amusing moment or two, CHAIRMAN OF THE BOARD does a) star a prop comic with a screechy voice who's now relegated to cheap AT&T TV spots, and b) contain jokes that seem to have been written during the first Bush administration. It's a movie solely for C.T. fans (both of them). Nobody else should bother. So, who's next, Gallagher? (Note: I was given a promotional soundtrack when this movie came out, and the CD has never been read by the laser in my boombox. It's made a nice dust collector over the years, and aside from a Ramones track that's available on countless other discs, I've never heard of the bands featured on it. Sprung Monkey? Hillbilly Soul Surfers? Do these names give you an idea of the intelligence level offered here?)",
         "There are many mysteries in life. For example: Why did any of the people other than Carrot Top agree to appear in this movie? Why did anyone distribute this movie? Why did anyone pay money to see it? I guess none of these questions will ever be answered, but one thing I know for sure, this movie is one of the worst ever made with a budget this big. It would already be bad, but the addition of Carrot Top's \"humor\" makes it even worse. The only entertainment one could possibly get from this movie is to burn it, smash it, or otherwise destroy it in an amusing fashion. If you were to rank it against every movie ever made, it would be right between \"Problem Child\" and \"Biodome\". Nuff said.",
         "Well, it's good to see the \"comedian\" Carrot Top get some recognition, but please, God, why like this??? First off, the dialogue sucks, whoever wrote it should never be able to write again. And why did they have to incorporate Carrot Tops \"inventions\"? I can see the way they are going with it, but did Jim Carrey do impressions in his role in Peggy Sue Got Married... Bottom Line: This movie is horrible, it's a good thing I worked at a video store and got to rent it for free, or I would have wasted 3.49...",
         "This movie is stupid. There's no getting around it. But so is Dumb and Dumber. Mind you, Dumb and Dumber is significantly more funny than this. However, I for one love seeing stupid movies (Tail Sting) and laughing with a group of good friends over how bad it is. Call me callous, but see this movie, and you'll find that the only way you can laugh at it is if you laugh at it instead of with it.",
         "The humor is non-existent in this loser of a movie. Carrot Top plays a surfer dude inventor who consistently blows the rent money on his goofy, useless inventions. Then he helps an old guy broken down by the side of the road, and voila, he's inherited a major corporation. And on and on and on past the jealous relatives, humanizing the corporation, hostile takeovers, the obligatory love interest.. aargh...let's just say this movie is virtually unwatchable. What Carrot Top has accomplished is to convince me never to go to his stage shows.",
         "\"Chairman of the Board\" is a ridiculously stupid film from the popular comic Carrot Top (also seen on the 1-800-COLLECT commercials). He plays a surfing inventor who comes upon a man who has a flat tire. Top helps him out and a few days later discovers the guy's died and has given his company to the comedian. Even if someone else was in Carrot Top's role, it still would have been bad. The jokes (which are constantly rigged throughout) are terrible and the idea of a romantic \"plot twist\" should have been discarded. DO NOT WATCH!!!",
         "Masterpiece. Carrot Top blows the screen away. Never has one movie captured the essence of the human spirit quite like \"Chairman of the Board.\" 10/10... don't miss this instant classic.",
         "Yes, the votes are in. This film may very well be the Plan 9 From Outer Space for our generation. But whereas Ed Wood's film, for all its flaws, retains a certain charm despite it all, this film defines the word \"charmless\" to the nth degree. In fact, I'd suggest to the editors of the Oxford English Dictionary to cite this movie as a key example defining the that word in the next update to the dictionary. Carrot Top is a performer of such abysmal ability that normally rational people that I know once they hear his name become homicidal maniacs dedicated to wanting to kill Mr. Top as soon as possible. Indeed, if one goes to Amazon.com and look at customer reviews for Carrot Top's movie and other performance DVD, one will find several that could be construed as death threats to Mr. Top. One other curious fact about this film, I recall that Mike Nelson, the head writer for MST 3000, in his book Mike's Mega Cheese about movies, good and bad, said he saw this film and shortly afterwords couldn't recall a thing about it, including the title. Obviously Mike was suffering a classic reaction to trauma. Viewing this atrocity was so soul numbing, Mike Nelson had to block it from his mind. (Evidently, in a later chapter in his book, Mike Nelson had recovered his memeory of this film. From the review he offers, Mike Nelson was definitely not grateful for the recovered memory.) The only comment I offer about the film, and it is not a spoiler, it's simply God's honest truth, it's not funny. None of it is, not even a nanosecond of it is funny."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "101st Street Films",
         "Aurora Productions",
         "Trimark Pictures"
      ],
      "summaries": [
         "A surfer and inventor Edison is chosen by his roommates to raise rent with his outrageous (and absurd) inventions. There's no luck in job interviews until he meets billionaire Armand McMillan, who likes him, and leaves his company after his death to Edison. Edison has a lot of success with his inventions while the company's competitors do all they can to destroy him.",
         "A surfer becomes the head of a major company."
      ],
      "budget": 10000000
   },
   "movielensId": 1679,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-03-13",
      "dvdReleaseDate": "1998-08-11",
      "directors": ["Alex Zamm"],
      "runtime": 95,
      "movieId": 1679,
      "title": "Chairman of the Board",
      "mpaa": "PG-13",
      "actors": [
         "Scott 'Carrot Top' Thompson",
         "Courtney Thorne-Smith",
         "Larry Miller",
         "Jack Warden",
         "M. Emmet Walsh",
         "Jack McGee",
         "Taylor Negron",
         "Raquel Welch",
         "Fred Stoller"
      ],
      "imdbMovieId": "0118836",
      "originalTitle": "Chairman of the Board",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A surfer becomes the head of a major company.",
      "tmdbMovieId": 31535,
      "avgRating": 1.9122,
      "releaseYear": "1998",
      "numRatings": 205,
      "posterPath": "/p4ZkJG5iTrZYKNQKEM1PQYYsYTl.jpg"
   }
}