{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "photographer",
            "id": 1003
         },
         {
            "name": "amnesia",
            "id": 1453
         },
         {
            "name": "empowerment",
            "id": 2386
         },
         {
            "name": "strong woman",
            "id": 2660
         },
         {
            "name": "confusion",
            "id": 10705
         },
         {
            "name": "female protagonist",
            "id": 11322
         },
         {
            "name": "memory loss",
            "id": 11469
         },
         {
            "name": "woman power",
            "id": 14537
         },
         {
            "name": "psychiatrist",
            "id": 15106
         },
         {
            "name": "failing marriage",
            "id": 163221
         },
         {
            "name": "flashback",
            "id": 187844
         },
         {
            "name": "traumatic accident",
            "id": 188341
         },
         {
            "name": "female empowerment",
            "id": 191731
         },
         {
            "name": "photos",
            "id": 212518
         }
      ],
      "imdb_id": "tt4680980",
      "video": false,
      "title": "Lavender",
      "recommendations": [
         381935,
         50458,
         381767,
         384289,
         214218,
         401065,
         24674,
         309879,
         156284,
         354924,
         306197,
         128842,
         267457,
         354220,
         381064,
         394689,
         381041,
         400329,
         392660,
         328763
      ],
      "backdrop_path": "/eu6nDxJLMrKS7zS7yRzigNn8Rg1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Jane Rutter",
               "gender": 1,
               "credit_id": "55581e93c3a368777e00772d",
               "name": "Abbie Cornish",
               "profile_path": "/keDV2eWIcdGGiFNaF3DjJA98KIt.jpg",
               "id": 37260,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Patrick Ryan",
               "gender": 2,
               "credit_id": "55581ed19251412a2a000e7a",
               "name": "Dermot Mulroney",
               "profile_path": "/uqDPswlyj7hUVrmTn5mbDiWiTQi.jpg",
               "id": 20212,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Alan Rutter",
               "gender": 2,
               "credit_id": "55581ee19251412a2a000e7e",
               "name": "Diego Klattenhoff",
               "profile_path": "/nOiJDYiEysyZJHQNPCOSVWw9XzT.jpg",
               "id": 142193,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Liam",
               "gender": 2,
               "credit_id": "55776d099251416cf7000a88",
               "name": "Justin Long",
               "profile_path": "/7TGXeHw4o86IBm6xknQotpludXK.jpg",
               "id": 15033,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Young Jane",
               "gender": 1,
               "credit_id": "560939c1c3a36859e20034e8",
               "name": "Peyton Kennedy",
               "profile_path": "/lnmA7ELPbVFGlfp2bDX8ITFx54O.jpg",
               "id": 1074125,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Alice Rutter",
               "gender": 1,
               "credit_id": "55776d2bc3a3683953000954",
               "name": "Lola Flanery",
               "profile_path": "/9eDN5LcSxBAxZOKEcacfuSfnJn7.jpg",
               "id": 1475744,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Susie",
               "gender": 0,
               "credit_id": "560939c1c3a3681207007e83",
               "name": "Sarah Abbott",
               "profile_path": null,
               "id": 1516081,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Jody",
               "gender": 0,
               "credit_id": "560939c19251415469002ea2",
               "name": "Mackenzie Muldoon",
               "profile_path": null,
               "id": 1516082,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "55581fb9c3a368776a0073f2",
               "name": "Ed Gass-Donnelly",
               "profile_path": null,
               "id": 557179,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55582014c3a3687779007064",
               "name": "Colin Frizzell",
               "profile_path": null,
               "id": 1467912,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5558203a9251412a2a000ea8",
               "name": "Ed Gass-Donnelly",
               "profile_path": null,
               "id": 557179,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "555820c89251412afe000f50",
               "name": "Brendan Steacy",
               "profile_path": null,
               "id": 63801,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "570f9629c3a3685373002c59",
               "name": "Dev Singh",
               "profile_path": null,
               "id": 1329399,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.140564,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 340584,
      "vote_count": 79,
      "budget": 0,
      "overview": "A photographer struggling with memory loss discovers her pictures may indicate something sinister is hitting close to home.",
      "similar": [
         346685,
         77,
         50456,
         376290,
         1903,
         11412,
         15472,
         297762,
         3525,
         1954,
         2501,
         70,
         204922,
         315837,
         290595,
         324668,
         72570,
         293768,
         390582,
         459928
      ],
      "original_title": "Lavender",
      "runtime": 92,
      "poster_path": "/ugTImNkM6MoHRCo2KkcGMw2m1as.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "South Creek Pictures",
            "id": 12215,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "3 Legged Dog Films",
            "id": 53568,
            "origin_country": ""
         }
      ],
      "release_date": "2016-11-04",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "The past won't forget",
      "adult": false,
      "homepage": "http://www.lavenderthemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ed Gass-Donnelly"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Colin Frizzell",
         "Ed Gass-Donnelly"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4680980/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BOTFiYTBkOTEtM2IzNS00OGQyLThkYWItNDUyMGJmZTM1YzZjXkEyXkFqcGdeQXVyMTk3Mjk5NjI@._V1_UY268_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Peyton Kennedy",
         "Abbie Cornish",
         "Dermot Mulroney"
      ],
      "reviews": [
         "I read on here that some think it is a horrendous movie and others think it's a very good movie. It's none of the above. Saying it's horrendous is ridiculous because it isn't that bad. Saying it's a very good movie is also ridiculous because there are way better movies in the same genre then this one. It's an average movie worth watching once and then forget about it. The cast isn't bad. All actors did their best playing their respective characters. It's just the story that could have been better. It's all a bit guessing what happened but it's just a bit too slow and too long before you get some answers. They try to make it creepy but it isn't really and that's why it's just an average movie for this genre.",
         "This was an unsuspected surprise. I did not have much exception about this film and by the end I was surprisingly satisfied by the experience. This is a ghost story that glides on atmospheric buildup and unhurried storytelling. Unlike the current series of horror movies that rely on hyperkinetic scenes to get a jump scare out of the audience, Lavender creates a world of hallucinatory reality. I would not indulge on the story line here but I would brush on number of elements that I really enjoyed about this film 1. Soundtrack, incredible amount of work has gone into creation of this soundstripe. This is an orchestral piece which is composed of many many layers of unique instrumental arrangements. They are quite original and composition really enhances the haunting visuals. 2. Photography, as with the soundtrack, the movie is inhabited with many equally stunning shots that brings out the almost fairy air amidst the horror. 3. Abbe Cornish is clearly in command here. I would say that she carries the movie all on her own. She delivers a multi-layered character performance which is mesmerizing on every scene she is present. At the end if you like a old fashioned ghost story which has no shortage of talent in every department give Lavender a try",
         "There wasn't a whole lot to like about 'Lavender'. The story was bland, the cast was mundane and the endless attempts to create a creepy and tense atmosphere failed miserably. Let's start with the story. In a way there really isn't one because we the audience never actually know what is going on. Things keep happening, but we have no idea why. There's no mystery for us to solve or plot for us to figure out along with the characters, because nothing is ever explained to us. All we know is that a mass murder happened in a house 20 years ago. For a thriller/mystery to work the audience needs to be seeing things with more clarity than the characters. They don't need the answers, just the problem put clearly in front of them. That does not happen here. Then there's the cast. It would have to be said that Abbie Cornish can not carry a film in the lead role. There are two ways to make it in Hollywood. Either be incredibly beautiful, or be a hell of an actress. Some can manage both, Cornish can manage neither. I'm not sure how Justin Long got roped into being in this either. I thought he was above roles like this, but apparently not. Also Lola Flanery, one of the main child actresses in the film, was distractingly bad. Generally, child actors and actresses these days are of a much higher standard than they used to be. Flanery though needs to keep working on her trade. Then there's the endless hallucinations the audience has to put up with. Hallucinations are only a minor step up from dream sequences. I understand it was part of the story (in a way), but when your film constantly relies on showing the audience things that are likely going to turn out to be nothing of importance, it's not a good sign. Even if the film does later clarify that they were more important than they were first understood to be, they were still incredibly annoying for the first 80 minutes of run time whilst we still thought they were nothing. I think 'Lavender' was really banking on its ending to impress audiences and just hoping that they forgot about all the terrible stuff leading up to that point. Sadly, it's far from impressive enough to achieve that. There are much better thrillers out there than this to see. Watch one of them.",
         "I don't understand the poorer reviews of this film! It explores the idea of repressed memories, but is also a \"ghost\" type movie. I'm not normally a fan of movies with lot of supernatural material like ghosts, or of movies with eerie music or creepy themes, but this was a fantastic movie. The acting was superb and the story kept me thoroughly engrossed. I will watch this again in the future, I'm sure.",
         "Why does Abbie Cornish over-enunciate every single word in this film? Very annoying. And she's also overly styled and made-up in her role. Less make up and a more worn out and 'haunted' look would've made her character and what she's going through more believable and real. This could have been such an awesome movie with a well written script plus a stronger lead. The dialogues were awkward, at best. Just, no! But, I did like the setting and the houses, a perfect set-up for a great thriller but again it failed in so many ways: from writing to directing to the whole execution of the film. I was also surprised to see Justin Long in this type of role and film as well. If you're studying film then watch this to learn how Not to do a film. Otherwise stay away. Yikes.",
         "Starts off with a gory crime scene at a farmhouse, Father, Mother & Sister killed with a young Jane found huddled in a corner with a bloody switchblade. The Uncle is the next of kin, lives nearby and gets called to the scene, however the kid is given up for foster homes(we learn later) and jumpcut to 25 years later when she has a husband and a daughter, with zero recollection of the events. An automobile accident juggles up her loosened screws and she starts remembering bits and pieces of her past life in weird riddle pieces. Sounds promising, right? Well, you'll not be the first to get fooled. 1. Absolutely the first thing you'd notice annoyed is the background score. Pretentious classical music played loud all along, dun-dun-Duns five seconds ahead of when you're supposed to be scared. You can play on your tablet while this movie rolls on your tv, look up when the music pokes up \"hey hey look! Somethings about to happppen!\" and you can get adequately miffed. Don't worry, you're not missing much. 2. The vapid and annoying Abbie Cornish and her Covet Fashions wardrobe and makeup. Which survive a) a car accident involving four to five roundabouts oft he said car b) irritatingly confusing multiple ghostly figures trying their hands at dumbcharade in the middle of the night attempting to pass off important information about her past c) several near death experiences of her daughter. Her stylists in the movie must be gaining on those Covet levels hard. There are designated impeccable \"toppling inside a car look\",\"discovering her traumatic past look\", \"pretty on the stairs while daughter chokes to death look\", \"pretty on the bed while ghost sister chokes to death look\". Loads of denim. Cool heels. I wanted a few for myself, the runway looks were so good. You almost wait for the label name to popup anytime. Added level bonus: Cornish' \"It's Sunday, why did you wake me up at 4 in the morning!' look. Delightful. especially in the scene where her daughter's having an asthma attack and her husband is trying to save her. 5.80 points where she stands by the railing posing. 3. I learned that ghost love painstakingly wrapping cute gifts for the demented. Nice red ribbons, cute little boxes to deliver riddle pieces at her doorstep. That talent could be exploited in Christmas times, just saying. 4. Sooo...we learn the Uncle basically killed off the family with Jane being a witness to the crime as also to the abuse he'd resort to on the kids. He left the house after the mass murder mistakenly thinking Jane to be dead, who was later found by the police shaken and traumatised. However, Uncle makes no attempt at keeping the kid under his roof (he admits to an older Jane that he was not very adept at raising kids) which would minimise the chance that she'd regain her memory and expose his crime to the world. Not a very intelligent man, he. 5. Jane's psychiatrist is a figment of her imagination. Which you guess as soon as the doctor awkwardly loiters around while she opens one of her dubious giftboxes. No doctor has that kind of time for his patients. 6. No context or explanations of any action by the characters. Why pray they moved to that old farmhouse right away? What about their home, did they rent it/sold it/gave it away in case she remembered some hidden treasures buried in the garden of the farmhouse? Does the kid go to school? Anywhere? Is this some extreme case of reverse germophobia where they just move into a dilapidated farmhouse locked up for 25 years and don't even change the bedsheets? Was the Uncle paying its electricity bill for the past 25 years? Good man. 6. That ending, My God. What exactly was the Uncle trying to do running away with the kid under one arm and shooting at the father with another? Leaving behind his house, barn, all those poor cows? Did he plan on the spot to run away on foot with the clothes on his back and the kid tucked under to a goodlife somewhere else while the Mom and Dad sit in their car and talk about the next Milan show? They should've tied his hands backwards. All in all, a film where all the characters are so vapid and uninterested that you don't feel sympathetic for the protagonists, villain or the ghosts and wish they could somehow have this final epic battle scene where everybody kills everybody off. You could nap in the sofa till then, the music will wake you up. With that final shot of Abbie Cornish lying dead in a Jovani Navy Mermaid Ball Gown($3500) and her dead fish stare. But here, it'll fit.",
         "What a strange little movie we have in the under-the-radar Canadian supernatural drama \"Lavender\". It may be a low budget indy, but the story, acting and cinematography are all of high caliber. Australian beauty Abbie Cornish is Jane, a woman with a horrific past that she can not remember. Cornish resonates as a wife and mother struggling to recall unthinkable events from a tragic childhood. Although she plays a gal from the American Midwest, her indigenous Aussie accent does seep through on occasion. But that doesn't detract from a solid performance as the anchor of a uniformly fine cast which includes veteran pros Dermot Mulroney and Justin Long. And one other thing. Watching \"Lavender\" may well result in you never again looking at unexpected presents wrapped in pretty red ribbon as a welcome surprise.",
         "Oh. My. God. If I have ever seen a slow-paced movie, they seem like roller-coasters now. This title is only rivaled by that French joke of a horror movie called They Came Back (100 minutes of my life; gone). Nothing happened for the first half hour besides the introduction of the characters and the main character living her life in between zoning out to annoying violin (or cello?) tunes for looong seconds. Literally two seconds of Dermot Mulroney and no Justin Long. Just as I was about to turn it off, though, my food arrived so I kept watching. Nothing kept happening for another 15 minutes, but right when I was closing the window for sure this time, a single interesting thing happened that involved Justin Long's character (and I love Justin Long) so I gave it yet another chance. When there was more empty scenery and zoning out, I just skipped ahead to the revelation part, which wasn't too bad, and then it was finally over. I thanked God and ran here to try and stop others from wasting precious time.",
         "When even the soundtrack in the movie annoys you, it is clear something is horribly wrong. It seems everyone involved in the movie was trying to create something, which failed in every possible area. Characters - boring and un-relatable. Couldn't care less what happens to them. Acting - looking \"profoundly\" sad all the time does not constitute dramatic acting... Story - I was praying to god (just an expression) that it will not be a banal story about ghosts. I really thought it is possible there will be an interesting twist, but noooo...freakin' ghosts. Oh, and while we are speaking about twists - the cheap \"Six Sense\" twist \"revealing\" (like I didn't see it all the way from 1999) that the psychologist was actually a ghost, was so laughable and unnecessary that I almost stopped watching right there. Soundtrack - unusual textures and ambiences, extended techniques on the violin and annoying \"sliding\" ultra low sounds for 99% of the movie were not only annoying, but simply like having a coffee with 12 spoons of sugar - bad taste. You can not shove \"suspense\" down the viewers throat all the time when there is no reason for it. It seemed the characters couldn't open the fridge door without the music suggesting \"something terrible is going to happen\". So yes, an absolute __________________(are you feeling the suspense?) waste of time.",
         "I've seen worse movies. I actually appreciated how artistically appealing this movie was. People are complaining that this movie wasn't interesting enough, but you have to realize that the top grossing movies in the world are fast and the furious and transformer franchises, so i wish there was some context in their reviews. I personally felt that this movie could have been better, but It definitely didn't deserve a 1 star rating.",
         "This was painful. I watched the entire thing, fighting sleep throughout. Only the last 20 minutes was interesting. Up until then it's just a string of boring flashbacks. I found myself just hoping they would hurry up and get to the point. To make matters worse, the ending is quite predictable. This one is a Netflix late night special if you are very bored.",
         "I don't understand the bad reviews. The one that first came up said the movie was slow and boring. It is for only about 10-15 minutes, but then the story picks up and it is a very good story. The eeriness is a key element of this movie and it is a true mystery. We all enjoyed it very much and would highly recommend it if you enjoy psychological thrillers.",
         "I wasn't sure going into the film exactly what to expect. I knew a few of the actors from other films and telly shows they've done so I thought I'd give it a shot. So glad I did! Won't toss out any spoilers, if you're looking for a psychological mystery with some spooks added to the mix give this film a try!",
         "The director managed transforming what might have been a plausible, absorbing tale into the standard Hollywood fare of over-made-up leading female roles and sympathetic little kids plodding through an essentially pointless plot, festooned with the obligatory Hollywood fare of slow-motion special effects (the car wreck, for example) and pointless scenic shots (the corn field, for example). Does anyone other than teenagers (who will consume anything and think it's great) or childish adults addicted to reality TV think this kind of stuff is entertainment? Not worth even a fraction of the bandwidth.",
         "This is a slow-burning, well constructed psychological thriller with mystery and supernatural elements. The revelation makes sense, but is not obvious. The acting could have been better, especially on part of the lead actress, but still does the job. The cinematography is beautiful. Other reviewers here seem to have simply picked the wrong film; if you only like action or horror, don't bother with this one.",
         "The plot is good, but the pace and acting are unfortunately much less than expected. Could have turned out a better movie if the casting was different, however Justin Long was good",
         "...and even that was as slow as molasses in January. I watched this film for one reason. I wanted to see Justin Long in something that wasn't a dopey comedy. I like Long (who I see as a decent actor), although he certainly accepts some awfully dumb films...and though not a dopey comedy, this film was plenty dumb, too. As a number of our reviewers have pointed out, this movie moves slow...very slow...and to no great effect. And the music...well matched to dull action. The acting? Well, although Long's acting was satisfactory (I'm not giving him more than that here), the acting of the lead -- Abbie Cornish -- was totally unconvincing, or should I say amateurish. I've generally liked Dermot Mulroney in a number of films, but this was pathetic. And I'll tell you what ultimately bothered me most of all. In the end, the director resorted to a \"The Sixth Sense\" flashback type of explanation for Justin Long's psychiatrist character. Shame, shame, shame. Apparently some people liked this film. There's no accounting for taste. About the only actually good thing I could say about this horror/ghost film (I was going to say suspense film, but if moved so slowly that there was no suspense) was that it wasn't a cheap slasher type film. Move along. There's nothing to see here.",
         "Barring that it will be this film. It's that slow. I guess everyone went to the same film school where they teach you the one style for everything. Pioneered by the series 'The Killing' where nothing happens there's no plot nothing ever reveals anything. Even one of the characters in this movie whines 'this is boring'. And boring it is. I think the writer director was aiming for a pilot and couldn't sell it so he made a movie of sorts that captures the utter nothingness. There's no suspense, no tension, no forward arc. And let's face facts; Abbie Cornish is the pot man's Charlise Theron while anything with Justin Long in it is a waste of time. BTW Saab is supposed to be a safe car. They don't rollover 9 times and without the airbags deploying. Just watch you'll see.",
         "It was very well done, mood, camera works, acting and especially the music. However, it was the same old story of spirits wanting for the truth to be told. Why couldn't have this been just about the psychological effects of a traumatized child who was suppressing her memories and the truth. And then later in life as she was stronger and able to face it was remembering what really happened. why bring the supernatural into such a beautifully shot movie with an excellent music score and this scary mood they were able to create even without the introduction of ghosts. This movie was scary enough without the spirits and ghosts they later got involved into the movie. All the supernatural could have been her dreams or subconscious trying to help her remember and face the truth and see who the monster in real life was. Any ways, I enjoyed it and give it 5 out of 10 only for all the hard work in everything they did except for the actual story. Movie makers, sometimes a simple story is a better story. 5 out of 10 for me is a very watchable movie i am stingy at scoring levels. I recommend this movie to drama watchers, art lovers and ghost/spirit story lovers. Horror fans stay away and their wasn't much mystery as I had already guessed what happened half way in the movie.",
         "Deserved a much better lead actress, for example. Abbie Cornish is totally apathetic, disinterested at acting, sometimes delivering out-of- place loud responses that comes from nowhere and most of the time keeping a vacant look that says nothing and feels nothing. The costumes she wear are a horrible hillbilly attempt at \"country\" fashion; the script deserved better sequences (there is no justification for her to stay at the hospital for so long, for example, for from day one she shows no injuries whatsoever...) and so on.... Not worth viewing.",
         "I don't understand the bad reviews and glad I watched it regardless. It was a thoroughly surprising tale with excellent acting, and a surprise twist. Where I thought it was going was not so I loved that surprise. Yes, according to others it is a ghost story BUT so much more than that! If you like suspense, twists and turns, watch this. You will not be disappointed.",
         "The film opens with a family being murdered except for young Jane (Peyton Kennedy) in a corner with a pocket knife. The film jumps 25 years later as older Jane (Abbie Cornish) has no memory of the event. She takes photos of farm houses. An accident causes a head injury and apparently she had a previous head injury. Some of her old memories come back while she loses others. Through circumstances Jane and her family end up in her childhood home as creepy things happen. There are butterfly fairies and the monster. The plot was not that tight. The scares were ineffective. There was nothing special about this me-too, I can't believe they went there, film. Jane was cardboard, a poorly scripted character. The film went out of its way to show us the family was killed on 10-10-1985. Then it shows us their headstone: June, 8 1986. They should have used that as the date instead. But as Ed Wood would say, \"Who would notice?\" Guide: 1 F-word. No sex or nudity.",
         "It has a good story to bad it was so poorly done. The acting is horrible and the soundtrack is so bad. If you feel like watching it for the story it is worth seeing once and only once. Maybe someday someone will remake the movie into what the story deserves Like I said I like the story just wish someone else made the movie."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "South Creek Pictures",
         "3 Legged Dog Films"
      ],
      "summaries": [
         "A photographer (Abbie Cornish) in a failing marriage suffers severe memory loss after a traumatic accident. Strange clues among her photos suggest she may be responsible for the deaths of family members she never knew she had. A concerned psychiatrist (Justin Long) tries to help her recover lost memories.",
         "After losing her memory, a woman begins to see unexplained things after her psychiatrist suggests she visit her childhood home."
      ],
      "budget": 0
   },
   "movielensId": 168772,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-11-04",
      "dvdReleaseDate": null,
      "directors": ["Ed Gass-Donnelly"],
      "runtime": 92,
      "movieId": 168772,
      "title": "Lavender",
      "mpaa": "",
      "actors": [
         "Abbie Cornish",
         "Dermot Mulroney",
         "Diego Klattenhoff",
         "Justin Long",
         "Peyton Kennedy",
         "Lola Flanery",
         "Sarah Abbott",
         "Mackenzie Muldoon"
      ],
      "imdbMovieId": "4680980",
      "originalTitle": "Lavender",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "YLRTCtUolMI",
         "L6OMsLU7Ikc"
      ],
      "plotSummary": "A photographer struggling with memory loss discovers her pictures may indicate something sinister is hitting close to home.",
      "tmdbMovieId": 340584,
      "avgRating": 3.1,
      "releaseYear": "2016",
      "numRatings": 20,
      "posterPath": "/ugTImNkM6MoHRCo2KkcGMw2m1as.jpg"
   }
}