{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "android",
            "id": 803
         },
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "space travel",
            "id": 3801
         },
         {
            "name": "alien life-form",
            "id": 4862
         },
         {
            "name": "infection",
            "id": 4884
         },
         {
            "name": "egg",
            "id": 5698
         },
         {
            "name": "engineer",
            "id": 5721
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "spaceship",
            "id": 9831
         },
         {
            "name": "space",
            "id": 9882
         },
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "outer space",
            "id": 12405
         },
         {
            "name": "robot",
            "id": 14544
         },
         {
            "name": "scientist",
            "id": 14760
         },
         {
            "name": "genocide",
            "id": 14900
         },
         {
            "name": "creation",
            "id": 163402
         },
         {
            "name": "acid",
            "id": 208580
         },
         {
            "name": "xenomorph",
            "id": 226177
         },
         {
            "name": "alien technology",
            "id": 231277
         },
         {
            "name": "genetic mutation",
            "id": 233300
         }
      ],
      "imdb_id": "tt2316204",
      "video": false,
      "title": "Alien: Covenant",
      "recommendations": [
         395992,
         293167,
         282035,
         315837,
         281338,
         283995,
         274857,
         8078,
         8077,
         353491,
         324552,
         335988,
         330459,
         263115,
         418078,
         333371,
         419430,
         311324,
         188927,
         300668
      ],
      "backdrop_path": "/kMU8trT43p5LFoJ4plIySMOsZ1T.jpg",
      "revenue": 232380243,
      "reviews": [
         {
            "author": "Screen-Space",
            "id": "590f90fac3a36864d4026534",
            "content": "\"At times a thrilling, stomach-churning journey, but one that leaves those on board wondering if the disorientation and down time was worth the investment...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/5/8/alien-covenant.html",
            "url": "https://www.themoviedb.org/review/590f90fac3a36864d4026534"
         },
         {
            "author": "CraigJamesReview",
            "id": "5915da5f92514157230206c7",
            "content": "Alien Covenant marks the third Alien movie directed by Ridley Scott and the second prequel to the franchise after Prometheus. They also seem to be getting worse with age.\r\n\r\nPrometheus was really a lot of questions searching for answers, ambitious in asking not only about the creation of alien life, but human life as well. However the plan to stretch out these topics into 3 or 4 movies should be met with some skepticism.\r\n\r\nEspecially considering the basis for this was started by Damon Lindeloff, the creator of Lost and the man most of us are still waiting for answers for most of the things that happened on Lost.\r\n\r\nHe of course has abandoned this second movie, leaving it in the hands of the far more capable John Logan, but even he struggles to find meaning here, or escape the clichés that have started to grow like a Xenomorph in John Hurt's stomach.\r\n\r\nWe're dealing with a whole new crew this time; the Covenant. They are headed on a colonial mission to another planet before an electric shock takes out the ship, the Captain, and 47 other members.\r\n\r\nReluctant to get back into their pods for a 7 year journey, the on board crew responsible for the ship's upkeep decide instead to answer a distress transmission coming from another planet.\r\n\r\nThat's where they find what continues to be the best character in these prequels; Michael Fassbender's David the Android. His motivations and whether he considers himself human or God is constantly in question and Fassbender's soft-spoken performance continues to haunt.\r\n\r\nI also really do consider Prometheus to be one of the most gorgeous-looking special films of the last decade and this continues that- from the Covenant ship to the grain fields and other vegetation eerily covering the mostly desolate other terrain of the planet.\r\n\r\nWe also get the first look at the Neo-morph, who is born the same way, seems a bit faster than the Xeno-morph but the main differences are it doesn't have the Venus fly trap tongue and it can stand like a human. Pretty cool.\r\n\r\nJust it's at this point I should probably say that after Aliens there started to be less reason to want these. Alien 3 was fine, Prometheus I thought could really go either way depending on the sequels, and Alien 4 of course was garbage.\r\n\r\nThe biggest problem here is that it feels so redundant. We get a distress call, the crew investigates, some background characters do stupid things leading to impregnation, someone says \"we never should have come\", final alien chase.\r\n\r\nThe aliens, when you can see them, are cool, but there is a lot of downtime between them, and a few quality kills does not a 200 million dollar mega blockbuster make.\r\n\r\nIt's also really odd that Prometheus does this whole thing of setting up the engineers as the creators of human beings but here they only get one scene and let's just say those looking for more info about them will get angry.\r\n\r\nThe promise of some larger conversation is in here somewhere but these movies feel so stretched out at this point that when this does get to the few moments of actually having something to say, it's hard to get re-engaged.\r\n\r\nThe characters don't help either as most just come off like archetypes. Katherine Waterston is the Captain's widow and really the bargain basement Ellen Ripley here.\r\n\r\nBilly Crudup plays the faith-based character, and like the last movie, this movie seems to be including that without ever really giving it value in the meaning of life conversation.\r\n\r\nBut at least those two have some background. I'm so tired of most of these others. The ones who just go tramping through the woods of an unknown planet or show the decision making skills of the Trump administration. You're not supposed to make us root for the alien, guys.\r\n\r\nFinally i'm no closer to understanding why these movies are necessary. It's easy to tell what this movie wants to do and it's even easier to see the twist coming a half hour before it even comes.\r\n\r\nThere are a few nice kills here, I will give the movie that. If you can remember to wake yourself every time Fassbender and Fassbender (he also plays an android named Walter) have a philosophy conversation, you might find some interesting stuff there too. But overall not enough action or thought to make this overly drawn out series seem necessary.\r\n\r\nSo I go 5/10. For more reviews, check me out on Youtube here- https://www.youtube.com/channel/UCY_IvAm1bJADConJhDCuq6A\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
            "url": "https://www.themoviedb.org/review/5915da5f92514157230206c7"
         },
         {
            "author": "Gimly",
            "id": "5916a5cfc3a36840aa0289e4",
            "content": "I had a few reservations going in to _Alien: Covenant_. In my opinion there hasn't been a truly great entry to the franchise since _Aliens_, so I was worried that the statistics were against it. I thought _Prometheus_ was incredible from a technical standpoint, but not a very engaging movie, and I was worried we might get the same here. The trailers had been mostly good but I was worried I had seen too much of the third act in them, and I was worried this would spoil the experience for me a little.\r\n\r\nWhat I was not worried about was within ten minutes of the damn thing starting I would think to myself: \"Wow, this movie is really poorly made.\"\r\n\r\nWell I guess I'm an idiot because that is exactly what happened. And that feeling never entirely abated over the course of the whole thing.\r\n\r\nDon't get me wrong, it's no \"_AVP: Requiem_\", but I was still very disappointed.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._",
            "url": "https://www.themoviedb.org/review/5916a5cfc3a36840aa0289e4"
         },
         {
            "author": "Simon Quinlank",
            "id": "5916e8fac3a3683fb602cd2f",
            "content": "**Limps along under the weight of its own importance.**\r\n\r\nI love my films dripping with self importance and this one is definitely one of them.  I can't get enough of these films that positively bubble over with a high handed, serious and arrogant attitude that indicates that there is no film quite as important as this one.\r\n\r\n\r\nThis film knows it all. It knows everything that we- the lowly, pathetic and simple minded audience do not know and could not ever possibly know because we are not intelligent enough to grasp anything, you see?\r\n\r\nFor such an authoritative, superior and intelligent film - I find it odd that every character stumbles around like a simple minded cretin making unwise decision after unwise decision.\r\n\r\n\r\nRidley and his scriptwriters seem to think that they are intellectuals but somehow they just _can't pull off_ the role of **being** an intellectual.\r\n\r\n- Simon Quinlank",
            "url": "https://www.themoviedb.org/review/5916e8fac3a3683fb602cd2f"
         },
         {
            "author": "Saketh Thota",
            "id": "5923ecf7c3a368044d00a533",
            "content": "I agree with most of the negative comments about this movie.It is a gigantic missed opportunity.My biggest issue apart from the utter predictability and nonsensical,inept script,was the disappointment of seeing 'Prometheus' mixed up with 'Alien'\r\nAlien covenant gets locked up in its own self importance while forgetting why we loved 'Alien' in the first place.I really wanted to like it but came a way  with a huge sense of disappointment",
            "url": "https://www.themoviedb.org/review/5923ecf7c3a368044d00a533"
         },
         {
            "author": "EvilWayz",
            "id": "5983babf9251410759000836",
            "content": "Not sure about all the bad reviews, I enjoyed the movie.  I'm guessing because I wasn't expecting it to be particularly cerebral.  Its a sci-fi/horror flick, I was looking forward to Sir Ridley Scott coming up with new and disgusting ways to terrorize the cast and I wasn't disappointed.  Of course, the android going rogue was pretty obvious, but if the Star Wars franchise can feature a planet destroying space station in 3 of 7 movies, I'll give Sir Ridley a pass.  If you are looking for the loose ends from Prometheus to be tied up, I suggest you include Sir Ridley in your prayers so he can survive long enough (the man is friggin 80) to film the prequel to _Covenant_ currently titled _Awakening_ that will hopefully meet your expectations.",
            "url": "https://www.themoviedb.org/review/5983babf9251410759000836"
         },
         {
            "author": "Mark Rushow",
            "id": "59843bcec3a36875730003c1",
            "content": "Watched Alien: Covenant a 3rd time. It is a lot better than first meets the eye. The drastic difference from what we were expecting in direction from Prometheus threw all of us off. We had expectations of what we would get to see and we didn't get those. There is so much detail and such good acting. It takes multiple watches to pick up on it all. It blends the styles of Alien, Aliens, and Prometheus all together and does it very well. There is also a lot of subtle reference to Terminator 2. The dynamic between the androids Walter and David and the acting that went into that is something quite special. In that alone is a reference to T:2. My first 2 watches I didn't appreciate the android Walter like the character deserves. I was biased against his character in light of the android David. The android Walter and how he was portrayed also blends the style of android we see in Aliens. The actor's voice and demeanor reflect that of the android Bishop and gives us a bridge to his design. Michael Fassbender really did one hell of a job acting those two parts of Walter and David. Near the end of the movie there is another nod to T:2 as a beam is clearly marked as such and the scene that follows has a strong T:2/Aliens sequence and taste in styling to it. Through and through the acting is very good. Details are abound everywhere. There are a few points of rather convenient plots however overall the film is now among my favorites right along side Aliens and T:2.",
            "url": "https://www.themoviedb.org/review/59843bcec3a36875730003c1"
         },
         {
            "author": "John Chard",
            "id": "59c62a13c3a3681461037321",
            "content": "Even the monkeys stood upright at some point.\r\n\r\nHee! Ridley Scott, it seems, is damned if he does and damned if he don't as regards the Alien franchise he so gloriously kick-started back in 1979. Prometheus was too cerebral for many and definitely bogged down by expectation levels. Not without flaws of course, but a very tidy science fiction piece it be. So we roll on to Alien Covenant, which while not universally reviled, has certainly garnered some fearful scorn in Alien franchise fan circles.\r\n\r\nAlien Covenant is a cover version, no two ways about it, it's a retread of what was showcased in 1979, only with the tie-in to Prometheus and a continuation to the origins of Xenomorph and pals. Clearly we have a case of Scott making one for the fans, a return to chest busting goo and space adventurers under great duress, all of course while he fills in the blanks as well. For sure it's lazy when put up against Alien, and indeed against his other superlative sci- fi offerings such as Blade Runner and The Martian, but for those who lambasted Prometheus for its non Alien conventions, you have now got what you hankered for. Any expectation of this turning out to be a fresh masterpiece was always going to be crushed, so really it's best viewed as a loving retread. Yes! Bad science, plot and logic holes, average acting etc, these rightly don't deserve forgiveness, but it's hardly the devil's spawn here, in fact its's great fun as much as being a visual treat.\r\n\r\nLog cabin on the lake.\r\n\r\nWe start with a prologue involving Weyland and David, the conversation involving creation, the most pertinent of which being the question of the ages, where do we come from? Then after a tantalising tinkle of the ivories for Wagner's \"The Entry Of The Gods Into Valhalla\", we are whisked into outer space 2104 to be in the company of the Colonisation Vessel Covenant. Crew 15 - Colonists 2000 - Embryos 1140. The destination is ORIGAE - 6, ETA in 7 years and 4 months. Only Walter the Android (Michael Fassbender) is awake, until it's time for the crew to be abruptly awakened from their hyper sleep...\r\n\r\nCrusoe and the pathogen.\r\n\r\nFrom the off disaster strikes, thrusting the crew into emotional strife. Characters are introduced, conversations and traits establishing the bare minimum that we need to know, then a ghost transmission is received from Sector 87, planet number 4, and off we go into familiar territory. Things inevitably go from bad to worse and the action, blood flow and creature feature conventions are all laid out for our digestion. There's some surprises in store, with Fassbender a double bonus, and there's some striking chatter ranging from if there's benefits of the human race? and even that involving the poets Byron and Shelley.\r\n\r\nBed Bugs.\r\n\r\nWho will survive? If anyone? Just what does the finale have in store? As we get devilish answers, and the barn storming aural pleasures of the full orchestral version of \"The Entry Of The Gods Into Valhalla\", it's tied up nicely and the pulse rate can settle. Job done. No bar raising here, no film to push the space lander out into new dimensions, just a good honest sci-fi thriller to be viewed with that in mind. 7/10",
            "url": "https://www.themoviedb.org/review/59c62a13c3a3681461037321"
         },
         {
            "author": "Reno",
            "id": "59ec96f8925141245f0034a5",
            "content": "**Good robot! Bad robot!**\r\n\r\nAfter some gaps, the 'Alien' franchise came alive with the prequel 'Prometheum' which originally said to be a spin-off. Particularly, it landed in the hands of the original maker. Now, even the original title back in action. It's another prequel, hence the prequel series on the making. The next film too will be the same kind, before the overall storyline in the franchise align in a straight line.\r\n\r\nI enjoyed it. But not as good as 'Prometheum' or the first two 'Alien' films. The issue with it was, the same old cliché. There's nothing in the story. It was like any space film that's set in a similar fashion. The 80 per cent of the film was what we had seen in the earlier 'Alien' films. Just altered scenes with a new cast and a great visuals. So the update makes it the special.\r\n\r\nThe story focused too much on the robot. The alien parts were reduced. Because it was like the first appearance of the original aliens we saw in the old films. Precisely to say, the origins. Genetic modification, crossbreeding, there comes the beast. From this film what I have learnt was, it was nothing but more or less the same old fear the humans have about that the robots which are the ones going to make humans go extinct. Except here the aliens come between them. Hence, falling prey to the same clichéd theme from any sci-fi that had humanoid.\r\n\r\nNevertheless, well maintained film in its balance coming from previous hits in the series and going forward to bring more hits. This flick would serve as a fine bridge between them. So only 18 years to go between this, from 2104 to 2122. I'm already anticipating the next film. As I have heard, that film would be focused more on the robot. That's going to be a different experience. Fassbender's time to have some space adventures.\r\n\r\n_7/10_",
            "url": "https://www.themoviedb.org/review/59ec96f8925141245f0034a5"
         },
         {
            "author": "Patrick E. Abe",
            "id": "5a83eb1c9251410b4d0065df",
            "content": "I paid to see the movie, just to see what all the hype was about. It's a mess, of course, from David going Nazi and practicing genocide, to the mindless violence of \"an earthworm impaled on a hook to catch fish,\" to space idiots/children who aren't smart enough to be hall monitors. \r\nI had wondered why some folk considered the first three \"Alien\" movies Canon and NOT the current set. \r\nI'm with the \"three and done\" crowd, this movie is a Hollyweird popcorm flick. \r\n\"Do not watch this movie. God complexes and stupidity abound. Stay away if you value your peace of mind.\" (Repeating acoustic beacon)",
            "url": "https://www.themoviedb.org/review/5a83eb1c9251410b4d0065df"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "David / Walter",
               "gender": 2,
               "credit_id": "52fe4ae9c3a368484e16d6c5",
               "name": "Michael Fassbender",
               "profile_path": "/ohGJPTlou8TuZ8VOz5m9kChWgts.jpg",
               "id": 17288,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Daniels Branson",
               "gender": 1,
               "credit_id": "575d8477c3a3681318002756",
               "name": "Katherine Waterston",
               "profile_path": "/zgLVX4KJJ6hTD2niGLchkzjfWpJ.jpg",
               "id": 77795,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Christopher Oram",
               "gender": 2,
               "credit_id": "575d846b9251412443002880",
               "name": "Billy Crudup",
               "profile_path": "/pYblSarjmmIUggmOafanD2yk0Zj.jpg",
               "id": 8289,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Tennessee Faris",
               "gender": 2,
               "credit_id": "575d8465c3a36836e5000211",
               "name": "Danny McBride",
               "profile_path": "/44DW4hNukuxNhGwyMScNNKhwflN.jpg",
               "id": 62862,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Sergeant Carl Lope",
               "gender": 2,
               "credit_id": "575d8485c3a3681351002d99",
               "name": "Demián Bichir",
               "profile_path": "/hIldnp3pj3LeDq1rVfGgVy4a7cT.jpg",
               "id": 76961,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Karine Oram",
               "gender": 1,
               "credit_id": "575d848bc3a36837310001f8",
               "name": "Carmen Ejogo",
               "profile_path": "/yAiQAfxCAFw2SNIVpAePKXBvT58.jpg",
               "id": 37158,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Ricks",
               "gender": 2,
               "credit_id": "575d847ec3a3681351002d97",
               "name": "Jussie Smollett",
               "profile_path": "/mENsciBE6E5ZsqhJROfLCpIT4re.jpg",
               "id": 181081,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Upworth",
               "gender": 1,
               "credit_id": "575d849cc3a36837910001d0",
               "name": "Callie Hernandez",
               "profile_path": "/doMXlhTAYCy8gH43yYA6m9ymxhd.jpg",
               "id": 1486488,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Maggie Faris",
               "gender": 1,
               "credit_id": "575d8492c3a36837310001fa",
               "name": "Amy Seimetz",
               "profile_path": "/zMJK3v7GvyYAgVVkStSFWTEHHHl.jpg",
               "id": 139150,
               "order": 8
            },
            {
               "cast_id": 57,
               "character": "Sergeant Hallett",
               "gender": 2,
               "credit_id": "57df5c1dc3a368129800bc30",
               "name": "Nathaniel Dean",
               "profile_path": "/akebwx7M4HJc3q2UnC6mKymKlkO.jpg",
               "id": 37290,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Ankor",
               "gender": 2,
               "credit_id": "575d84aa925141042300019a",
               "name": "Alexander England",
               "profile_path": "/7ED4LEneHVZjK4ENxYXWxS8WRoN.jpg",
               "id": 1527210,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Ledward",
               "gender": 0,
               "credit_id": "575d84b39251415dd20035c9",
               "name": "Benjamin Rigby",
               "profile_path": "/j88wCTeYGJ7aEYufVggs23sa0QE.jpg",
               "id": 1371541,
               "order": 11
            },
            {
               "cast_id": 54,
               "character": "Cole",
               "gender": 2,
               "credit_id": "57df5c039251416bea003851",
               "name": "Uli Latukefu",
               "profile_path": "/7lds2oEjpYccuh7hMaMH1j2kWbA.jpg",
               "id": 1384511,
               "order": 12
            },
            {
               "cast_id": 56,
               "character": "Sarah Rosenthal",
               "gender": 1,
               "credit_id": "57df5c13c3a36808ec00c563",
               "name": "Tess Haubrich",
               "profile_path": "/dwiJxDrHCuIAjiMSk3M9j2wWXRj.jpg",
               "id": 1057485,
               "order": 13
            },
            {
               "cast_id": 134,
               "character": "Voice of 'Mother' (voice)",
               "gender": 1,
               "credit_id": "5917ba8392514156f503c5ec",
               "name": "Lorelei King",
               "profile_path": "/fCePl4nc105Na96L5SMbTfnroGs.jpg",
               "id": 7032,
               "order": 14
            },
            {
               "cast_id": 55,
               "character": "Xenomorph / Neomorph",
               "gender": 0,
               "credit_id": "57df5c0cc3a368095600ae11",
               "name": "Goran D. Kleut",
               "profile_path": "/ikAVxzlgo4bXQWn4GpoFfDrgnth.jpg",
               "id": 61784,
               "order": 15
            },
            {
               "cast_id": 133,
               "character": "Neomorph",
               "gender": 0,
               "credit_id": "58ea9252925141281007c7e0",
               "name": "Andrew Crawford",
               "profile_path": "/krq5P2obysllpJmTP8dvks2b0zp.jpg",
               "id": 1792879,
               "order": 16
            },
            {
               "cast_id": 59,
               "character": "Peter Weyland (uncredited)",
               "gender": 2,
               "credit_id": "585ff879c3a3681a680235c0",
               "name": "Guy Pearce",
               "profile_path": "/qB0BGUhMph48P1msl9wHRgL4AeT.jpg",
               "id": 529,
               "order": 17
            },
            {
               "cast_id": 58,
               "character": "Jacob Branson (uncredited)",
               "gender": 2,
               "credit_id": "584b301592514133b9003394",
               "name": "James Franco",
               "profile_path": "/m9he3UnbmAAxkV1XH2EmzkNfkaS.jpg",
               "id": 17051,
               "order": 18
            },
            {
               "cast_id": 162,
               "character": "Dr. Elizabeth Shaw (uncredited)",
               "gender": 1,
               "credit_id": "591ce04b9251414ab1011cd6",
               "name": "Noomi Rapace",
               "profile_path": "/xllWXMaKlPSQ9LUkG9niugX8vOx.jpg",
               "id": 87722,
               "order": 19
            },
            {
               "cast_id": 131,
               "character": "Xenomorph (uncredited)",
               "gender": 2,
               "credit_id": "58b816c49251412781008ca4",
               "name": "Javier Botet",
               "profile_path": "/4u8ZkMMt5ipQgfpb81YudFW5rQG.jpg",
               "id": 111090,
               "order": 20
            },
            {
               "cast_id": 169,
               "character": "Engineer (uncredited)",
               "gender": 0,
               "credit_id": "59980bedc3a3680ce100bc15",
               "name": "Benjamin Taylor",
               "profile_path": "/ceuoq3reh2jWH898Kii6QHDXVeT.jpg",
               "id": 1872492,
               "order": 21
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ae9c3a368484e16d6c1",
               "name": "Ridley Scott",
               "profile_path": "/oTAL0z0vsjipCruxXUsDUIieuhk.jpg",
               "id": 578,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "575d8502925141189e00158c",
               "name": "David Giler",
               "profile_path": null,
               "id": 915,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "575d850cc3a36837910001e7",
               "name": "Walter Hill",
               "profile_path": "/gCU3dgnNaZuvmArtBJgjCUMmimd.jpg",
               "id": 1723,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "575d8515925141536d0009ba",
               "name": "Mark Huffam",
               "profile_path": null,
               "id": 8401,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "575d8524c3a3681351002dbd",
               "name": "Michael Schaefer",
               "profile_path": null,
               "id": 22498,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "575d852f9251415dd20035e0",
               "name": "Ridley Scott",
               "profile_path": "/oTAL0z0vsjipCruxXUsDUIieuhk.jpg",
               "id": 578,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "575d855cc3a36836e5000262",
               "name": "Carmen Cuba",
               "profile_path": "/c6zX0b29FimnAQ6nkisWxYsCHvE.jpg",
               "id": 51922,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "575d856fc3a368451600129c",
               "name": "Chris Seagers",
               "profile_path": null,
               "id": 60579,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "575d857b92514124430028af",
               "name": "Damien Drew",
               "profile_path": null,
               "id": 962431,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "575d858c9251415dd20035fc",
               "name": "Charlie Revai",
               "profile_path": "/wXEFYR9DxXum9CuJTDje1AJcXx2.jpg",
               "id": 9583,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "575d85a5c3a3681351002dd8",
               "name": "Victor J. Zolfo",
               "profile_path": null,
               "id": 6055,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "575d85b19251414a82004867",
               "name": "Janty Yates",
               "profile_path": "/ixu9JLzHeHV8QrGXldMe4nxJ1ON.jpg",
               "id": 946,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "575d863a92514104230001e8",
               "name": "Dean Hood",
               "profile_path": null,
               "id": 1634544,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "575d86709251414a82004886",
               "name": "Raymond Kirk",
               "profile_path": null,
               "id": 1578651,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "575d883e9251415dd200367d",
               "name": "Steve Burg",
               "profile_path": null,
               "id": 74089,
               "department": "Art",
               "job": "Conceptual Design"
            },
            {
               "gender": 2,
               "credit_id": "575d884cc3a36879bb0009e9",
               "name": "Andrew Chan",
               "profile_path": null,
               "id": 1518775,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "575d88599251412443002945",
               "name": "Belinda Cusmano",
               "profile_path": null,
               "id": 1634555,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "575d8924c3a36836e500035a",
               "name": "Wayne John Haag",
               "profile_path": null,
               "id": 1634557,
               "department": "Art",
               "job": "Conceptual Design"
            },
            {
               "gender": 0,
               "credit_id": "575d8934c3a3684516001365",
               "name": "Dane Hallett",
               "profile_path": null,
               "id": 1634558,
               "department": "Art",
               "job": "Conceptual Design"
            },
            {
               "gender": 0,
               "credit_id": "575d894d925141244300297c",
               "name": "Mark Hatton",
               "profile_path": null,
               "id": 1634559,
               "department": "Art",
               "job": "Conceptual Design"
            },
            {
               "gender": 2,
               "credit_id": "575e81abc3a368455c00082e",
               "name": "Dariusz Wolski",
               "profile_path": "/4LD7NmEu1JV7TLLOsG6VJzhvz0t.jpg",
               "id": 120,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "588c88a99251413778007301",
               "name": "Rebecca Allen",
               "profile_path": null,
               "id": 1634542,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "588c88bb92514136d4007295",
               "name": "Lara Jade Birch",
               "profile_path": null,
               "id": 1585743,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "588c88d4925141376a0070c1",
               "name": "Lesley Vanderwalt",
               "profile_path": null,
               "id": 961143,
               "department": "Costume & Make-Up",
               "job": "Hair Designer"
            },
            {
               "gender": 0,
               "credit_id": "588c88e8c3a368111f00608b",
               "name": "Jennifer Stanfield",
               "profile_path": null,
               "id": 1401639,
               "department": "Costume & Make-Up",
               "job": "Key Hair Stylist"
            },
            {
               "gender": 0,
               "credit_id": "588c88fe925141370e006e93",
               "name": "Lesley Vanderwalt",
               "profile_path": null,
               "id": 961143,
               "department": "Costume & Make-Up",
               "job": "Makeup Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "592daa0992514139160004fc",
               "name": "Jack Paglen",
               "profile_path": null,
               "id": 1155661,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "592daa4a9251413912000525",
               "name": "John Logan",
               "profile_path": "/3yVu9Jda97tJlkijaL3wmSABWwo.jpg",
               "id": 932,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "588bcb84c3a368191e020383",
               "name": "Lauren Wild",
               "profile_path": null,
               "id": 1746248,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "588bcbbb9251410b92006096",
               "name": "Jacinta Leong",
               "profile_path": null,
               "id": 1391711,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "588bcbce9251410bc100644b",
               "name": "Ian Gracie",
               "profile_path": null,
               "id": 33195,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 0,
               "credit_id": "588bcc51c3a3683c3d0048f4",
               "name": "Merran Elliot",
               "profile_path": null,
               "id": 1746249,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "588bcc779251411bbe034549",
               "name": "Melina Burns",
               "profile_path": null,
               "id": 1470970,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "588bcc919251410bc1006536",
               "name": "Lizzy Jane Klein",
               "profile_path": null,
               "id": 1649534,
               "department": "Production",
               "job": "Researcher"
            },
            {
               "gender": 0,
               "credit_id": "588bccb69251410bef006024",
               "name": "Ebony Hardin",
               "profile_path": null,
               "id": 1746251,
               "department": "Production",
               "job": "Casting Assistant"
            },
            {
               "gender": 1,
               "credit_id": "588bccc8c3a368191e0204cc",
               "name": "Wittney Horton",
               "profile_path": null,
               "id": 1538204,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "588c80dbc3a368136e0059c7",
               "name": "Peter Beeh",
               "profile_path": null,
               "id": 1644252,
               "department": "Camera",
               "job": "Aerial Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "588c80f89251413834006793",
               "name": "P. Scott Sakamoto",
               "profile_path": null,
               "id": 1357066,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "588c8111925141370e0065ca",
               "name": "Damian Wyvill",
               "profile_path": null,
               "id": 1190661,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "588c8127925141376a0067be",
               "name": "Matt Toll",
               "profile_path": null,
               "id": 1527926,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 2,
               "credit_id": "588c8168c3a3680ffe005909",
               "name": "Andrew Johnson",
               "profile_path": null,
               "id": 1569342,
               "department": "Camera",
               "job": "Steadicam Operator"
            },
            {
               "gender": 0,
               "credit_id": "588c8194925141370e006669",
               "name": "Mark Rogers",
               "profile_path": null,
               "id": 1418310,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 2,
               "credit_id": "588c81c8c3a3680ffe005977",
               "name": "Shaun O'Dell",
               "profile_path": null,
               "id": 1399033,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 0,
               "credit_id": "588c81dbc3a368149200533e",
               "name": "Mal Booth",
               "profile_path": null,
               "id": 1746428,
               "department": "Camera",
               "job": "Dolly Grip"
            },
            {
               "gender": 0,
               "credit_id": "588c8210c3a3680e5f005de2",
               "name": "Mark Glindeman",
               "profile_path": null,
               "id": 1746429,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "588c822b9251413778006b0e",
               "name": "Mark Jefferies",
               "profile_path": null,
               "id": 1411238,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "588c824b92514137c3006b54",
               "name": "Theo Thomas",
               "profile_path": null,
               "id": 1746430,
               "department": "Lighting",
               "job": "Rigging Grip"
            },
            {
               "gender": 0,
               "credit_id": "588c825f925141383400693f",
               "name": "Toby Copping",
               "profile_path": null,
               "id": 1746431,
               "department": "Camera",
               "job": "Key Grip"
            },
            {
               "gender": 0,
               "credit_id": "588c8363c3a368131b005889",
               "name": "Anthony Smith",
               "profile_path": null,
               "id": 1721454,
               "department": "Visual Effects",
               "job": "2D Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "588c837e92514136af006c54",
               "name": "Gabriele Zucchelli",
               "profile_path": null,
               "id": 1453612,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "588c839b9251413778006cfc",
               "name": "Alexandre Ronco",
               "profile_path": null,
               "id": 1746432,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "588c83dcc3a3680b4f00616d",
               "name": "Alexandre Cancado",
               "profile_path": null,
               "id": 1746433,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "588c84189251413834006b86",
               "name": "Maxime Cazaly",
               "profile_path": null,
               "id": 1746434,
               "department": "Visual Effects",
               "job": "Creature Technical Director"
            },
            {
               "gender": 0,
               "credit_id": "588c842b9251413778006dcd",
               "name": "Francis Leong",
               "profile_path": null,
               "id": 1746435,
               "department": "Visual Effects",
               "job": "Creature Technical Director"
            },
            {
               "gender": 0,
               "credit_id": "588c8461c3a368111f005be4",
               "name": "Will Fife",
               "profile_path": null,
               "id": 1746436,
               "department": "Visual Effects",
               "job": "Creature Technical Director"
            },
            {
               "gender": 0,
               "credit_id": "588c8475c3a368131b0059bb",
               "name": "Victor Pillet",
               "profile_path": null,
               "id": 1746437,
               "department": "Visual Effects",
               "job": "Creature Technical Director"
            },
            {
               "gender": 0,
               "credit_id": "588c84aa925141370e006a24",
               "name": "Boyan Baynov",
               "profile_path": null,
               "id": 1746438,
               "department": "Lighting",
               "job": "Lighting Director"
            },
            {
               "gender": 0,
               "credit_id": "588c84d292514137c3006e7e",
               "name": "Spencer Fitch",
               "profile_path": null,
               "id": 1746439,
               "department": "Lighting",
               "job": "Lighting Director"
            },
            {
               "gender": 0,
               "credit_id": "588c84e9c3a3680e5f006129",
               "name": "Britton Plewes",
               "profile_path": null,
               "id": 1746440,
               "department": "Lighting",
               "job": "Lighting Director"
            },
            {
               "gender": 0,
               "credit_id": "588c84fd92514136d4006e20",
               "name": "Leonardo Bianchi",
               "profile_path": null,
               "id": 1746441,
               "department": "Lighting",
               "job": "Lighting Director"
            },
            {
               "gender": 0,
               "credit_id": "588c8513c3a3680cc100626b",
               "name": "Matthieu Paugam",
               "profile_path": null,
               "id": 1746442,
               "department": "Lighting",
               "job": "Lighting Director"
            },
            {
               "gender": 0,
               "credit_id": "588c852892514136d4006e55",
               "name": "Manjusha Balachandran",
               "profile_path": null,
               "id": 1746443,
               "department": "Lighting",
               "job": "Lighting Director"
            },
            {
               "gender": 0,
               "credit_id": "588c853cc3a3680ffe005d19",
               "name": "Elisabeth Leeb",
               "profile_path": null,
               "id": 1746444,
               "department": "Lighting",
               "job": "Lighting Director"
            },
            {
               "gender": 0,
               "credit_id": "588c857b9251413778006f6e",
               "name": "Manmath Matondkar",
               "profile_path": null,
               "id": 1746445,
               "department": "Visual Effects",
               "job": "Modeling"
            },
            {
               "gender": 0,
               "credit_id": "588c8597925141354b007023",
               "name": "Luke Wilding",
               "profile_path": null,
               "id": 1746446,
               "department": "Visual Effects",
               "job": "Modeling"
            },
            {
               "gender": 0,
               "credit_id": "588c85ce92514137c3006fd5",
               "name": "William Bell",
               "profile_path": null,
               "id": 1746447,
               "department": "Visual Effects",
               "job": "Modeling"
            },
            {
               "gender": 0,
               "credit_id": "588c8613c3a3680e5f00627b",
               "name": "Dan Oliver",
               "profile_path": null,
               "id": 1746449,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "588c8663c3a368131b005bdf",
               "name": "Jason McDonald",
               "profile_path": null,
               "id": 1466454,
               "department": "Visual Effects",
               "job": "Pre-Visualization Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "588c869c9251413834006e63",
               "name": "Lukasz Bukowiecki",
               "profile_path": null,
               "id": 1461629,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "588c86aec3a368131b005c23",
               "name": "Paolo Buzzetti",
               "profile_path": null,
               "id": 1444969,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "588c86c6c3a368136e0060b1",
               "name": "Mark Carr",
               "profile_path": null,
               "id": 1384371,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "588c86efc3a368131b005c59",
               "name": "Sona Pak",
               "profile_path": null,
               "id": 1574096,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "588c870a925141354b0071b0",
               "name": "Tomi Nieminen",
               "profile_path": null,
               "id": 1595166,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "588c875592514136d40070cf",
               "name": "Charley Henley",
               "profile_path": null,
               "id": 1368871,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "588c877292514137c30071b4",
               "name": "Rachael Tate",
               "profile_path": null,
               "id": 1459875,
               "department": "Sound",
               "job": "ADR Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "588c8789c3a3680e5f0063da",
               "name": "Derek Casari",
               "profile_path": null,
               "id": 1432596,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 0,
               "credit_id": "588c87a6c3a3681492005954",
               "name": "Judah Getz",
               "profile_path": null,
               "id": 1737654,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 0,
               "credit_id": "588c87e392514137c3007237",
               "name": "Sue Harding",
               "profile_path": null,
               "id": 1079085,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "588c8802925141354b0072b1",
               "name": "Oliver Tarney",
               "profile_path": null,
               "id": 1408373,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "588c8819c3a3680b4f0065ad",
               "name": "Dillon Bennett",
               "profile_path": null,
               "id": 1408374,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "588c8845c3a368136e00623c",
               "name": "Paul Massey",
               "profile_path": null,
               "id": 113073,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "588c885c92514136d4007228",
               "name": "Oliver Tarney",
               "profile_path": null,
               "id": 1408373,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "588c8921c3a368111f0060c9",
               "name": "Tess Natoli",
               "profile_path": null,
               "id": 1418802,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "588c893792514136af007300",
               "name": "Lesley Vanderwalt",
               "profile_path": null,
               "id": 961143,
               "department": "Costume & Make-Up",
               "job": "Makeup Designer"
            },
            {
               "gender": 0,
               "credit_id": "588c89ac92514136af007389",
               "name": "Mark Campbell",
               "profile_path": null,
               "id": 1746451,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "588c8a15925141370e006fb3",
               "name": "Bronwyn Doughty",
               "profile_path": null,
               "id": 1746452,
               "department": "Costume & Make-Up",
               "job": "Costume Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "588c8a2bc3a368136e006446",
               "name": "Maria Salcher",
               "profile_path": null,
               "id": 1746453,
               "department": "Costume & Make-Up",
               "job": "Costume Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "588c8a44c3a3681492005c12",
               "name": "Sarah Robinson",
               "profile_path": null,
               "id": 1334493,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "588c8a619251413834007295",
               "name": "Robyn Elliott",
               "profile_path": null,
               "id": 1355543,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "588c8a9092514136d40074b1",
               "name": "Anna Burstall",
               "profile_path": null,
               "id": 1746454,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "588c8aa4c3a3680b4f00683d",
               "name": "Ivana Daniele",
               "profile_path": null,
               "id": 1746455,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "588c8acf925141370e007082",
               "name": "Dan Owen",
               "profile_path": null,
               "id": 1746456,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "588c8aef92514137c30075d5",
               "name": "Anna Haigh",
               "profile_path": null,
               "id": 1746457,
               "department": "Costume & Make-Up",
               "job": "Costume Illustrator"
            },
            {
               "gender": 0,
               "credit_id": "5917bafe92514156f503c652",
               "name": "Michael Fentum",
               "profile_path": null,
               "id": 1335556,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "5917bb2792514159c1039fb1",
               "name": "Jack Stew",
               "profile_path": null,
               "id": 1393300,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "5917bc3592514159c103a0d6",
               "name": "Cheryl Potter",
               "profile_path": null,
               "id": 1816348,
               "department": "Editing",
               "job": "Additional Editing"
            },
            {
               "gender": 0,
               "credit_id": "5917bc5f925141572303c6d8",
               "name": "Justin Tillett",
               "profile_path": null,
               "id": 1816349,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "5917bc83c3a36842c103cfd8",
               "name": "Laurence Johnson",
               "profile_path": null,
               "id": 1459937,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "5917bc9c925141572303c705",
               "name": "Mary Barltrop",
               "profile_path": null,
               "id": 1401743,
               "department": "Production",
               "job": "Location Manager"
            },
            {
               "gender": 0,
               "credit_id": "5917bcabc3a36840aa036a71",
               "name": "Jeremy Peek",
               "profile_path": null,
               "id": 1816350,
               "department": "Production",
               "job": "Location Manager"
            },
            {
               "gender": 0,
               "credit_id": "5917bcbb92514159c103a140",
               "name": "Tony Lewis",
               "profile_path": null,
               "id": 1338287,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "5917bcd6925141572303c736",
               "name": "Alex Ferguson",
               "profile_path": null,
               "id": 158596,
               "department": "Sound",
               "job": "Assistant Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "5917bcf0c3a36840aa036aaa",
               "name": "Arabella Winter",
               "profile_path": null,
               "id": 1816351,
               "department": "Sound",
               "job": "Assistant Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "5917bd49c3a36842d603d274",
               "name": "Ben Ruffell",
               "profile_path": null,
               "id": 1816353,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "5917bd85925141572303c7e7",
               "name": "Dante Harper",
               "profile_path": null,
               "id": 231826,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5917bda0925141580d03b4a2",
               "name": "Dan O'Bannon",
               "profile_path": "/slLZWXZ1lmdF763166ATRRI200n.jpg",
               "id": 5045,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "5917bdaf925141061e03432e",
               "name": "Ronald Shusett",
               "profile_path": null,
               "id": 5046,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "5917be2ac3a3683fb6038214",
               "name": "Danielle Blake",
               "profile_path": null,
               "id": 1816354,
               "department": "Directing",
               "job": "Second Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5917be3f925141585203c251",
               "name": "Claire Frayn",
               "profile_path": null,
               "id": 1816355,
               "department": "Directing",
               "job": "Third Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5917be53c3a368426903e800",
               "name": "Claire Frayn",
               "profile_path": null,
               "id": 1816355,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 0,
               "credit_id": "5917be70925141585203c28a",
               "name": "Sarah Hood",
               "profile_path": null,
               "id": 1816356,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 0,
               "credit_id": "5917be80c3a36840aa036bfe",
               "name": "Sarah Hood",
               "profile_path": null,
               "id": 1816356,
               "department": "Directing",
               "job": "Second Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5917be8e92514156f503c9a9",
               "name": "Scott Lovelock",
               "profile_path": null,
               "id": 1805808,
               "department": "Directing",
               "job": "Second Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5917bea2c3a36840aa036c1c",
               "name": "Matthew Webb",
               "profile_path": null,
               "id": 1816357,
               "department": "Directing",
               "job": "Third Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5917beaec3a36842d603d40e",
               "name": "Greg Tynan",
               "profile_path": null,
               "id": 1805809,
               "department": "Directing",
               "job": "Third Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5917bed2c3a3683fb60382be",
               "name": "Dion Boothby",
               "profile_path": null,
               "id": 1816358,
               "department": "Art",
               "job": "Set Dresser"
            },
            {
               "gender": 0,
               "credit_id": "5917bef2c3a3683a93039937",
               "name": "Tony Drew",
               "profile_path": null,
               "id": 1816359,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "5917bf06925141572303c96c",
               "name": "Andrew Kattie",
               "profile_path": null,
               "id": 1816360,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "5917bf14c3a36842c103d281",
               "name": "Kate McCowage",
               "profile_path": null,
               "id": 1816361,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "5917bf23c3a36842c103d293",
               "name": "Alasdair Mott",
               "profile_path": null,
               "id": 1816362,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "591f83739251414990039e3d",
               "name": "Jed Kurzel",
               "profile_path": null,
               "id": 549315,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "591ff0cf9251414990041a31",
               "name": "Jed Kurzel",
               "profile_path": null,
               "id": 549315,
               "department": "Sound",
               "job": "Music Director"
            },
            {
               "gender": 2,
               "credit_id": "592da9c092514139160004bf",
               "name": "Michael Green",
               "profile_path": "/oXmMv1vlJf2G9xWwCXBPrRY50EV.jpg",
               "id": 191937,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5939c4099251411f1b0012ff",
               "name": "Kyle Gardiner",
               "profile_path": null,
               "id": 1830633,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 1,
               "credit_id": "59c04577c3a36804ec004145",
               "name": "Julie Payne",
               "profile_path": null,
               "id": 1247285,
               "department": "Crew",
               "job": "In Memory Of"
            },
            {
               "gender": 2,
               "credit_id": "5a74f6cb0e0a26643302aad0",
               "name": "Pietro Scalia",
               "profile_path": "/kcQTeWNVqDg0h1jzthF21TxRB9U.jpg",
               "id": 950,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 29.632608,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "NZ",
            "name": "New Zealand"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 126889,
      "vote_count": 3600,
      "budget": 97000000,
      "overview": "Bound for a remote planet on the far side of the galaxy, the crew of the colony ship 'Covenant' discovers what is thought to be an uncharted paradise, but is actually a dark, dangerous world – which has its sole inhabitant the 'synthetic', David, survivor of the doomed Prometheus expedition.",
      "similar": [
         348,
         157336,
         274870,
         384521,
         8077,
         7453,
         831,
         8078,
         19995,
         118340,
         644,
         330459,
         228161,
         679,
         33155,
         19761,
         22825,
         15493,
         2103,
         27727
      ],
      "original_title": "Alien: Covenant",
      "runtime": 122,
      "poster_path": "/zecMELPbU5YMQpC81Z8ImaaXuf9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/6Ry6uNBaa0IbbSs1XYIgX5DkA9r.png",
            "name": "Scott Free Productions",
            "id": 1645,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Brandywine Productions",
            "id": 19747,
            "origin_country": ""
         },
         {
            "logo_path": "/qx9K6bFWJupwde0xQDwOvXkOaL8.png",
            "name": "TSG Entertainment",
            "id": 22213,
            "origin_country": "US"
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "2017-05-09",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": "/cK83Pq8SJoeSTnLJucr8IWn35KF.jpg",
         "name": "Prometheus Collection",
         "id": 135416,
         "poster_path": "/gMjiXB5dhV8nN77xXnhTIhARE7a.jpg"
      },
      "tagline": "The path to paradise begins in hell",
      "adult": false,
      "homepage": "https://alienuniverse.com/alien-covenant",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ridley Scott"],
      "runtime": 122,
      "synopsis": "In a prologue, business magnate Peter Weyland speaks with his newly activated android, who chooses the name \"David\" after observing a replica of Michelangelo's statue of David. Weyland tells David that one day they will search for mankind's creator together. David comments on his own unlimited lifespan compared to his creator's limited one. In 2104, 11 years after the Prometheus expedition, the colonization ship Covenant is bound for a remote planet, Origae-6, with a crew of 15, two thousand colonists in stasis and 1,140 human embryos aboard. The ship is monitored by Walter, a newer android model that physically resembles David. A stellar burst damages the ship, killing 47 colonists. Walter orders the ship's computer to wake the crew, which includes several married couples. The ship's captain, Jake Branson, is burned alive when his stasis pod malfunctions. While repairing the ship, the crew picks up a radio transmission from a nearby, habitable planet. Against the objections of Daniels (Branson's widow), the new captain, Oram, decides to investigate. As the Covenant remains in orbit, an expedition team descends to the earth-like planet's surface and tracks the transmission's signal to a crashed alien ship. Crew members Ledward and Hallett are infected by alien spores. Oram's wife Karine helps the rapidly-sickening Ledward back to the lander where Maggie, the pilot, quarantines them both inside the med-bay. A small, pale, alien creature (neomorph) bursts from Ledward's back, killing him, and then kills Karine. Maggie attempts to kill the creature with a shotgun, but triggers an explosion which kills her and destroys the lander. The neomorph escapes while a similar creature bursts from Hallett's mouth. The neomorphs attack the remaining crew members and kill one. The crew manages to kill a neomorph before David, who survived the Prometheus mission, scares away the other, and leads the crew to a temple in a city full of humanoid (Engineer) corpses. David tells them that upon his and fellow Prometheus survivor Elizabeth Shaw's arrival at the planet, their ship released a black liquid bio-weapon which annihilated the native population and that Shaw died when the ship crashed in the ensuing chaos. After the crew members tell David of their mission, they attempt to contact the Covenant but are prevented by fierce storms. The surviving neomorph infiltrates the structure and kills crew member Rosenthal. David tries to communicate with the creature, but is horrified when Oram kills it. Oram questions David who reveals that the aliens are a result of his experimenting with the black liquid in an attempt to create a new species. He manipulates Oram into being attacked by an alien parasite (facehugger). An alien creature (xenomorph) later erupts from Oram's chest, killing him. As the others search for Oram and Rosenthal, Walter, who has found Shaw's dissected corpse, confronts David. David explains that he believes humans are a dying species and should not be allowed to colonize the galaxy. When Walter disagrees, David disables him, and threatens Daniels. Walter recovers (being a superior model capable of self-repair) and confronts David while Daniels escapes as they fight. A facehugger attacks security chief Lope, but he is later rescued by crew member Cole. The now fully grown Xenomorph appears and kills Cole, while Lope escapes and meets up with Daniels. Pilot Tennessee arrives in another lander to extract Daniels, Lope, and Walter, who claims David has \"expired\". After an encounter outside the ship, they kill the Xenomorph and return to the Covenant. The next morning, Daniels and Tennessee find out that another Xenomorph burst from Lope's chest, killing him, and is loose on the Covenant. It matures, and kills crew members Ricks and his wife Upworth. Tennessee and Daniels lure the creature into the Covenant's terraforming bay and flush it into space. The Covenant resumes its trip to Origae-6, and the surviving crew re-enters stasis. As Walter puts Daniels under, she realizes that he is in fact David, but is unable to escape her stasis pod before falling asleep. David regurgitates two facehugger embryos and places them in cold storage alongside the human embryos before entering the cargo bay containing the colonists in stasis. He then poses as Walter to record a log stating that all crewmembers except Daniels and Tennessee were killed by the neutrino blast at the beginning of the film and that the ship is still on course for Origae-6.",
      "writers": [
         "Dan O'Bannon",
         "Ronald Shusett"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2316204/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNzI5MzM3MzkxNF5BMl5BanBnXkFtZTgwOTkyMjI4MTI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Michael Fassbender",
         "Katherine Waterston",
         "Billy Crudup"
      ],
      "reviews": [
         "So once again, after the debacle of Prometheus, Ridley Scott has proved himself simultaneously a master of visuals and yet utterly incompetent when it comes to creating a believable Alien story. The single biggest problem I had with Prometheus was the collection of imbeciles and weirdos that made up the crew, and one might have hoped that Mr Scott would have realised that himself and made amends this time round. Errr.... no, sadly not. Once again we're treated to a crew of simpletons who make THE MOST pathetic and unbelievable decisions possible. Are we really supposed to believe that a crew would just ditch it's primary mission (that we're told had been over 10 years in the planning to ensure their destination was safe, etc) just because they happened to stumble on a new planet purely by chance? Just plain ludicrous. And that's just the start. A few more examples : Assuming we suspend our disbelief and accept the whole \"let's risk all the colonists and everything we have planned for decades for to land on this new unknown planet instead\" premise, why do these alleged scientists once again TOTALLY disregard the need for any protective clothing? So no breathing equipment, nothing at all to protect them from any alien pathogens. Good thinking! Faced with a choice of sending either an android, or pretty much the entire human crew with no protective gear, to investigate an alien world, who should go? Yeah that's right, send all the unprotected humans! Choice of landing right near the source of the unknown signal, or land several miles away and in a foot of water despite there being solid and flat ground a few feet away? Yep, it's wet feet and a huge hike all round folks! Little alien pods on this alien world puffing their alien spores into the air? Sure, just get your nose in there and have a good sniff. I'm sure it'll be fine! Crewmen get infected by said spores? Don't worry about any quarantine procedures, just carry them back to the ship while getting covered in their vomited-up blood. Alien organism just burst out of said infected crewman? Just open up the locked door and try to shoot it, but be careful you don't miss at point blank range and then slip up on the blood.... twice. (When that happened, people actually laughed in the cinema. I was half expecting a comedy sound effect the second time!) Tens of thousands of dead bodies, and an enormous dead city solely inhabited by David the android from the Prometheus mission, that the planetary scan managed to NOT pick up from orbit when determining the planet to be \"safe\"? No need to ask David what happened, just accept that it's all fine. Dark basements to go into all on your own? Do it! Nothing bad will happen. Huge alien eggs opening in front of you? Just have a good look inside. What could possibly go wrong?! The list of stupid decisions just goes on and on AND ON! While visually the film is generally excellent, the all-CGI-Alien was a huge let-down. Personally I found it considerably less convincing than the practical effects used in Alien and Aliens, which is unforgivable considering the creature is what these films are all about! Additionally the crew, apart from being imbeciles (as is usual under Mr Scott's direction these days), are also completely forgettable. I saw this movie last night and I can't remember a single character's name today. The one exception is David/Walter, and once again Fassbender does a great job. (Perhaps that's why there's two of them - to make up for a lack of any other decent characters). The other problem narrative-wise is that both Prometheus and Covenant have actually served to make the Alien universe much SMALLER in my opinion. In the original Alien and Aliens, the creature was just an unknown organism from the far reaches of the universe, and all the more scary because of it. (The same went for the Space Jockey for that matter). But these new movies have tried to tie it all back to humanity in some way - i.e. the Engineers (who are also the Space Jockeys) created both humanity and the black oil virus, and then the Xenomorph was apparently created by David (who was in turn created by man) somehow doing some genetic tinkering with the black oil and human DNA, while living in a cave and playing with his flute. Far from expanding the Alien universe, both these prequels have actually shrunk it by making man the centre of everything, while at the same time managing to sanitise and neuter one of the greatest movie creatures of all time. So what Ridley Scott is saying is that the entire Alien series and the iconic Xenomorph itself was just created by a deranged android with God/daddy issues. How very pathetic and disappointing. I personally hate it when movies try to explain everything to the millionth degree because it invariably ends up as a massive anticlimax. What was wrong with the Xenomorph just being some hideous unknown life-form from the far reaches of space??? I could go on and on, but there's a word limit here. Lastly, the end is just pretty feeble and anticlimactic. The CG- Alien just kind of gets killed and that's it. And the *ahem* \"twist\" with David/Walter could be seen from a mile away, although David wouldn't have had anywhere near enough time to cut his own arm off and change his clothes and hairstyle. Please PLEASE Mr Scott, stand aside and let Neill Blomkamp have his shot at an Aliens sequel. A generous 2 Stars. One for the visuals that are once again gorgeous, and one for a great effort from Fassbender.",
         "It seems that in 'Alien: Covenant', Ridley Scott and his writers tried to use the best loved elements from previous Alien installments to appease those fans of the franchise who hated 'Prometheus' - but perhaps also to camouflage their intention to make a far meaner and less conventional blockbuster than what modern audiences (and studios) are willing to accept in this age of superheroes. It was my impression that what on the surface appears to be a very straight forward - and some might even say derivative - retread of familiar story beats is actually just a ploy to delve even deeper into the themes explored in 'Prometheus'. Because 'Alien: Covenant' not only continues to \"dissect\" the creator/creation/creature dynamic: it brings the android David's storyline to its perverse, if somewhat logical, conclusion. Now if you hated 'Prometheus', or just dismissed it as a dumb movie where most characters are stupid and nothing is explained or makes sense, you won't find much to like in the less conventional story elements in 'Alien: Covenant', and you might as well stop reading this review now (btw, if you still have questions about 'Prometheus', you'll find a link to an article explaining everything by clicking on my username). But if you DID like it - or at least found its maliciously ironic religious subtext and musings on creation fascinating - you'll probably find some aspects of 'Alien: Covenant' highly enjoyable. As you might recall, the cycle of creation depicted in 'Prometheus' goes as follows: the Gods (aka \"the Engineers\") create mankind - mankind creates David - David in turn starts to experiment on his creators (the humans) in order to create something new. The totally insane - and hilariously mean spirited - continuation/escalation of that cycle in 'Alien: Covenant' (beware: spoilers abound for the whole movie follow): David's ambition to make the jump from creation to creator has grown exponentially; it now entails nothing less than to exterminate the Gods, as well as experimenting on them - which makes him kind of hard to top in the mad scientist (or mad killer robot) department. By killing the Gods, he, the unworthy machine and \"2nd class\" creation conquers \"Paradise/Heaven\" and becomes the sole creator (humans are degraded to the status of lab-rats), thereby closing the cycle started in 'Prometheus'. Admittedly, the film is uneven in terms of story and pacing - but I admire its ambition. 'Alien: Covenant' is a fascinating hybrid which somehow halfway through its running time turns from relatively straight sci-fi and very familiar Alien terrain into a brooding, Gothic horror film (at least for a while before it turns back into a more conventional sci-fi/action film). In the Gothic part of the film, the man-made monster/creature (David) has turned the table and assumed the role of Dr. Frankenstein to make creatures of his own design. These creatures - who appear to be the first actual Xenomorphs - reflect and reveal who/what David really is and how deceiving his human looks are. For although he inherited some very human traits from his creator (emotions, curiosity, ego, the urge to create - among others) he is still a machine adhering to a logic that is ultimately as alien (pun intended) to a human being as the Xenomorph itself - and as lethal. Which is why it makes complete sense that David is the \"designer\" of this perfect, machine-like organism (Swiss artist H.R. Giger, who created the original Alien, called it \"biomechanoid\" for a reason). In 'Alien: Covenant', David is the humans' - and humanity's - ultimate adversary; in fact, for the purpose of the story told in the film, he is the Devil (he even quotes Satan's famous lines from John Milton's epic poem 'Paradise Lost'). Now if the Devil in this tale were to create life in HIS own image (his REAL image - for David was only given human features to make interaction with him more \"comfortable\" for the humans), surely, he would create demons: and isn't the Xenomorph the ultimate demon sprung straight from the darkest pits of Hell? That 'Alien: Covenant' is essentially a riff on Milton's 'Paradise Lost' was the most surprising aspect of the film for me. David's story-line follows Satan's (quite literal) ascent to Heaven (Paradise), where he kills the Gods and starts his own rule, thus turning it into Hell and ending the age of man (and for those of you who think I'm reaching a little here: the film's title was originally supposed to be 'Alien: Paradise Lost'). Now regardless whether you liked the film or not, you have to admit: that's not exactly the texture of a generic, conventional blockbuster, right? At the end of the film, David is aboard the spaceship Covenant - which he has turned into a perverted version of Noah's Arch - and travels to a new world where he plans to start his new version of Genesis. He might even start a new religion: the Bible as written by a mad killer robot with a god complex (just think about how crazy demented - and completely wonderful - that sounds). Imagine the Lovecraftian nightmare he will create and what creatures will populate \"his\" version of Earth. I would love a sequel to 'Alien: Covenant' to take us there and finally fully descend into madness. It would be the logical next step: after the human protagonists visited an angry god in 'Prometheus' who wanted to destroy humanity, and then discover that Heaven is empty and the Gods are all dead in 'Alien: Covenant', they should next visit the Devil in his newly created Hell. My suggestion for a title: 'Alien: Genesis'. Favorite films: IMDb.com/list/mkjOKvqlSBs/ Lesser-Known Masterpieces: imdb.com/list/ls070242495/ Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/ Favorite TV-Shows reviewed: imdb.com/list/ls075552387/",
         "After watching Prometheus I was looking forward to Alien Covenant, big mistake. When you can guess the ending of a film early on, are aware of the SLOW passage of time when watching it and don't give a flying f*#k about the characters and you suddenly realise you are actually BORED you know you have a dud. Yeah, big budget, impressive scenery but no new ideas here folks. It's like the writers didn't care anymore. \"Hey, we'll make money out of this no matter what let's just chuck a bunch of derivative s@#t in the script, no one will notice\". One word...PREDICTABLE.",
         "This movie is not worth the money. Its the worst Alien movie i have seen and i have seen all Alien (xenomorphs) movies. You don't care about the characters and they are so god damn stupid all the time! My god its an insult to watch and they flushed all the lore down the drain. This movie is about droids and not aliens or the engineers. It does not explain anything at all and it totally kills Prometheus handling. Im happy Sigourney Weaver did not sign up for this crap.",
         "I started going to the movies when I was about 8 or 9 years old. I am now 71 years old. My oldest daughter and I have tried to get to the newest movie, every weekend, for the past 35 years. When watching movies, I never complain about the actor/actress in the movie. My concern is the writer/director of the movie. Acting,now, is like working at McDonald's was when I was growing up. There is so much money involved in movie making that with a few classes, young people can make a living in the movie industry. I have a nephew, living in L.A., that started right out of high school working with a crew that puts \"set's\" together for movies and TV. He even got credit at the end of some of the movies he worked on. Amazing that a person can get credit for putting furniture on and off a set. I put in my summary that I was not just disappointed in this movie, but angry. I am not angry at the movie, the actor's, the CGI, or the Director. I think that I am angry at the movie industry for allowing this kind of crap to be put in the theater. I am angry, because I actually paid money to see this piece of crap. I am angry because Riddley Scott promised so much more. I thought that \"Prometheus\" was actually pretty good,despite it flaws. It was a movie about possibilities and that is what science fiction is for. The possibilities ended when the mentally Ill android, destroyed the Engineers. I am now done with this series of movies, there is no more story to tell. A mentally ill human (Weyland), created a mentally ill android (David), who created Xenomorphs that kill humans. That's it folks, the story is over,no need for two more pieces of crap like this. Thanks to Alien Covenant, I am done going to the movie theater. I will not pay another dime to go to the theater. We movie lovers are being abused by the movie industry. I have told you a better story in less than a thousand words then this piece of crap told anyone on planet earth. Ridley had 97 Million dollars to tell us a better story and he didn't. If you have not paid to see it, don't pay to see it. Wait until it comes to your steaming device and see it for free. That way you can't be disappointed or angry. Please forgive the rambling.",
         "How in God's name did Scott make a worse movie than \"Alien 3\"? And then Rotten Tomatoes reviewers gives it a Fresh rating to boot. Any skepticism I've had for that rating site being an accurate barometer has imploded. This movie is a masterful mess. The worse thing Scott has ever done. I won't step too much into the plot, as others have already given the best parts of comical nonsense away. Only to say this, the movie begins with a captain of the ship, who...is a free rock climber...who takes a selfie video with one hand on the rock...nearly falling. This is the man they initially send to guide a ship with \"terraformers\" to set up a society. Then the second in charge...he answers a random beacon and decides it is a better course of action to follow up on that rather than stay the course. Dumb beyond belief. I am through with Scott. I've been a fan for decades, but the slide is real. Like painfully real. He is treading not only over similar material, he is gutting it and leaving the fans to rot in the sun. This is the worse of the series and everyone involved should be ashamed. A true crime of a movie.",
         "After the amazing Alien and Aliens, (and I believe the hard done by Alien 3), we had a string of utter tripe from this franchise, and this is no better. Character development is almost non existent, with the vast majority of people there simply to die. Danny Mcbride might as well have had a leash on him, for all the acting he was allowed to do, and James Franco showed more charisma than anyone else in the movie...and he died before even having a speaking role. The film has gone down this ancient feel/setting, which didn't work in AVP, or Prometheus, and just flat out bores to death in this film. And the \"twist\" at the end was so obvious that there was an audible \"DUH\" and \"NO SH*T\" from onlookers in the cinema during the reveal. Ridley Scott's last two films have led me to believe a couple of things. 1. He can't do jack without a GREAT script 2. His movies look good, but are boring as hell 3. Alien was a fluke! It was a mess of ideas that all came together and somehow worked, but that was by accident and not design...or at least not by Scott's design. Unless Cameron, or possibly Blomkamp (hell even give David Fincher another go) get involved, or perhaps someone equally as talented, we're just going to see Ridley Scott spew his old man, self indulgent philosophical man juice all over our faces for the foreseeable future It was an OK by film standards...but by an Alien film standards it was pure muck. And a final note. A TWIN ANDROID FIST FIGHT AKIN TO X-MEN belongs nowhere near an Alien move.",
         "I'm a huge Alien fan and was massively impressed by Prometheus, and like all avid Alien fans I was excited to see Convenant - but what an utter disappointment. I thought the beginning was spectacular, except for the fact an obvious and critical error was made to explore an unknown planet. Then the face-palm moments increased at an alarming pace. The scene where the first Alien was born, and the events leading up to it, was simply painful to watch. e.g. why would a specially trained scientist hug a clearly infected soldier while he's having a seizure and bleeding all over the place? simple - poor writing. I have to say the moment when the 2 Aliens attacked from the bushes was intense and highly suspenseful, but that was the only relief before it was obvious I'd wasted my money. The fact that David was scarier than the Aliens, that one idiotic decision was made after the other, and that many questions after Prometheus were left unanswered - make Alien Covenant a monumental failure. What a crying shame.",
         "I don't really know what to say. I am such a fan of Alien, this movie truly offends me. It's intellectually offensive and insults the audience - especially fans familiar with Alien/Aliens. I really just want to vote and bring the score down for this horrible movie. Others have already said it. The biggest problem is that the plot is idiotic. Worst writing ever. Prometheus had problems, and instead of addressing those problems in sensible ways that take us back to the meat and potatoes of the Alien narrative, which is, you know, THE ALIEN, it does the opposite, and leaves all those problems in place and then makes them even worse. Did Alien3 make you mad? Alien4? This movie will make you even madder! It's not about a personal preference that things be changed here or there, from beginning to end the movie is a confused mess. The writers are trying to do way too much. The writers also think the audience is stupid and can't figure certain things out for themselves. But then the writers also don't bother trying to fill in some logic huge holes that deserve some answers. Without spoilers it's difficult to get into specifics. The thing that is really bad is that this movie is a prequel. So we're supposed to be filling in story gaps that lead into the movies we already know and love, Alien/Aliens. This movie creates a narrative that is insulting to those films. The origin of this awesome Alien character? I'm not sure why that is something which needs to be answered to begin with, but, oh, turns out, some jackass that didn't get enough hugs as a child decided to create it out of boredom. Yep, that's it. Oh, well thanks for making a whole movie to tell the story of this stupid idea. This movie takes the great \"xenomorph\" character and basically neuters it. Nothing special. Just the invention of a lunatic. What was Scott thinking, seriously? Here is our alpha character, the scariest science fiction villain of all time, chop off the testes, replace it with an annoying android/robot with daddy issues that won't shut up and then give it the dumbest/cheesiest dialog ever. And then of course the movie then also has the characters doing things that defy logic/common sense. Similar to Prometheus where Charlize Theron is running away from a huge wheel in a straight line rather than, I don't know, turning left or right or something. Or morons marooned in a cave that decide it's a good idea to play with an alien snake. Except worse. Situation after situation things like this happen that insult you. Nobody, even the dumbest of the dumb, would act like this. Much less professionals who are elite members of a crew traveling across the galaxy to colonize another planet. Everything that happens is easily avoided. Beside insulting you in every way imaginable with the completely stupid plot, the movie is just boring. There isn't much action at all. If you are hoping to see the Alien doing what it does best, kick butt, forget it. And instead of giving us the alien we know and love, which is scary and realistic, they come up with a variety of other CGI aliens which look very different, fake, and not scary. And there is no rhyme or reason for any of it. I'm not interested in DNA experiments and the creation of these other spin off aliens... I want THE ALIEN. I'm shocked to be honest. I don't understand how Ridley Scott can possibly be so detached from reality. Is the man sub intelligent? I'm serious. Whoever wrote this is a literal idiot. I don't know how else to say it. If the Alien franchise didn't already exist, nobody would watch this movie. It's nonsense from beginning to end. This isn't even an Alien movie. What is it? I don't know. It was nothing but confusion. A wannabe Blade Runner/android/robot movie?",
         "Dear Ridley Scott, You've ruined my life, you've ruined the lives of others, you've ruined your own life. I genuinely think you have a mental disorder. It's the only explanation. I have no words. I tried to write a fair, logical and critical review, but the 10,000 character limit wasn't enough to cover the sheer volume and perplexity and magnitude of brain hurting plot holes, editing, directing, story, acting and absurdity of the nonsensical destruction of the very thing you created. If I had the rest of your life to sit and explain the utter repugnance and absurdity of every choice you have made, it would still not be enough. Everything, is wrong. Even your own wrongs are wrong about the wrongs you've already wronged. I'm speechless. I'm just going to breath. Breath and try to remain calm as I remove every piece of Alien: Covenant and Prometheus from my mind. I feel dirty and infected, repulsed by this miasma of psycho vomit you have inflicted upon me. My brain feels like the magical, inexplicable, story excusing black ooze... that's sometimes dust... and sometimes from insects... and sometimes is used as a plot device to explain absolutely nothing, and destroy people in vastly conflicting and apparently never ending ways, including itself. Perhaps from the ashes of my DNA, new life will be made. But apparently, not all the time. So I don't even have hope. Clearly, nothing makes sense anymore. Yours sincerely",
         "This movie is an insult, not only to Alien fans but to each and every cinephile. Hollywood has been happily churning out a lot of garbage lately, it's all about the money, they just bank on the name, doesn't matter if it's good or not as long as they make a profit. Hope this one loses money, I feel bad cause I got suckered into going opening day. Like the video game crash of 1983, maybe one day, one day soon there will be a movie industry crash when people won't even bother going to see any more crappy sequels/prequels, unnecessary reboots, and other misleading bad creations of Hollywood, this is not entertainment, it's a just a kick in the brain. I feel bad for every Alien fan out there, I found nothing to enjoy here. The direction they took the Alien lore is just... dull, even Prometheus was more enjoyable. Alien Covenant - a waste of talent, time and money. (This is my second review, I wrote more harsh things and it got deleted)",
         "I have to say. I was more eager than ever to see this film. The trailers were great (if not slightly spoiler filled) I was super keen on seeing Danny McBride playing a serious role, and I was more than eager to see something that would pull the Alien up from the nose dive it have become. But when the credits rolled, oh man was I disappointed. This movie is actually a massive step down from Prometheus. The problems with this film are vast, but some struck me more than than others. For one, it actually felt amateur. Considering Ridley Scott made the iconic origin film, it's hard to understand how tragically he has failed to grasp what makes the Alien film great. There is no slow burn atmosphere here. No tension build up. No creepiness to the xenomorph itself. It just fails to do anything that the predecessors do. The film also makes the same mistakes as Prometheus did, by giving the characters terrible motives or at best, strange decision making capabilities. Nothing really makes sense. There are so many times where you wonder to yourself, 'if this is suppose to be such an important mission, why are they making such ridiculous choices?' My next big gripe is with the visual effects. They are awful. Again, a huge step down from Prometheus (which at least had that going for it). The action scenes with the xenomorph were spastic and often hard to follow. Characters were plain, story was beyond boring, plot was ill thought out, and the only likable character who makes sense is the villain! It just failed overall to make a decent movie, and I am tired about giving movie justice just because 'at least the effects were good' or 'at least the sound was great'. If the film can't stand up with its own story, then it is a bad film. And as sorry as I am to say, this is a bad film. Neill Blompkamp should be handed the reins, as at least he has vision which could benefit the franchise.",
         "a crew responsible for thousands should contain only the smartest people. here nobody ever heard of quarantine or security protocols. the plot is boring and predictable (last 10 minutes of the film make you: \"facepalm\"). you also have two class quality visuals fx that range from poor to really good. sry as hard as i think, there is absolutely nothing good about this film.",
         "OK... This \"Crew\" ...they must be the biggest morons in the whole Universe. Were these people supposed to go and...inhabit an Alien planet? These guys are dumber than the illegitimate child of Jeff Daniels and Jim Carrey. -- Ah a planet that looks like Earth! Let's forget our carefully planned initial destination and let's go and inhabit this one! What can possibly go wrong? It has 78% Nitrogen and 21% Oxygen, so it must be fine. No need for any special precautions. Not even a ...mere gas mask! And while were here why not rest on this comfy rock and light a ...cigarette to pass the time! Jokes aside, this is more like a semi-horror movie than an actual sci-fi movie. I recently saw \"Life\" and this is even worst. Nothing original. Nothing new. Just creatures bursting out of the bodies of morons and imbeciles. I won't bother you with comments about the visuals nor the music. (They are the \"usual\" stuff) and the acting refers more to screaming queens than to actual actors. And the very predictable ending you can see it coming from a mile away. Overall: Ignorant, idiotic, crying babies in Space !",
         "The film is in all ways worse than literally every Alien film that has come before it and I actually include the god-awful Aliens vs Predator films because at least they didn't over- promise and under-deliver so grotesquely. This film is filled with deus ex machina, clichés, bad techno babble, worse dialogue, and overused tropes. It is not only bad, it is laughably bad. There are extensive spoilers in this review, nevertheless I urge you to read on so that I can save you from this piece of absolute garbage. The nonsense begins pretty much in the first minutes of the film. A disaster befalls the colony ship Covenant, which has stopped in deep space to unfurl its sails to recharge for some reason. I guess the ship runs on solar power or something because the people writing the script figure that's how it'll work in the future, and didn't bother checking with a technical consultant. So this disaster —a giant neutrino burst caused by a nearby star farting or something— damages the ship's solar sails, and causes fires to break out all over and steam vents to start spraying steam, and most notably killing the ship's captain James Franco whom I imagine had a larger part but saw where this mess of a script was going and cut fence along with Noomi Rapace who really only appears in likeness, but I digress. So the flight crew of 15 (the rest of the ship's population of colonists are kept in hanging freezers that just kind of swing around like they're on coat hangers) has to fix the sails. Whilst Danny McBride is outside the ship doing this his helmet intercepts a cryptic signal of some one singing a —I'm not even kidding— John Denver song. Apparently only Danny McBride's helmet could pick this up because the ship has \"communication buffers\" that block out communication attempts I guess because that's how the communication systems aboard solar powered space ships of the future will work. The replacement captain who no one trusts because he is \"a person of faith\" decides to take the ship off course to investigate the source of the transmission because it is coming from a planet that is awesome, way closer than their original destination that is still 7 years away, and yet that they somehow missed when selecting a planet to colonize. Of course it turns out the planet they find is the planet that Noomi Rapace and Michael Fassbender from the previous movie ended up on. This is deus ex machina at its absolute worst. The odds of a ship in the vastness of space, just happening to run out of gas and getting a flat tire in front of Planet Bates Motel completely undermines the rest of the film, which even without this silly contrivance would have been terrible. The colonists organize a landing party with their only shuttle, because of course they do. They find an eerily dead world because of course they do. Some of their number get sick on spores and end up birthing some monsters because of course they do. Things get particularly bad once David makes his appearance. Yes David has survived since the events of Prometheus, his hair has grown out because I guess Weyland Corp makes androids that need hair cuts. Some more nonsense happens — I'm not going to go into it in detail because it is just so hackneyed and predictable. Suffice it to say more people die. And then the first huge twist of this pathetic film: David invented eggs and face huggers. That's right. David the android, still doing his best Peter O'Toole impression, stranded on a dead engineer world inhabited by monsters, decided that with all of this time on his hands he may as well invent the alien menace because he was mad about, I don't know, something, and wants to take it out on humanity by inventing a penis-headed monster. Maybe because he was made without a penis, I'm not really sure, they don't cover it. It is never adequately explained how he even does this or what tools he uses, or even how he knows how to do this in the first place. We stumble across the preserved and vivisected corpse of Noomi Rapace that David has kept for some reason ala Bates Motel, as well as an art studio filled with of creepy poster sketches David made of her — I guess this planet had a Hobby Lobby. What ensues is a bad, nonsensical, utterly devoid of suspense or tension, chase sequence with terrible creature effects. I won't bother to tell you how it ends, it's just as stupid and predictable as the rest of the film. To make matters worse, one of the script writers who churned out this turd also wrote the script for the upcoming Bladerunner sequel for which I now have absolutely zero hope. I don't know what is wrong with Ridley Scott. He keeps working with absolutely terrible scripts. Does he read this garbage beforehand? Does he show up on day one of shooting and just say \"to hell with it, let's get this crap in the can\"? Maybe he is just taking these projects on in order to set up trust funds for his kids — I don't know where the budget for this film went, it looked like it could have been filmed for less than a quarter of what went into it. Skip this film. And just to be safe skip any other films that happen to follow it. Nuke the whole god damn mess of a franchise from orbit. I can only hope this is the final nail in the coffin of this series I once loved. 0 Stars",
         "This movie is a result from corporate decision making based on marketing data. You take everything that has been known to work in this franchise and you mash it in a single installment. Make sure you have an opening for a sequel in there for cash flow continuity! Where's creativity? where's the story? where is the plot? It's a typical Hollywood by the numbers movie production that we see all the time these days. Your DC movies, your marvel movies etc. etc. It's all by the numbers. Hence a by the numbers score of a 6. It's so very average without a standout anywhere.",
         "No suspense. No Horror. A permanent stain on the franchise that makes you feel dirty after having watched it. I had pretty much no expectations going into this film. I had avoided much of the marketing material beforehand and knew very little about it other than it being a sequel to Prometheus, which I actually thought was a half decent film and a worthy prequel to Alien. I'm not sure what went wrong with this film, but it is no exaggeration to say it is one of the worst films I've had the misfortune of sitting through. There is not one redeeming scene. The story is disjointed and quite frankly a complete mess. The editing is horrendous, the score completely forgettable and the cinematography is weirdly terrible. Even Michael Fassbender cannot save this awful dirge. The CGI xneomorph will haunt my dreams for quite some time. Not because it's an imposing and scary alien in this film, but because the CGI is some of the worst you'll see from a movie this year. Alien and Alien 2 were as close to cinematic perfection as you're going to get. Please avoid this dreadful film.",
         "DO NOT UNDER ANY CIRCUMSTANCES WASTE GOOD MONEY ON THIS UTTER RUBBISH. Another rip-off designed to make a few richer and steal two hours from movie-goers lives. The entire movie is shot in the dark...the use of shaky cam is diabolical and the speed at which scenes change is mind boggling. All this combines to ensure that you will have no clue what is going on. There is no point in commenting on the acting, as it would be impossible for any actor to perform under this direction and production. You will not forgive yourself for wasting your precious life on this absolute rubbish.",
         "In the first 20 minutes I was so happy with Covenant. It felt sharp, atmospheric, there are interesting character situations, emotive moments and infinitely better writing than we had in Prometheus. As it progresses, this feeling continues - thankfully, a solid sci-fi film that got it right. Then Ridley starts to indulge in his convoluted ideas about creation and destruction. Its like switching from 1977 George Lucas to 1999 Lucas. You can almost hear Ridley at a writing meeting saying \"this'll be cool, and this, and this, and then this\" and the writer saying \"uh, is this for the same film or later in the series?\" \"Yeah just cram it all in, make it happen\". You end up with three different films - a first act like a modern Alien which I loved, a middle act of Prometheus style philosophizing that feels like more Westworld, then a last act of two shoe-horned in action scenes homaging Aliens and Alien 3 respectively. Except there is no satisfaction at all, because the aliens are rushed, a bit silly, often awkwardly CGI looking, and not even convincing as threats because we don't care about any of it. By the end I just have no idea what to think. I just think it would have worked much better if the ideas were done justice in their own film, rather than ham-fistedly trying to ram them into an Alien film to try and please fans and make box-office.",
         "I live in the Uk and saw this film last night. On the plus side it looks good and the ship and crew of the Covenant vessel are reminiscent of the original classic Alien. On the down side these people are too stupid to live. They answer not a distress beacon, but a garbled rendition of John Denvers Take me Home. The go to a dead planet and don't take any precautions. They land a couple of miles away from a vast Gothic alien city as big and bold as the Vactic city and they don't notice it. I remember thinking at the time 'I can see how they'd miss that' The alien attacks when they occur are really well done, but then there is the question of the ending. The bad android David who killed not only all the Engineers who had inhabited this and all other non-plant they find and even the nice Dr. Elizabeth Shaw who put his head back on is basically worse than Hitler. He deliberately created the acid blooded xenomorph to wipe out humans and so it seems all other animal life just for good measure. He's basically android Doctor Frankenstein. In the incredibly dumb ending he somehow kills the more advanced nice android Walter who is part of the landing party and takes his place. Swapping clothes and chopping off his own hand to resemble they injury Walter picked up saving Daniels the Katherine Waterson character who tells her idiot crew-mates what a bad idea this mission is before they start dying horribly. He'd already cut his hair to look like his 'brother' Walter and no alarm bells rang amongst the crew despite Davids home resembling a Hironimous Bosch version of Hell. It ends with David in charge of the colony ship ready to turn all the people in cryo stasis into his nasty little monsters. To the tune of Das Rheingold the entry of the gods into Valhalla.",
         "It is Z-quality filmmaking with a huge budget. Imagine if someone picked a talentless, autistic nerd, told him to write and direct a fan fiction film, and gave him a professional film crew to get it done. This is that film. It is so badly written that it boggles the mind. It doesn't care about the story, the characters, or even the action. It's as though it goes through the motions, hoping to get to the end as quickly as possible, while never stopping to pay attention to anything. It has no rhythm, no buildup of suspense, no memorable characters or scenes, and it leaves a strong impression of being made by people who really don't care about anything except getting the whole thing finished and shipped to the cinemas worldwide. I guess I can give it one star instead of zero for comedic value: people repeatedly slipping on blood (absolutely hilarious), the dancing alien from Spaceballs, the 'put your head in the egg' moment (remember Blackadder and the Scotsman that puts his head in the cannon?), the whole talk about 'security protocols' while no one even wears a protection suit on an alien planet, the silly 'good vs. evil Data' thing that was done a lot better in a much cheaper Star Trek episode... The film sure made me laugh time and again. Another funny thing is watching old Ridley give interviews while trying to stay awake or put together a coherent sentence. The man should have retired before he even made Prometheus.",
         "Set 10 years after the events of 'Prometheus,' the story begins with the crew of the colony ship Covenant receiving a possible distress call coming from an uncharted planet that seemed to be paradise for humans to live on. Once there, the crew discover the world is much dangerous than it seems but none more dangerous than encountering David, the android from the doomed Prometheus expedition. From the get go, none of the human characters in 'Covenant' are interesting or memorable enough and except for a few, most of them are just faceless red shirts. Some of them act annoyingly hysterical which results in some face-palming reactions and some act like they're in a B-movie slasher flick, but worst of all, a few do something so incredibly stupid that you end up wondering if Weyland- Yutani intentionally hires morons to be part of their billion dollar expeditions. Katherine Waterston plays Daniels and although she is probably the \"best\" character among these losers, she's not written very well nor does she have any notable moments. Michael Fassbender did a superb job with his dual role of David and Walter. Most were expecting Danny McBride to stink up the place but he turned out to be one of the very few reasonably decent characters. Billy Crudup's Oram joins the ranks of Fifeld and Millburn as the dumbest people in the 'Alien' series. Despite the many flaws of 'Prometheus' and the numerous dumb human actions, the characters there were at least not boring and Elizabeth Shaw (Noomi Rapace) was a good leading character that had many memorable exciting scenes. 'Prometheus' even had some thrilling action spectacle that wowed audience and expanded the Alien mythology. Those that are expecting to learn more about the Engineers will be sorely disappointed as they are just briefly touched upon. The whole movie just feels like one big glorified set-up to show the transition from black goo to neomorph to finally xenomorph. Ridley Scott stated he plans to make three more 'Alien' prequels after Covenant. The problem now is we will get three more movies in the future to convolutedly and exhaustively tie everything up leading up to the first 'Alien' movie where the Engineer spacecraft somehow lands at the LV-426 moon. The horror element in 'Covenant' is quite satisfactory, showcasing some spine-chilling terror and graphic kills. The action though is hugely disappointing with the last two big action sequences being uninspiring and unexceptional. The pacing during the last few minutes after the fake-out ending seemed rushed and dissonant. The xenomorph felt shoehorned. The pink-skinned neomorph was a worthy adversarial monster on its own and much creepier than the xenomorph. If this is what Ridley Scott has in store for future Alien prequels, he should just stop and do something else. Or better yet, allow Neill Blomkamp to proceed with his planned 'Alien' do-over sequel where Hicks and Newt are still alive. Interest for the 'Alien' franchise will probably die down steadily with each prequel Ridley releases. This is starting to feel more and more like when George Lucas' botched up the 'Star Wars' prequels. In space, no one can hear you scream. With each passing Alien prequels, no one cares anymore. RATING: 5.5/10 or 6/10",
         "I think people have too high expectation to new movies of famous franchises, and when it doesn't come to their expectation, they just freak out and start giving one out of ten. If you have seen lots of harsh criticism for this movie, I say it's not bad at all. It's still quite entertaining. To be fair, lots of good horror movies are barely above 6 out of ten. So don't avoid it just because people say they hate it. It's true that they throw lots of (probably too many) elements into this movie, which might turn out to be less exciting. However, the ending succeeds in opening up to more stories, which is good. Also, keep in mind that this is not meant to be like the previous alien movies. It has totally different theme. I bet Ridley is a totally different person now. I would be surprised if he makes a new alien movie with similar tone to the older ones. And it's sensible for the old Ridley to explore the \"creation\" stuffs. I think it's a fairly good sequel to Prometheus. Look, now we have a new franchise directed by Ridley Scott himself, which is some what relates to the alien franchise. That is just great.",
         "This is my first review on IMDb and I'm going to keep this one brief. It boggles my mind with the budget of this film that they would make something so horrific. I went to the 7pm IMAX showing and the hard drive arrived late, so it was canceled. I then went and had some beverages at a nearby pub and waited for the 10pm showing, I was that excited to see this movie. Started off great, kind of pulled you in, then it was empty for almost 2 hours. A series of absolute ridiculous events (that my 5 year old could do a better job of writing) happen and decision making that only someone with a true death wish and unbelievable lack of common sense would make, we see over and over. As a matter of fact, the only film I've seen worse than this in my entire lifetime is Cloudy with a Chance of Meatballs 2. The only good thing about this epic failure, is the tremendous previews before it starts. Anyone associated with the making of this boondoggle should consider other avenues to make a living. How did this clown show make it out of the cutting room? Bad story, ridiculous acting, no sense of direction, no fear factor, no scare factor, only offensive bloodletting that you would see in a slasher film (which consequently there's hundreds of......and all better than this movie)......it's an abomination. I'll end with this note, this experience was so dreadful, that I actually went out of my way to put a review on here so hopefully save someone else from the 4 hours of my life that I will never have back.",
         "As a great fan of Ridley Scott and the original Alien film, I looked forward to this film. From the first 15 minutes, I couldn't wait for it to end. The characters are barely one-dimensional, there is zero character development, the editing is so lightning-fast it feels as though you are watching a bad MTV concert video, the action is nonsensical and the story is predictable. A total failure on all levels. Just bad. Not \"so bad it's good\" or campy or horribly charming. Just bad."
      ],
      "genres": [
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Twentieth Century Fox",
         "TSG Entertainment",
         "Scott Free Productions"
      ],
      "summaries": [
         "Almost eleven years after the futile and disastrous expedition on the distant moon LV-223, the deep-space colonisation vessel Covenant equipped with more than 2,000 colonists in cryogenic hibernation, sets a course for the remote planet Origae-6 with the intention to build a new world. Instead, a rogue transmission will entice the crew to a nearby habitable small planet which resembles The Earth. The unsuspecting members of Covenant will have to cope with biological foes beyond human comprehension. Ultimately, what was intended as a peaceful exploratory mission, will soon turn into a desperate rescue operation deep into the cold infinite space.",
         "It is the year 2104. The spaceship Covenant is headed for a remote planet in order to colonise it. The ship's captain is killed in a freak accident, leaving the Executive Officer in charge. He makes the decision to investigate a nearby planet in order to colonise it, as a possible substitute for their original mission. This has dramatic and far-reaching consequences.",
         "The crew of the colony ship Covenant, bound for a remote planet on the far side of the galaxy, discovers what they think is an uncharted paradise, but is actually a dark, dangerous world. When they uncover a threat beyond their imagination, they must attempt a harrowing escape",
         "The crew of a colony ship, bound for a remote planet, discover an uncharted paradise with a threat beyond their imagination, and must attempt a harrowing escape."
      ],
      "budget": 97000000
   },
   "movielensId": 169984,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2017-05-09",
      "dvdReleaseDate": null,
      "directors": ["Ridley Scott"],
      "runtime": 122,
      "movieId": 169984,
      "title": "Alien: Covenant",
      "mpaa": "R",
      "actors": [
         "Michael Fassbender",
         "Katherine Waterston",
         "Billy Crudup",
         "Danny McBride",
         "Demián Bichir",
         "Carmen Ejogo",
         "Jussie Smollett",
         "Callie Hernandez",
         "Amy Seimetz",
         "Nathaniel Dean",
         "Alexander England",
         "Benjamin Rigby",
         "Uli Latukefu",
         "Tess Haubrich",
         "Lorelei King",
         "Goran D. Kleut",
         "Andrew Crawford",
         "Guy Pearce",
         "James Franco",
         "Noomi Rapace",
         "Javier Botet",
         "Benjamin Taylor"
      ],
      "imdbMovieId": "2316204",
      "originalTitle": "Alien: Covenant",
      "genres": [
         "Horror",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "EkXgRlRao5I",
         "svnAD0TApb8",
         "H0VW6sg50Pk"
      ],
      "plotSummary": "Bound for a remote planet on the far side of the galaxy, the crew of the colony ship 'Covenant' discovers what is thought to be an uncharted paradise, but is actually a dark, dangerous world – which has its sole inhabitant the 'synthetic', David, survivor of the doomed Prometheus expedition.",
      "tmdbMovieId": 126889,
      "avgRating": 3.09239,
      "releaseYear": "2017",
      "numRatings": 1012,
      "posterPath": "/zecMELPbU5YMQpC81Z8ImaaXuf9.jpg"
   }
}