{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "time travel",
            "id": 4379
         },
         {
            "name": "time machine",
            "id": 5455
         },
         {
            "name": "tardis",
            "id": 196414
         }
      ],
      "imdb_id": "tt1129418",
      "video": false,
      "title": "Doctor Who: Time Crash",
      "recommendations": [
         335209,
         410714,
         282758,
         369295,
         282963,
         421142,
         281979,
         281982,
         357118,
         317190,
         371759,
         369145,
         315620,
         255466,
         258209,
         421147,
         430951,
         282848,
         317182,
         384257
      ],
      "backdrop_path": "/oAvw5TY5jXR3ywOjJMgWDaX2Zt0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Fifth Doctor",
               "gender": 2,
               "credit_id": "57f6cc2c925141082500019c",
               "name": "Peter Davison",
               "profile_path": "/zmVMWs6QtEs5epXxLAjxUqhsu8v.jpg",
               "id": 47513,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Tenth Doctor",
               "gender": 2,
               "credit_id": "57f6cc44c3a3686f9a0001d6",
               "name": "David Tennant",
               "profile_path": "/dvhgfeZtK0aSHU1H8rkGwFTq28b.jpg",
               "id": 20049,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Martha Jones",
               "gender": 0,
               "credit_id": "57f6cc4fc3a3686f980001e9",
               "name": "Freema Agyeman",
               "profile_path": "/x4Cqx4gtuBtvfFlFLJsSrO6AoRN.jpg",
               "id": 1182929,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "57f6d17692514111c5000156",
               "name": "Steven Moffat",
               "profile_path": "/sE2qahPFzT5jRlkvfqYGZhnM8rS.jpg",
               "id": 146459,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57f6d18692514111da000134",
               "name": "Graeme Harper",
               "profile_path": null,
               "id": 1213659,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 1.631855,
      "production_countries": [],
      "id": 419786,
      "vote_count": 22,
      "budget": 0,
      "overview": "After Martha Jones parts company with the Doctor, his TARDIS collides with another, and he comes face to face with one of his previous incarnations.",
      "similar": [
         206487,
         41154,
         23048,
         87101,
         59967,
         14337,
         24420,
         4723,
         2134,
         1267,
         10353,
         2048,
         2666,
         869,
         8247,
         180,
         605,
         816,
         7551,
         604
      ],
      "original_title": "Doctor Who: Time Crash",
      "runtime": 8,
      "poster_path": "/d8VUkX1NGIZMK782x6GrNZkEEOx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2007-11-16",
      "vote_average": 8.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Graeme Harper"],
      "runtime": 8,
      "synopsis": "The episode takes place within the final scene of Last of the Time Lords. After the Tenth Doctor (David Tennant) parts ways with Martha (Freema Agyeman), he tries taking off, only for the TARDIS to spin wildly and sound an alarm. Checking out the systems, the Doctor passes the fifth incarnation (Peter Davison) doing the same thing. The Tenth Doctor recognises his past self and is overjoyed to see him, gently poking fun of his particular eccentricities, such as the unneeded glasses he sometimes wears. The Fifth Doctor is annoyed, believing his counterpart to be a fan who has broken into the TARDIS. The Fifth Doctor discovers that two TARDISes have merged, a paradox that will cause a massive black hole. The Tenth Doctor counters it with a supernova, a solution he remembers seeing himself perform in this same incident (a predestination paradox); the Fifth Doctor realises that the Tenth really is his future self. The Tenth reminisces as the Fifth begins to fade into a separate timeline: You know, I loved being you. Back when I first started, at the very beginning, I was always trying to be old and grumpy and importantlike you do, when you're young. And then I was you, and it was all dashing about and playing cricket and my voice going all squeaky when I shouted. I still do that, the voice thing, I got that from you. Oh, and the trainers. And... [putting his glasses on] snap! 'Cos you know what, Doctor? You were my Doctor. The two Doctors say goodbye: \"To days to come,\" says the Fifth, raising his hat. \"All my love to long ago,\" replies the Tenth with a bow. As the time streams split, the Fifth Doctor calls out, warning the Tenth to put his shields up. But it is too late; the Titanic collides with the TARDIS, leading the narrative into Voyage of the Damned.",
      "writers": ["Steven Moffat"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1129418/",
      "coverLink": null,
      "actors": [
         "David Tennant",
         "Peter Davison",
         "Freema Agyeman"
      ],
      "reviews": [
         "This short adventure featuring two doctors was absolutely amazing, it had such an epic feel and I felt I had died and gone to heaven. When the new series started I began getting DVD's of the classic series and Peter Davison's stories such as Earthshock and The Caves Of Androzani were great and proved how good a doctor he was. So to have Peter Davison and possibly the best Doctor of them all David Tennant together was magical. The story also gets the chance to pay homage to Peter Davison and what he did as the character all those years ago, this story leaves everyone smiling and feeling nostalgic but it also leaves the question 'Will the doctor meet any of his selves again?' based on the quality of this short story, I sincerely hope so. Doctor Who is still as strong as ever!",
         "Of all the 'Doctors' to follow Tom Baker's epic ( seven year ) run, Peter Davison was for me the most impressive. His boyishly charming, cricket-loving Time Lord made a nice contrast to his grinning, scarf-wearing Bohemian predecessor. Alas the actor was served appalling scripts of the calibre of 'Time Flight' and 'Warriors Of The Deep', and after three seasons beat a hasty retreat to the cosy Sunday evening world of James Herriot. 'Time Crash', written by Steven Moffat before he became producer, was a short ( 8 minutes, to be exact ) episode that went out as part of 'Children In Need' in November 2007. It was not the first 'Doctor Who' to have that honour - the last one was in 2005 when the show still basked in the glory of the Eccleston/Piper combo, and featured David Tennant's debut in the role. Chronologically, it takes after 'Last Of The Time Lords' ( what a horrible season finale that was! ) and before the 'Voyage Of The Damned' Christmas Special. After seeing Martha off, the Doctor is alone in the Tardis once more. But not quite. A stranger has mysteriously slipped aboard. An older-looking Fifth Doctor, still wearing that Edwardian cricketing costume, and baffled by his predicament. The episode then becomes a two-hander, loaded with continuity references, but still managing to satisfy young viewers not readily acquainted with '80's 'Who'. The exchange was easily the best since the 'dandy and the clown' of 1973's 'The Three Doctors'. I liked the way The Tenth Doctor spoke of his delight at being The Fifth. The line \"You were my Doctor!\" was delivered with absolute sincerity. Graeme Harper, who directed the final Davison story 'The Caves Of Androzani', drew from the actor one of his very best performances in the role. Like a fine wine, his Time Lord had mellowed with age. I was touched when he doffed his hat in respect, before vanishing into the ether. They should do a sequel one day.",
         "\"Doctor Who\" was back for all of eight minutes, as part of \"Children in Need\" night, in a mini-episode, written by Steven Moffat and directed by Graeme Harper, entitled \"Time Crash\". I've already seen it described, subsequently, as \"Time Crap\" but I thought it was good fun with a rather poignant final minute. My favourite line was actually one given to tenth Doctor David Tennant, and thus the obvious choice for the title of this post, but, overall, I thought fifth Doctor Peter Davison out-acted his successor. He was \"let's be honest, pretty sort-of-marvellous\"! Readers may think I'm prejudiced in his favour because I prefer the classic series to Russell T. Davies' reinvention but that isn't the reason. Peter wasn't \"My Doctor\", just the better actor on this occasion. They really only got it spot on, during his era, in his final story so it was intriguing to see the actor reunited with the director of that story, \"The Caves of Androzani\", for this little, well-balanced, excursion. While David may have had the best line, the one tinged with A. E. Housman-style regret of a past long since lost, the fifth Doctor had the leading question, and the one I've been asking myself for the last two years, when he asks the tenth, \"Is there something wrong with you?\"! Perhaps David is \"the decorative vegetable\" rather than Peter's stick of celery!! Steven Moffat summed up the current Doctor's predilection for \"ranting in my face about every single thing that happens to be in front of him\" perfectly!!! My only regret about \"Time Crash\" is that it wasn't a full-length episode. Having gone to the trouble of rehiring a popular former-leading man from the series, together with the programme's best director of that period combined (for the first time) with the writing skills of the current series' best author, it would've been nice to see the central relationship developed further\u0085 as in \"The Two Doctors\", one of my \"Blue Remembered Hills\". I echo the sentiment, \"All My Love To Long Ago\".",
         "This little 8-minute special, which exists chronologically right between the third and the fourth seasons of \"Doctor Who\", is quite possibly the best thing that the new series has offered us so far. I laughed out loud, I cried (I've never even watched a single episode of the old series - and yet David Tennant's \"All my love to long ago\" at the end had more emotional power than, say, the Doctor-Rose farewell scenes at the end of \"Doomsday\"), I had my mind boggled in a way only \"Blink\" (also written by Steven Moffat) had managed to do before, and I admired the subtle way Tennant breaks out of character at the end to express his own personal feelings. This special celebrates not only a part of \"Doctor Who\" history, but also the past in general, the things that shape and define us. The ONLY reason I'm deducting half a star is because of the reference to L.I.N.D.A: first of all, how could the Fifth Doctor know about them, and second of all, who wants to be reminded of the worst episode of the entire series (\"Love And Monsters\") while they are watching the best (this one)? ***1/2 out of 4.",
         "Doctor Who: Time Crash is a short (under 10 minutes) little piece made specifically for the 2007 BBC Children in Need night of fund raising. There's no real story other than the fifth Doctor (Peter Davison) ends up meeting the tenth Doctor (David Tennant) in the TARDIS just after he leaves Martha (Freema Agyemen) on Earth at the end of season 3 of the new series. I actually thought it was a nice little fun self referential piece where doctor number ten pokes a bit of fun at one of his previous incarnations while Doctor number five at first thinks he's a loony fan & criticises the new interior of the TARDIS likening the change to that of a Windows desktop! There are some amusing references to various enemy's, Doctor fives traits & some of his companions. I actually smiled on a few occasions & Time Crash has enough continuity with he series as a whole to become an accepted part of it in it's own right. It's certainly far more serious & sensible in tone than the silly Dimensions in Time (1993). Hell, I liked it, I like both David Tennant & Peter Davison although he has noticeably aged which is explained by the time difference or something technobable like that & it also features Freema Agyeman at the start (in footage taken from the end of Last of the Time Lords(2007)) & I admit I have the hots for her & really like her in general so that also helps. At the end Doctor number ten says Doctor number five was his Doctor & in fact in reality Peter Davison would have been David Tennant's first Doctor as he grew up which I thought was a nice little touch. It never leaves the confines of the new style TARDIS & actually leaves you wanting something a bit more substantial, a complete proper story to feature both Tennant & Davison (I wouldn't have said no to Freema Agyeman appearing as well) would have been nice if this little taster was anything to go by. I thought it was a fun little piece & a nice accompaniment to both the new & old series that works well within the context of both. But then again what do I know? The end features a gratuitous plug for the upcoming Christmas special Voyage of the Damned (2007) & also features more footage from the end of Last of the Time Lords.",
         "This is a pretty funny short where The Tenth Doctor and The Fifth manage to bump into each other out of time thanks to Ten not raising the shields while flying. There's some banter between them and Five finds out Ten is a future re-incarnation of him. The \"You're a fan!\" line was hilarious and I always love it when I see multiple Doctors on screen together. And while I do love it when Doctor Who does these little shorts for charity I am going to have to play the bad guy on one major aspect in this short. Peter Davison acts nothing like he did on his run as five! I'm sure any fan of the old and new show will be able to see that he is exactly like Ten, only Ten is more hyperactive. Despite that it is a decent enough homage to the classic show and I would say it is entertaining to watch despite me thinking it's perplexing why they didn't have that little nod before Voyage Of The Damned or The Last Of The Time Lords. Either way, It is worth taking a look at.",
         "\"Doctor Who: Time Crash\" is, as the title already suggests, a Doctor Who short film from almost 10 years ago. The story here is that the (then) current Doctor Who meets his equivalent from the past. Of course, this story had to be taken up at some point with all the time travel references and here it is. However, their dialog for roughly 8 minutes is neither too inspiring nor really memorable. Nothing stays in the mind. Then again, I am not the biggest Doctor Who fan anyway, so fans of the series may see this differently. That's also what the IMDb rating implies. Graeme Harper directed this and he worked on several Doctor Who episodes as well. I hope the are funnier and smarter than this boring short movie. Not recommended.",
         "When a young David Tennant watched Dr Who his favourite take on the hero was that of Peter Davison. As the then-current star, Tennant got the chance to work with him for this short and what does his character say to the man who would later be his father-in-law? You were my doctor. Inside references are the best aren't they? So, what's this about? The Tenth and Fifth Doctors meet each other, that's what! If two of the finest actors ever to grace our screens coming together as the same character isn't enough to grab at you then I don't know what is. \"Two minutes to Belgium!\" As in, an explosion the size of. The TARDIS can't cope with being in the same place as its past self and it's up to the two incarnations to stop that from happening. Doing so will separate the two again and Ten has some important parting words to Five first. It's great to see the classic doctors getting the respect they deserve. This probably led some young fans to investigate the older Dr Who serials for the first time and that's only ever a good thing. Moffat delivers the goods again. Shame we couldn't see them team up for a whole episode."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Family",
         "Mystery",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "BBC Wales",
         "Canadian Broadcasting Corporation (CBC)"
      ],
      "summaries": ["The Tenth Doctor meets one of his previous incarnations."],
      "budget": 0
   },
   "movielensId": 175295,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-11-16",
      "dvdReleaseDate": null,
      "directors": ["Graeme Harper"],
      "runtime": 8,
      "movieId": 175295,
      "title": "Doctor Who: Time Crash",
      "mpaa": null,
      "actors": [
         "Peter Davison",
         "David Tennant",
         "Freema Agyeman"
      ],
      "imdbMovieId": "1129418",
      "originalTitle": "Doctor Who: Time Crash",
      "genres": ["Science Fiction"],
      "youtubeTrailerIds": [],
      "plotSummary": "After Martha Jones parts company with the Doctor, his TARDIS collides with another, and he comes face to face with one of his previous incarnations.",
      "tmdbMovieId": 419786,
      "avgRating": 3.8,
      "releaseYear": "2007",
      "numRatings": 15,
      "posterPath": "/d8VUkX1NGIZMK782x6GrNZkEEOx.jpg"
   }
}