{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "toy",
            "id": 4290
         },
         {
            "name": "company",
            "id": 6129
         },
         {
            "name": "uncle",
            "id": 6464
         },
         {
            "name": "toy shop",
            "id": 6476
         },
         {
            "name": "technical toy",
            "id": 7136
         },
         {
            "name": "inheritance",
            "id": 10911
         }
      ],
      "imdb_id": "tt0105629",
      "video": false,
      "title": "Toys",
      "recommendations": [
         10406,
         11718,
         10442,
         1552,
         13595,
         7095,
         8873,
         15413,
         11353,
         12499,
         10379,
         9612,
         6280,
         11335,
         11630,
         9099,
         11584,
         10163,
         8989,
         11000
      ],
      "backdrop_path": "/lJfOdg9ZbwplMukH3rN0doVNQhK.jpg",
      "revenue": 23278931,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Leslie Zevo",
               "gender": 2,
               "credit_id": "52fe44649251416c75033111",
               "name": "Robin Williams",
               "profile_path": "/5KebSMXT8uj2D0gkaMFJ8VEp53.jpg",
               "id": 2157,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lt. General Leland Zevo",
               "gender": 2,
               "credit_id": "52fe44649251416c75033115",
               "name": "Michael Gambon",
               "profile_path": "/k6VxRs7xcG6DLEVM1izjb3UWSyC.jpg",
               "id": 5658,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Alsatia Zevo",
               "gender": 1,
               "credit_id": "52fe44649251416c75033119",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Gwen Tyler",
               "gender": 1,
               "credit_id": "52fe44649251416c7503311d",
               "name": "Robin Wright",
               "profile_path": "/tXfQTgcIEPP7gtVdJ44ZxZPhacn.jpg",
               "id": 32,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Old General Zevo",
               "gender": 2,
               "credit_id": "52fe44649251416c75033151",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Nurse Debbie",
               "gender": 1,
               "credit_id": "52fe44649251416c75033155",
               "name": "Debi Mazar",
               "profile_path": "/8i1RkV4iIvTh6BXOgclylwZehEk.jpg",
               "id": 5578,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Captain Patrick Zevo",
               "gender": 2,
               "credit_id": "52fe44649251416c75033159",
               "name": "LL Cool J",
               "profile_path": "/dyDxzZo3buNTntxWehyW66aS5Mo.jpg",
               "id": 36424,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Kenneth Zevo",
               "gender": 2,
               "credit_id": "52fe44649251416c7503315d",
               "name": "Donald O'Connor",
               "profile_path": "/hxVmaQrq8pY1Yq3eaW5WoojxydO.jpg",
               "id": 13295,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Owen Owens",
               "gender": 2,
               "credit_id": "52fe44649251416c75033161",
               "name": "Arthur Malet",
               "profile_path": "/6YEWBozoD2s33M1QHxcPVN69Jvu.jpg",
               "id": 13392,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Baker",
               "gender": 2,
               "credit_id": "52fe44649251416c75033165",
               "name": "Jamie Foxx",
               "profile_path": "/cDRGXCNrwf1p9jouw9GzhU2vWP7.jpg",
               "id": 134,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Hagenstern",
               "gender": 2,
               "credit_id": "52fe44649251416c75033169",
               "name": "Blake Clark",
               "profile_path": "/j6nhwuLKJXzHuD4zv2d3y99PcIC.jpg",
               "id": 21485,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44649251416c75033123",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44649251416c7503312f",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44649251416c75033135",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44649251416c7503313b",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44649251416c75033141",
               "name": "Valerie Curtin",
               "profile_path": "/uhdcq0IAtxSKXcZdh3A1myXmHK2.jpg",
               "id": 70172,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44649251416c75033147",
               "name": "Adam Greenberg",
               "profile_path": "/te3aqArBCPkza8DeJpDx0Rncen8.jpg",
               "id": 2723,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44649251416c7503314d",
               "name": "Stu Linder",
               "profile_path": null,
               "id": 5166,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "563f5e7dc3a3681b5c0308ab",
               "name": "Mark Johnson",
               "profile_path": "/yKGF6cbzyP03Gl1QhVLCu1gWSW6.jpg",
               "id": 5162,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 7.360127,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11597,
      "vote_count": 204,
      "budget": 0,
      "overview": "Leslie Zevo is a fun-loving inventor who must save his late father's toy factory from his evil uncle, Leland, a war-mongering general who rules the operation with an iron fist and builds weapons disguised as toys.",
      "similar": [
         425,
         1562,
         10054,
         745,
         334,
         8967,
         11631,
         120,
         2454,
         2758,
         401,
         858,
         1547,
         209244,
         601,
         637,
         675,
         2539,
         433,
         392
      ],
      "original_title": "Toys",
      "runtime": 118,
      "poster_path": "/xWQ8ONckSDgy0OXJyDq5hVhuxgP.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Baltimore Pictures",
            "id": 11407,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1992-12-18",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Laughter is a state of mind.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Barry Levinson"],
      "runtime": 118,
      "synopsis": "Amid a sea of gently-waving tall grass, lies the factory of Zevo Toys, founded by Kenneth Zevo as a place where 'joy and innocence prevail.' Kenneth works in his whimsical factory, along with his children Leslie, and Alsatia. In recent months, Kennth has grown deathly ill, and sends for his Militaristic brother, General Leland Zevo. Upon meeting his brother, Kenneth explains that he wants Leland to take control of Zevo Toys once he dies. This strikes Leland as a very strange request, since he is not at all like his brother, and is more concerned with the 'rank and file' of his former glory days. Eventually, Kenneth dies, and Leland is still not sure what to do. He goes to consult with their father, a bed-ridden, retired 4-star general. But even this doesn't lead to any answers. Leland finally decides to fulfill his brother's request, but even with Leslie and Alsatia welcoming him to the factory and trying to get him acclimated, Leland seems largely like a 'fish out of water,' not seeing the humor or fun in the factory's workings. During a board meeting, word of industrial espionage rouses his attention. Consulting with Kenneth's former advisor, Owen Owens, Leland decides to implement some changes. At a formal dinner at Leslie and Alsatia's home, they are introduced to Leland's son, Patrick, a master of camouflage. Leland takes the opportunity to explain to everyone about his upcoming plans. Patrick is being implemented to step-up security measures to prevent future information leaks, and Leland also plans to start a new line of 'war toys,' a concept that has never been introduced in the factory. Some months pass, and a major security detail is now in place, with the once happy workers now rather dour. Leland has grown upset that the design teams are not fulfilling his vision for a war toys line, and berates them, much to Leslie's displeasure. While passing by the copy room, Leslie meets Gwen Tyler (Robin Wright), who he soon strikes up a conversation with, and finds her to have a rather intriguing personality. Leslie also finds out that Gwen was hired by his father right before he died. Later that evening, Leland and Patrick go into town, where they peruse a video arcade, watching children play intently at the flickering game consoles. Going to a local toy store, Leland is amazed at what other companies have produced in regards to war toys. As they drive back to the country, Leland and Patrick stop at a small pond, and contemplate. Leland soon hits on an epiphany: what if military aircraft and hardware could be made smaller? After all, the reason they are so large is because they need a human being inside to man them. What if the human person operated the craft by remote control? Plus, this could allow Military spending to become less cumbersome! The next day, Leslie meets with Leland, to discuss his feelings about the 'war toys' line. Leslie contends that Zevo Toys has always been moreso about children, and war toys would bring a change to his father's philosophy. Leland 'plays along' with this, and claims he agrees, but asks Leslie if he could have some space to work on some of his own ideas for potential toys. Leslie agrees to this, but then notices some rather startling changes going on around the factory. Leland keeps asking for more space, which begins to 'shrink' other departments in the factory. Alsatia's department is also shut down, and a number of workers are fired. Owen Owens tells Leslie about children being brought into the factory, but has no idea where they are going to. Leslie confronts Leland about what he's doing, but the General is tight-lipped and refuses to say more. Leslie ends up obtaining a security key to the General's secret project, and after staging an elaborate plan to distract the guards, gains access to the secret room. Inside, he finds numerous children at videogame consoles, playing simulations of fighter craft in war-like scenarios. Leslie's presence is soon found out, and he attempts to escape, but falls into a pit, in which a strange creature named the 'sea-swine' inhabits. Patrick and the General find Leslie in the tank, and the two are at odds with the other: Patrick wants to save Leslie, but the General refuses. Leslie manages to secretly make his way out of the sea-swine enclosure, and reports to his family and friends what he's seen. Leslie then has a confrontation with the General about what he's seen, but the General refuses to tell more, other than requesting two weeks to finish his project, at which time he promises to show them what he's doing. After the meeting, Patrick informs the General that some men from Washington D.C. are coming to meet with him. The General is ecstatic, and a top-secret location is set-up a ways outside the factory, with tight security. The General states his vision for the future, but the men at the meeting are still unsure about his plan. Their negative attitude towards his ideas infuriates the General, causing him to strangle one of the men. The General appears to have gone power-mad, as later on that evening, while sitting in his office, he attempts to take care of an errant fly by shooting it with a pistol...and succeeds in shooting himself in the foot. By now, Patrick has grown upset with his father's 'conduct,' and goes to Leslie's place, where he explains to Leslie, Alsatia, Gwen, and Owen about what the General has been up to, and that they have to stop him. Sneaking into the factory, Patrick and the others split up, trying to find the main control center where the General is. The General uses this to his advantage, letting loose some cute-yet-deadly toys, before setting his military-style 'Tommy Tanks' and 'Hurly-Burly Helicopters' on them. Leslie, Alsatia, Gwen and Owen end up finding their way into a storage warehouse, where the General had the older Zevo Toys stored. Devising a plan, Leslie has the old toys wound up, and put to battle against the General's creations. As the battle rages on, Leslie runs off to find Patrick. He winds up in a room outside the General's offices that resembles a miniature of New York City, where Patrick explains that he's been wounded, and that Leslie has to get to the General's room and shut off the controls. Getting into a small plane over the New York model, Leslie tries to pilot it into the General's office, where he confronts the General, and manages to shut off the controls. As the machines shut down, Alsatia, Gwen and Owen join Leslie. However, the sea-swine has also been activated, and tries to kill Leslie, but misses, and hits Alsatia, causing her head to fly off. It is then revealed that she is a robot, that was created as a playmate for Leslie by his father. In the confusion, the General attempts to escape, but is attacked by the sea-swine. Time passes, and Leslie has now assumed control of Zevo Toys, returning it to it's more innocent state. The General has now become bed-ridden, and now shares quarters with his father as well. The film ends with Leslie, Alsatia, Gwen, and Patrick visiting Kenneth's Zevo's grave. Patrick then says his goodbyes, and wanders off into the sea of waving tall-grass.",
      "writers": [
         "Valerie Curtin",
         "Barry Levinson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105629/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2NDE0NTA0MV5BMl5BanBnXkFtZTcwODg5MjcxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Robin Williams, Michael Gambon, Joan Cusack | See full cast and crew »"],
      "reviews": [
         "It's hard to think of a movie that divides its audience as deeply as \"Toys\" does. Few people will say this movie is \"fair.\" Instead, people often call it the best movie ever made or the worst... and they mean it! Even its severest critics grudgingly admit that it's visually stunning and has perhaps the best soundtrack of the decade (\"Happy Worker\" is a classic, and \"At the Closing of the Year\" is, in my opinion, the best Christmas song written in the past 30 years). It's clearly Oscar-worthy in the categories of music and set design. Most people who've seen it agree that Joan Cusack's quirky characterization is wonderful and that the vignettes provided Robin Williams with a springboard for some of the best ad libs of his career. And the story, a whimsical fable of innocence versus corruption, is as unlikely to give offense as any you can name. So, you'd expect the movie's critics to say \"I didn't care for it,\" instead of \"Everyone associated with this movie should be ashamed!\" When I like something and others don't, I hesitate to say they don't \"get it,\" but in the case of \"Toys,\" it really is true. It's no coincidence that many visual references to the work of Rene Magritte keep popping up. \"Toys\" is a surrealist movie, and like any work of surrealism, it has a simple veneer over a more sophisticated message, one that defies explanation and works on the level of a dream. This movie is more \"Mulholland Drive\" than \"Willie Wonka.\" Whether you will like this movie depends entirely on how your mind works. Poets will probably love it. Engineers will probably hate it.",
         "People can be funny about movies like \"Toys\". They'll analyze them to death, wonder what underlying messages are hidden in the subtext, how much the FX cost, what the actors were thinking, all BEFORE they let the movie begin. I don't think about things like that when watching a movie at first. I just decide if I was entertained or not. I was. \"Toys\" uses Williams' natural exuberance and Cusack's looniness to its benefit and make them the most unique characters in a movie that ISN'T about toys as much as it is childhood, life, death and whatever happens to be in between. I especially liked Cusack's comment at her father's funeral about the tin horn. Gambon plays the \"serious-minded\" adult who traipses into toyland and decides to declare war. What happens? About what you'd expect. Or maybe not, I dunno. What can you expect in a movie where it makes up its own rules along the way, just like a child at play? I loved the production design and a lot of toys are just downright cute. Williams' speech to the toys near the end that hybrids Gandhi and Churchill with a little of \"Begin the Beguine\" is a classic in my book. And Cusack's fate is somewhat of a shock. LL Cool J does a pretty good job as does Gambon. Wright is pretty, as always, and you have to love that down-home accent (and dolphin imitation). In the end, \"Toys\" breaks free of the world like the elephant during the end credits, making a world all its own, one where children's rules apply and simply allowing yourself to be a child is the perfect remedy to adulthood. Maybe THAT'S what a lot of people don't understand about this movie. Nice Job, Barry. Ten stars and a smoking jacket for \"Toys\", the movie that proves there's a time and a place for children's things, as long as you don't let growing up spoil it for you.",
         "Toys is a movie easily overlooked and dismissed as childish and nonsensical. Nothing could be further from the truth though, as it is a movie of surprising depth and style. The first point that must be covered is the performance given by Robin Williams as Leslie Zevo. Although it is fraught with his almost trademark wackiness there is an underlying current of a man who is on the edge of coming into his own. The layers of the character he plays are subtly shown, as Leslie is a man who is strong, but unsure of his strength and covers that insecurity with comedy and whimsy. The film is visually striking, a real art department tour de force, and is very much removed from any hint of the past at first glance. Looking deeper into the visuals however reveals the films deeper content of classic surrealist motifs, especially that of dismembered body parts and other parts separated from the whole. Partially assembled dolls, the parts of which come out of machines that are shaped as further separated body parts, are shown throughout. Alsatia lives in rooms within rooms that seem separated from the wholeness of houses, and indeed lives in a paper fold-out doll house herself, the reasons for which become quite apparent by the films end. This aesthetic choice, combined with the toys vs. weapons juxtaposition makes the films textual purpose clear. Toys is a surrealist reaction to the end of the Cold War, in the very same vein as the original surrealists reactions to the end of the First World War. The film even makes several direct references to one of the surrealist masters, Rene Magrite, especially in the music video sequence. This places Toys in a very deep anti-war tradition, one that is expressed very openly in the entire premise of a General taking control of a toy company and turning it to military purpose. Any who would dismiss this film as merely childish surely owe it to themselves to take another look at this surrealist masterpiece and lose themselves in the quirky visuals and creative world that is placed on screen.",
         "This has to be one of my all-time favourite films, in the same league as \"Run Lola Run\", \"Pi\", and \"Contact\" for films that make you feel something you've always known to be true but just weren't quite aware of. Never have I seen such a subtle and innocent social critique. Amazing visuals, wacky sound effects, and a well-suited musical score add tremendously to the already brilliant plot. This film is much more than a simple movie, it is a work of art. Consider yourself lucky if you get to see this gem, for most will surely overlook it.",
         "On the surface I suppose its easy for one to judge this movie as nothing more than an early 90's wacky comedy that lacks depth and meaning. I actually saw this movie in theaters when i was a kid, and quite honestly didn't think that much of it, however, the images always stuck with me for some reason. Watching this film again as an adult, I can honestly say that not only is this a great movie, but it is truly a work of art. To me, this film represents innocence, and what happens when innocence is threatened by forces of destruction. The shots and images in this film are astounding. It feels as If you are staring at a fine abstract painting. The music is well done and only enhances the beautiful imagery. Sure it has its corny parts, but in a way, that's what adds to this film's personality. Overall, this movie will either move you or it wont. If you are someone who only likes big Hollywood movies then you probably wont enjoy this film. If you are an abstract thinker then this may be your cup of tea. Overall, Toys is an acquired taste, however, once acquired you will be staring into a window of enlightenment.",
         "An eccentric, pacifistic toymaker, Robin Williams, learns to take responsibility and assert himself after his father leaves the family toy factory to his uncle, Michael Gambon, a retired army general, who violates the company philosophy by making war toys. Director Barry Levinson, a sometimes brilliant writer, used his considerable prestige to make this very big film built around this very simple analogy: War is bad/innocence (toys) is good. This film would have had more relevance in 1972 than 1992. As it is, it is two decades too late and two tons too heavy. Worse still, the climax is directly contradicts the theme of the film. Robin Williams is only able to gain the maturity to take control of the company by waging a toy war. Hmmmm, maybe war isn't so bad after all. Still, the film is not a total washout. The sets are quite imaginative, and the film does manage to generate an interesting atmosphere - if you're in the mood for such things. The most interesting thing, however, is the casting of rapper LL Cool J as Michael Gambon's son and Robin Williams' cousin. No explanation is given for the fact that he's African-American. That's a nice touch.",
         "I am shocked how this movie can have the horrible rate of 4.5 here in IMDb. The movie is so damm cool! I first watched when I was a kid, but even now that I am 20 years old, I considered it to be awesome! I like the actors(Joan Cusack,Robin Williams,Jamie Foxx,LL Cool J), I like the visual effects,I like the cinematography, I enjoy the plot theme and so on! Even a futuristic theme that can become a reality in the future, with children playing games, that are in fact military vehicles ready to kill, is present in this movie. Plot: When Kenneth Zevo, the owner of large toy company, dies,the company is willed to Zevo's ruthless brother Leland, a Lieutenant General, rather than his son Leslie or his daughter Alsatia. Kenneth Zevo was a pacifistic who believed in the innocence of the toys, but when his brother Leland stays as the main head of the company, the ideals who once Kenneth had are changed, since Leland begins making violent toys in secret, toys that not only simulate violence but actually cause it. The worst is that Leland starts to employ children to participate of the combat simulations, that in fact are real combats. But Leslie and Alsatia are going to confront Leland, and a battle between the peace-loving toys and the killing machines are going to begin.",
         "I remember seeing this movie was first released, when I was seven, and I've loved ever since. Even though I'm 19 now, I still enjoy watching it. I really love Robing Williams and Joan Cusack's acting, especially Joan's. Her character has always been my favorite. The writing is very good, the humor is right on, the costumes are great(especially Alstatia's), the acting is great, the music is great(my favorite song is Happy Worker by Tori Amos). I believe that this movie will be my favorite until the day I die. One of my favorite scenes has to be when Leslie(Robin) is in the room with the three other people discussing the fake vomit, when the walls start coming in on them. \"Is this room getting smaller or am I bloated?\" \"Like we're getting attacked by a cross-word puzzle.\" \"Why does this has coconut in it?\"-\"Oh, that's diarrhea. It shoudn't be here.\" I give this movie 9 *'s out of 10 *'s.",
         "This movie rivals Time Bandits for the best movie for adults who refuse to grow up. It has all the subtle, intelligent jokes the adult in you could want, AND all of the slapstick and visual humor the child in you needs. The entire move is set in a huge field of very green grass. The colors are primary and silly. The subtext is incredibly fascinating. And the music! The music involves some of the best rock and pop artists of the time! Hooray for Toys!",
         "*** and a half/**** Toys comes very close to being perfect. First, it is the closest I have seen a director come to creating a Kubrick style of filmaking. However, the ending for this movie is terrible. Toys is about a man named Leslie Zevo whose father's toy company is taken over by his uncle, General Leland Zevo. The General tries to change the toy line from wind-up toys and dolls to military equipment and is trying to create a toy army operated by little children on remote the control. The plot sounds far fetched but it works. The beginning of this movie if flawless. The entire production design was definately Oscar worthy. Barry Levinson manages to create this incredible world. I actually did feel like I as watching a Stanley Kubrick film because of the camera and design. There's one chilling scene were Robin Williams is discussing some of the novelty items the company will produce and as he does it the walls of the room he is in slowly close in because the General needs more space to build his war toys. Out of all the films I've seen in the 90's this scene would rank as one of the most memorable amoung them. The performances are good. Michael Gambon and Robin Williams are both strong (I think Robin Wright was mis-cast though). However, Joan Cusack gives one of the most incredible performances I've ever seen. She plays a very child like adult, almost retarded but doesn't quite cross the line. The risks she takes and her characterization are all brilliant. There is one momennt when she is at her father's funeral and she just talks about how the word \"tinhorns\" stays with her. It's so beautiful and pure. Now, about the ending. There is a scene in the film where the General tries to kill a fly with a gun. The movie should have ended with him trying to shoot the fly, but then shooting himself. However, there is this whole cliche plotline about bad guys becoming good, there's a toy battle which goes against the thematic elements of the movie, and there's an unesecary love scene that ruins the Kubrickian mood. The ending actually reminded me of a movie called Baby Geniuses and anyone who has seen both movies (which I'm sure is unlikely) will agree with me. Oh well, if you see Toys watch up to the scene with the General and the fly and then stop. If you do this, you will have one of the most enjoyable cinematic experiences of your life."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Baltimore Pictures",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": [
         "An eccentric toymaker's last wish is that his brother takes over the running of the business. The brother is a military General, and is out of touch with toymaking, and out of touch with reality too. The business should really have been given to Leslie, who was much more like his toymaking father. When the General starts making weapons instead of toys, Leslie decides to take action.",
         "Leslie Zevo is the son of an eccentric toy maker. While Leslie was closest to his father and works as a toymaker himself, his Military General Uncle, Leland Zevo, inherits the toy making factory and begins making war toys. Leslie, however, does not see eye to eye with his Uncle, as his father had a policy against making War toys. When the General begins making live weaponry behind Leslie's back, and recruiting children to pilot his army, Leslie, his friends, and his family band together to put an end to the General's tyranny.",
         "When a military general inherits a toy making company and begins making war toys, his employees band together to stop him before he ruins the name of Zevo Toys forever."
      ],
      "budget": 0
   },
   "movielensId": 2253,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-12-18",
      "dvdReleaseDate": "2001-10-16",
      "directors": ["Barry Levinson"],
      "runtime": 118,
      "movieId": 2253,
      "title": "Toys",
      "mpaa": "PG-13",
      "actors": [
         "Robin Williams",
         "Michael Gambon",
         "Joan Cusack",
         "Robin Wright",
         "Jack Warden",
         "Debi Mazar",
         "LL Cool J",
         "Donald O'Connor",
         "Arthur Malet",
         "Jamie Foxx",
         "Blake Clark"
      ],
      "imdbMovieId": "0105629",
      "originalTitle": "Toys",
      "genres": [
         "Fantasy",
         "Comedy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["cP-TU0P2Lw4"],
      "plotSummary": "Leslie Zevo is a fun-loving inventor who must save his late father's toy factory from his evil uncle, Leland, a war-mongering general who rules the operation with an iron fist and builds weapons disguised as toys.",
      "tmdbMovieId": 11597,
      "avgRating": 2.75069,
      "releaseYear": "1992",
      "numRatings": 4334,
      "posterPath": "/xWQ8ONckSDgy0OXJyDq5hVhuxgP.jpg"
   }
}