{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "theatrical producer",
            "id": 10963
         },
         {
            "name": "eva braun",
            "id": 10964
         },
         {
            "name": "playwright",
            "id": 10965
         },
         {
            "name": "scam",
            "id": 11454
         },
         {
            "name": "broadway",
            "id": 156028
         }
      ],
      "imdb_id": "tt0063462",
      "video": false,
      "title": "The Producers",
      "recommendations": [
         12535,
         982,
         10970,
         3063,
         651,
         632,
         11072,
         16305,
         11898,
         488,
         576,
         10156,
         981,
         1939,
         596,
         903,
         204,
         10403,
         11426,
         17687
      ],
      "backdrop_path": "/1pf5eObre2IdJw2qn2gDqaScRh.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Jeff_34",
         "id": "589dc9f9c3a3685f8300837a",
         "content": "**Greatest of all Time - GOAT - Best comedies.**\r\n\r\nEasily my number one. \r\n\r\nThis film can be rewatched over and over again - always just as hilarious and timeless.",
         "url": "https://www.themoviedb.org/review/589dc9f9c3a3685f8300837a"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Leo Bloom",
               "gender": 2,
               "credit_id": "52fe44049251416c9100238b",
               "name": "Gene Wilder",
               "profile_path": "/7xQjm2yrqAVy4yPjGemWseo1Ovi.jpg",
               "id": 3460,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Max Bialystock",
               "gender": 2,
               "credit_id": "52fe44049251416c9100238f",
               "name": "Zero Mostel",
               "profile_path": "/3EexCCgqsUSj6ObFpZ75sXFCJLX.jpg",
               "id": 18861,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Lorenzo St. DuBois (L.S.D.)",
               "gender": 2,
               "credit_id": "52fe44049251416c910023a7",
               "name": "Dick Shawn",
               "profile_path": "/vCCVQc8CQiMM4gMsoeZJ5pGzMHA.jpg",
               "id": 19178,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Franz Liebkind",
               "gender": 2,
               "credit_id": "52fe44049251416c91002393",
               "name": "Kenneth Mars",
               "profile_path": "/xS8r7UXRtBLLCa5MPo0zYP66VlZ.jpg",
               "id": 9601,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Ulla",
               "gender": 1,
               "credit_id": "52fe44049251416c91002397",
               "name": "Lee Meredith",
               "profile_path": "/eFUZyO0Pk1RmCrIqjedw9yFi5P5.jpg",
               "id": 71898,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Hold Me-Touch Me",
               "gender": 1,
               "credit_id": "52fe44049251416c9100239b",
               "name": "Estelle Winwood",
               "profile_path": "/xtmdaPh7ksaUqx56yCRmIryrGiS.jpg",
               "id": 47504,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Roger De Bris",
               "gender": 2,
               "credit_id": "52fe44049251416c9100239f",
               "name": "Christopher Hewett",
               "profile_path": "/hJPDs1847HMk105FKwDyBE5PVxy.jpg",
               "id": 105813,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Carmen Ghia",
               "gender": 0,
               "credit_id": "52fe44049251416c910023a3",
               "name": "Andréas Voutsinas",
               "profile_path": "/ydBwnErUYKKLDdQGRWbGkb6bWdo.jpg",
               "id": 2172,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Eva Braun",
               "gender": 0,
               "credit_id": "52fe44049251416c910023ab",
               "name": "Renée Taylor",
               "profile_path": "/3WYu7Je7lT47KtayiavBL5kAQLA.jpg",
               "id": 56105,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "'Hold Me Touch Me'",
               "gender": 1,
               "credit_id": "54e4afe4925141469f009916",
               "name": "Estelle Winwood",
               "profile_path": "/xtmdaPh7ksaUqx56yCRmIryrGiS.jpg",
               "id": 47504,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Goebbels",
               "gender": 0,
               "credit_id": "54e4aff3c3a368454b00a768",
               "name": "David Patch",
               "profile_path": null,
               "id": 1357506,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "The Drunk",
               "gender": 2,
               "credit_id": "54e4b000925141454f00909b",
               "name": "William Hickey",
               "profile_path": "/zr7UJxP5MdEksn6ZaxeHbwr6o5Z.jpg",
               "id": 21282,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Göring",
               "gender": 2,
               "credit_id": "54e4b0129251411099005cab",
               "name": "Barney Martin",
               "profile_path": "/8DHvFVUyk6o9Uh5E5MHmZghCtjU.jpg",
               "id": 1212034,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44049251416c910023b1",
               "name": "Mel Brooks",
               "profile_path": "/ndFo3LOYNCUghQTK833N1Wtuynr.jpg",
               "id": 14639,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44049251416c910023b7",
               "name": "Sidney Glazier",
               "profile_path": null,
               "id": 69571,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44049251416c910023bd",
               "name": "John Morris",
               "profile_path": null,
               "id": 719,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44049251416c910023c3",
               "name": "Joseph F. Coffey",
               "profile_path": null,
               "id": 71899,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44049251416c910023c9",
               "name": "Ralph Rosenblum",
               "profile_path": null,
               "id": 6848,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44059251416c910023cf",
               "name": "Jack Grossberg",
               "profile_path": null,
               "id": 68939,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44059251416c910023d5",
               "name": "Charles Rosen",
               "profile_path": null,
               "id": 1049,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe44059251416c910023db",
               "name": "Alfa-Betty Olsen",
               "profile_path": null,
               "id": 102600,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "54e4af66925141139d000b08",
               "name": "Mel Brooks",
               "profile_path": "/ndFo3LOYNCUghQTK833N1Wtuynr.jpg",
               "id": 14639,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 7.021156,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30197,
      "vote_count": 210,
      "budget": 947000,
      "overview": "Broadway producer, Max Bialystock and his accountant, Leo Bloom plan to make money by charming little old ladies to invest in a production many times over what it will actually cost, and then put on a sure-fire flop, so nobody will ask for their money back – and what can be a more certain flop than a tasteless musical celebrating Hitler.",
      "similar": [
         637,
         1771,
         424,
         14574,
         228150,
         872,
         15121,
         5925,
         423,
         2253,
         203833,
         16869,
         289,
         613,
         339259,
         289222,
         2005,
         351339,
         369885,
         821
      ],
      "original_title": "The Producers",
      "runtime": 88,
      "poster_path": "/xgKikS0QQcWS1CvhjbemeoBFd32.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Embassy Pictures Corporation",
            "id": 419,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Crossbow Productions",
            "id": 1296,
            "origin_country": ""
         }
      ],
      "release_date": "1967-11-22",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "Hollywood Never Faced a Zanier Zero Hour!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mel Brooks"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Mel Brooks"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0063462/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjYxNzUxNzE1Ml5BMl5BanBnXkFtZTYwNDYxMzA5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Zero Mostel, Gene Wilder, Dick Shawn | See full cast and crew »"],
      "reviews": [
         "A down-on-his-luck Broadway producer, Max Biolystock (Zero Mostel), is reduced to funding his shows by romancing old ladies for cash. Enter neurotic accountant Leo Bloom (Gene Wilder), arriving at Biolystock's apartment to do his books. Upon discovering that Biolystock had extorted $2000.00 from his last Broadway flop, Bloom, simply on a whim, mentions to Biolystock that he could've made a fortune on the flop if he'd only gotten more money from the old ladies. Needless to say, this revelation gets Max's mind working---get the old ladies to invest $1,000,000 on what Biolystock knows will be a surefire flop, then run off with the excess cash! Max convinces the gullible Leo to join him on the scheme, and off the two men go, on a crusade to produce the biggest disaster Broadway has ever seen. They come across a god-awful work written by a former Nazi (Kenneth Mars) called \"Springtime For Hitler,\" and decide to produce it. If it's a flop, Max & Leo will become rich. But if it's a hit, they'll go to jail.... If you're one of the infinite many who've been unable to secure any of those scorching-hot tickets to Mel Brooks' current Broadway phenomenon, \"The Producers,\" there's always this, the original 1968 movie version to watch & enjoy. This Oscar-winner for Best Screenplay is a comedy classic, and easily Mel Brooks' masterpiece, a brilliantly funny film that hasn't aged a bit. Zero Mostel & Gene Wilder are hilarious & perfectly cast as the con-artist producers, with terrific chemistry between them (just their opening scene together, including the great bits about Leo's blue blanket, and Leo terrified of being jumped on by Max, is already one of the great filmed moments of comic acting). Kudos all around to the rest of the cast, too: Kenneth Mars as the deranged Nazi playwright of \"Springtime For Hitler,\" Christopher Hewett as the no-talent gay director who only makes \"Springtime\" even more misguided than it already is, Dick Shawn in an outrageous performance as L.S.D., the hippie ham who lands the coveted role of Hitler (his audition song, \"Love Power,\" is a major highlight), and the gorgeous Lee Meredith as Ulla, Max & Leo's dimwitted secretary. And then there's the \"Springtime For Hitler\" production number itself---yes, it's everything you've ever heard about it, a wonderfully hysterical \"you gotta see it to believe it\" moment in film comedy. Mel Brooks' direction is spot on, and his hysterical screen writing here has never been better (though his co-writing with Gene Wilder on \"Young Frankenstein\" comes close). His Oscar win for the screenplay was very well deserved, indeed. \"The Producers\" is a timeless comedy classic, and the defining moment of Mel Brooks' long illustrious film career.",
         "This Mel Brooks' directorial debut is still after ten movies he directed afterwards one of his very greatest, cleverest and wittiest comedies ever. It's a masterpiece and perhaps the funniest film of the late 60's. Merely the basic idea of \"The Producers\" is already hilarious enough. Theatrical producer Max Bialystock (played irresistibly by splendid Zero Mostel) finds out that with a bit of dishonesty the producer could actually make more money with a flop than he could with a hit. In order to make this scheme reality he teams up with his new friend Leo Bloom (always terrific Gene Wilder) and starts to look for the worst play ever written. They end up choosing a play called \"Springtime for Hitler\" - highly questionable musical written by a fanatic Nazi jerk Franz Liebkind, a lunatic German nutcase who never seems to take off his helmet. Of course they also hire the worst and the most ungifted man they can find to direct the play, quite a personality Roger De Bris - a bloke who just seems to like wearing dresses. Naturally they find an old hippie Lorenzo Saint Dubois (or just LSD to friends) to play the part of Adolf Hitler. They are ready to vouch for the fact that the play is going to be as catastrophical as it possible can be. If all this sounds funny that's because it simply is so damn funny, in many scenes even hysterically funny. Finally the play \"Springtime for Hitler\" starts out with a shocking song and the dubious lyrics contains parts like \"Springtime for Hitler and Germany, Winter for Poland and France\" and \"Bombs falling from the skies again, Deutschland is on the rise again\". I have to give you a serious warning. Want it or not, this foolish little song is annoyingly catchy so the possibility that it will stick in your head and you still hum or sing it few days later is always there and you can imagine where it could lead. Script is so ingenious it's basically a work of art and acting is widely spectacular. Zero Mostel is marvelous and master comedian Gene Wilder's performance once again extremely convincing (\"I don't like people touching my blue blanket\"). Kenneth Mars was an exquisite choice to play the part of the Nazi jackass Liebkind and Christopher Hewett handles the role of the director Roger De Bris enjoyably (\"That whole third act just got to go. They're losing the war...it's too depressing!\"). Dick Shawn is also superb in the role of LSD, one the best moments of the film was when he performed the unexpectedly humorous song \"Love power\" (great parody of a typical hippie, especially considering that \"The Producers\" was released in 1968). Overall \"The Producers\" is a magnificent comedy, a masterpiece that just gets better every time you watch it. At least I can't help of loving a movie that makes the Nazis look ridiculous.",
         "The DVD release of \"The Producers\" sends me every viewing back to 1968 when I first saw this brilliant, barrier-smashing comedy. Zero Mostel and Gene Wilder were the perfect pair to bring to life the adventures of a Broadway faded impresario, now a con man, and his neurotic, hyper, accountant accomplice. Together they fleece old ladies, something Mostel's Max Bialystock was doing before the auditor, Max Bloom, came by to check the books. Mostel's seduction of the old, the awful and the ugly has no equal in movie physical comedy. The scheme: put on the worst flop imaginable and when it closes virtually after opening night the two scammers snare riches: the investments they don't have to return. But if the show is a hit... The producers' vehicle, \"Springtime for Hitler,\" both brought audiences to a new level of appreciation for the malleable, creative power of film and...it made some viewers genuinely nervous, even upset. Following Steve Allen's observation that a formula for comedy based on history is Tragedy+Time, director Mel Brooks brought to the screen, less than a quarter century after World War II ended, Dick Shawn as a campy fuehrer surrounded by the Nazi counterpart of the Rockettes. And Max and Leo are clearly Jewish in character if not so openly identified. Kenneth Mars grabs laughs as the author of \"Springtime for Hitler,\" an unreconstructed, Hitler-adoring flake who raises pigeons on the roof of a Manhattan tenement while accoutered in the odd leftovers of Wehrmacht uniforms. When I fitted in seeing \"The Producers\" in its opening week I sat in the middle of an audience that was, to a certain extent, as befuddled as the film's playgoers watching the first part of the intended-to-outrage musical comedy about the Third Reich. Not only were SS uniforms, swastikas and photos of Hitler on the \"stage\" but the movie theater audience also digested, perhaps for the first time, a send-up of an uproarious gay couple, two real queens. One is effeminate to the core, the other is a cross-dresser (and a faultlessly garish one at that). This kind of stuff hadn't been done before in a Hollywood flick. 1968's audience had many who well-remembered World War II and some had fought in the conflict. I knew people who admitted feeling that the horrific global battle against Hitler had been trivialized by Brooks and his extroverted cast - until they could no longer hold back guffaws that segued rapidly into uncontrolled laughter. That \"The Producers\" is also now a runaway Broadway hit is no surprise and I'd love to see a DVD release with Lane and Broderick. However fine they would be, it's the original that broke barriers. The DVD has a number of worthwhile features including a fascinating \"Making of...\" segment. Peter Seller's short, famous encomium is read and there are the usual other additions. An outtake presenting an alternative blow-up of the \"Springtime for Hitler\" theater is interesting, largely because it shows how perceptive Brooks was in scrapping it for the shorter scene actually used. \"The Producers\" is, in some ways, a subversive movie. Without stridently proclaiming a new aesthetic, it is exactly that and so it's a timeless classic. This is not satire about Nazism, Hitler and the Third Reich. It's treating as suitable material for slapstick and quick gags the detritus of an evil time. But it's also a bit dated, no subject is taboo today for comedic treatment, and many who see it for the first time (as my teenage son did tonight) will enjoy the movie without getting the full impact of its assault on conventionality. Is there any historical topic that will not, in the passage of time, be employed for pure comedy? Is it possible that the next generation will laugh at a comedy parodying Auschwitz? I hope not but I also can't be sure. Many years ago I refused to watch \"Hogan's Heroes\" on TV because I personally knew former U.S. POWs. But that show, with Werner Klemperer as Colonel Klink, was very popular. \"Hogan's Heroes\" was to TV what \"The Producers\" was, and is, to film. And both made a mark that will be emulated as future generations go beyond satire to humorous treatment of matters most today consider beyond the pale of acceptability as a vehicle for laughs. 10/10",
         "When you see a movie once and think it's hilarious, that's a good sign. When you see a movie about a half-dozen times and think it's still hilarious, that's more than a good sign. That means that not only can you put up with seeing it multiple times, but you also find new things that you didn't see before. Plus, there are some scenes that are too hilarious not to laugh at! The chemistry between stars doesn't hurt, either. What movie am I talking about? Mel Brooks' The Producers, his most sustained and inspired piece of lunacy! Gene Wilder and Zero Mostel have amazing chemistry as meek accountant Leo Bloom and scheming Broadway producer Max Bialystock. Max seduces little old ladies for checks, and when Leo comes into his office one day, he finds that a producer can make more money with a flop instead of a hit. They decide to do his ploy, and create the world's worst play, Springtime for Hitler (a gay romp with Adolf and Eva), and meet interesting characters, including author Franz Liebkind (Kenneth Mars), director Roger DeBris (Christopher Hewett), and their Hitler, Lorenzo St.DuBois, aka L.S.D. (Dick Shawn). What makes this comedy such a gem is its mixture of types of comedy. There is slapstick, there's satire, there's bad taste, and everything but the kitchen sink! The scenes I have seen so many times, but what makes me love them is how they, mainly Wilder, play their roles. Wilder is somewhat crazy, and relies on his blanket to calm himself down. Not only does he have comic perfection, he's a darned good actor to boot! Mostel is great as the would-be sleazy loser-producer, with eye movements that put Silent Bob to shame and a great voice. The songs in it are great, also. Two of them were written by Brooks himself, `Springtime for Hitler' (with which I have auditioned for a role in a musical with) and `Prisoners of Love'. They're both very funny (real Brooks-ian) (note to Merriam-Webster: include that word right next to `bling-bling'). It's not exactly a musical, but The Producers is in a class of its own. Long live The Producers! My rating: 9/10 Rated PG for bad taste and homosexual themes.",
         "Peter Sellers considered The Producers to be the ultimate film, and he may very well have a point. Mel Brooks's dazzling debut is a classic piece of spiralling insanity that just gets funnier and funnier every time you watch it - there's just so much to enjoy! Much of the non-verbal humour revolves around Zero Mostel - watch in amazement as this great comic genius effortlessly twists his features into configurations you never even knew existed! Gene Wilder is a perfect match for Mostel's booming delivery, turning in a beautifully underplayed study of meek neurosis that makes his occasional lapses into hysteria all the more funny and surprising, in particular his \"blue blanket\" tantrum. If Mostel is larger than life, then Kenneth Mars as the Hitler-fixated author of \"the worst play ever written\" is uglier still, a breathtaking depiction of eye-rolling Nazi lunacy complete with tin helmet and the craziest accent this side of FAWLTY TOWERS! Then, just when you think it can't get any more outrageous, that underused and underrated actor Dick Shawn turns up as a spaced-out flower child called (wait for it) LSD and practically steals the film. If you've never seen THE PRODUCERS, do yourself one huge favour and buy a copy today. Then prepare to watch it again and again, laughing louder and louder every time. Altogether now - \"Don't be stupid, be a smartie, come and join the Nazi party\"!",
         "There are so many laughs in THE PRODUCERS (long before Mel Brooks lost his magic touch), that you'll be in tears by the time Brooks gets to his \"Springtime for Hitler\" routine. ZERO MOSTEL's early scenes with ESTELLE WINWOOD are hilarious enough, but he and GENE WILDER top themselves by the time you get to the frantic ending. LEE MEREDITH is the curvy Ulla who can shake a mean hip and DICK SHAWN is the hilariously daffy Lorenzo St. DuBois (LSD for short), and everyone in the cast has a fine time delivering over-the-top performances in the spirit in which this sort of satire requires. The story is simply that of a producer running short on cash who devises a scheme whereby if he produces the worst musical in the world, he can actually get his investment back and then some. He convinces his mild-mannered bookkeeper GENE WILDER to join him in the scheme and then the fun gets off to a great start. The climactic \"Springtime for Hitler\" is just one of the delirious highlights (if politically incorrect by today's standards), and is probably the reason so many of the comments here resent the film and everything it stands for. But there's no getting away from it--the script is downright brilliant and original--winning an Oscar for Best Original Screenplay and numerous other writing awards including an award from The Writer's Guild of America. Summing up: Mel Brooks at his wittiest.",
         "This is a classic film with wonderful performances all around (although I didn't take to Dick Shawn's as much as the others). Zero Mostel and Gene Wilder were perfect casting as was Christopher Hewitt (later to be known as TV's \"Mr. Belvedere\"). What's even more impressive are the various elements of truth that are beneath the histerical if not obsurbed storyline. The current Broadway hit doesn't compete with this film. The performances are good on stage but not as wonderful as here. Due to long term business problems this film wasn't released for home video and cable until much later then it should have been. Outright broad comedy and silliness belong in our daily lives and this film offers them very well. EVERYONE should see this film!",
         "I know more people who quote lines from THE PRODUCERS than from Shakespeare; make of that what you will! :-) That said, people seem to either love it or hate it, but most folks I know agree this nutzoid farce has, to quote groovy LSD (delightful Dick Shawn), \"Love Power!\" Writer/director Mel Brooks' insanely zany yet strangely sweet tale of down-on-his-luck Broadway producer Max Bialystock (the great Zero Mostel, who should have been nominated for an Oscar himself) who uses his powers of persuasion (and wheedling, and bellowing, and conning :-) to convince meek accountant Leo Bloom (justifiably Oscar-nominated Gene Wilder) to help him make a surefire Broadway flop that, if their nutty book-cooking scheme works, will land them in Rio -- or, if it doesn't work, Sing Sing. This screamingly funny, no-holds-barred comedy won Mel Brooks an Oscar for Best Screenplay and put the former YOUR SHOW OF SHOWS writer on the map as a filmmaker. Anyone trying to make a comedy depending on controversy and questionable taste for its laughs should watch THE PRODUCERS first and see how a master does it! For that matter, Mel Brooks and Gene Wilder ought to watch it again themselves; after the duds they were churning out for a while there, maybe they need a refresher course in how to be funny. (Hell, it might be as simple as them teaming up again; Wilder seemed able to temper Brooks's mania for poo-poo humor and Brooks seemed able to help Wilder to better balance out his trademark blend of shrill hysteria and sweetness.) Much as my family and I also loved the Broadway and film editions of the musical version co-written by Brooks and Thomas Meehan and starring the incomparable Nathan Lane and Matthew Broderick (even though I felt that Broderick wasn't quite as good as Leo Bloom as Lane was as Max Bialystock. That said, together they have great buddy chemistry), the original is still the champ.",
         "How can a Broadway producer who has seen his day really make a lot of money? Leave it to writer/director Mel Brooks to answer that, and answer it he does in the uproarious comedy `The Producers.' Zero Mostel stars as the producer in question, one Max Bialystock, with Gene Wilder co-starring as Leo Bloom, the meek accountant who steers Max onto the path to instant riches with a scheme that (in Max's hands) simply can't fail. With Leo on board as his new partner, Max embarks upon a search for the perfect script, the first step of the plan that will lead them to the pot of gold at the end of the Great White Way. And with Brooks at the helm, it's the beginning of a laugh-filled movie that gets funnier every time you see it. Mostel is perfect as the unflappable Max, the charlatan who woos a string of old ladies into becoming investors in his show; his personality and countenance match the broad approach Brooks takes with his comedy, and it's a fit made in comedic heaven. Wilder, however, nearly steals the show with his terrific, definitive `long' takes and sideward glances that have served him so well during his career. Here, in one of his first screen appearances, he works it perfectly, creating just the right counter-balance to Mostel's boldness, and it makes Leo a truly memorable character. Visually, there is enough in this film to generate plenty of laughs, but that it's delivered with wonderfully witty and clever dialogue as well (the screenplay earned Brooks an Oscar), makes it a true classic in anybody's book. Also unforgettable here are Kenneth Mars, as Franz Liebkind, author of the play that Max and Leo undertake to produce; Christopher Hewett, as Roger De Bris; and especially Dick Shawn, as Lorenzo Saint DuBois (`L.S.D.' to his friends), who becomes the star of Max and Leo's production. Rounding out the great supporting cast are Estelle Winwood (`Hold me, touch me' old lady), Lee Meredith (Ulla), Renee Taylor (Eva Braun), Andreas Voutsinas (Carmen Giya), and William Hickey (Good Natured Inebriate). `The Producers' is every bit as funny now as when it debuted in 1968, maybe even funnier; it proves that good comedy is timeless, and this is comedy at it's best. This is a must-see, not only for Mel Brooks' fans, but for anyone who just likes lots of good laughs. Believe me, this is one funny movie you're going to want to see again and again. I rate this one 9/10.",
         "Although I saw this film after seeing some of Brook's bigger works, such as Blazing Saddles and Spaceballs, I still found this very funny and entertaining. It's hard to fault the antagonistic partnership of the two main characters, and are played so well. The actor who played Hitler in the show was so bizarre that it worked much like the play 'springtime for Hitler' was to the audience I presume! The only character I thought was unnecessary, was the babbling 'old-school' Nazi, but you could argue that he was necessary for the plot to move forward. Overall, great light-hearted fun."
      ],
      "genres": [
         "Comedy",
         "Musical"
      ],
      "productionCompanies": [
         "Crossbow Productions",
         "Springtime Productions",
         "U-M Productions"
      ],
      "summaries": [
         "Down-on-his-luck theatrical producer Max Bialystock is forced to romance rich old ladies to finance his efforts. When timid accountant Leo Bloom reviews Max's accounting books, the two hit upon a way to make a fortune by producing a sure-fire flop. The play which is to be their gold mine? \"Springtime for Hitler.\"",
         "Max Bialystock is a washed up Broadway producer. Leo Bloom is a mousy PA (public accountant). When the two meet, their combined expertise points them toward the ultimate scam: Raise more money than you need for a SURE-FIRE Flop Broadway Show. No one will expect anything back and you can pocket the difference. They need the worst play to do this. They find it in the musical \"Springtime for Hitler\".",
         "Producers Max Bialystock and Leo Bloom make money by producing a sure-fire flop."
      ],
      "budget": 941000
   },
   "movielensId": 2300,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1967-11-22",
      "dvdReleaseDate": "2005-12-13",
      "directors": ["Mel Brooks"],
      "runtime": 88,
      "movieId": 2300,
      "title": "The Producers",
      "mpaa": "PG",
      "actors": [
         "Gene Wilder",
         "Zero Mostel",
         "Dick Shawn",
         "Kenneth Mars",
         "Lee Meredith",
         "Estelle Winwood",
         "Christopher Hewett",
         "Andréas Voutsinas",
         "Renée Taylor",
         "Estelle Winwood",
         "David Patch",
         "William Hickey",
         "Barney Martin"
      ],
      "imdbMovieId": "0063462",
      "originalTitle": "The Producers",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [
         "tCNjOBzg8tc",
         "z51xeox0Jlg"
      ],
      "plotSummary": "Broadway producer, Max Bialystock and his accountant, Leo Bloom plan to make money by charming little old ladies to invest in a production many times over what it will actually cost, and then put on a sure-fire flop, so nobody will ask for their money back – and what can be a more certain flop than a tasteless musical celebrating Hitler.",
      "tmdbMovieId": 30197,
      "avgRating": 3.85287,
      "releaseYear": "1967",
      "numRatings": 7626,
      "posterPath": "/xgKikS0QQcWS1CvhjbemeoBFd32.jpg"
   }
}