{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "diving",
            "id": 269
         },
         {
            "name": "dictator",
            "id": 407
         },
         {
            "name": "africa",
            "id": 409
         },
         {
            "name": "riddle",
            "id": 483
         },
         {
            "name": "treasure",
            "id": 1454
         },
         {
            "name": "nile",
            "id": 2906
         },
         {
            "name": "palace",
            "id": 3998
         },
         {
            "name": "treasure hunt",
            "id": 6956
         },
         {
            "name": "guru",
            "id": 8616
         },
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "desert",
            "id": 18034
         },
         {
            "name": "double cross",
            "id": 33456
         },
         {
            "name": "archaeologist",
            "id": 41586
         },
         {
            "name": "novelist",
            "id": 155251
         },
         {
            "name": "swashbuckler",
            "id": 157186
         },
         {
            "name": "adventurer",
            "id": 175428
         },
         {
            "name": "archeology ",
            "id": 184134
         }
      ],
      "imdb_id": "tt0089370",
      "video": false,
      "title": "The Jewel of the Nile",
      "recommendations": [
         9326,
         10328,
         150,
         10859,
         2614,
         11584,
         9292,
         1727,
         249,
         11896,
         11595,
         9869,
         2924,
         9396,
         12154,
         4105,
         10998,
         10466,
         9671,
         10136
      ],
      "backdrop_path": "/gz4ytKq2oHi040GEakUszYXmOrJ.jpg",
      "revenue": 96773200,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Jack Colton",
               "gender": 2,
               "credit_id": "52fe43559251416c7500c621",
               "name": "Michael Douglas",
               "profile_path": "/nmlitv4g2jXO3sJrnA9g980j2uc.jpg",
               "id": 3392,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Joan Wilder",
               "gender": 1,
               "credit_id": "52fe43559251416c7500c625",
               "name": "Kathleen Turner",
               "profile_path": "/jM1gpAt7vsn81NsvWqJGVLhD8As.jpg",
               "id": 3391,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Ralph",
               "gender": 2,
               "credit_id": "52fe43559251416c7500c629",
               "name": "Danny DeVito",
               "profile_path": "/zKuyzmKzPLG7RJo7lbbHjx6CCZc.jpg",
               "id": 518,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Omar",
               "gender": 0,
               "credit_id": "52fe43559251416c7500c62d",
               "name": "Spiros Focás",
               "profile_path": "/kadjsoJ5LhRtjH76w1ACuMLeUN6.jpg",
               "id": 6783,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Jewel",
               "gender": 2,
               "credit_id": "52fe43559251416c7500c631",
               "name": "Avner Eisenberg",
               "profile_path": null,
               "id": 943150,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Tarak",
               "gender": 0,
               "credit_id": "52fe43559251416c7500c635",
               "name": "Paul David Magid",
               "profile_path": null,
               "id": 1076195,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Barak",
               "gender": 0,
               "credit_id": "52fe43559251416c7500c639",
               "name": "Howard Jay Patterson",
               "profile_path": null,
               "id": 1076196,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Karak",
               "gender": 0,
               "credit_id": "52fe43559251416c7500c63d",
               "name": "Randall Edwin Nelson",
               "profile_path": null,
               "id": 1076197,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Arak",
               "gender": 2,
               "credit_id": "52fe43559251416c7500c641",
               "name": "Samuel Ross Williams",
               "profile_path": null,
               "id": 1076198,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Sarak",
               "gender": 0,
               "credit_id": "52fe43559251416c7500c645",
               "name": "Timothy Daniel Furst",
               "profile_path": null,
               "id": 1076199,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Rachid",
               "gender": 0,
               "credit_id": "52fe43559251416c7500c649",
               "name": "Hamid Fillali",
               "profile_path": null,
               "id": 1076200,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "52fe43559251416c7500c64d",
               "name": "Holland Taylor",
               "profile_path": "/oPcA8Ju1rBGlDCRqbyVD7S5vakY.jpg",
               "id": 11318,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Le Vasseur",
               "gender": 0,
               "credit_id": "52fe43559251416c7500c651",
               "name": "Guy Cuevas",
               "profile_path": null,
               "id": 1076201,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Missionary",
               "gender": 0,
               "credit_id": "52fe43559251416c7500c655",
               "name": "Peter DePalma",
               "profile_path": null,
               "id": 1076202,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Pirate",
               "gender": 0,
               "credit_id": "52fe43559251416c7500c659",
               "name": "Mark Daly Richards",
               "profile_path": null,
               "id": 1076203,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43559251416c7500c5f3",
               "name": "Lewis Teague",
               "profile_path": "/8S7HOgNIpqqa7CpkV5uMR4hMSvx.jpg",
               "id": 21819,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43559251416c7500c5f9",
               "name": "Mark Rosenthal",
               "profile_path": null,
               "id": 2103,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43559251416c7500c5ff",
               "name": "Lawrence Konner",
               "profile_path": null,
               "id": 2100,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43559251416c7500c605",
               "name": "Michael Douglas",
               "profile_path": "/nmlitv4g2jXO3sJrnA9g980j2uc.jpg",
               "id": 3392,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43559251416c7500c60b",
               "name": "Jack Nitzsche",
               "profile_path": null,
               "id": 7066,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43559251416c7500c611",
               "name": "Jan de Bont",
               "profile_path": "/9kPf2LuyLLwCawSGyPIQCX7ighX.jpg",
               "id": 2209,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43559251416c7500c617",
               "name": "Peter Boita",
               "profile_path": null,
               "id": 25823,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43559251416c7500c61d",
               "name": "Michael Ellis",
               "profile_path": null,
               "id": 28841,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.600539,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10303,
      "vote_count": 361,
      "budget": 25000000,
      "overview": "Joan Wilder is thrust back into a world of murder, chases, foreign intrigue... and love. This time out she's duped by a duplicitous Arab dignitary who brings her to the Middle East, ostensibly to write a book about his life. Of course he's up to no good, and Joan is just another pawn in his wicked game. But Jack Colton and his sidekick Ralph show up to help our intrepid heroine save the day.",
      "similar": [
         9326,
         9838,
         6637,
         85,
         87,
         89,
         1995,
         1996,
         217,
         2059,
         9710,
         9355,
         1523,
         17578,
         256274,
         313943,
         11576,
         8393,
         606,
         179
      ],
      "original_title": "The Jewel of the Nile",
      "runtime": 106,
      "poster_path": "/6VjsIhnIcrz2XdQVHdsMj5DdSa1.jpg",
      "spoken_languages": [
         {
            "name": "العربية",
            "iso_639_1": "ar"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "SLM Production Group",
            "id": 396,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Stone Group Pictures",
            "id": 3470,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1985-12-04",
      "vote_average": 6,
      "belongs_to_collection": {
         "backdrop_path": "/duC10LBJE51nzOSNm7ZbWppMxTC.jpg",
         "name": "Romancing the Stone Collection",
         "id": 89264,
         "poster_path": "/mHJHMng2y2jLHgz2S8AoACVgJMi.jpg"
      },
      "tagline": "When the going gets tough, the tough get going.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Lewis Teague"],
      "runtime": 106,
      "synopsis": "This sequel to 1984's rip-snorting romantic-adventure, Romancing the Stone, is a moderately entertaining tale that pales by comparison to its predecessor. Romance novelist Kathleen Turner and retired soldier-of-fortune Michael Douglas return as a now-complacent couple. Bored with life on a yacht, they find excitement thrust upon them when she accepts a speaking engagement in the Middle East. Once there, she is abducted and finds herself involved with the \"jewel\" everyone is chasing. Douglas teams up once more with Danny DeVito to rescue his love. Less charming and more predictable than the original, this suffers for one simple reason: the characters have nowhere to go. In the original story we watched Turner blossom from timid storyteller to lusty adventuress. In this flick she is too much like all the other action adventure babes we've seen before. --Rochelle O'Gorman",
      "writers": [
         "Mark Rosenthal",
         "Lawrence Konner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089370/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkwNTEyMDE5NV5BMl5BanBnXkFtZTYwNTAyMTU5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Douglas, Kathleen Turner, Danny DeVito | See full cast and crew »"],
      "reviews": [
         "There are two kinds of good movies: The movies that, because of one or more characteristics, win grammys, oscars, and much lauding by critics. Gladiator comes to mind. Great cinematography, plot, acting. Then, there are movies, that, although they don't win critical acclaim, seem to find their way onto my TV much more than an oscar-winner. Princess Bride is a good one. Timothy Dalton's bid for a James Bond movie as well. And Jewel of the Nile. Jewel of the Nile is not a stellar specimen of a film in any way. There are movies that are better filmed, better acted, better scripted, ones that don't have as many plot holes, whatever the comparison. It doesn't leave you in a state of deep pondering or leave you not wanting to go to bed for fear of your life. But it is a movie that I, and my family, put in when we want to watch something light, uninvolved, comical, and with actors we like to see. It's something to watch on a Sunday afternoon, over whatever sorry excuse for lunch I decide to have, and to go to sleep on the couch to. It's a good movie to put in and listen to while doing housework, homework, or another activity. It is full of great one-liners that find their way into conversation as well as a severe cheesiness factor in some parts(which isn't a bad thing). Bottom line, I guess, is this: You will find movies that are of superior quality to this one. Ones that you will feel outweigh this one in every single way. All the same, I would highly recommend adding this movie to your cabinet (but purchase and view Romancing the Stone first) because every once in a while, you'll come back to the Nile.",
         "This is a worthy sequel to \"Romancing the Stone\", although not as polished, with the featured actors already a little stilted after the first outing. It is probably significant that the following 15 years have not yet seen a further addition to the series, despite the star quality and charisma of the two leads who do play comedy well together, both in this truncated series and in the blacker \"War of the Roses\". The film suffers from a disjointed plotting, which appears to serve only to link together both some admittedly fine action sequences (a ground-based escape in an F-16 fighter plane, among them) and also the interminable arguments and subsequent reconciliations between Douglas and Turner. Whilst certainly not reaching the heights of style of the original film, \"The Jewel of the Nile\" nevertheless provides a good rounded slice of action/adventure/romance entertainment, with some witty one-liners for DeVito delivered in his own inimitable style and featuring an endearing cameo from Avner Eisenberg as the mystical `Jewel' of the film's title who delivers his religious and philosophical pronouncements in a curious combination of the spiritual world and western pop culture.",
         "I have given this movie a 7/10 because, taken on its own merits, it is just a delightful movie to watch. It's funny, although the slapstick sometimes is a little over done; but good wins out over evil, and leaves you satisfied at its conclusion. It reminds me of the \"On the Road\" movies made by Bob Hope, Bing Crosby, and Dorothy Lamour during the forties, but with better, if not sometimes outlandish, special effects and chases (e.g., the F-16 chase) and just as many, if not more, one liners. However, the movie is more than just comedy. It pits secular evil against a spiritual goodness (the Jewel), albeit a spiritual goodness which on the surface seem naive and comic...but which, in reality, achieves its goals through that apparent naivty. That is a serious overtone which many of the previous comments on the movie seem to have overlooked. The Jewel does not perform miracles, but his presence and comic actions create an aura of the miraculous.",
         "A somewhat sketchy screenplay and unsteady direction sink \"The Jewel of the Nile\", the sequel to \"Romancing the Stone\". Kathleen Turner and Michael Douglas are taking it easy on their yacht, but soon become a bit bored with their now simple lives. Turner gets an invitation from a suspicious sheik in the Middle East who has a dastardly plan up his sleeves. Danny DeVito is also along for the ride once again as everyone is searching for the seemingly unobtainable jewel. Likeable performances are the main attraction, but the film is a large step behind \"Romancing the Stone\". 2.5 out of 5 stars.",
         "It's been too long since I have seen 'Romancing the Stone' and I had forgotten that 'The Jewel of the Nile' was a sequel. As a stand alone movie itself this movie is fun in parts. It's got plenty of ridicule, a disjointed plot, poorly spoken Arabic, bad pacing, poor special effects but it is the cast, that includes, Michael Douglas, Kathleen Turner and Danny Devito that keep it alive. They're the ones who provide the funniest moments. The chemistry between Douglas and Turner shines on screen. They seem to have a good rapport off screen, which might explain them doing so many movies together and looking good on screen. Turner is incredibly sexy. 'The Jewel of the Nile' has some wonderful shots of Africa and the comedic action sequences are enjoyable. The African dances are fun to watch. I was quite disappointed by the ending and what exactly was the point of the holy man being the 'jewel'? Why is this man so important to the people? There's also a terribly done pointless scene where the 'Jewel' walks through the fire. All, in all, it does have a feeling of adventure which would have worked better if the pacing was a little tighter. There's enough action, adventure and romance (even though the element of suspense is ruined) to make it enjoyable at least for a one-time watch.",
         "This sequel is rather quite disappointing to me. In all honesty I loved the first film, Romancing the Stone, so I when I heard there was a sequel to this I was excited to see it. So I went ahead and rented Jewell and it turned out to be one of the worst sequels I've ever seen. I figured it would be at least an entertaining fun movie, especially since it had the stars back from the first film. One thing that really ticked me off was the cheezy score that accompanied the film. I don't know whose idea it was to make this movie but as soon as Robert Zemeckis and Alen Silvestri said no this production should not have gone underway. Michael and Kathleen weren't bad but even they couldn't save this one.",
         "I loved (Romancing the Stone). I was quite amazed when I knew that it has a sequel. For a long time I didn't come upon it at all (some channels hate it ?!). It took me 13 years to get to watch it. And did I love it? Yes. But lesser than the first. So why is that ?! First of all, the script. Compare (Romancing..) to this one, and you'd know the difference between the Hollywood perfect script and the Hollywood draft. Simply the first had more emotions; being like a romantic comedy about the opposite attract, more talk about the dreams; which makes the characters humans to be related to, before heroes to cheer on, more hard choices; there was a scene where the lead had to decide between a gem and a girl, and more twists; namely : more heat. This one is only a fine skeleton for all of the above, however empty. Looking to the movie as a whole assures that it's not the matter of the action-with-more movie and its pure-action sequel, rather the memorable B movie and another B movie ! True after the jungles in the first they went to the desert in this one, and after pursuing a gem, this time the gem is a man, but that was it concerning any \"changing\" ! The movie is enjoyable but hyped. Everything runs very fast (in one scene : Joan is at a book signing engagement, meets Omar, a charming Arab ruler, he offers her the opportunity to live at his palace while she writes about him, she agrees, leaves Jack, and travels with Omar\u0085JUST LIKE THAT ?!). The characters don't think, they just do. There is no gag thrown in-between or special emotional moment. And it lacks the surprises along the way. To say the least : It's tangible that the time spent in writing (The Jewel..) was less than the time spent in writing (Romancing..). The title character, \"The Jewel\", it's extremely pathetic! Who is that man anyway? Sometimes he's a very poor street magician, sometimes he's a man of miracles, and all the time he seems like A-one fool ! And more than that I was forced to believe that this fool is a religious leader and beloved icon ???!!! It mirrors dumb writing for sure, especially when he uses naive tricks to rescue Jack at one moment, while \u0096 at another \u0096 we discover that he can walk amongst fire with no harm whatsoever!! Or it's part of many Hollywood movies' dogma while dealing with Arabs; whereas they're pictured, eternally, as throng of idiots (the movie, this round, resorts to giving them a funky look sometimes to change the flavor of the pretty old idea though !). Or maybe it's the way things work in a movie about American adventurous leads, where the American must be the cowboy, and the rest must be Red Indians ! Then, THE MUSIC ! Jack Nitzsche produced electronic weak thing that doesn't live up to what it expresses of non-stop action and adventures. It's a major let-down which almost turned the movie into a cheap, hasty and cheesy TV episode. And take it from me, don't beat a dead horse by comparing the first's music, by Alan Silvestri, to this; it would sound like a comparison between Charles Chaplin and Tom Arnold ! The special effects took a lot from the movie's personality as something done by big production company. They, instead, fit a B movie from independent destitute company! The last walking in the fire scene is clear example. The 3 stars, (Kathleen Turner), (Michael Douglas) and (Danny DeVito), aren't playing their roles inasmuch as playing at them, with not much of fun. However (Kathleen Turner) is still a treat to watch apart. She reminds me, with that husky voice of hers, with (Lauren Bacall). Back then, at her young non-fat phase, she was sexy as hell. And since her long legs couldn't be resisted, they have been put, exactly like the previous movie, in always torn skirts, so with a lot of running and jumping around you might have a pretty sight indeed. Even at one moment (DeVito) calls her \"LEGS\", and obviously he has a point. By the way, for every male viewer who missed it; its color was white (You know well what I'm talking about !). The character of (Omar Khalifa) is none other than a handsome version of (Muammar al-Gaddafi), see how the smallest details refer to him (the picture with the commander's white suit). At the time (al-Gaddafi) was a favorite laughingstock in the American movies. Albeit, the Nile doesn't flow in Libya. The stars' glow, not glee, and the action sequences are the sole facts in this movie. Director Lewis Teague, who made many TV series, mastered a good comic book. He was as vigorous as (Robert Zemeckis), the director of (Romancing the Stone), yet with less saturated script and more speedy pace. I bet, with not much time between the 2 movies, they quickened the sequel. Overall (The Jewel..) made money as huge as the first (rarely when a Michael Douglas production goes wrong), it works in terms of being flashy flash, and it shows the nature of the initial scripts in Hollywood, and the initial ideas at understanding other nations in the same city too !",
         "As much i have enjoyed the chemistry of this cast in Romancing and War Of The Roses i felt that even that strong bond could not save Jewel Of The Nile from being a dud of a film.The first film had a much stronger Indiana Jones type feel to it,Douglas and Turner hit it off superbly and although that continues to some extent here,its mainly a tired retread that isn't quite as much fun,partly due to the barren desert setting as opposed to the lively mud slides and tropical setting of the first film.The finale of the film is also not a satisfying as the first film and one is left to ponder what was the point of it all.Its a below average action adventure film that relies too heavily on the chemistry of its actors to salvage some credit.",
         "\"The Jewel of the Nile\" is a follow-up to \"Romancing the Stone\". It lacks the greatness of the original but it keeps the same spirit. This one has lots of adventure and action (even more than the original, and is also far more violent). Robert Zemeckis didn't return to direct this one, but 4 of the same actors reprise their roles: Michael Douglas (who also produced it), Kathleen Turner, Danny DeVito and Holland Taylor. The rest of the cast is entirely different. There are plenty of new characters and new villains. As the title says, this movie takes us not to Colombia again, but to the Egyptian deserts (in Africa, close to the Nile river). Exotic like the original's but a completely different scenario than the original's. The main villain in this is Omar Khalifa (well portrayed by Spiros Focás). He is just as treacherous and dangerous as Zolo from the original film. Like Zolo, he fools Joan Wilder so that she falls in his entrapments. He pretends to be a good person, but he's a brutal dictator. But I do like Omar's Egyptian accent. He speaks with a charming accent. Funny that he plays an Egyptian when the actor is Greek, but then, Demis Roussos is a Greek who was born in Egypt. Avner Eisenberg does a nice portrayal of The Jewel but the character has a mix of charm and silliness and isn't always lovable. This film has some really funny and great sequences, but also has a large number of faults and does not possess the charm of the original. Therefore, it doesn't match the original's greatness. Apparently Michael and Kathleen only made this movie because their contract forced them to. Kathleen even attempted to back it out but was threatened by 20th Century Fox to be sued with a $25 million lawsuit. Geez, that is just so wrong! They shouldn't have been forced to do something they didn't want. I sort of can see why they didn't want to do it and why Robert Zemeckis refused to make the sequel. I used to like this movie almost as much as the original. But now it doesn't seem that great to me anymore. Looking at it now, many things about it don't make much sense. The original is a great blockbuster and a timeless classic.",
         "A previous reviewer has taken this film to pieces, and while many of his criticisms are well-made, I can't go along with the overall rating. If you're looking for plausibility, then this is certainly one of the worst movies of all time, but it wasn't actually intended as a documentary, unless I miss my guess completely. This is a silly action adventure, mostly set in North Africa. There are good guys and bad guys, and they have personalities rather than well-rounded characters. There's some slapstick humour. Danny de Vito is cutely irritating, Michael Douglas is brave and rugged. We even have a scene in a tribal village compete with tribal dancing. In other words, it's an updated version of the Stewart Granger/Rod Taylor African adventure type movies. What makes this film worth watching, though, are the chase-type scenes, the specific likes of which I'd not seen before. Suffice to say that they're unusual. If you can accept a plot with more holes than a tuna net and just let it flow by, this is a fairly jolly way to spend a couple of hours."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "SLM Production Group",
         "Stone Group Pictures",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": ["This is the sequel to \"Romancing the Stone\" where Jack and Joan have their yacht and easy life, but are gradually getting bored with each other and this way of life. Joan accepts an invitation to go to some middle eastern country as a guest of the sheik, but there she is abducted and finds her- self involved with the \"jewel\". Jack decides to rescue her with his new partner Ralph. They all go from one adventure to another... What is the story of this \"jewel\"?"],
      "budget": 25000000
   },
   "movielensId": 2405,
   "movielens": {
      "languages": [
         "العربية",
         "English"
      ],
      "releaseDate": "1985-12-04",
      "dvdReleaseDate": "1999-05-25",
      "directors": ["Lewis Teague"],
      "runtime": 106,
      "movieId": 2405,
      "title": "The Jewel of the Nile",
      "mpaa": "PG",
      "actors": [
         "Michael Douglas",
         "Kathleen Turner",
         "Danny DeVito",
         "Spiros Focás",
         "Avner Eisenberg",
         "Paul David Magid",
         "Howard Jay Patterson",
         "Randall Edwin Nelson",
         "Samuel Ross Williams",
         "Timothy Daniel Furst",
         "Hamid Fillali",
         "Holland Taylor",
         "Guy Cuevas",
         "Peter DePalma",
         "Mark Daly Richards"
      ],
      "imdbMovieId": "0089370",
      "originalTitle": "The Jewel of the Nile",
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["KIxJjBO86G4"],
      "plotSummary": "Joan Wilder is thrust back into a world of murder, chases, foreign intrigue... and love. This time out she's duped by a duplicitous Arab dignitary who brings her to the Middle East, ostensibly to write a book about his life. Of course he's up to no good, and Joan is just another pawn in his wicked game. But Jack Colton and his sidekick Ralph show up to help our intrepid heroine save the day.",
      "tmdbMovieId": 10303,
      "avgRating": 3.1449,
      "releaseYear": "1985",
      "numRatings": 7105,
      "posterPath": "/6VjsIhnIcrz2XdQVHdsMj5DdSa1.jpg"
   }
}