{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gas station",
            "id": 1420
         },
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "van",
            "id": 4580
         },
         {
            "name": "midnight movie",
            "id": 11487
         },
         {
            "name": "leatherface",
            "id": 11545
         },
         {
            "name": "hitchhiker",
            "id": 11546
         },
         {
            "name": "slaughterhouse",
            "id": 11547
         },
         {
            "name": "chainsaw",
            "id": 12394
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "polaroid",
            "id": 33874
         },
         {
            "name": "cult film",
            "id": 34117
         }
      ],
      "imdb_id": "tt0072271",
      "video": false,
      "title": "The Texas Chain Saw Massacre",
      "recommendations": [
         4488,
         948,
         10331,
         9003,
         16337,
         11281,
         764,
         15516,
         765,
         9725,
         794,
         1694,
         377,
         9529,
         9728,
         8408,
         923,
         9373,
         763,
         2082
      ],
      "backdrop_path": "/bAtnyMa4jXc1bVUco6wCZBFh0f2.jpg",
      "revenue": 30859000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Sally Hardesty",
               "gender": 1,
               "credit_id": "52fe44209251416c91005c6f",
               "name": "Marilyn Burns",
               "profile_path": "/bEPYa5U36XHiTBdZqZkcRq3cdPP.jpg",
               "id": 27798,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jerry",
               "gender": 0,
               "credit_id": "52fe44209251416c91005c53",
               "name": "Allen Danziger",
               "profile_path": "/nwxGMag4AYEQJcB7x5l8snDtDjE.jpg",
               "id": 122454,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Franklin Hardesty",
               "gender": 2,
               "credit_id": "52fe44209251416c91005c57",
               "name": "Paul A. Partain",
               "profile_path": null,
               "id": 122455,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Kirk",
               "gender": 2,
               "credit_id": "52fe44209251416c91005c5b",
               "name": "William Vail",
               "profile_path": null,
               "id": 122456,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Pam",
               "gender": 0,
               "credit_id": "52fe44209251416c91005c5f",
               "name": "Teri McMinn",
               "profile_path": "/z9V7RSDbGyOf1OnphMlpOwWXoli.jpg",
               "id": 122457,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Hitchhiker",
               "gender": 2,
               "credit_id": "52fe44209251416c91005c63",
               "name": "Edwin Neal",
               "profile_path": "/2pggldtOoONkXwzK2nDNHPXzOgk.jpg",
               "id": 27803,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Old Man",
               "gender": 2,
               "credit_id": "52fe44209251416c91005c67",
               "name": "Jim Siedow",
               "profile_path": "/s6ILyhAwoUsZYyyslG5t9nlUjXc.jpg",
               "id": 104014,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Leatherface",
               "gender": 2,
               "credit_id": "52fe44209251416c91005c6b",
               "name": "Gunnar Hansen",
               "profile_path": "/bwqo7HNyvYqPCnTWlOHSUnstg2F.jpg",
               "id": 27804,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Grandfather",
               "gender": 2,
               "credit_id": "552bd386c3a3681f5c006f90",
               "name": "John Dugan",
               "profile_path": "/4rhSibBG8MY7qtcoOtXI7NGqBfh.jpg",
               "id": 104892,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Window Washer",
               "gender": 0,
               "credit_id": "552bd43c92514121d6003bbb",
               "name": "Robert Courtin",
               "profile_path": null,
               "id": 1453740,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Bearded Man",
               "gender": 0,
               "credit_id": "552beae5925141265f004c9b",
               "name": "William Creamer",
               "profile_path": null,
               "id": 565191,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Storyteller",
               "gender": 0,
               "credit_id": "552bf19d925141288b002d63",
               "name": "John Henry Faulk",
               "profile_path": "/2Bew8g9tK8ToXFn1ZnKedLrUPlt.jpg",
               "id": 1372356,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Cowboy",
               "gender": 0,
               "credit_id": "552bf32ac3a36843cd000f16",
               "name": "Jerry Green",
               "profile_path": null,
               "id": 1453812,
               "order": 12
            },
            {
               "cast_id": 27,
               "character": "Cattle Truck Driver",
               "gender": 0,
               "credit_id": "552bf3de925141265f004e93",
               "name": "Ed Guinn",
               "profile_path": null,
               "id": 1453813,
               "order": 13
            },
            {
               "cast_id": 28,
               "character": "Drunk",
               "gender": 0,
               "credit_id": "552bf445c3a36858d6006927",
               "name": "Joe Bill Hogan",
               "profile_path": null,
               "id": 1453814,
               "order": 14
            },
            {
               "cast_id": 29,
               "character": "Pick Up Driver",
               "gender": 0,
               "credit_id": "552bf4a9c3a3681f56008225",
               "name": "Perry Lorenz",
               "profile_path": null,
               "id": 1453815,
               "order": 15
            },
            {
               "cast_id": 30,
               "character": "Narrator (voice)",
               "gender": 2,
               "credit_id": "552bf56d9251412845002daa",
               "name": "John Larroquette",
               "profile_path": "/2JCgM1nqdxZUQv1qsE3BJu4fnRr.jpg",
               "id": 14101,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44209251416c91005c4f",
               "name": "Tobe Hooper",
               "profile_path": "/rE5TqnAvgaKjWwWZ9AsoU9KcUGU.jpg",
               "id": 10051,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44209251416c91005c75",
               "name": "Kim Henkel",
               "profile_path": null,
               "id": 27797,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44209251416c91005c81",
               "name": "Tobe Hooper",
               "profile_path": "/rE5TqnAvgaKjWwWZ9AsoU9KcUGU.jpg",
               "id": 10051,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "598b18d2c3a3681f6e033a7f",
               "name": "Tobe Hooper",
               "profile_path": "/rE5TqnAvgaKjWwWZ9AsoU9KcUGU.jpg",
               "id": 10051,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "598b18ff9251414bac03256a",
               "name": "Wayne Bell",
               "profile_path": null,
               "id": 75406,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 2,
               "credit_id": "537b2a7e0e0a267fea001347",
               "name": "Tobe Hooper",
               "profile_path": "/rE5TqnAvgaKjWwWZ9AsoU9KcUGU.jpg",
               "id": 10051,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "537b2ab70e0a267fed001439",
               "name": "Wayne Bell",
               "profile_path": null,
               "id": 75406,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "537b2ad30e0a267fea00134d",
               "name": "J. Larry Carroll",
               "profile_path": null,
               "id": 74681,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "537b2b270e0a267fed001441",
               "name": "Sallye Richardson",
               "profile_path": null,
               "id": 1321618,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "537b2b470e0a267ff4001522",
               "name": "Robert A. Burns",
               "profile_path": null,
               "id": 27805,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5402d0d70e0a2658f10069fd",
               "name": "Daniel Pearl",
               "profile_path": null,
               "id": 6042,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 11.942265,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30497,
      "vote_count": 819,
      "budget": 85000,
      "overview": "Five friends visiting their grandfather's house in the country are hunted and terrorized by a chain-saw wielding killer and his family of grave-robbing cannibals.",
      "similar": [
         16780,
         9373,
         10781,
         170,
         948,
         76617,
         762,
         300665,
         655,
         9792,
         10331,
         9542,
         81446,
         9964,
         45272,
         136,
         2759,
         626,
         5172,
         11326
      ],
      "original_title": "The Texas Chain Saw Massacre",
      "runtime": 83,
      "poster_path": "/hXF5nuEvUIlMXv4fOCIhA8KWaN2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Vortex",
            "id": 1197,
            "origin_country": ""
         }
      ],
      "release_date": "1974-10-01",
      "vote_average": 7.1,
      "belongs_to_collection": {
         "backdrop_path": "/1zIwt7gUyxKhOKYXN5XNGdGxwHg.jpg",
         "name": "Texas Chainsaw Massacre Collection",
         "id": 111751,
         "poster_path": "/9qd7xPYvrJTK2bBPFsZAoMbx8px.jpg"
      },
      "tagline": "Who will survive and what will be left of them?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tobe Hooper"],
      "runtime": 83,
      "synopsis": "The film opens on the date of August 18, 1973 by revealing that a cemetery in rural Texas has been vandalized; several gravesites have been desecrated, the bodies dug up and arranged into bizarre \"sculptures\". Sally Hardesty (Marilyn Burns) and her invalid, wheelchair-bound brother, Franklin (Paul A. Partain), are concerned that their grandfather's grave may have been vandalized, so they travel to the site with three of their friends, Sally's boyfriend Jerry (Allen Danziger), her best friend Pam (Teri McMinn), and Pam's boyfriend Kirk (William Vail). When they discover that the grave is intact, they decide to visit the old family homestead which is now abandoned. Along the way, they pass a slaughterhouse and Franklin describes how cattle used to be killed with a sledgehammer, and now they use an air gun. Shortly afterwards, they pick up a skinny, strange-looking hitch hiker (Edwin Neal) who exhibits bizarre behavior. After inviting the group back to his house for dinner, an invitation they all decline, the hitchhiker takes a photo of Franklin with an instant polarid camara, and demands a two-dollar payment for it. When Franklin refuses, the man angrily crumples the photo, sets it on fire, and cuts his own hand with Franklin's pocket knife. The guys manage to throw him out of the van, but not before he cuts Franklin with the knife, too. Before they can drive away, he smears blood on their van. Running low on fuel, they stop at a rural Gulf filling station, only to have the strange-looking old man who runs it (Jim Siedow) tell them that the tanks are empty and that he's waiting for the gas tanker to show up. When the old man learns that their destination is the old Hardesty home, he advises the young people against going there by saying that the people who live around that area are not receptive to strangers. They buy some barbeque sandwiches from the old man and depart for the family home which they finaly arrive a short while later. While Sally and Pam go off to look through the abandoned house, Franklin finds it hard to get around the old place due to his wheelchair, and he is frustrated by the fun that the two couples seem to be having. Franklin gives Pam and Kirk directions to an old swimming hole that used to be nearby, but they find it completely dried up. Kirk hears the sound of a gas generator nearby and gets the idea to find out where it is and barter for some gasoline. Following the sound, they discover a large farm house surrounded by numerous abandonded vehicles, partially hidden by a large tarp. Kirk finds a human tooth on the front porch and frightens Pam with it. He gets no answer to a knock at the door, and he is lured inside by strange animal sounds. He goes into the house and in the space of a few moments, an enormous heavyset man in a weird mask (Gunnar Hansen) appears and murders him with a blow to the head via sledgehammer. The man, known as \"Leatherface\" due to his mask made out of a human face, drags the body into a back room. Pam becomes restless when Kirk does not return, and she goes into the house to look for him. She stumbles into a room that is filled with human and animal bones. A live chicken dangles in a small bird cage. Weird sculptures made out of human skulls hang from the ceiling. Furniture is adorned with human bones and skulls. The floor is covered with bits of bones and feathers. Pam begins to retch and starts screaming, when Leatherface appears and lunges for her. She runs out onto the porch but he catches her, carrying her kicking and screaming back into the house, where he savagely hangs her on a meat hook through her back. While she hangs there, she can see Leatherface dismembering the dead body of Kirk with a chainsaw. Back at the Hardesty house, Sally and the others start to wonder why Pam and Kirk have not returned. As the sun begins to set, Jerry sets out in the general direction and also comes upon the house after he is lured to the area by the sound of the house's gas generator. He is alerted by the blanket that Kirk left hanging on the front porch, and he goes into the house. After Jerry walks into the kitchen, he discovers Pam locked inside a large freezer, still alive but convulsing and near death. She lunges out of the freezer just as Leatherface appears and kills Jerry with the sledgehammer. He forces Pam's body back into the freezer and locks it again. Leatherface is clearly distraught, apparently upset because strangers keep coming to his house. At nightfall, Sally and Franklin are forced to go after Jerry when he does not return; Jerry took the keys to the van with him when he left. Franklin refuses to wait at the van and insists that Sally push his wheelchair along the unpaved path through the woods. Before they get to the house, they are attacked by Leatherface, who murders Franklin by ramming him in the chest with a chainsaw. Sally flees in terror with Leatherface directly behind her. She gets cut on the thorny brush as she runs, eventually reaching the house; she is unaware that the house belongs to her pursuer. Sally runs upstairs as Leatherface saws through the front door to get at her. In an upstairs bedroom, she finds two dessicated figures, an old man and old woman. The woman is long dead, but the old man is still barely alive, hideously withered. Leatherface corners her on the second floor, so she leaps out a window and runs from the house again with him right behind her. Sally reaches the gas station and Leatherface disappears. The old man says he's going to take Sally to get help, and while he's gone Sally notices the smoke pit where the barbeque is made. She stares at it in fascination. The old man returns and suddenly attacks Sally, who tries to defend herself with a kitchen knife. But the old man knocks the knife out of Sally's hand with a broom. The old man beats Sally unconcious with the broom, uses the knife to cut some twine to tie her up, he then puts a gunny sack over her head and forcing her into his pickup truck. He drives her back to the dreaded house, and along the way picks up the hitch hiker from earlier in the day. They all live there, along with Leatherface. They tie Sally to a chair inside the house and remove the bag from her head. She and the hitch hiker recognize one another and Sally screams in horror. The family torments her for the rest of the night, forcing her to sit at their table while they eat a meal that is obviously made up of human flesh. They bring \"Grandpa\" down from upstairs, the dessicated old man, and slice Sally's finger open, sticking it in the old man's mouth while he sucks her blood. They tell Sally that \"Grandpa\" used to work in the slaughterhouse and was the best with a sledgehammer there was. They decide to let Grandpa kill Sally and untie her, forcing her onto her knees and holding her head over a bucket while Grandpa makes several feeble attempts to hit her head with a hammer. The hitch hiker gets frustrated and makes a grab for the hammer to finish her off, and suddenly Sally breaks free. She hurls herself out a window again and lands outside just as dawn begins to break. The hitchhiker and Leatherface emerge from the house and chase Sally up to the road, the hitch hiker brandishing a knife and Leatherface waving the chainsaw. The hitchhiker very nearly catches her, grabbing for her and catching her hair over and over. A large semi drives by and the hitch hiker is caught off guard; the truck drives over him, killing him. The truck driver slows down and gets out of the rig to see what happened, only to be confronted by a screaming, bloodied Sally with Leatherface close behind, the chainsaw buzzing. He chases Sally and the truck driver to the other side of the cab, when the driver hurls a wrench at him and hits him in the side of the head. Leatherface drops the saw and falls, wounded in the leg by the saw blade. The truck driver flees down the road, but the wounded Sally cannot catch up. Then a pickup truck drives by and Sally abandons the scene by jumping in the back of the truck. Leatherface still gives chase, but the pickup driver pulls away. Sally laughs crazily at Leatherface as she escapes, giggling at him as he swings his chainsaw around in frustration and rage in the middle of the road in the full light of dawn.",
      "writers": [
         "Kim Henkel",
         "Tobe Hooper"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0072271/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0NDQ2MzMxMF5BMl5BanBnXkFtZTgwODg5MTkzMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Marilyn Burns, Edwin Neal, Allen Danziger | See full cast and crew »"],
      "reviews": [
         "With the recent box-office success achieved by the latest remake of 1974's `The Texas Chainsaw Massacre,' it's worth looking back at Tobe Hooper's original horror classic. The movie tells a fairly simple tale at heart. A group of five teenagers driving through rural Texas happen upon a deranged, cannibalistic family. Psychological terror and chainsaws ensue. Yet despite this simplicity, what is it about `The Texas Chainsaw Massacre' that continues to succeed so with its audience? Outside of one memorial scene involving a meet hook; the movie is not particularly gory by today's standards. The film's characters and actual scares are not that remarkable. The power of `The Texas Chainsaw Massacre' lies in its atmosphere and in what H.P. Lovecraft called `the oldest and strongest kind of fear': the fear of the unknown. The later of these two staples of great horror is often cast aside in modern horror movies-especially in those churned out by the great Hollywood engine. Instead, every mystery must be explained away, every mask ultimately pulled from a monster's face, and not a moment of exposition is spared. It is interesting to note that the filmmakers behind the latest `Chainsaw' film chose to implement all three of these stylistic vices in their remake. In the original, the feeling of dread and mounting paranoia creeps over the viewer in slow but steady waves. The first scene in the film depicts a desecrated grave with a voiceover of radio newscast, immediately followed by an opening credits sequence set against a backdrop of roaring solar flares. This, along with some idle astrological chatter on the part of one of the teenagers early on, leads to a feeling of cosmic disarray in the lonely Texas hills they traverse. Questions about the villain's mask or the field of cars under camouflage netting are left for the viewer to answer on his or her own. At worst, in the loss of any acceptable answer, they are forced to ponder that terrible and limitless gulf of the imagination: the unknown. In it's later stages, the film becomes a cacophonous world of throat-peeling screaming, blood-shot eyes, laughter, and grinding machinery. One is forced to recall the solar flares in the film's opening credits. In the climax of famous dinner scene, there is a feeling of cosmic forces pressing in on reality and warping it into some crude mockery of order, as if the world were but a TV or radio signal distorted into madness by flares on the surface of the sun. In the 29 years since `The Texas chainsaw Massacre' hit theaters, there have been countless imitators and four additional films in the franchise, three of them remakes. Yet as loved and influential as the original classic has been, many who would seek to emulate its vision seem to overlook its true strengths.",
         "The Texas Chain Saw Massacre can, and will, be reinterpreted by critics and theorists for decades to come. It was shot in the summer of 1973, during the aftermath of the Vietnam War and the Munich Olympics massacre, at the height of the Watergate scandal and the legal investigation into the shootings at Kent State. It was an era of plane hijackings, government oppression and dishonesty, racial conflict, terrorism and revolution. As a mirror of a dark period in American history, Chain Saw remains one of the best evocations yet of the era, as a group of young individuals, returning to the nostalgic home of their childhood, stumble into the raw and irrational cruelty of the modern world. The movie has a weak, though functional storyline, one that has since became the staple for slasher movies; a group of teenagers get lost, stumble across evil and get stalked and killed. But Chain Saw isn't about storyline and plot; it's about creating an experience, a sensory overload. The cast and crew work tirelessly to create scenes and images that are raw and powerful and ultimately, against all expectations, beautiful. Leatherface's travesty of motherly domesticity as he prepares dinner, his child-like dance in the dawn light, the open door at the gas station, the van making it's slow turn off the road towards the derelict and ivy clad Hardesty residence are all images that burn themselves into your consciousness after just a single viewing. The cinematography is exceptional. Watching the Special Edition, you'd never know that this was shot on 16mm in poor light. The picture quality is outstanding, the colors rich and vibrant, the blacks inky and menacing. The brilliant azure skies, the jade green of the grass, the bright red generator, the searing sunlight and stifling shadows. Every frame seems saturated in nicotine gold. Beautiful. Though not always likable, the actors are always believable. Performances are universally startling, but special mention has to go to Marilyn Burns. Though she has little more to work with than the clichéd screaming heroine, she works it with remarkable conviction. It was a traumatic shoot, and it shows. Few actresses have so effectively conveyed mind-numbing terror. The soundtrack is exceptional and deserves more recognition. It is a great testimony to the experimentation and risk taking attitude of the era that all melody is destroyed under an industrial ambient soundscape of metallic clangs, scrapes and screams, evoking the atmosphere of the local slaughterhouse and the Family's state of mind. Terrifying. Despite the complete lack of gore or extreme physical violence, The Texas Chainsaw Massacre continues to horrify and holds up the countless, shot-on-video, slasher clones of subsequent years for the puerile crap that they truly are. Whether by accident or design, this one is a classic. 9 out of 10",
         "Those who have posted here comparing Tobe Hooper's (one and only) masterpiece with the dreadful remake are presumably young children with no real understanding of cinema. The 1974 film is the antithesis of the slick, MTV-influenced, cynical cash-in mentality that informed the later remake. The fact that the remake's target teen audience (well, at least some of them) appeared to lap it up is just a sad reflection of how far standards have fallen since the heyday of the horror film in the 70's. But Hooper's CHAINSAW is more than just a classic horror film. With its print in the permanent collection at the NY Museum of Modern Art, it truly is a classic of cinema. I've shown this to Bergman fans, Tarkovsky fans and, yes, horror fans too - none of them have been prepared for its power, its inventiveness, its willingness to push the envelope of what cinema can do. And, with its simple story and powerhouse, unstoppable delivery, it is as open to interpretation as any piece of \"modern art\" - whether it be from the \"vegetarian treatise\" angle, or the post-Vietnam traumatised America school of thought. But, as I was on my first (of several) viewings, those I have introduced to this movie have been bowled over by the quality of the film-making, and the filmic techniques (soundtrack, editing, startling images) used by Hooper to capture his \"waking nightmare\" on screen. It is something I really don't think any other film has quite achieved, though many have tried. Now, of course, there is a fluke element at work here. Hooper never came close to achieving anything like this again, and many, though not all, of the film's fascinating resonances are a product of the era and the filmmaker's unconscious sensibilities. What he obviously had as a director was the kind of daring to take the visceral power that cinema can deliver so well to the limit, to the the edge of acceptability, skirting on exploitation. That the film is so unrelentingly dark and so unbelievably sadistic in its second half, and yet fascinates even as it traumatises, is a definite testimony to the skill of its director. What could have been sleaze is instead a horrible nightmare experience, sure enough, but one that borders on the transcendental. Should be seen by ALL students of cinema at least once in their lifetime.",
         "A group of teenagers on a road trip... OH BOY!!! HERE WE GO AGAIN... the typical horror movie set up. But wait.... something sets this one apart... IT'S SCARY... to be more precise, IT'S TERRIFYING!!! And I'm not just talking about the horrible 70's clothing and hairstyles. This film is one of the very few films I consider scary. Let me list a few reasons: 1) The gritty documentary feel the film has. 2) The excellent performances by Edwin Neil (the Hitch-Hiker), Jim Seidow (The Old Man), and Gunnar Hansen (Leatherface) as the psychos (in a film this low budget and grainy, performances this real feel all the more scary) and Marilyn Burns (Sally) and Paul A. Partain (Franklin) as the victims (we truly believe and feel their fear). 3)The atmosphere (the skeleton bone art... the freaky metal door in the farmhouse... Leatherface's mask and demeanor... even the way the sun sets in this film is spooky along with the sound of the farmhouse generator). 4)Relentless Horror (Leatherface RUNS not speedwalks after his victims with a live chainsaw... there's no time to trip and fall or your booty is chainsaw bait) 5)The ability the film has to scare you with almost a complete lack of gore (the only \"gory\" scene is when Leatherface accidently cuts his thigh with the chainsaw). The scares lie within the performances and atmosphere and pacing. In closing... this is truly the greatest horror film (and one of the greatest films period) ever made. 15 out of 10!!!",
         "Tobe Hopper's 'The Texas Chain Saw Massacre' is a landmark low budget horror movie which must be considered a modern classic. Hooper's subsequent career has ben extremely uneven, and frequently disappointing, but even if he never made another movie he would still be a legendary figure. As would Leatherface (Gunnar Hansen) and his twisted family played by Edwin Neal and Jim Siedow, and immortal scream queen Marilyn Burns. These actors never have to set in front of a camera again, they'll never be forgotten by horror buffs worldwide! In this day and age of cynically conceived and marketed MTV-friendly teen slashers it's a revelation to see old school horror classics like this, Romero's 'Night Of The Living Dead' and Craven's 'Last House On The Left'. Uncompromising movies, pure horror that makes no attempt to water themselves down and court a mainstream audience. This movie was one of the most controversial of the 1970s, censored or banned here in Australia, and in Britain, and despite the hundreds of horror movies released since, it is still powerful and fresh. There is an undercurrent of bizarre black humour underneath the film, a lot subtler than the sequel and other more obvious \"horror comedies\". The terror isn't compromised, the uneasy giggles make the extreme images even more difficult to dismiss. The cast, all unknowns at the time, and from what we know know paid diddley squat, are all pretty good, especially Marilyn Burns (who Hooper used in his underrated 'Eaten Alive' and who also appeared in the Charles Manson TV biopic 'Helter Skelter'), and whiny paraplegic Paul A. Partain (who went on to bit parts in 70s Drive-In faves 'Race With The Devil' and 'Rolling Thunder' and very little else). One would have thought both would have went on to bigger things watching their performances in this movie but sadly it wasn't meant to be. Gunnar Hansen is absolutely extraordinary as Leatherface. An amazing performance with his features obscured and no real dialogue to speak of. I don't think it's an exaggeration to compare it to Boris Karloff in the original 'Frankenstein'. Leatherface is a horror icon, and 'The Texas Chain Saw Massacre' is a landmark movie that remains essential viewing for every horror buff. It's a sensational movie that still has the power to confront, disturb and terrify audiences worldwide!",
         "I decided to get this movie for my annual Hallowe'en scarefest, a week early...as the new one was out in theatres, I felt a need to see the original first, and bow am I glad I did... The whole movie just blew me away, I turned off all the phones, chat programs and so on, and just let the story hit me. I think what is still with me after this is the sense of fear and utter WEIRDNESS that emanates from the movie... And it all seemed so realistic...no hokey fountains of blood, no running into the shower, or overused cliches, just a bunch of kids that need to get some gas, meet some very odd characters (The Hitchhiker is superb) and then fall into the wrong place at the wrong time... I think Hooper must have had some divine inspiration, because each of Leatherface's scenes is exquisitely planned and executed, from the first guy who gets dragged down, to Pam, to the encounter with Franklin and Sally in the woods (how chilling and scary was that, and yet how clever, to chase someone in the woods equipped with...a chainsaw) to the end. Very, very unsettling as well, from the beginning to the final dinner scene, to the unforgettable whirling dance by Leatherface at the end. Simply put, the best horror movie ever...if this doesn't scare you, then nothing will, sadly.",
         "Texas Chain Saw Massacre, this movie is a legend in the horror genre. I have heard so much about this movie, the interesting thing is, my mom told me it's one of the bloodiest movies she's ever seen, then she paused and said \"Wait, actually there wasn't that much blood\u0085 it's just creepy\". So I had to see this movie, was it really that scary? Is it really that bloody? Is it really that creepy? I had to see for myself, so of course I bought the movie, it was on sale, watched it during the day, not much effect, was pretty disappointed. But then my friends came over and we wanted to watch a scary movie and they all saw that I had The Texas Chain Saw Massacre, we turned off the lights, turned on the surround sound and then the screams came as I realized this is one messed up movie! Sally Hardesty and her wheelchair-bound brother Franklin travel with three friends to a cemetery where the Hardestys' grandfather is buried to investigate reports of vandalism and corpse defilement. Afterward, they decide to visit an old Hardesty family homestead, and on the way, the group picks up a hitchhiker. The man speaks and acts bizarrely, and then slashes himself and Franklin with a straight razor before being forced from the group's van. Franklin tells Kirk and Pam about a local swimming hole, and the couple heads off to find it. Instead, they stumble upon a nearby house. Kirk decides to ask the residents for some gas, while Pam waits on the front steps. Receiving no answer but finding the door unlocked, Kirk enters the house and is immediately murdered by Leatherface. Pam enters soon after to find the house filled with furniture made from human bones. She attempts to flee but is caught by Leatherface and impaled on a meat hook. At sunset, Sally's boyfriend Jerry heads out to look for the others. Finding the couple's blanket outside the neighboring house, he investigates and finds Pam still alive inside a freezer. Before he can react, Leatherface appears and kills him, stuffing Pam back inside the freezer afterward. With darkness setting, Sally and Franklin set out to find their friends. As they near the killer's house, calling for the others, Leatherface lunges out of the darkness and murders Franklin with a chainsaw. She is captured and invited to Leatherface's house for a family dinner she'll never forget. Movies from the 1970's are so special to me, the reason why I think some of the greatest horror movies came out of that decade is due to the fact that directors didn't hold back like today. Most directors of today's Hollywood are too scared of the censors or go too far and make the audience gag rather than scream. The Texas Chain Saw Massacre I'm sure Tobe Hooper wasn't exactly expecting this movie to become the classic it has. Leatherface is frightening and I'm not so sure I'd accept an invitation from him and his family for dinner. I think they made the Manson family look like the Cleavers, you haven't seen a horror film until you've seen The Texas Chain Saw Massacre. 10/10",
         "Let me begin by saying that there are precious few movies that can actually scare the crap out of you, and this is one of them. The tension that this movie generates is overwhelming at times, and if you watch it with someone who's never seen it before, be sure to keep your eye on them. You'll probably notice a look of disbelief on their unsuspecting face. Anyone who doesn't like being scared will end up being unable to finish this movie. People who have a taste for the brutally bizarre will probably hit play again after the credits roll. In light of all this, I must also say that in some respects, TCM's bark is much worse than it's bite. Being banned in so many countries for so long, and having a title that includes the phrase 'Chainsaw Massacre', has seemingly led many people to believe that there is an undue amount of gore in it. However, there simply isn't. Gore is not where the scares are in this one. The scares come from the absolutely brutal and bizarre scenarios that befall poor Sally Hardesty. In closing, I'd also like to go out on a limb and make the following grandiose statement: TCM is the greatest horror film of all time! Not bad for Tobe Hoopers' first effort.",
         "This movie set the stage for the onslaught of classic modern horror of the late 70's and early 80's. Tobe Hooper's vision paints a drab and disturbing picture of a family of cannibals who hunt their victims using any means necessary for survival. Caught up in this whole mess is a group of young people, unaware of what lurks down an old back road of Texas. Hunger is our most probable urge as human beings, and this family takes this idea to the extreme. Each family member is their own character with their own feelings and their own personalities. One such character, Leatherface, stands out for the fact that he was born without a face, thus using human skin to gain an identity. This is what sets him apart from other slashers such as Michael Myers and Jason Vorhees for they hid behind masks. It's safe to say he's not the only insane one in this bunch. Every one of them are one fry short of a happy meal and I am sure they like it that way. Gunnar Hansen did a great job of playing Leatherface, sculpting a faceless killer who slew not for fun but for survival. His perfect killer image was later destroyed by other actors in later sequels. Many people refuse to watch this movie in the first place because of what they've heard and because of the title. Strangely, some even walked out of the theaters on the previews for this thing. That's just how strong this movie actually is. There's really a lot less gore in this movie than most people think. It's Tobe Hooper's great directing that pelts the viewer with suspense. The last 10 minutes of this film are some of the most exciting, terrify shots ever put on film. All because of Leatherface, many people's nightmares will be dominated by the hum of a chainsaw.",
         "The (original) Texas Chainsaw Massacre, is without a doubt in my mind, the most impressive horror film to date. No other horror film stays with you in the same way. You feel not only fearful for the characters, but at times feel afraid for your own safety. The natural lighting and loose, improvised acting style creates a strong sense of reality that no other horror film can possibly achieve. Under a thin layer of dated aesthetics (1973 style of dress) lies the most dangerous, horrifying and psychotic world ever committed to script or screen. As the first of its kind, this movie set the mold for the modern horror film, though none were ever to realize any comparable distinction. It gave birth to the \"slasher\" genre (for better or for worse) . It is also one of few timeless films that has managed to combine horror and avant-garde styles, successfully. Unlike its remake, this one is more of an exercise in minimalism and simplicity (think even Dogme). The expert subtlety of the filmmakers; Tobe Hooper (writer/director), Kim Henkel (co-writer) and Daniel Pearl (cinematographer) results more in psychological terror than in gore. The air-tight script, jarring realism and attention to detail are unparalleled in practically any film, horror or otherwise. And last, but by far not the least Marylin Burns PHENOMENAL performance is the only in cinematic history (a close second by that of Shelly Duvall in The Shining) that evokes such a nature of desperate and primal fear. You truly believe in every single one of her screams that her life is hanging by a single, thin thread."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Vortex"],
      "summaries": [
         "En route to visit their grandfather's grave (which has apparently been ritualistically desecrated), five teenagers drive past a slaughterhouse, pick up (and quickly drop) a sinister hitch-hiker, eat some delicious home-cured meat at a roadside gas station, before ending up at the old family home... where they're plunged into a never-ending nightmare as they meet a family of cannibals who more than make up in power tools what they lack in social skills...",
         "The year is 1974. A group of five close friends are heading through the back roads of Texas en route to their grandfather's potentially vandalized grave. Among them are Sally Hardesty, and her invalid brother Franklin. They encounter an unpleasant hitchhiker (Neal) who slashes both himself & Franklin with a wicked-looking knife. The others manage to eject the hitchhiker from the vehicle, but shortly after wards, they are forced to stop & wander over to a small, sinister clapboard house nearby in hopes for gas. What none of them realize is that this house is the home of the ghoulish Leatherface (Hansen) and his evil, demented family of cannibalistic psychopaths. One at a time, the teens are murdered by the evil Leatherface in horrifying ways. Sally soon finds herself an involuntary guest at Leatherface's home, and flees into the night to escape the demented cannibal and his loudly-buzzing chainsaw. Can she escape the grim fate that befell her friends & brother? Based on the terrifying true story of Ed Gein.",
         "A group of five hippies on a road trip through the backwaters of 1970's rural Texas fall prey to a murderous cannibalistic family making up of a leather-masked chainsaw-wielding maniac, his knife-wielding grave robber brother, and their cannibal chief father and decaying grandfather.",
         "Upon hearing that vandals have desecrated a graveyard where her grandfather is buried, Sally recruits her boyfriend Jerry, her brother Franklyn, and her friends Pam and Kirk to investigate. On a side trip to the grandfather's deserted farm, the travellers pick up a slimy hitchhiker who cuts himself and slashes Franklyn. After arriving at the farm, Pam and Kirk search for an old swimming hole--Kirk hears a generator and believes he can find some gasoline. He enters the house hoping to find the owner. Unfortunately, this is the home of the hitchhiker, as well as Leatherface, who has some surprises for the travellers consisting of sledgehammers, chainsaws, and assorted cutlery.",
         "Sally Hardesty and her wheelchaired brother Franklin along with three friends travel to a cemetary where there have been grave robbings.To continue their trip, they pick a hitchiker. The hitchiker turns out to be crazy so they drop him off and proceed with the trip. They go to visit an old house where Sally and Franklins' Grandfather used to live . One follows a trail from the back of the house and that's when it all begins.",
         "Five friends visiting their grandfather's house in the country are hunted and terrorized by a chain-saw wielding killer and his family of grave-robbing cannibals."
      ],
      "budget": 83532
   },
   "movielensId": 2459,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1974-10-01",
      "dvdReleaseDate": "2003-10-14",
      "directors": ["Tobe Hooper"],
      "runtime": 83,
      "movieId": 2459,
      "title": "The Texas Chain Saw Massacre",
      "mpaa": "R",
      "actors": [
         "Marilyn Burns",
         "Allen Danziger",
         "Paul A. Partain",
         "William Vail",
         "Teri McMinn",
         "Edwin Neal",
         "Jim Siedow",
         "Gunnar Hansen",
         "John Dugan",
         "Robert Courtin",
         "William Creamer",
         "John Henry Faulk",
         "Jerry Green",
         "Ed Guinn",
         "Joe Bill Hogan",
         "Perry Lorenz",
         "John Larroquette"
      ],
      "imdbMovieId": "0072271",
      "originalTitle": "The Texas Chain Saw Massacre",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "eY4ldz615FA",
         "-VFA1sH2ujU"
      ],
      "plotSummary": "Five friends visiting their grandfather's house in the country are hunted and terrorized by a chain-saw wielding killer and his family of grave-robbing cannibals.",
      "tmdbMovieId": 30497,
      "avgRating": 3.26637,
      "releaseYear": "1974",
      "numRatings": 3878,
      "posterPath": "/hXF5nuEvUIlMXv4fOCIhA8KWaN2.jpg"
   }
}