{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "post-apocalyptic",
            "id": 4458
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "ape",
            "id": 14759
         }
      ],
      "imdb_id": "tt0069768",
      "video": false,
      "title": "Battle for the Planet of the Apes",
      "recommendations": [
         1688,
         1687,
         1685,
         871,
         172,
         9610,
         11411,
         168,
         11234,
         157,
         10651,
         174,
         9531,
         11935,
         152,
         10768,
         193,
         10328,
         11950,
         33518
      ],
      "backdrop_path": "/kz5aml9pRPFg9oTCSViyJXSKbCW.jpg",
      "revenue": 8844595,
      "reviews": [{
         "author": "Ian Beale",
         "id": "58a5eb05c3a3681b95000a3b",
         "content": "**The best of the sequels**\r\n\r\n_Battle for the Planet of the Apes_ is the best of the Planet of the Apes sequels - a film packed with emotion and incident. Caesar (Roddy McDowall) seeks his parents in the ruins of a destroyrd city and irks a gang of crazed freaks who all wear silly hats and _skiing goggles_.\r\n\r\nLeonard Rosenman gives us a nice score and the photography is beautiful. The classiest looking of the Apes sequels and definitely the most emotional. Just stick with the first movie and this one.\r\n\r\n- Ian Beale",
         "url": "https://www.themoviedb.org/review/58a5eb05c3a3681b95000a3b"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Caesar",
               "gender": 2,
               "credit_id": "52fe430ec3a36847f8037199",
               "name": "Roddy McDowall",
               "profile_path": "/2vwhHtQoICsqrKB5YVzFPiPKtdA.jpg",
               "id": 7505,
               "order": 0
            },
            {
               "cast_id": 21,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "52fe430ec3a36847f80371bf",
               "name": "Natalie Trundy",
               "profile_path": "/50ljrtCFeFQRFURoSgf1hrgdCPw.jpg",
               "id": 18648,
               "order": 1
            },
            {
               "cast_id": 23,
               "character": "MacDonald",
               "gender": 2,
               "credit_id": "52fe430ec3a36847f80371c7",
               "name": "Austin Stoker",
               "profile_path": "/ukRtXDLGlmaSE4lAruhAqG7IsLJ.jpg",
               "id": 103707,
               "order": 2
            },
            {
               "cast_id": 26,
               "character": "Kolp",
               "gender": 2,
               "credit_id": "52fe430ec3a36847f80371d3",
               "name": "Severn Darden",
               "profile_path": "/aLIhcERvzViemlgvTovyKJ7A6zZ.jpg",
               "id": 99829,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Aldo",
               "gender": 2,
               "credit_id": "52fe430ec3a36847f80371a9",
               "name": "Claude Akins",
               "profile_path": "/ul0S3Eb0yt2UC8h5xUuNXQHxdy8.jpg",
               "id": 4307,
               "order": 4
            },
            {
               "cast_id": 22,
               "character": "Virgil",
               "gender": 2,
               "credit_id": "52fe430ec3a36847f80371c3",
               "name": "Paul Williams",
               "profile_path": "/qkGR5o0Yl8Q1PitH6N422NunOiN.jpg",
               "id": 35040,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Mutant",
               "gender": 2,
               "credit_id": "52fe430ec3a36847f80371a5",
               "name": "Richard Eastham",
               "profile_path": "/y4scEOQ0t8K7lf2dYCh06cifpM.jpg",
               "id": 18678,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Mandemus",
               "gender": 2,
               "credit_id": "52fe430ec3a36847f803719d",
               "name": "Lew Ayres",
               "profile_path": "/8Z3YPfpxj5dR9jR5GGXWaoGmjAu.jpg",
               "id": 2007,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Cornelius II",
               "gender": 2,
               "credit_id": "52fe430ec3a36847f80371a1",
               "name": "Bobby Porter",
               "profile_path": null,
               "id": 18677,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Teacher",
               "gender": 2,
               "credit_id": "52fe430ec3a36847f80371cb",
               "name": "Noah Keen",
               "profile_path": null,
               "id": 106121,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Alma",
               "gender": 1,
               "credit_id": "52fe430ec3a36847f80371cf",
               "name": "France Nuyen",
               "profile_path": "/fzwelsavSKYpwtYGBox9JXqkweD.jpg",
               "id": 16096,
               "order": 10
            },
            {
               "cast_id": 27,
               "character": "Mendez",
               "gender": 2,
               "credit_id": "52fe430ec3a36847f80371d7",
               "name": "Paul Stevens",
               "profile_path": null,
               "id": 160494,
               "order": 11
            },
            {
               "cast_id": 28,
               "character": "Doctor",
               "gender": 1,
               "credit_id": "52fe430ec3a36847f80371db",
               "name": "Heather Lowe",
               "profile_path": null,
               "id": 153641,
               "order": 12
            },
            {
               "cast_id": 29,
               "character": "Jake",
               "gender": 2,
               "credit_id": "52fe430ec3a36847f80371df",
               "name": "Michael Stearns",
               "profile_path": null,
               "id": 101453,
               "order": 13
            },
            {
               "cast_id": 30,
               "character": "Soldier",
               "gender": 2,
               "credit_id": "52fe430ec3a36847f80371e3",
               "name": "Cal Wilson",
               "profile_path": null,
               "id": 196057,
               "order": 14
            },
            {
               "cast_id": 32,
               "character": "Julie",
               "gender": 1,
               "credit_id": "52fe430ec3a36847f80371ed",
               "name": "Colleen Camp",
               "profile_path": "/3SbQnaC4SjykOIPDzrDlyIKzD9I.jpg",
               "id": 13023,
               "order": 15
            },
            {
               "cast_id": 33,
               "character": "The Lawgiver",
               "gender": 2,
               "credit_id": "57da197b92514150dd0006c4",
               "name": "John Huston",
               "profile_path": "/1YV2m0943zGmgQaHHgtFuQhOEKl.jpg",
               "id": 6593,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe430ec3a36847f8037177",
               "name": "J. Lee Thompson",
               "profile_path": "/cVHgJwHOh4j7q1tn3vQEcopblrJ.jpg",
               "id": 18669,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe430ec3a36847f803717d",
               "name": "Paul Dehn",
               "profile_path": null,
               "id": 9916,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe430ec3a36847f8037183",
               "name": "Leonard Rosenman",
               "profile_path": null,
               "id": 2027,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe430ec3a36847f8037189",
               "name": "Richard H. Kline",
               "profile_path": "/1b9iffgT1rS9ff2erVOaPhVowW8.jpg",
               "id": 1762,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe430ec3a36847f803718f",
               "name": "John C. Horger",
               "profile_path": null,
               "id": 18672,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe430ec3a36847f8037195",
               "name": "Alan Jaggs",
               "profile_path": null,
               "id": 18665,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe430ec3a36847f80371b5",
               "name": "John William Corrington",
               "profile_path": null,
               "id": 68683,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe430ec3a36847f80371bb",
               "name": "Joyce Hooper Corrington",
               "profile_path": null,
               "id": 68684,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe430ec3a36847f80371e9",
               "name": "Arthur P. Jacobs",
               "profile_path": null,
               "id": 13269,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5885941cc3a3684d6d002f53",
               "name": "Pierre Boulle",
               "profile_path": null,
               "id": 12240,
               "department": "Writing",
               "job": "Characters"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 11.210699,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1705,
      "vote_count": 273,
      "budget": 1700000,
      "overview": "The fifth and final episode in the Planet of the Apes series. After the collapse of human civilization, a community of intelligent apes led by Caesar lives in harmony with a group of humans. Gorilla General Aldo tries to cause an ape civil war and a community of human mutants who live beneath a destroyed city try to conquer those whom they perceive as enemies. All leading to the finale.",
      "similar": [
         869,
         871,
         198663,
         119450,
         861,
         76341,
         131631,
         157350,
         263115,
         281,
         604,
         605,
         335984,
         185063,
         9482,
         7512,
         9739,
         9381,
         1685,
         12244
      ],
      "original_title": "Battle for the Planet of the Apes",
      "runtime": 93,
      "poster_path": "/2tx8XXPU6lSerxDnIhYwror52LV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Apjac International",
            "id": 22542,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1973-06-15",
      "vote_average": 5.6,
      "belongs_to_collection": {
         "backdrop_path": "/eYf3GRnuVCgeFQfEo0qK7ua5rCR.jpg",
         "name": "Planet of the Apes Original Collection",
         "id": 1709,
         "poster_path": "/r7TBDEcpBAuFoqdtUz7z2nSeFej.jpg"
      },
      "tagline": "The final chapter in the incredible Apes saga. The most suspenseful showdown ever filmed as two civilizations battle for the right to inherit what's left of the earth!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["J. Lee Thompson"],
      "runtime": 93,
      "synopsis": "Set in a flashback in the former North American continent of the early 21st century in the year 2003, and told by the Great Lawgiver, this latest Planet of the Apes sequel focuses on the chimpanzee ape leader, Caesar (Roddy McDowall), more then a decade after he led the ape revolution in the previous film, 'Conquest of the Planet of the Apes'. In this post-nuclear war society, Caesar tries to cultivate peace between his simian peers and the surviving remains of humanity. A militant gorilla general named Aldo (Claude Akins) however opposes this. Therefore, he plots Caesar's overthrow and doom. Caesar is now married to the chimpanzee Lisa (Natalie Trundy), the female chimpanzee ape of the previous film, and they have a son, named Cornelius (Bobby Porter) in honor of Caesar's late father. Caesar regrets having never known his parents until his human assistant MacDonald (Austin Stoker) informs him that by viewing video taped archives of his parents, he can learn about the future. Caesar learns the archives are in the Forbidden City, once the city in which Caesar was enslaved, and is now in nuclear ruins. After obtaining weapons from an armory run by the orangutan Mandemus (Lew Ayres), Caesar travels with MacDonald and the orangutan Virgil (Paul Williams) to the Forbidden City and sneaks in to find the recorded archives. However, there are radiation-scarred humans still living in the Forbidden City, now under the command of Governor Kolp (Severn Darden), the former police chief under the late Governor Beck and who is now the current leader and governor. Caesar and his party view the video recordings of Cornelius and Zira (from 'Escape from the Planet of the Apes') and learn about the future of the world, but barely have enough time to study the tapes before they must escape or risk capture or death. Back in Ape City, Caesar assembles a meeting with the citizens to report his discoveries at the Forbidden City. Aldo objects when some humans show up at the meeting and leads the gorillas away. The three-man scout group sent by Governor Kolp return and tell them about the Ape City. Kolp considers this clandestine entrance by Caesar an act of espionage while his subordinate Méndez (Paul Stevens) says that they did nothing wrong and should be allowed to go in peace. Governor Kolp then declares war on Ape City, mustering the mutant humans from the Forbidden City to destroy the ape society once and for all. That night, Aldo is furious over the fact that Caesar wants to co-exist peacefully with humans and plots a military coup in order to install himself as the leader of Ape City. Cornelius (while climbing a tree) overhears this when trying to catch his pet squirrel, but is spotted by Aldo who hacks at the branch with his sword causing Cornelius to fall to the ground and suffer serious injuries and he becomes bedridden. After one of the ape scouts is wounded by Governor Kolp, Aldo takes action into his own hands and orders all humans rounded into the corral. Then, Aldo leads the gorillas to loot Mandemus' armory for its weapons. Cornelius succumbs to his wounds leaving Caesar devastated. Upon learning about Aldo's actions from Virgil, Caesar leaves Cornelius's side to confront Aldo, but Kolp's ragtag force of mutant humans launches their attack against Ape City at that moment delaying Caesar's and Aldo's confrontation until after the battle as both Caesar and Aldo are forced to team up to fight the attacking mutant humans. The mutants attack on Ape City initially succeeds after an artillery barrage destroys or damages many homes and buildings, forcing Caesar to order the defenders to fall back. When Kolp finds Caesar lying wounded amongst the apes on the ground, he taunts him saying the apes would once again be humanity's slaves or die, and is about to shoot him. But then Lisa cries out, and Kolp is distracted. Caesar shouts, \"Now, fight like apes!,\" and most of the fallen apes all around them, who were feigning death (clearly on Caesar's orders) or hiding, launch a counter-attack that captures most of the mutants and drives Kolp into retreat. Kolp and his remaining forces are killed by Aldo and his mounted troops. After the battle, Aldo wants to kill the humans in the pen, but Caesar shields them for they were not part of Kolp's army and thus killed nobody. Aldo declares that Caesar should be killed if he shields the humans. But before he can carry this out, he lets it slip that Cornelius' death was not due to an accident, but Aldo's malevolence. The ape community immediately grows angry and concludes that the society's sacred law (\"ape must never kill ape\") has been broken. As the community repeats \"ape has killed ape!\", an infuriated Caesar pursues Aldo up a large tree, and their fight results in Aldo's death when he falls. Caesar then goes to free the humans, but they refuse to leave the pen unless things change. MacDonald insists that freedom is meaningless without being treated as equals. Caesar then realizes the apes are just as evil and despicable as the former slave-owners if they treat the humans as second class citizens. The apes and humans then decide to co-exist with one another and begin to work side-by-side in rebuilding their community and make a new society. In the final scene, the wizened orangutan teacher at the beginning of the film, known in ape society as the Great Lawgiver (John Huston), finishes the narration begun in the prologue all about the life of the late great chimpanzee leader Caesar who united the world in peace... to a mixed group of young human and ape children in an outdoor classroom. The setting is now in the year 2670, over 600 years in the future. In complete contrast to the first 'Planet of the Apes' movie, instead of humanity falling and apes rising to take their place as the dominant species on Earth, the two species have continued to co-exist. When asked by a human child at what the future will hold and if man and ape will continue to live together in peace (among the next 1,300 years before the first 'Planet of the Apes' movie thus bringing the series full circle), the Lawgiver states that only the dead know about the future. The final shot zooms over to a life-size stone statue of Caesar and shows a single tear falling from the statue's left eye.",
      "writers": [
         "Pierre Boulle",
         "Paul Dehn"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069768/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3NDA3OTg4M15BMl5BanBnXkFtZTgwNDgxMjUzMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Roddy McDowall, Claude Akins, Natalie Trundy | See full cast and crew »"],
      "reviews": [
         "This movie isn't as bad as many people think it is.. As far as sequels go, I can think of worse ones. It also ends on a very positive note. It is pretty entertaining, especially if you like the previous \"Apes\" movies.",
         "SPOILERS ON WHOLE SERIES I'll not say I like this movie - it IS pants, but having seen it recently after all the other 4 in succession I realised something I had never understood before. Some of you might already know this and hence think I'm dumb .. OK, others might disagree with me .. also OK but this is intended for those of you who had the same viewpoint on the series as I previously did. I had thought that the films III, IV and V had simply explained events prior to the first movie but after seeing Battle again, I saw that the past had been changed due to the apes going back in time after the destruction of the earth. Here are my reasons, and the evidence grows stronger as episode 3 progresses to episode 5 : Episode 3 : In the timeline before episode 1, no talking apes had arrived in the 20th century therefore the past has already begun to change. Cornelius claims an ape named Aldo had been the one who first spoke the word 'No' to his masters. He also revealed the plague of cats and dogs was in another century than the 20th (I forget which). Episode 4 : The plague of cats and dogs has already taken place - the bacteria obviously having been brought back from the future by the 3 apes in the spacecraft. Cornelius' son is the ape to give rise to revolution - not Aldo as he had claimed in part 3. Episode 5 : The entire film can basically be forgotten except for the ending. The battle scene is particularly useless, having been more like an end-of-episode fight from the A-Team rather than a battle for the destiny of a planet. However, we end with the statue of the lawgiver as Caesar (a chimpanzee), and not one of an orangutan as shown in the first two movies. We also see ape and human children sitting side by side as equals, which is perhaps the biggest hint. For me, this put the series into a new perspective and I appreciate it more now. What had previously appeared to be inconsistencies between episodes turned out to be intended differences. Any comments on the above are most welcome - agree or disagree or just call me stupid for not realising this is blatantly obvious to the rest of you! I apologise in advance for any factual errors I have made due to this being all from memory and no references being consulted.",
         "Definitely the weakest in the series...but alas...my favorite. The final human battle to take over what's left of the Earth is good. One major flaw in the actual battle is when the battle starts we see Aldo and his cavalry charge----then we don't see them again until the battle is over...throwing grenades in the bus. I had this film on Super 8 back in the seventies (the color 9 minute version) and it was a favorite of the neighborhood.",
         "Rarely does the restoration of deleted scenes added back into a film work to its benefit. The Extended Edition of Battle for the Planet of the Apes is one of those rare exceptions. The fifth and final chapter in the Apes theatrical series is generally regarded as its weakest link. It had the lowest budget of all of the films in the series and it painfully shows and looks more like it's a made-for-TV movie. In fact, it feels almost like a pilot for the Planet of the Apes Television Series. The film begins in the year 2670 and is bookended with John Houston as the revered ape Lawgiver reading from the sacred scrolls like a bedtime storyteller. From here the story is told in flashback and the viewer is left scratching their heads by the befuddling logic. Events not clearly explained are left to the viewer to make assumptions or draw conclusions about the contradictory order of events. It must be assumed that a nuclear war had devastated the Earth immediately after the ape uprising in Conquest and somehow only a decade afterward the ape society had unbelievably evolved their verbal powers of speech and intelligence. These facts are inconsistent with Cornelius' explanation of the apes' evolution in Escape in which he explains that the plague that destroyed all cats and dogs occurred some 200 years later than it did in Conquest and that Aldo was the first ape to utter human speech when he said the word \"No\" which was spoken by Lisa in Conquest, and that Aldo led the revolt against the humans which was led by Caesar. We can only conclude that the incongruent events in Conquest and Battle are the events of an alternate timeline forged by the creation of the temporal paradox from Cornelius and Zira's arrival in Escape. The apes also adorn costumes similar to the fashions of the ape society from the first film which had evolved over several thousand years but again this is only a decade after their revolt against the humans (one explanation could be that since this story is told as a flashback to ape and human children we are seeing it as depicted by their imaginations as a point of reference). MacDonald in this film is not the same MacDonald who was the Governor's Adjutant in Conquest but rather his brother which is confusing since Caesar appeared to have found a human sympathizer and ally in the MacDonald from Conquest and the only reasonable explanation for the deliberate change of character is that MacDonald is played by a different actor this time, but if you aren't paying close attention, you are likely to miss that inference. Ape City is located in a very lush and hospitable forest area within miles of the inhospitable desert wasteland of the annihilated Forbidden City. Automobiles such as jeeps and school buses still work somehow and were not rendered inoperable by the EMP of the atomic detonation. Radioactive half-life apparently only affects the surviving humans living within the irradiated remains of the Forbidden City and the apes can somehow sustain bombardments of high levels of radioactive fallout for a few hours while they search its archives for a videotape of Cornelius and Zira which also amazingly happened to not be vaporized or magnetically degaussed by the atomic blast. The mutated humans all wear skull caps for the purpose of (take your pick): A.) protecting their craniums from high radiation levels B.) to hide the fact that their hair has completely fallen out due to radioactive fallout C.) to enhance telepathic reception of their now-suddenly mutated telekinetic minds or D.) All of the above. The newly restored scenes with the human mutants and the Alpha-Omega bomb at least help to make some sense of the rather weak narrative and gaps of logic and provide some continuity to the rest of the series. These scenes are significant because it shows the mutants beginning to hone their developing telepathic powers and it establishes the fundamental doctrine of their quasi-religious sect that will worship the Alpha-Omega bomb in future generations. It almost feels more like a direct prequel to Beneath now. Why this subplot was excised is almost as baffling as the film's logic but one reason perhaps is the fact that the film ends with a more optimistic outlook suggesting that the timeline of events were changed when Caesar united the apes and the humans and that the crisis of Beneath may have been averted but it is left open for the audience to decide from the ambiguous tear of the weeping statue of Caesar suggesting that perhaps the fateful events of the future cannot be avoided after all. Battle is definitely the worst of the five apes films but compared to most low-budget sci-fi shlock I've seen, it's really not as bad as it's made out to be, but judged against the superior standard set precedent by the first film it is a quite a disappointment. In addition to the restored scenes, there are few highlights that make the film worth at least a viewing if you have enjoyed watching the other films in this series at all. Of particular interest are the sets of the melted down post-apocalyptic Forbidden City that are just visually interesting to look at, even if the obvious matte paintings were composited into the background. It gives the film a future-coda feel in a way that evokes images of James Cameron's The Terminator but pre-dates it over a decade. If nothing else, Battle was at least influential in inspiring other science fiction films in the genre and was the template for subsequent franchises and was more than influential to George Lucas and his Star Wars mega-merchandising empire that would follow only a few years later and the Planet of the Apes series would forever be buried under its apocalypse and reside in the realm of Saturday afternoon and late-night television broadcasts.",
         "As far as I know, this one usually gets a bad rap, but I've always liked it a lot (but then, it was only the second one I saw, right after \"Conquest\"). How can you NOT like Severn Darden as the leader of the mutants? (He really walks a line between being serious and funny, being mainly a comedy actor.) And France Nuyen (in probably a smaller part than she'd been used to), as his aide, who's a little like a secretary with a crush on the boss, only in this weird setting. And Austin Stoker (an actor I know from hardly anything else) as McDonald, Caesar's human friend, was very believable. And of course, it was probably the Ape movie with the most well-known actors in ape roles - Claude Akins, Lew Ayres, John Huston, Paul Williams. There's one thing I never completely thought about till the last time I saw it (only days ago) - practically the last moment of the story (apart from the crying statue) does something that almost \"deflates\" the \"message\" of these movies - after all the endless strife between the apes and humans in these stories, the last thing you see is the little ape jokingly pulling the hair of the little girl. So even in the sequels (not just the original, which does get credit for this), the writers didn't really take the whole thing TOO seriously.",
         "Okay, by now the series had just about run its course and it was obvious that it would be concluding soon. However, there was one final film for the original series to go and they actually managed to come up with a credible reason for a followup. It was NOT so easy to make movie #3, as the Earth had just blown up and no logical reason could resurrect the series (so, in the 3rd film, they came up with a totally illogical reason!). This film was set only a few years after the fourth film, CONQUEST OF THE PLANET OF THE APES. Unexpectedly, the new society that Caesar set up after the last film was pretty egalitarian and the humans were not all confined to become slaves--though there were a lot of rumblings from the gorillas who for some odd reason carried a grudge after being tortured and enslaved by the humans! One serious flaw with the film, though, is that although this only takes place perhaps a decade later, all the apes are civilized and can talk, use guns, etc. as well as any of the humans! I am a school teacher and I only PRAY that I get students this smart!! Anyways, back to the review. It turns out that although this society is functioning pretty well, not all the humans have fallen to the apes. Nope. Ignorant and nihilistic humans STILL hold out hopes of wiping out the basically decent apes and re-asserting mankind's hold over the planet. Well, without getting into the complex plot, the film boils down to a final battle with the bad humans. The apes win, but in the process the evilness of the gorillas is exposed, as they murder Caesar's son! It seemed the bad gorillas SHOULD have teamed up with the bad humans after all!! The film concludes leaving the viewer to ponder what will become of the perfect ape society--will it actually degenerate to what it would become in movie #1 or would all the positive changes in this movie avert that awful future and the destruction of the Earth?!? I guess we'll never know. The first time I saw this movie, I didn't like it very much. However, in seeing it again, it had a good plot, acting and was a worthy conclusion to the series. A few points in conclusion: it was cool to see the singer Paul Williams as an ape in this movie (it probably took less make-up than usual), there was a short-lived TV series that followed, and if anyone thinks the remake from 2001 was great is an idiot.",
         "This final installment in the series may be a bit corny, but it sure as hell does provide us with some action. Humans and apes are again at war, and as a result a lot of stuff explodes, that's pretty much the summary. The usual philosophic remarks are thrown in, but they just work up to the battle the title promised. The action scenes are pretty chaotic but still look good, especially the scene early in the movie where they enter the forbidden zone/undergrond parking lot works out well. By this time the actors knew what they were making and seemed to be loving it, Claude Akins hams it up like crazy. His portrayal of man-hating general Aldo has one dimension, and that dimension is really built to last. We meet Aldo and he's angry, we see him again later and he's angry, and then finally he's well what do you know, angry. His best scene comes near the ending though, you'll know it when you see it. You can say a lot of negative things about this movie, but boring it ain't.",
         "So the final entry in the Planet of the Apes series takes liberties with the timeline and the plot wanders through other prior installments, but I feel the movie delivers a degree of pathos seldom seen in a sequel. The bookend scenes involving the Lawgiver, John Huston in heavy make up, speaking to a group of schoolchildren--apes and humans--tie up the saga nicely, leaving open the future for more sequels.(Tim Burton in his dreadful remake should have filled in the blanks instead of \"reimagining\" a different world of apes. Only my opinion.) Things I like include the character Mandemus, keeper of the armory(Caesar's conscience), the trek to the radioactive city, Caesar's viewing of his dead parents in the Hall of Records and the final ambiguous shot of the movie. The money allocated to Leonard Rosenman's impressive score was well spent. The pop singer Paul Williams display a deft touch for acting in his debut. Try and catch this screen gem on Fox Movie Channel and you will be treated to additional scenes involving the always looming doomsday bomb. And special praise to J.Lee Thompson for delivering more with less.",
         "This movie had big ambitions:the hero,Ceasar,Cornelius's and Zira's son,has to change the future,like Bruce Willis would have to do a quarter of century later in \"twelve monkeys\" -no pun intended-.But the results are not up to scratch,by a long shot:the last two sequels are the poorest of a saga which brilliantly began with Shaffner's classic in 1967(adapted from Pierre -Bridge on the river Kwai-Boulle's absorbing book). One should note than the first five minutes are footage from 'escape from....\" which tend to reinforce Ceasar's Christlike nature ;and it's even enhanced by John Huston's patriarch \"lawgiver\" (sic) character. And if we consider there are still two or three minutes of footage of \"escape\" in the middle of the movie,one realizes \"battle\" is really short weight.No character on the screen ( in spite of Roddy McDowall) can sustain interest as Taylor,Nova,Cornelius,Zira,Zaius and co used to do. Better watch the first one again and again,and avoid Burton's remake.",
         "Battle for the Planet of the Apes makes for a fantastic conclusion to the Apes saga. The plot involves morality, revenge and evil, and all this is handled pretty well by director J Lee Thompson. Roddy McDowell establishes himself as the ultimate Ape actor with this movie. His performance as Ceaser this time around is more mellow, but all the more enjoyable. The central plot revolves around the ancient Ape theory that Ape should not kill Ape, just as in real life worlds Humans should not kill Human. McDowell handles the scenes withn the death of his son at the hands of an evil Ape, who goes against the theory, excellently. His portrayal of an anguished Ceasar is a memorable and haunting one. Singer Paul Williams turns up as a friend to Ceasar and the movie contains excellent make-up, matte work and Battle scenes. Battle for the Planet of the Apes would in turn inspire the future Ape adventures in the medium of television. The final shot of the statue of Ceasar crying is well handled, memorable and hopefull."
      ],
      "genres": [
         "Action",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Apjac International",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": [
         "After conquering the oppressive humans in \"Conquest for the Planet of the Apes\", Caesar must now keep the peace among the humans and apes. Gorilla General Aldo views things differently, and tries to cause an ape civil war. In the meantime, other human survivors learn of the ape city, and decide they want to take back civilization for themselves, thus setting the stage of warring ape factions and humans.",
         "Ten years after conquering the Earth, ape leader Caesar wants the ruling apes and enslaved humans to live in peace. But warring factions of apes led by a militant gorilla general as well as various human groups threaten the stability."
      ],
      "budget": 1800000
   },
   "movielensId": 2531,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-06-15",
      "dvdReleaseDate": "2000-08-15",
      "directors": ["J. Lee Thompson"],
      "runtime": 93,
      "movieId": 2531,
      "title": "Battle for the Planet of the Apes",
      "mpaa": "G",
      "actors": [
         "Roddy McDowall",
         "Natalie Trundy",
         "Austin Stoker",
         "Severn Darden",
         "Claude Akins",
         "Paul Williams",
         "Richard Eastham",
         "Lew Ayres",
         "Bobby Porter",
         "Noah Keen",
         "France Nuyen",
         "Paul Stevens",
         "Heather Lowe",
         "Michael Stearns",
         "Cal Wilson",
         "Colleen Camp",
         "John Huston"
      ],
      "imdbMovieId": "0069768",
      "originalTitle": "Battle for the Planet of the Apes",
      "genres": [
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["d_FFlLeh5nM"],
      "plotSummary": "The fifth and final episode in the Planet of the Apes series. After the collapse of human civilization, a community of intelligent apes led by Caesar lives in harmony with a group of humans. Gorilla General Aldo tries to cause an ape civil war and a community of human mutants who live beneath a destroyed city try to conquer those whom they perceive as enemies. All leading to the finale.",
      "tmdbMovieId": 1705,
      "avgRating": 2.789,
      "releaseYear": "1973",
      "numRatings": 2263,
      "posterPath": "/83csUnvqANWfR2f4vchoTyFMl0d.jpg"
   }
}