{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "cloud",
            "id": 3124
         },
         {
            "name": "razor",
            "id": 3125
         },
         {
            "name": "ant",
            "id": 3126
         },
         {
            "name": "surreal",
            "id": 3307
         },
         {
            "name": "donkey",
            "id": 4144
         },
         {
            "name": "surrealism",
            "id": 9887
         },
         {
            "name": "priest",
            "id": 10093
         },
         {
            "name": "midnight movie",
            "id": 11487
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "severed hand",
            "id": 166862
         },
         {
            "name": "piano",
            "id": 207592
         },
         {
            "name": "short",
            "id": 214549
         }
      ],
      "imdb_id": "tt0020530",
      "video": false,
      "title": "Un chien andalou",
      "recommendations": [
         775,
         5698,
         5729,
         234,
         992,
         4593,
         36265,
         26317,
         780,
         643,
         662,
         614,
         800,
         147,
         631,
         29264,
         653,
         490,
         833,
         8327
      ],
      "backdrop_path": "/5XUmngHuhc41kMwv7ZeRWaplcBl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Man in Prolog",
               "gender": 2,
               "credit_id": "52fe4260c3a36847f8019863",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Seminarist",
               "gender": 0,
               "credit_id": "52fe4260c3a36847f8019867",
               "name": "Salvador Dalí",
               "profile_path": "/151bXN94CxxFQq1IDntXO8UOLX4.jpg",
               "id": 8988,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Man",
               "gender": 0,
               "credit_id": "52fe4260c3a36847f801986b",
               "name": "Pierre Batcheff",
               "profile_path": "/gCYsyewY2t4K4GM7D7vavlPBlDW.jpg",
               "id": 8992,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Young Girl",
               "gender": 0,
               "credit_id": "52fe4260c3a36847f801986f",
               "name": "Simone Mareuil",
               "profile_path": "/uuTknKDhwvggccjwzXAliWjWxW8.jpg",
               "id": 8993,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Young Man",
               "gender": 2,
               "credit_id": "52fe4260c3a36847f8019873",
               "name": "Robert Hommet",
               "profile_path": "/dvXSfSFPm1yYpw7AlxxWOU2z71P.jpg",
               "id": 8994,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Seminarist",
               "gender": 0,
               "credit_id": "52fe4260c3a36847f8019877",
               "name": "Marval",
               "profile_path": null,
               "id": 8995,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Hermaphrodite",
               "gender": 0,
               "credit_id": "52fe4260c3a36847f801987b",
               "name": "Fano Messan",
               "profile_path": null,
               "id": 8996,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Fat Seminarist",
               "gender": 0,
               "credit_id": "52fe4260c3a36847f801987f",
               "name": "Jaume Miravitlles",
               "profile_path": null,
               "id": 8997,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4260c3a36847f801983b",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4260c3a36847f8019847",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4260c3a36847f801984d",
               "name": "Albert Duverger",
               "profile_path": null,
               "id": 8989,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4260c3a36847f8019853",
               "name": "Jimmy Berliet",
               "profile_path": null,
               "id": 8990,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4260c3a36847f8019859",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4260c3a36847f801985f",
               "name": "Pierre Schild",
               "profile_path": null,
               "id": 8991,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59d3e83d9251414b7f00489b",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 0,
               "credit_id": "59d3e84e9251414b990046e7",
               "name": "Salvador Dalí",
               "profile_path": "/151bXN94CxxFQq1IDntXO8UOLX4.jpg",
               "id": 8988,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 2,
               "credit_id": "59d3e8bdc3a36845500047a0",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "59d76bea925141252c00c5de",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a73cee60e0a266435016705",
               "name": "Salvador Dalí",
               "profile_path": "/151bXN94CxxFQq1IDntXO8UOLX4.jpg",
               "id": 8988,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a73cf01c3a36859fc0174b3",
               "name": "Pierre Braunberger",
               "profile_path": null,
               "id": 1082571,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a73cf410e0a2664330169a5",
               "name": "Albert Dubergen",
               "profile_path": null,
               "id": 1971297,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5a73cf4cc3a3685a0c015f5a",
               "name": "Albert Dubergen",
               "profile_path": null,
               "id": 1971298,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5a73cf55925141059c01493e",
               "name": "Jimmy Berliet",
               "profile_path": null,
               "id": 8990,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 7.224533,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 626,
      "vote_count": 351,
      "budget": 0,
      "overview": "Un Chien Andalou is a classic European avant-garde surrealist film from the cooperation of director Luis Buñuel and Salvador Dali. The film changed the way people made movies. Most famous is the scene of a woman’s eye being cut with a knife.",
      "similar": [
         46624,
         12092,
         1903,
         18,
         627,
         1429,
         150540,
         68,
         11360,
         638,
         1694,
         24920,
         326359,
         4593,
         985,
         36040,
         8852,
         775,
         11834,
         4977
      ],
      "original_title": "Un chien andalou",
      "runtime": 16,
      "poster_path": "/pSkFYEvz6gpy1LExdXe27y2X0FD.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Luis Buñuel",
         "id": 85822,
         "origin_country": ""
      }],
      "release_date": "1929-06-05",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Luis Buñuel"],
      "runtime": 16,
      "synopsis": null,
      "writers": [
         "Salvador Dalí",
         "Luis Buñuel"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0020530/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0NDkyMDk0MF5BMl5BanBnXkFtZTgwODQ3ODMwMzE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Pierre Batcheff, Simone Mareuil, Luis Buñuel | See full cast and crew »"],
      "reviews": [
         "Good way to sample the filmography of Luis Bunuel is to begin with this surreal short. An excellent intro to Bunuel's more mature work because his films are full of bizarre images that began here. Un Chien Andalou(1929) like the rest of Bunuel's early works experiments with use of film image and surrealism. Illustrates the beginning of a career full of amazing, bizarre, and subversive films. Things could only get better for Bunuel's film career and they did. Un Chien Andalou(1929) was an artful collaboration between two surrealistic masters in Luis Bunuel and Salvador Dali. These two artists were part of a surrealism movement in Spain that influenced the country's art. Bunuel and Dali had a fruitful but short film partnership that ended once each wanted to go their separate ways. After the early 1930s these talented artists would never work with each other again. For Un Chien Andalou(1929), Bunuel and Dali created images of eccentric force based on their day and night dreams. Surrealism was very popular in early 20th Century art especially during the 1920s. The surrealist movement took shape in places like France and Spain where it flourished for a period of time before falling apart in 1930s. Un Chien Andalou(1929) is a good example of what made the surrealist movement tick. Salvador Dali designs images with social and symbolic meanings. Bunuel's skills as a surrealist as first shown here would become more abstract once he started mastering his craft. Plotless short film that is basically a series of images. Un Chien Andalou(1929) is an 'Absolute Film' which relies on abstract imagery in an attempt to unnerve the viewer. In Bunuel's early films, imagery took precedent over things like dialogue and plot. In the history of cinema its a rarity especially since the beginning of the sound era for pure imagery to be the sole existence in a motion picture. Un Chien Andalou(1929) contains images that ranges from the erotic, frightening, funny, strange, and symbolic. Bunuel's direction for Un Chien Andalou(1929) is very good considering its his first piece of cinematic work as a film director. He uses the same type of dreamlike logic here that prevails in his best films. He directs each image with unlimited imagination. Direction for Un Chien Andalou(1929) may be crude a little unsophisticated but its still fascinating to observe. Luis Bunuel first put his name among the cinematic ranks with the historical important, Un Chien Andalou(1929). Forever immortalized on celluloid is the eye slicing image of Un Chien Andalou(1929). Cinema's fascination with eye motif probably began here and continued from then on. The destruction of sight is an important them in Un Chien Andalou(1929) and other cinematic works. Jean Vigo remarked in opinion of eye slicing image, \"Is it more dreadful than the Spectacle of a cloud veiling a full moon\"? Eye slicing image was influential to Italian horror espically to the films of Lucio Fulci and Mario Bava(the former did an updated version of image with eye penetration moment from Zombie Flesh Eaters[1979]). Caused an enormous scandal in the late 1920s with depiction of disturbing and outright strange imagery. I can picture the reaction of disgust and shock on audiences faces as they watch tongue tied at the images that bombard their senses. Un Chien Andalou(1929) may have lost a little of its shock power by today's standards. Still this short film continues to retain the ability to dare which is an improbability in today's Hollywood cinema. Luis Bunuel's next film, L'Age D'Or(1930) caused an even bigger scandal and riots broke out during the film's opening show. Not much in the way of substancial acting in a film where characters exist only as impulses and symbols. One of the most important pieces of film during first half of 20th Century cinema. Showed filmmakers that the power to provoke is as important as acting, cinemtography, dialogue, and plot. Un Chien Andalou I think is a forethought to the daring and subversive films of period covering 1967 to 1977. Un Chien Andalou(1929) I feel is the near last of a group of films concerned with film imagery that occupied the silent film genre for twenty plus years. A motion picture ahead of its time in more ways than one. One reason its ahead of its time is the image of a woman's bare naked breasts being touched by male hands. Image such as one mentioned above was unusual for the period the film was made. Also, there are a couple of images in the film that are on the slightly gory side. Obviously done by a young Bunuel who was more sexually open minded than the older man who though an on screen kiss was obscene. Bunuel's fetishes and Obsessions that occupied the images of Un Chien Andalou becomes maturely developed in later films. Couple of motifs from Un Chien Andalou shows up in films like Simon del Desierto(1965). Dreamlike imagery of short frequents the stories of El Angel Exterminador(1962) and Belle De Jour(1967). Its a warmup to Bunuel's next film, L'Age D'Or(1930) which is also his first feature length film. Un Chien Andalou(1929) is an exercise in artistic expression and artistic vision by an artistic genius.",
         "Couple of weeks ago I visited Philadelphia Museum of Art. One of the reasons I went there was to try to see the Salvador Dali's exhibitions but the tickets have been sold until the end of April. While in the museum, I was able to see two films that Dali was a big part of. In the video Gallery of the museum, two intriguing projects have been running together in the continuous loop, the early \"Un Chien Andalou\" (17 minutes) and the recently released, animated Destino (6 minutes). This was the first viewing for me. I kept coming back to the gallery for few more times and I never was tired of both short films. The inspiration for \"Un Chien Andalou\" began with the dreams of two men, two artists, and two friends. Luis Bunuel and Salvador Dali exchanged the dreams they both had, Bunuel - about a slender cloud slicing the moon in half \"like a razor blade slicing through an eye\", and Dali - about a dream involving a hand enveloped by ants. Both artists soon began working on a film script based on these ideas. Made in 1929, the film has not aged at all. The film's disconnected but haunting scenes and images are as shocking today (at least, for me they were) as I am sure they were 75 years ago. The reason the film is so powerful today may be in the themes of love, sex, death, and decay that are eternal and will always attract the artists and audiences alike. It is also could be in the establishing and following by both artists the certain rules, \"No idea or image that might lend itself to a rational explanation of any kind will be accepted...We had to open all doors to the irrational and keep only those images that surprised us without trying to explain why.\" Perhaps, Dali and Bunuel intended their film to be experienced directly and not analyzed by the viewers.",
         "\"Sitting comfortably in a dark room, dazzled by the light and the movement which exert a quasi-hypnotic power... fascinated by the interest of human faces and the rapid changes of place, [a] cultivated individual placidly accepts the most appalling themes...and all this naturally sanctioned by habitual morality, government, and international censorship, religion, dominated by good taste and enlivened by white humor and other prosaic imperatives of reality.\" - Luis Bunuel Un Chien Andalou exists to shock the viewer of this stupor that Bunuel elucidates above. Freudian dream imagery, amorphous space/time, and absurdist humor combine in this drawn out mating ritual between a confused cyclist and the female he pursues. May be the most inventive fifteen minutes of film anywhere.",
         "\"Un Chien Andalou\" is amazing. A fifteen minute dream that's both breathtaking and eerie. This was the first film collaboration between Luis Bunuel and Salvador Dali. They both wanted to take their dreams and put it into a film. I must say they succeeded. The film is most notorious for the beginning sequence of the razor across the eye. The film was definitely ahead of its time. Even today, more than 75 years later, the image is still disturbing. A cow eye was used for the effect. The film also has a severed hand, ants that crawl from a wound and a man's Frudian like sexual obsession with a woman. If you are interested in surrealism or surreal films, this would be a perfect place to start.",
         "Even those who do not like Buñuel's \"Un Chien Andalou\" will probably never forget it once they see it. It's one of the weirder and more interesting films that you'll ever run across, and even aside from its significance, it would be worth seeing for the distinctive style and material. It is also very well-crafted, despite its apparently chaotic narrative (or lack thereof). Even when it is impossible to attach meaning to some of the images, it seems clear that it has been filmed almost exactly as Buñuel and Dali intended. Even the music seems to have been chosen deliberately, and at times it complements the images surprisingly well. While the exact meanings of many of the symbols are probably deliberately obscure, it strongly suggests some general themes such as desire, frustration, and the like. To attempt to analyze it carefully is almost certainly a mistake, and it is probably best taken as a dream or a dream-like series of events without the kinds of obvious connections that one might want to find. Likewise, it's hard to determine just how good or how important it may be. The extreme disregard of cinema conventions is hard to evaluate now, in that the movie itself established some alternative conventions of a sort. The images themselves are often fascinating, sometimes unsettling or even off-putting, almost always interesting and suggestive. Perhaps the one thing that can be said about such a movie without much risk of going astray is that almost anyone who has a real interest in cinema or cinema history will (or ought to) want to see \"Un Chien Andalou\" for himself or herself. Hearing it described by someone else really cannot adequately convey what it is like.",
         "Probably the greatest short film in existence, and one of the most influential films ever. Preferable, in my view, to the longer follow-up *L'Age d'Or*, if only because *Un Chien Andalou* wastes no time trying to construct an even peripheral narrative. Just seventeen minutes of masterly, bizarre images and dream-logic. There's something gratifying in the fact that, in Bunuel's first film, Bunuel himself is practically the first thing we see. After he cuts open a woman's eyeball with a straight razor, we see him no more. A fine introduction. The famous Slitting of the Eyeball constitutes Bunuel's clarion call for cinema to ATTACK the audience right at the organ with which it consumes the medium. From that point on, he never looked back during the next five decades of movie-making. You'll notice I've waited this long to mention his putative collaborator on *Un Chien Andalou*, Salvador Dali. That's because dragging him along is wearisome, and frankly, not even germane. This movie is strictly Bunuel's baby, and I don't care what the credits say: we get the guns, bugs, rotting carcasses, sexual fetishism, and idiotic clergymen that featured in almost every Bunuel film that followed this one. I'm not sure which part of the movie constituted Dali's dreams . . . but from where I'm sitting, *Andalou* strikes me as wholly Bunuelian. It's also not as sloppy as some critics have made out. The images may be as disconnected as in any dream, but the logic behind them is rooted in the aesthetic philosophies of the great Surrealists like Artaud, Cocteau, and the rest of 'em. Don't kid yourself into believing that Bunuel was a lazy hack with a camera, the directorial equivalent of a homely poet scribbling free verse at your local Starbucks. He knew exactly what he was doing, and in this film, made each of those seventeen minutes count. There is a ruthless economy actuating all that kinky whimsy. A landmark achievement that prodded the medium forward even as it announced the zenith of the Surrealist movement. 10 stars out of 10.",
         "Distilled surrealism. 100% pure but joyously unrefined. This film can never age, it will still be slicing film students' eyes wide open a hundred years from now. As movies get more and more codified it's a real joy to watch something like this, utterly freewheeling. What makes 'Un chien andalou' exciting for me is that it's so replete with imagery that an instinctual human fear of anarchy kicks in and you can't help trying to piece it all together somehow, as if it were one of those 3D art posters and if you stared at it long enough you'd finally \"get it.\" Yet it just can't be understood in any conventional way, and anyone who tells you otherwise is simply trying to push their own subconscious on you. I don't have anything against Wagner but this film should definitely be watched without the distraction of the score that Buñuel added later.",
         "Luis Buñuel, Calanda, in the province of Teruel in the south of the region called Aragón, a town itself afamed for the twenty-four hour non-stop drums (`la tamborada') in the streets played by hundreds of people together in Holy Week, as a young man fled to Paris with the intention of doing something great in this world. There he met Salvador Dalí who had done the same, leaving his native Catalonia in his mid twenties - some five years younger than Buñuel - with more or less the same ideas in his head. These two young men, who in later years were to be known - even admired in some cases - as the most extravagant and flamboyant creators of art, were not alone. Pablo Picasso, not yet 50, had already been blazing the trail, to mention another Spaniard among those thronging the avant-garde Paris of the times. Claude Debussy and Maurice Ravel had led the impressionist movement in music for many years, and the `Imagiste' school in poetry was well under way. Anybody who was anybody in the artistic world flocked to Paris, and either made a hit and became someone eminent, or did not. Cinema was a new art form still to be experimented with; no wonder, then, that these two men of evidently original ideas trying to burst out of them, had to do something so as to gatecrash into the gentry of the established circles of artistes and would-be artistes or hangers-on. The Buñuel-Dalí tandem knew they would produce something different; not necessarily to scandalize anyone, but more with the purpose of attracting attention, whether from intellectuals, artists or their entrepreneurs, or just newspaper editors. Simply following the logical sequence that words can be poetic and an image is worth a thousand words, and that poetry can be abstract, thus so can images, and if they move - better still. Buñuel got a bit of money out of his mother's purse, and thus the two young men had finance to start on making an abstract poetic sequence which did not pretend to have any logical meaning of any kind. `Un Chien Andalou' was to exist in the same way that any later painting either by Picasso or by Dalí himself would exist without necessarily purporting to mean anything, either significant or insignificant, and without necessarily any implicit objective - far less objective - raison d'etre than simply existing in itself. Whether the result could or should be considered `art' in any quintessential sense is/was up to the pundits, pseudointellectuals, newspaper critics, or anybody else who thought he had any ideas on the matter. Buñuel himself says in his autobiography `My Last Breath' that he would have quite happily burnt the film, but that would not have made any difference anyway. `Un Chien Andalou' was the only silent film he made; whether because of lack of funds or otherwise intentionally, is hard to say. `L'Age d'Or' one year later had sound; however I cannot help thinking that Buñuel and Dali wanted to make a silent film, which then does not explain why in the 1960s Buñuel chose to add music - Wagner interspersed with a tango, a blatently at-odds combination - which would seem to have been some attempt at being unfaithful to the original. But Buñuel was nothing if not a contradictory person, to say the least. But by the 1960s he was beginning to turn out his best repertoire - `Viridiana' (qv), `Tristana', etc - and maybe his sense of maturity reigned over his other feelings, compelling him to `up-date' the film for newer audiences, even though he might be accused of unloyalty. But, how does one remain loyal to abstract concepts which defy rationality? Thus `Un Chien Andalou' remains one of the most misunderstood pieces of art to have ever been made public, and is perhaps the most widely-known short film of all time.",
         "this movie may be dated in a certain sense, but the vitality and passion of its vicious rebellion against societal taboos and constraints still comes through full throttle. bunuel, master of cinematic/surrealist revolt, violates every boundary he can think of. a woman's eyeball is slashed open, her chest brutally groped, ants crawl out of a man's hand, etc. this is more of a curiosity than anything else, but I am a surrealism fanatic and love this along with Cocteau's \"Blood of a Poet\". the reviewers here who downplay it's value are simply wrong and probably decided in advance to dislike it to look different.",
         "This is a truly ground-breaking movie. Surrealist geniuses Dali and Bunuel combined their powers and produced this short collection of shocking scenes. This is the film that first showed that art is not there only to please the audience but also to annoy and depict our darkest thoughts and dreams. The proof of its success is that nowadays the shock value is almost zero (except the ultra-famous eye scene). What then seemed an outrageous and demoralizing attempt is now common practice. I still think though that given their talents, they could do an even better movie if they were more serious about it, but one should not forget they were two young guys trying to revolt against the establishment."
      ],
      "genres": ["Short"],
      "productionCompanies": [],
      "summaries": [
         "A surrealistic film with input from Salvador Dalí, director Luis Buñuel presents stark, surrealistic images that shock the viewers including the slitting open of a woman's eye and a dead horse being pulled along on top of a piano. Obviously open to interpretation - from deep meanings to it all meaning absolutely nothing - it is certain that this short (17 minutes) film presented something new in the cinema of its day.",
         "In a dream-like sequence, a woman's eye is slit open--juxtaposed with a similarly shaped cloud obsucuring the moon moving in the same direction as the knife through the eye--to grab the audience's attention. The French phrase \"ants in the palms,\" (which means that someone is \"itching\" to kill) is shown literally. A man pulls a piano along with the tablets of the Ten Commandments and a dead donkey towards the woman he's itching to kill. A shot of differently striped objects is repeatedly used to connect scenes.",
         "Un Chien Andalou consists of seventeen minutes of bizarre and surreal images that may or may not mean anything. A straight razor seems to be placed by a woman's eye, a small cloud formation obscures the moon, a cow's eye is slit open, a woman pokes at a severed hand in the street with his cane, a man drags two grand pianos containing dead and rotting donkeys and live priests, and a man's hand has a hole in the palm from which ants emerge."
      ],
      "budget": 0
   },
   "movielensId": 25771,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1929-06-05",
      "dvdReleaseDate": "2004-12-26",
      "directors": ["Luis Buñuel"],
      "runtime": 16,
      "movieId": 25771,
      "title": "Un chien andalou",
      "mpaa": null,
      "actors": [
         "Luis Buñuel",
         "Salvador Dalí",
         "Pierre Batcheff",
         "Simone Mareuil",
         "Robert Hommet",
         "Marval",
         "Fano Messan",
         "Jaume Miravitlles"
      ],
      "imdbMovieId": "0020530",
      "originalTitle": "Un chien andalou",
      "genres": [
         "Drama",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["BVbTEVfLksU"],
      "plotSummary": "Un Chien Andalou is a classic European avant-garde surrealist film from the cooperation of director Luis Buñuel and Salvador Dali. The film changed the way people made movies. Most famous is the scene of a woman’s eye being cut with a knife.",
      "tmdbMovieId": 626,
      "avgRating": 3.78189,
      "releaseYear": "1929",
      "numRatings": 1082,
      "posterPath": "/pSkFYEvz6gpy1LExdXe27y2X0FD.jpg"
   }
}