{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "coronation",
            "id": 2505
         },
         {
            "name": "villain",
            "id": 3289
         },
         {
            "name": "kingdom",
            "id": 4152
         },
         {
            "name": "heir to the throne",
            "id": 5515
         },
         {
            "name": "royalty",
            "id": 9920
         },
         {
            "name": "mistaken identity",
            "id": 10325
         },
         {
            "name": "king",
            "id": 13084
         },
         {
            "name": "identity swap",
            "id": 177035
         },
         {
            "name": "monarch",
            "id": 204060
         },
         {
            "name": "lookalikes",
            "id": 235228
         },
         {
            "name": "beautiful princess",
            "id": 236891
         }
      ],
      "imdb_id": "tt0029442",
      "video": false,
      "title": "The Prisoner of Zenda",
      "recommendations": [
         27470,
         151431,
         37038,
         91727,
         21335,
         31694,
         16939,
         132263,
         41206,
         37550,
         28431,
         35032,
         43130,
         38077
      ],
      "backdrop_path": "/hqXPFYoSfw2RvCrH9OLOlrNTrD2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Major Rudolf Rassendyll / The Prisoner of Zenda",
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fcff3",
               "name": "Ronald Colman",
               "profile_path": "/eYzmXamTV6CpqwxZqTEJSBRNlb0.jpg",
               "id": 29522,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Princess Flavia",
               "gender": 1,
               "credit_id": "52fe4667c3a36847f80fcff7",
               "name": "Madeleine Carroll",
               "profile_path": "/pDsBAfEuYtjd36RXvEqzSm10LeL.jpg",
               "id": 3610,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Black Michael",
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fcfff",
               "name": "Raymond Massey",
               "profile_path": "/hGum9pfA0NOSD1CYXyG4TYc3upQ.jpg",
               "id": 2669,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Antoinette de Mauban",
               "gender": 1,
               "credit_id": "52fe4667c3a36847f80fd003",
               "name": "Mary Astor",
               "profile_path": "/w1KLRK5J5SRXkqONL9WS8exhKgp.jpg",
               "id": 13992,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Rupert of Hentzau",
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd00b",
               "name": "Douglas Fairbanks Jr.",
               "profile_path": "/A8hI3VdDpt40pFQqljlc6WidrJv.jpg",
               "id": 51762,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Colonel Zapt",
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fcffb",
               "name": "C. Aubrey Smith",
               "profile_path": "/u00cKiTSCbCeFLaTPL6ykgqB5AB.jpg",
               "id": 2438,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Captain Fritz von Tarlenheim",
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd007",
               "name": "David Niven",
               "profile_path": "/xslrziGA3B24iQ7BG9IO0ugycDo.jpg",
               "id": 14261,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Detchard",
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd00f",
               "name": "Montagu Love",
               "profile_path": "/j4lOtL9TTR60lblXCK6McgdIcXe.jpg",
               "id": 92907,
               "order": 7
            },
            {
               "cast_id": 25,
               "character": "Albert von Lauengram",
               "gender": 0,
               "credit_id": "5971d5519251417fa600c5e8",
               "name": "Philip Sleeman",
               "profile_path": null,
               "id": 1312720,
               "order": 8
            },
            {
               "cast_id": 26,
               "character": "Frau Holf the Cook",
               "gender": 0,
               "credit_id": "5971d56e9251412d4c049d27",
               "name": "Eleanor Wesselhoeft",
               "profile_path": null,
               "id": 103016,
               "order": 9
            },
            {
               "cast_id": 27,
               "character": "Max the Butler",
               "gender": 2,
               "credit_id": "5971d588c3a3687c7d00c09a",
               "name": "Torben Meyer",
               "profile_path": "/aEVmODp4Fv3TxaDiNpoIJC5ubx7.jpg",
               "id": 12153,
               "order": 10
            },
            {
               "cast_id": 28,
               "character": "Krafstein",
               "gender": 0,
               "credit_id": "5971d5a8925141130100bfbe",
               "name": "Wilhelm von Brincken",
               "profile_path": "/gdPMkkvybQwk30Bj4QAZ2JhkC30.jpg",
               "id": 229609,
               "order": 11
            },
            {
               "cast_id": 29,
               "character": "Lord Topham (uncredited)",
               "gender": 2,
               "credit_id": "5a49649a0e0a262dc500477a",
               "name": "Ben Webster",
               "profile_path": null,
               "id": 22601,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fcfe9",
               "name": "John Cromwell",
               "profile_path": "/1osYpgUy3zABKeFRjyBX0K4qcY9.jpg",
               "id": 31497,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fcfef",
               "name": "W.S. Van Dyke",
               "profile_path": "/npK68MUyjJD3gZHhF04xBaXnuqd.jpg",
               "id": 32427,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd015",
               "name": "Anthony Hope",
               "profile_path": null,
               "id": 18908,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd01b",
               "name": "John L. Balderston",
               "profile_path": null,
               "id": 1546,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4667c3a36847f80fd021",
               "name": "Edward E. Rose",
               "profile_path": null,
               "id": 1168853,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd027",
               "name": "Wells Root",
               "profile_path": null,
               "id": 96253,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd02d",
               "name": "Donald Ogden Stewart",
               "profile_path": "/eS4tJHSN4fm81yXXiUXnvoRnmGu.jpg",
               "id": 14676,
               "department": "Crew",
               "job": "Additional Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "5633ebd2c3a3681b590157fa",
               "name": "James Wong Howe",
               "profile_path": "/rbAffvKfJYrfLCuuYPzXKSSyU6t.jpg",
               "id": 14569,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5633ebdc9251414ab7013e89",
               "name": "Bert Glennon",
               "profile_path": "/xLzo0JqItVHAm8OqlhyRQxEw5k9.jpg",
               "id": 14960,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5633ebe5c3a3681b4d017d71",
               "name": "James E. Newcom",
               "profile_path": null,
               "id": 68417,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5633ebf092514129fe0084f1",
               "name": "Lyle R. Wheeler",
               "profile_path": null,
               "id": 3358,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5633ebfcc3a3681b61016595",
               "name": "Ernest Dryden",
               "profile_path": null,
               "id": 33276,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5633ec08c3a3681b52015a68",
               "name": "Oscar Lagerstrom",
               "profile_path": null,
               "id": 1368085,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 2,
               "credit_id": "572655fcc3a36858710006eb",
               "name": "Alfred Newman",
               "profile_path": "/498k6KmplSJPvWzAecS7eUnaBNg.jpg",
               "id": 8503,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.917954,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43867,
      "vote_count": 11,
      "budget": 0,
      "overview": "An Englishman on a Ruritarian holiday must impersonate the king when the rightful monarch, a distant cousin, is drugged and kidnapped.",
      "similar": [
         28431,
         2312,
         1732,
         10473,
         810,
         275,
         2270,
         150689,
         9880,
         270487,
         585,
         2163,
         1619,
         984,
         38542,
         11645,
         9828,
         12493,
         373569,
         9039
      ],
      "original_title": "The Prisoner of Zenda",
      "runtime": 101,
      "poster_path": "/tqckdN1b3xi7ICV82xK9HU1Vz6N.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Selznick International Pictures",
            "id": 1553,
            "origin_country": ""
         }
      ],
      "release_date": "1937-09-03",
      "vote_average": 8.4,
      "belongs_to_collection": null,
      "tagline": "The most thrilling swordfight ever filmed...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "John Cromwell",
         "W.S. Van Dyke"
      ],
      "runtime": 101,
      "synopsis": "Having got off the train, Rudolf Rassendyll, a British subject, dressed up in the typical tweeds of an English sportsman, is going through passport check at a small principality somewhere in Europe. He is asked whether he is here for the coronation, he tells them he is on a fishing holiday. He notices that people keep staring at him. He thinks it must be his dress. By way of explanation he says Of course you dont dress this way in your country, but you see we dont dress your way in England. His English humour is lost on his audience. Actually, minus his goatee, he has a striking resemblance to the soon to be crowned king of the principality. While fishing in what turns out be to extremely troubled waters, he is spotted by the king and his body guards, an old Colonel and his aide, the young David Niven, also out hunting. The king Rudolf V and the commoner Rudolf stare at each other. The king, who has already had a few, says, \"It is too early in the day to be seeing double. On comparing notes they find out that they are cousins, far, far, far removed. Rudolf with his typical British humour says We owe this kinship to your great-great-great-grandfather Rudolf and my great-great-great-grandmother Amelia.\" The king is delighted and says, then you must attend my coronation tomorrow, but for now let us retreat to my hunting lodge for drinks and dinner. The drinking and the gaiety goes on and on under the watchful eyes of the Colonel. A toast is drunk to great-great-great-grandfather Rudolf and is reciprocated for great-great-great-grandmother Amelia. \"Who should we drink to now, asks the already tipsy king. I would drink to prince Michael, my half brother, but he does not love me. He thinks the world is wrong. He thinks he ought to be me and I ought to be he. Let us instead drink to my cousin Flavia soon to be my bride and queen. I havent seen her for years, she and I did not get on very well then. Perhaps we shall now. They say she is too good for me, perhaps she is. You know what they say about me dont you? I drink too much.\" The king wants another bottle brought from the cellar for his English guest. The king pours a drink but finds that his guest is already snoring. He drinks it himself and slumps to the floor. In the morning one sniff of the bottle tells the Colonel that the king has been drugged, most certainly the handiwork of the black prince Michael to keep the king away from the coronation. It appears the king will not come around for many hours. He tells Rudolf, \"if my king is not crowned today, he never will be. Prince Michael wants the crown and the queen. Only you can help us.\" \"My dear Colonel I came here on a fishing trip, I like to fish. I couldnt begin to act like a king even if I tried. I wouldnt deceive any body. Saying this he starts smiling. Colonel What do you find so amusing.\" \"It would be a scene wouldnt it, the cathedral crowded to the doors, Organ booming, I kneel to be crowned. Then your friend Michael steps forward and says This isnt the king. This is an Englishman named Rudolf Rassendyll. Colonel - Then Michael sits on the throne today and the king lies in prison or his grave, and Princess Flavia marries that scoundrel.\" \"You cant let that happen to her.\" \"Can you?\" \"Rudolf ruminating, After all, it would only for a day. Wouldnt it.\" \"By tonight you will be safely across the border.\" \"King for a day. What would it mean if I fail.\" \"Your life and mine and of young David.\" \"The king is laid down in the cellar in charge of the lodge keeper. As they depart, David salutes the king, \"Sleep well sire, we go to see you crowned.\" During the train journey to the capital, Rudolf is briefed on the coronation ceremony and made to learn by rote the speech he would have to make. As they alight the train the Colonel murmurs God save the king. Rudolf says God save both of them. Prince Michael is planning to announce that the king will not be coming for the coronation and has abdicated in his favour, when suddenly he hears the bugles heralding the arrival of the King. He dispatches his henchmen to the hunting lodge to find out what had gone wrong. Inside the cathedral, Rudolf comes face to face with Michael who stares at him as if seeing a ghost. The elder brother, as per custom, lends his arm to the younger brother to guide him to the throne. The Cardinal places the crown on the kings head. He stands up with his sword held aloft and recites his rehearsed speech about defending the realm against all enemies etc. While Rudolf is reciting the rather longish speech, the Colonel and David listen most anxiously with bated breaths and exhale a sigh of relief as he completes the speech without faltering. Then princess Flavia walks to the throne down the long corridor, flanked on both sides by courtiers, kneels down before the king and swears allegiance. Rudolf lifts her up by the shoulders, they momentarily stand side by side and then start to walk out of the cathedral to the waiting royal carriage Unsure of himself, Rudolf falls back on small talk, \"Well, I think it all went off very well, dont you, for a coronation. Of course, I mean, that is, a coronation should go well, if a king puts in an appearance, properly dressed and looks his part.\" \"And sober.\" \"Well, that was a nasty one. By the way among my Many other failings, I rather neglected you, didnt I.\" \"Two picture post cards in three years, I think.\" \"And all the time youve been changing into the loveliest princess in Europe. No, the loveliest girl in Europe.\" \"Your dynastic obligations to the princess royal dont compel you to make pretty speeches to her in private.\" Rudolf, pointing to the teeming crowds on both sides says, \"You call this private.\" \"You really behaved and looked like a king today. Something, I confess, few of us expected of you.\" Arriving at the royal palace they both appear on the balcony to the adulations of the gathered subjects. And from there retreat to an inner room. \"I think wed better go out, theyre expecting.\" \"Dont go yet. Its such a relief to have you to myself for a moment. All day long Ive been on parade. Cheered at, waved at, stared at. Not a chance to say - - - .\" \"Say what?\" \"Its enough to make any man lose his head a bit. I am crowned king. I meet the loveliest, most beautiful woman - - - - \" \"That isnt what you used to say. You used to call me tow-headed scarecrow.\" \"No! I hope you slapped me.\" \"I did. And once I kicked you very hard.\" \"Where?\" \"In the garden.\" \"I deserved it. But I've reformed.\" \"Almost beyond recognition. You seem an entirely different person. I cant understand.\" \"Dont try. Just stand there and let me look at you.\" \"But once you really hurt me. Youve forgotten, havent you.\" \"What did I do?\" \"It was at my 14th birthday party and I thought I was grown up. Your father told you to dance with me. You said you wouldnt, that I was a beastly infant. And when he insisted, you pinched me all the time we were dancing and told me how gawky I was. I hated you.\" \"I should have been horse whipped.\" Rudolf keeps Michael waiting outside before he can come in to pay his feigned respects. Rudolf takes a few jibes at him including how he had enjoyed the bottle of wine Michael had sent for him to the hunting lodge. Michael takes leave. \"Rudolf please be careful, Michael hates you. If you wont think of yourself, think of me. All my life Ive known what my future had to be and I was resigned to it. And now I dont have to tell you how different it is.\" \"Forgive me Flavia, I have been unfair.\" \"I only want you to know how much your life means to your country.\" \"To my country?\" \"And to your friends.\" \"My friends?\" \"And to your cousin and, most loving servant.\" Flavia gets up to leave saying, \"I will see you tomorrow.\" Rudolf repeats sadly to himself tomorrow, knowing he would not be here tomorrow. Colonel says to Rudolf, \"let us hurry back to the lodge to bring back the king and bid you farewell.\" At the lodge they find that the king has been kidnapped and taken prisoner to prince Michaels Castle of Zenda. Rudolf now perforce becomes the king for more than one day. \"At the coronation ball, Flavia waltzing with Rudolf says You look troubled.\" \"I was only thinking there may never be another night like this, another waltz.\" \"We shall always waltz together, Rudolf.\" Rudolf sees the British Ambassador approaching. He knows the Ambassador and is worried he might recognize him. The Cardinal joins them and asks for a date for the wedding. Rudlof, unsure of when the king can be brought back, says, in six months time. \"Cardinal- that is rather a long postponement.\" Unable to reveal the real reason, Rudolf prevaricates, \"There's an old proverb your eminence. Something about crossing your bridges before you come to them.\" \"Ambasador If your majesty will examine that proverb, you will find how very difficult it would be to cross a bridge at any other time!\" Moving away the Ambassador tells his wife, did you notice how much the king resembles our young Rudolf. Not at all - a typical wifely response. Princess Flavia is most upset about the postponement and starts to leave the ball. Rudolf begs her to listen to him. \"I never could willingly do anything to hurt you.\" \"I still dont understand.\" \"Then will you believe this without understanding that I love you.\" \"Oh, is it true or do you say that because you must.\" How the king is rescued from the prison in Zenda is a long and tortuous tale of jelousy, treachery, loyalty and bravery, the last by Rudolf himself in no small measure. Not much unlike the twists and turns in our Indian films of that period. The king says to him, \"I want to tell my people what you have done for us but I am told this has to be kept secret. You could not have served me better, you have taught me how to be a king.\" \"Princess Flavia wants to see Rudolf before he leaves for England.\" \"Rudolf presents himself Your highness.\" \"I sent for you to thank you for the service youve done this kingdom and its king.\" \"I love you. With my whole heart and soul, I love you. In all else I have been an imposter, but not in that. From the first moment I saw you in the cathedral youve been the only woman in the world for me. As I stand now, I know there'll never be any other.\" \"It would have made no difference if Id known. It was always you and never the king.\" \"Come with me, I wont give you up. I wont let them stand in the way of our happiness.\" \"Theres a world outside. Our world. And a throne for you, a womans throne, in my heart.\" \"I want that.\" \"Oh my love, think. Youll be free. Free of all these cares and duties - - - - .\" \"He sees the expression on her face change and asks, what is it Flavia?\" \"I was born for these cares and duties, Rudolf, Help me to do what I was born to do. Help me to do what I must. But how can I do that, I love you.\" \"If love were all you would have left the king to die in his cell. Honour binds a woman too, Rudolf. I must stay.\" -Khurshid Anwer-",
      "writers": [
         "Anthony Hope",
         "John L. Balderston"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0029442/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0NzU2MTgzMl5BMl5BanBnXkFtZTgwMzc1NDgzMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ronald Colman, Madeleine Carroll, C. Aubrey Smith | See full cast and crew »"],
      "reviews": [
         "Ronald Colman shines in the dual role of the dissipated Crown Prince Rudolph and the \"simple Englishman\", Rudolph Rassendyl. The crown prince's predilection for the bottle recalls Colman's earlier portrayal of the dark side of Sydney Carton from A Tale of Two Cities. In contrast, Rassendyll's reluctant gallantry and abiding integrity and honor epitomize the qualities for which matinée idol Colman had become known during his famous film career. His scenes with the incandescent Madeleine Carroll are especially felicitous, both visually and aurally. The poignant, penultimate scene of the film left this reviewer with a wistful sense of regret that The Prisoner of Zenda was to be their only cinematic collaboration. Raymond Massey was never better as the ambitious Duke Michael. The expressionistic qualities of his facial contortions make his lines almost superfluous. The rakish Count Rupert, played by Douglas Fairbanks, Jr., represents the archetypal rogue. His perennial smile, abiding charm, and sardonic wit make him a curious composite of Don Juan and Mephistopheles. Like Massey, I have never seen the underrated son of the silent screen's most dashing hero in better form. The film's remaining actors acquit themselves more than adequately. Mary Astor is the lovely Antoinette, Duke Michael's devoted, yet unfairly, neglected paramour. Her consistently dark raiment and shadowy movements are perhaps reflective of her lover's illegitimate origins, while at the same time belying her kind heart. Visually this is contrasted with the always radiant Princess Flavia. The two royal bodyguards, Colonel Zapt and Captain von Tarlenheim, are a case study, to my mind, as to why films like The Prisoner of Zenda are consistently superior to today's mediocre fare. Although relatively lesser roles, they are capable of, and on more than one occasion, do dominate a given scene; moreover, in their own way they are as fully developed as any of the principals. The abiding sense of honor and loyalty expressed by C. Aubrey Smith's Colonel Zapt is so profoundly felt and reflective of a long-vanished ethos, that one laughs to think of any contemporary actor making such utterances. The paradox would be striking! As for Zapt's protégé, Captain von Tarlenheim, given the camera's fondness for the handsome young star, it will come as no surprise to learn that this role was reputedly David Niven's first acting breakthrough. His gift for dry English understatement is the occasion for one especially humorous scene-stealing moment that I will generously leave to the curious viewer to enjoy for himself. With such an outstanding, marquee cast that lives up to its advanced billing and then some, it is not difficult to understand why this film was such a rousing success when it premiered in 1937; so successful, in fact, that it was copied verbatim by MGM 15 years later after it purchased the rights from Selznick. With no slight intended to Stewart Granger et al., you cannot improve on perfection.",
         "If anyone wants to see an excellent movie made before the banner cinematic year of 1939, this would be a film to watch. It could hardly have gone wrong, with David O. Selznick as producer and John Cromwell as director. And a superlative cast of popular stalwarts, mostly from Hollywood's British colony. Ronald Colman is his usual smooth and accomplished self in a dual role, King Rupert (of some fictitious country) and look-alike Englishman Rudolph Rassendyll, very distant cousins. The scenes in which he faces himself onscreen \u0096 called `trick photography' then \u0096 are remarkable for the period. Lovely Madeleine Carroll plays a princess, betrothed to the king. Her equal in elegance and beauty wasn't seen on the screen again until Audrey Hepburn and Julie Andrews. Many critics have praised Douglas Fairbanks, jr, as a likeable rogue. He's very good, in an easy role. My applause goes to the two stars. The film is a glamorous combination of romance, spectacle and adventure. Don't even dream of realism; there was too much realism in ordinary life during most of the Thirties. This is a grand escape to a time and place that never were. If I had to pick a favorite scene in the film, it would be the famous entrance of Colman and Carroll into the coronation ball. The shot opens on the couple, walking fast, arm in arm, directly toward us. The camera pulls back and back and BACK until the grand staircase of the palace and the entire ballroom, filled with people, are revealed. Visually and technically, this single fluid shot is a stunning achievement. It shows us the creative work that could be done at the time, by hugely talented artists, long before the advent of zoom lenses and computer graphics. Elegance and class are not hallmarks of most current movies. `The Prisoner of Zenda' (1937) is a stylish and very satisfying example \u0096 a symbol, perhaps \u0096 of what escapist entertainment can be. And of what it could and should be, now and then, even today.",
         "Sir Anthony Hope Hawkins was a successful London barrister, who got his measure of permanent fame as the author of several novels. Some were quite popular in their day, like \"The Dolly Dialogues\" and \"The Man In The Car\" (which bases it's central figure on Cecil Rhodes). But it is his two \"Ruritanian\" Romances, \"The Prisoner Of Zenda\" and \"Rupert Of Hentzau\" that are the main novels he is recalled for, especially \"The Prisoner Of Zenda\". Set in a middle European kingdom, it was (for it's day in the last decades of the 19th Century) an updating of the swashbuckling novels of Alexandre Dumas. Dumas had some stories set in \"modern Europe\" (\"The Count Of Monte Cristo\" is set in the period of 1815 - 1830, and was written in 1844 - 1845), but most were in earlier periods, such as the 16th, 17th, and 18th Centuries. Hope Hawkins (who wrote under the name Anthony Hope) figured that there was sufficient intrigue and deviltry in modern Europe to transplant the plot style to the 1870s - 1890s. And there was considerable intrigue, especially in Eastern Europe. In the 1880s Prince Alexander of Battenberg seemed set to become first Prince or King of Bulgaria. He had won admiration in Europe for his stunning victories over the armies of the Kingdom of Serbia in a war of 1885 (the war that was the background to Shaw's ARMS AND THE MAN), and was poised to get his crown, when the Russian Empire balked. They thought Alexander was too pro-German, and too close (due to family relationships) to Great Britain. So Alexander was toppled, and forced to leave Bulgaria under very humiliating circumstances. Eventually Prince Ferdinand of Saxe-Coburg got the Bulgarian throne. \"The Prisoner Of Zenda\" is not based on the story of Alexander of Battenberg, but it shows the type of conspiracy atmosphere that pervaded the area. Basically the plot is an old one of substitutions concerning political figures. Dumas had used one in \"The Vicomte De Bragalone\", a huge multi-volume novel that included \"The Man In The Iron Mask\". One of the theories about the Iron Mask (the one that Dumas used)was that it was the twin brother of King Louis XIV. In that novel D'Artagnan has to thwart a plot to replace the Sun King with his brother - a plot that almost succeeds. Hope changed this slightly. Here the King is threatened by his ambitious half-brother, and the King's distant twin cousin replaces him to save the throne. The 1937 film version of the novel is usually considered the best of several (including the 1951 version with Stewart Granger and Deborah Kerr, and a comic version with Peter Sellers and Lionel Jeffries in 1978). David Selznick was the producer, this being part of his series of movies-based-on-famous-novels that included \"A Tale Of Two Cities\" (also with Colman), \"David Copperfield\" (with W.C.Fields), and finally \"Gone With The Wind\". His casting was top notch, with Colman supported by Madeleine Carroll, Douglas Fairbanks Jr., Raymond Massey, Mary Astor, C. Aubrey Smith, and David Niven. It is an exciting and well made film, and definitely worth watching. Selznick hoped to do the sequel \"Rupert Of Hentzau\", but that book is a comparative downer. Several of the main characters from the first novel are killed, and one of them shows a less likable side to his personality than in the first story. He toyed with a total rewrite of the story, to try to make Fairbanks a hero instead of a villain. The project never reached fruition. Probably just as well. It is rare for a successful film production to be replicated in a sequel.",
         "'The Prisoner of Zenda' is one of the most fondly-remembered films of the '30s, and for good reason. It offers Ronald Colman, one of Hollywood's most beloved British stars, in the dual role of Rudolf, crown prince of a small European kingdom, and Rudolf Rassendyll, his look-alike British cousin, end product of a brief affair of an ancestor (as the Englishman puts it, \"Fishing in forbidden waters\"); the radiant Madeleine Carroll, best-known as Robert Donat's leading lady in Hitchcock's classic 'The 39 Steps', as the royal betrothed, who falls in love with the pretender; Raymond Massey, Canadian star of H.G. Wells' SF masterpiece, 'Things to Come' (and, 3 years later, the quintessential Abraham Lincoln on stage and in film!), as Black Michael, Rudolf's scheming half-brother; and, best of all, a youthful Douglas Fairbanks, Jr., son of silent Hollywood's greatest swashbuckler (and a pretty fair swashbuckler, himself), as the suavely villainous ally of Michael. The story is simple, and has been done many times before, but never with such elan; drugged monarch-to-be must be impersonated by look-alike for coronation, lest kingdom fall into hands of evil half-brother. In the hands of this PERFECT cast (with terrific support by C. Aubrey Smith, a young David Niven, and Mary Astor) the tale becomes a stylish tale of love, intrigue, and derring-do. High points include an astonishingly beautiful Royal Ball, where Colman and Carroll reveal their love; a very funny yet menacing meeting between Colman and Fairbanks, as they discuss the real King's potential fate; and best of all, a MAGNIFICENT climactic swordfight between the pair, as they lunge and parry furiously through the halls of a castle, while exchanging quips and one-liners. This is swashbuckling at it's finest! If you are unfamiliar with Ronald Colman's work, you're in for a treat...Don't miss it!",
         "The Prisoner of Zenda, based somewhat obviously on Shakespeare's The Tempest, is a film that has something for everyone. There's action, adventure, romance, suspense, and swashbuckling. It's a historical film, and over the years hasn't really aged, so it remains fantastic 62 years later. The cast is first rate, especially because the male leads-Ronald Colman, Douglas Fairbanks Jr., and David Niven-are so handsome and talented, mainly Doug. In the best role of his career, he wields swords, cigarettes, and sticks with an airy sensuality and was deprived of a much-deserved Oscar nomination. The sets and costumes are so magnificently detailed, that you'll wish it was in color. And the script is perfect, with some very witty lines. And the musical score is excellent. Anyone who wants to see a movie with all the basic ingredients for 110 minutes of sheer entertainment should seek this one out.",
         "Traveling in a Middle European kingdom, an Englishman on a fishing vacation discovers to his astonishment that he is an identical look-alike for the country's king. When the dissipated monarch is unable to attend his own coronation, the Englishman is pressured to impersonate him temporarily. But when he falls in love with the new queen and the real king is kidnapped by an evil half-brother, the Englishman is swept into a world of intrigue & danger he scarcely knew existed. Can he rescue THE PRISONER OF ZENDA without losing his own life? This is one of the great adventure films of the 1930's. Given lavish treatment by Selznick Studios, it is escapist cinema at its most enjoyable. Silky-voiced Ronald Colman is perfectly cast as both the Englishman & the King. He was one of those rare, fortunate actors with great screen charisma - his every moment, every word, is interesting to the viewer. He almost meets his match, though, in Douglas Fairbanks Jr., here playing a charming & completely ruthless young villain. Their rapier fight stands out in a decade full of terrific swordplay. The rest of the cast is equally impressive: lovely Madeleine Carroll, wicked Raymond Massey, frantic Mary Astor, stalwart David Niven and especially wonderful old Sir C. Aubrey Smith, a model of elderly devotion & courage.",
         "Mixed identities, castles, swords, fancy uniforms, Ruritanian romance, royal intrigues -- it's all here. What a lot of fun. I could never really figure out Ronald Coleman's appeal. He's likable enough but from what I gather women used to swoon over him. Is he really handsome? If so, the quality slips past my perceptive apparatus. I do like his voice, though, so theatrically nasal and so hard to take seriously. Raymond Massey is Black Michael, he of the monocle and the perpetual sneer. Mary Astor and Madeleine Carrol are decorative and provide the men with motives. Outstanding, though, is Douglas Fairbanks, Jr., as Rupert of Hentzau. It's often said that a movie is as good as its villain, and that's as true here as in any other film. He laughs, he oozes charm, he beats people over the head with iron pipes, he stabs unarmed noblemen, he seduces women, he drugs kings, seems to enjoy betrayal, smokes too much, lies as easily as the rest of us breathe, and instead of fighting to the end like a man he jumps out a window and runs away, or rather swims away. He quotes poetry: \"Oh, woman, in our hour of ease/ uncertain, coy, and hard to please./ When pain and anguish wring the brow/ a ministering angel, thou.\" David Niven is a lighthearted friend of the hero. C. Aubrey Smith is -- well, C. Aubrey Smith. Niven hadn't gotten very far in Hollywood until he landed this role, which he was able to do only through the influence of Hollywood's \"British colony.\" He began the shoot by playing the part in the breezy manner we now see on screen. This displeased the director and the producer, who wanted it dramatic, but when they saw how it looked on film they were tickled pink. (Both Niven and Fairbanks were to go on to meritorious service in World War II.) The movie is so undemanding and so rewarding that it was remade several times, twice as a spoof. The 1950s version with Stewart Granger and Deborah Kerr is about as good as this one, only of course splashier. The climax involves a nicely done fight with sabres between Coleman and Fairbanks. Coleman wasn't a physical actor and Fairbanks not a fencer, so doubles are used extensively, but without doing much damage. And it's curious to note that this was released in the same year as \"The Adventures of Robin Hood,\" and both films use some of the same conventions, fighting with furniture, trading wisecracks during the fight, and the use of shadows swashbuckling away on the castle walls. This despite the fact that different directors were in charge. Hard to tell whether this is an instance of independent invention or some historical adhesion left over from one of Fairbanks' dad's early silents. And enjoyable tale, not meant to be taken seriously.",
         "Of the at least eight film versions of Anthony Hope's famous novel, this is the best. There is a fairly decent silent version starring Ramon Navarro and a flashier 1950's version with Stewart Granger but this one leads the pack as the most entertaining and the best directed. Dashing Douglas Fairbanks Jr. always in the shadow of his famous father gives the role of Rupert all he's got and that's a lot. He steals every scene he's in, even from the likes of Ronald Coleman and Raymond Massey. He gives treachery and deceit not to mention opportunism new meanings in his double dealings. Few today have even heard of Junior, though most movie buffs have heard of his father silent star Douglas Fairbanks and step mother for a time Mary Pickford. Senior divorced Junior's mother to marry Pickford. Junior gave other outstanding performances on the big screen especially in \"Gunga Din\" in 1939 opposite Cary Grant and Victor McLaglen. He went on to have a popular television show in the early days of that medium \"Douglas Fairbanks, Jr., Presents.\" He gradually retired from films. Sadly when he passed away in the year 2000 very few knew who he was. Ronald Coleman gets to play two parts Maj. Rudolf Rassendyll and King Rudolf V, two lookalike cousins from a family indiscretion several generations back. He does so admirably. Though Madeleine Carroll as Princess Flavia who loves one cousin but is tied to the other out of duty and patriotism is a hard act to follow as always, Mary Astor gives her a good run for the money as Black Michael's (Raymond Massey)lady love. The two ladies counterbalance each other well as stand by your man women but for different reasons. The always underrated and under-appreciated actor Raymond Massey makes the character of Michael come alive with jealousy and vainglory but with true love in his heart for his Antoinette. The grand old man of early cinema C. Aubrey Smith is around to make sure all is done correctly according to pomp and circumstance. David Niven in an early screen role gives his portrayal of Capt. Fritz Von Tarlenheim the easy touch, almost tongue in cheek at times, which lightens the heavy load for the viewers. He is a good counterbalance for the dour C. Aubrey Smith. Silent screen veteran actor Montagu Love is present to show them all how it's done. What a troupe of Thespians to savor! John Cromwell directs with flair and makes the film move at a fast pace especially near the end. The action sequence when the castle is stormed following the lowering of the draw bridge is intense. The rapier fight between Coleman and Fairbanks is still exciting to watch. The crisp black and white photography makes one forget that the film is not in color. For excitement, adventure, and romance by all means see the 1937 version of \"The Prisoner of Zenda.\"",
         "John Cromwell's direction sparks this entry into \" The Prisoner of Zenda\" This film redone by MGM with James Mason as Black Michael and in colour( Color) This version has more wit and sweep even though its in black and white. For sure the screenwriters and Cromwell made Doug Fairbanks Jr into more of a rascal than a criminal and of course he escaped in the final reel. I like Coleman and Carroll in their leading roles as well as C A. Smith and Niven as the co conspirators Raymond Massey looks like he is uncomfortable with his lines and would rather be doing Hamlet Nevertheless this is the best version and it still has legs and looks more Gothic than the MGM Vehicle which is saturated in colors and may cause headaches after the first reel C Pope",
         "In the end of the Nineteenth Century, the Englishman Major Rudolf Rassendyll (Ronald Colman) travels to the Province of Zenda to spend a couple of days fishing at the Royal Game Preserve. He meets King Rudolf V (Ronald Colman), whose coronation will happen on the next day, riding with his loyal Colonel Zapt (C. Aubrey Smith) and Captain Fritz von Tarlenheim (David Niven) and they all become astonished with the resemblance of Rassendyll and Rudolf V. They conclude that they might be distant cousins and the King invites the newcomer to drink wine in his castle. King Rudolf is an alcoholic and drinks too much; however, he is drugged by his brother Michael (Raymond Massey) and Rudolf V is no able to participate at the ceremony of coronation. Colonel Zapt and Captain Fritz asks Rassendyll to impersonate Rudolf V, otherwise his greedy brother would take his place and be crowned king. Rassendyll accepts to participate in the fraud but when he meets King's Rudolf V fiancée, the Princess Flavia (Madeleine Carroll) of the Royal House Court of Strelsau, the immediately fall in love for each other. Meanwhile, the evil and ambitious Rupert of Hentzau (Douglas Fairbanks Jr.) abducts Rudolf V and brings him to the dungeons of his castle. However, Michael's mistress Antoinette de Mauban (Mary Astor) secretly summons Rassendyll to her Boulevard Elsberg and proposes to help him to rescue the King. In return, Michael would be exiled without any other additional punishment. Rassendyll accepts to risk his life trying to save Rudolf V, even knowing that his love with Princess Flavia would be affected by his action. \"The Prisoner of Zenda\" is one of the most delightful classic adventures of cinema industry. The performances and the ironic and witty dialogs are awesome and unfortunately this type of film is innocent film that is hardly made by the studios. My vote is nine. Title (Brazil): \"O Prisioneiro de Zenda\" (\"The Prisoner of Zenda\")"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Selznick International Pictures"],
      "summaries": [
         "This is a classic swashbuckler. Rudolph Rassendyll, Rudolf V's identical distant cousin, is asked to risk his life and impersonate the would-be king when his relative is kidnapped before his impending coronation. If Rudolf V isn't present at the ceremony, he will forfeit the crown to his younger brother. Complications ensue when Princess Flavia, the cousin's betrothed, begins to notice a \"personality change\" in her fiancé.",
         "An Englishman on a Ruritarian holiday must impersonate the king when the rightful monarch, a distant cousin, is drugged and kidnapped."
      ],
      "budget": 0
   },
   "movielensId": 25840,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "1937-09-03",
      "dvdReleaseDate": "2007-03-06",
      "directors": [
         "John Cromwell",
         "W.S. Van Dyke"
      ],
      "runtime": 101,
      "movieId": 25840,
      "title": "The Prisoner of Zenda",
      "mpaa": "",
      "actors": [
         "Ronald Colman",
         "Madeleine Carroll",
         "Raymond Massey",
         "Mary Astor",
         "Douglas Fairbanks Jr.",
         "C. Aubrey Smith",
         "David Niven",
         "Montagu Love",
         "Philip Sleeman",
         "Eleanor Wesselhoeft",
         "Torben Meyer",
         "Wilhelm von Brincken",
         "Ben Webster"
      ],
      "imdbMovieId": "0029442",
      "originalTitle": "The Prisoner of Zenda",
      "genres": [
         "Adventure",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["9eJK5XXxLQU"],
      "plotSummary": "An Englishman on a Ruritarian holiday must impersonate the king when the rightful monarch, a distant cousin, is drugged and kidnapped.",
      "tmdbMovieId": 43867,
      "avgRating": 3.63636,
      "releaseYear": "1937",
      "numRatings": 66,
      "posterPath": "/tqckdN1b3xi7ICV82xK9HU1Vz6N.jpg"
   }
}