{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "exotic island",
            "id": 911
         },
         {
            "name": "captain",
            "id": 1316
         },
         {
            "name": "mutiny",
            "id": 1860
         },
         {
            "name": "heart-throb",
            "id": 3188
         },
         {
            "name": "tahiti",
            "id": 6611
         },
         {
            "name": "import",
            "id": 9089
         }
      ],
      "imdb_id": "tt0056264",
      "video": false,
      "title": "Mutiny on the Bounty",
      "recommendations": [
         12311,
         18019,
         10178,
         16905,
         25430,
         19429,
         25736,
         898,
         69333,
         11911,
         20372,
         77133,
         3598,
         4486,
         43379,
         11174,
         17660,
         42131,
         14676,
         132378
      ],
      "backdrop_path": "/u3eM8Z7HhecS2NJrtIIZUK8i51T.jpg",
      "revenue": 13680000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Capt. William Bligh",
               "gender": 2,
               "credit_id": "52fe43f39251416c750240b3",
               "name": "Trevor Howard",
               "profile_path": "/drj1FPryhAimWCiufEnMLzUxpBQ.jpg",
               "id": 12726,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "First Lieutnant Fletcher Christian",
               "gender": 2,
               "credit_id": "52fe43f39251416c750240b7",
               "name": "Marlon Brando",
               "profile_path": "/84aAmVDUiQqzkfliOBemb7FaiuD.jpg",
               "id": 3084,
               "order": 1
            },
            {
               "cast_id": 19,
               "character": "Seaman John Mills",
               "gender": 2,
               "credit_id": "52fe43f49251416c75024107",
               "name": "Richard Harris",
               "profile_path": "/64jkJJtL5sins6nwGKOERduLSEA.jpg",
               "id": 194,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Alexander Smith",
               "gender": 2,
               "credit_id": "52fe43f39251416c750240bb",
               "name": "Hugh Griffith",
               "profile_path": "/qIFbwovMcEd9dMGCRB0x2RRr3m7.jpg",
               "id": 10021,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Matthew Quintal",
               "gender": 2,
               "credit_id": "52fe43f39251416c750240dd",
               "name": "Percy Herbert",
               "profile_path": "/5ZUj6cyhZ237SbeyF5fwAv2jvjD.jpg",
               "id": 33220,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Seaman Edward Birkett",
               "gender": 2,
               "credit_id": "52fe43f39251416c750240e1",
               "name": "Gordon Jackson",
               "profile_path": "/yz1S8Ge93l9DoC3zmElq26KN2Ug.jpg",
               "id": 41998,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Michael Byrne",
               "gender": 2,
               "credit_id": "52fe43f39251416c750240e5",
               "name": "Chips Rafferty",
               "profile_path": "/k30vX3i5L6v066MlAOwBkDIZLHZ.jpg",
               "id": 69248,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Seaman William McCoy",
               "gender": 2,
               "credit_id": "52fe43f39251416c750240e9",
               "name": "Noel Purcell",
               "profile_path": null,
               "id": 33090,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "John Frye",
               "gender": 2,
               "credit_id": "52fe43f49251416c750240ed",
               "name": "Eddie Byrne",
               "profile_path": "/mSwNawI6Ou8m99Y05WjctoTWYUK.jpg",
               "id": 69249,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Midshipman Edward Young",
               "gender": 2,
               "credit_id": "52fe43f49251416c750240f1",
               "name": "Tim Seely",
               "profile_path": null,
               "id": 69250,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Maimiti",
               "gender": 1,
               "credit_id": "5a51092d925141132600c2b7",
               "name": "Tarita",
               "profile_path": "/anYoKv7vDkms7XJD2Ut6jFTKuA7.jpg",
               "id": 1955167,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43f39251416c750240c1",
               "name": "Lewis Milestone",
               "profile_path": "/qBEYKHYyjbMoaJBZtQgVe6fVa5v.jpg",
               "id": 2000,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f39251416c750240c7",
               "name": "Aaron Rosenberg",
               "profile_path": null,
               "id": 68083,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f39251416c750240cd",
               "name": "Bronislau Kaper",
               "profile_path": null,
               "id": 14861,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f39251416c750240d3",
               "name": "Charles Lederer",
               "profile_path": null,
               "id": 4358,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f39251416c750240d9",
               "name": "John McSweeney Jr.",
               "profile_path": null,
               "id": 21508,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f49251416c750240f7",
               "name": "Moss Mabry",
               "profile_path": null,
               "id": 14727,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f49251416c750240fd",
               "name": "Henry Grace",
               "profile_path": null,
               "id": 3648,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f49251416c75024103",
               "name": "Hugh Hunt",
               "profile_path": null,
               "id": 10010,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f49251416c75024113",
               "name": "Charles Nordhoff",
               "profile_path": null,
               "id": 72064,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5512cb7b92514103e90012e0",
               "name": "Robert Surtees",
               "profile_path": "/6CuhH7m0KvjbR088xyaJurddfZH.jpg",
               "id": 10005,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 7.694032,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11085,
      "vote_count": 88,
      "budget": 19000000,
      "overview": "The Bounty leaves Portsmouth in 1787. Its destination: to sail to Tahiti and load bread-fruit. Captain Bligh will do anything to get there as fast as possible, using any means to keep up a strict discipline. When they arrive at Tahiti, it is like a paradise for the crew, something completely different than the living hell aboard the ship. On the way back to England, officer Fletcher Christian becomes the leader of a mutiny.",
      "similar": [
         58,
         173,
         2669,
         1865,
         22,
         12311,
         817,
         254,
         285,
         244,
         19899,
         246080,
         8963,
         1408,
         9660,
         18784,
         23592,
         26612,
         758,
         18993
      ],
      "original_title": "Mutiny on the Bounty",
      "runtime": 178,
      "poster_path": "/6dEnZkgxpsLQFyxEMdTdV2Fjul9.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Arcola Pictures",
            "id": 14091,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1962-11-08",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "The mightiest excitement that ever swept across the sea or the screen!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Lewis Milestone",
         "Carol Reed"
      ],
      "runtime": 178,
      "synopsis": "Based on a true story: The Bounty, a British sailing ship commanded by Captain Bligh sails for Tahiti to pick up breadfruit plants and take them to Jamaica where they are to be planted and help supply the British with a compact, easy to grow, nutritious plant. Lt. Christian is the executive officer - that is, second in command of the vessel. The ship proceeds south with the intention of rounding Cape of Good Hope, Africa and proceed via the Indian and Pacific Ocean to the Tahitian islands. Captain Bligh is pressed for time since he must get to Tahiti while the plants are transportable. He decides to cut 5 months off the journey by going around Cape Horn (South America) instead. However, he encounters typical horrible weather and is unable to make the transit. He then reverses course (to the east) and goes to Tahiti via the originally intended route. This diversion costs more time and pretty much guarantees he will be late in arriving in Tahiti which will require staying there until the plants are transportable (perhaps 6 months). During all this time, Bligh is abusing his men and officers in various ignoble and demeaning ways. He explains his foul behavior to his exec (Mr. Christian) that fear is the only thing seamen understand and this justifies general cruelty and abuse. The sadistic details are numerous and do not advance the plot except to set the stage for the eventual mutiny. After an idyllic stay in Tahiti (the exec, Mr. Christian, is ordered by Bligh to 'sleep with' the Tahitian chief's daughter to avoid insulting the chief) the ship laden with a thousand plants sets sail for Jamaica. More abuse and cruelty ensues on this leg of the trip - mostly as a result of Bligh restricting water to the crew in order to feed the plants (many would otherwise die, says the onboard gardner). Finally Mr. Christian snaps and takes command of the ship and sets Bligh and a few seamen adrift midocean in a boat with enough provisions to last a while (they do make it back to England where Bligh is acquitted of wrongdoing in a naval trial but is scolded). Christian, now in command of returns to Tahiti, picks up a few of the native guys and gals and wanders the ocean looking for a good hiding place and discovers Pitcairn Island which is uninhabited and in the middle of nowhere and mislocated on the naval charts (Google it). The ship is intentionally destroyed by fire at Pitcairn by three of the crew to prevent Christian from making good on an expressed idea to return to England and vindicate the mutiny. Christian is severely burned in the fire when he rushes on board the ship to try to put the fire out. He dies of his burns while saying goodbye to everyone in his death scene.",
      "writers": [
         "Charles Lederer",
         "Charles Nordhoff"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056264/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzA2NTQ2MjgwNl5BMl5BanBnXkFtZTgwNzI2MzgxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Marlon Brando, Trevor Howard, Richard Harris | See full cast and crew »"],
      "reviews": [
         "When the news broke that MGM had the audacity to remake the hallowed 1935 classic `Mutiny on the Bounty' starring Clark Gable and Charles Laughton, the critics were aghast. As the news leaked out about trouble in production, they whipped themselves into a self-righteous frenzy. Brando was a lightening rod for criticism because he was renowned as arrogant hothead. Compared with Gable, who was universally loved and adored, Brando was a boor. It was almost sacrilegious to put Brando in any part Gable had played. When the film opened, it never had a chance. It was ripped to shreds. Brando was ridiculed as a lower class character actor who couldn't step up to the part, and derided for his dreadful attempt at an English accent. The film was a box office loser and critics smugly declared they told us so. The film was beset by problems throughout production. The full-scale replica of the Bounty arrived on location two months after the film was scheduled to begin shooting. There were three deaths among the film's personnel and the film ran well over budget. The biggest problems were the result of Brando's constant temper tantrums as he tried to rewrite the entire film from the set. At least six writers came and went. After countless confrontations, director Carol Reed gave up and quit to be replaced by Lewis Milestone (`All Quiet on the Western Front'). Milestone was an utterly intractable director that Brando couldn't bully. The result was a battle between the immovable object and the irresistible force, with daily emotional pyrotechnics that further delayed the film. Although Milestone usually prevailed in the fracases, this film turned out to be his last in a 37-year career. Over the years, the critics have continued to pillory the film, but the public generally receives it more favorably as time passes. Though I often disagree with the masses, in this case I concur. Having seen both the 1935 and 1962 versions, I prefer the latter. Gable is clearly more charming and dashing in the role, but Brando gives the more complete performance. Gable's Christian seems far less ruffled by the events that transpire on the Bounty, whereas Brando accomplishes a believable transition from the cavalier rogue to an honorable hero who endures self-torment over the treasonous act. Though Brando's English accent is oft ridiculed, I have heard far worse. Part of the problem probably stemmed from the fact that the accent he attempted to imitate was very upper crust and he delivered it with a certain sneering tone that made it seem like he was mocking the English. Just hearing that accent from the same lips that gave us, `I coulda been a contenda' was a kind of ironic comedy unto itself. Between the Bligh portrayed by Charles Laughton and that depicted by Trevor Howard in the remake, Howard wins hands down for pure detestability. Most of the production values, such as music, set design and costumes were superior in the remake. Moreover, the remake was more historically accurate than the original. The film features a youthful Richard Harris in the role of Mills, who gives an excellent performance of the petulant sailor. Also noteworthy is the lovely Tarita, a native Tahitian who plays Christian's love interest Maimiti, and does a scorching belly dance. This was Tarita's only film, but to anyone who has seen the film, she will not be soon forgotten. This is an excellent film. It was nominated for seven Oscars including Best Picture, but it was shut out, trampled by `Lawrence of Arabia'. It is highly entertaining with wonderful costumes, props and sets, fabulous locations and photography, and some terrific performances. Though many will disagree, I rated it a 10/10. If one can step back from the controversy that swirled around this film when it debuted, it is an easy film to enjoy.",
         "While the initial critical reception given MUTINY ON THE BOUNTY was not as favorable as that given the original 1935 film, seen nowadays it is a very impressive telling of the Bounty story with some fine performances and a stirring musical score by Bronislau Kaper that fully captures the mood with some haunting and truly striking themes that give the film added dimension. The pictorial splendor of the technicolor photography at sea and in Tahiti is never less than eyefilling. A thrilling high point is the storm at sea with Kaper's music rising to powerful intensity. Furthermore, there are two fascinating performances by Marlon Brando and Trevor Howard. Howard is not quite as showy in the role as the scenery-chewing Laughton but his characterization is a bit more complex. Brando does an excellent job as Christian, posturing in the manner of a gentleman and speaking with an upper crust British accent that is entirely credible. Indeed, when he reaches the mutinous moment in a rage of uncontrolled anger, he is at the top of his acting form. Even so, some of his most effective moments are quietly underplayed. His performance deserved an Oscar nomination--but with so much bad publicity surrounding the film and the hardships and strains involved in the making, Hollywood apparently gave him the cold shoulder. Years later, they did the same to Russell Crowe for his bad boy behavior. Technically, of course, the film is far superior to the B&W 1935 Gable-Laughton film. Gorgeous sunsets are backdrops to the ship at sea and the island scenes in Tahiti are gorgeous to behold. A missing element from the earlier film is the absence of the character played by Franchot Tone. Indeed, Tone was nominated for a Best Actor award, along with Gable. There are numerous other differences but this take on the story is a good one, every bit as valid as the 1935 film. With all of the bad publicity surrounding the film relegated to the past, we can look at this film with a fresh viewpoint today and enjoy it for the entertaining blockbuster that it is. Highly recommended.",
         "I wonder if they made more three-hour-plus films in the 1960s than any other decade? It seems that way. Here is another one. This also is a re-make from a 1935 version of the famous story I liked this 'Mutiny On The Bounty' better than the critics did, who got annoyed at Marlon Brando's British accent. I found nothing wrong with it and I usually am critical about that sort of thing myself. Brando gave a solid performance. Trevor Howard was convincing as the sadistic \"Captain Bligh\" and Tarita was fair as the love interest \"Maimiti.\" The cinematography might have been the best feature of the film, a definite movie for widescreen as a lot of these mid '50s-to-mid '60s films were. There are some beautiful shots in here, beginning with those Tahiti sunsets. The color in this movie is magnificent. Although not particularly a film you might watch over and over, I found no major fault with it except for perhaps the romance which was a bit sappy. The adventure, acting and photography were all top-notch and the three hours went by fairly fast.",
         "This is my favorite version of Mutiny of the Bounty, and I think it takes a very unfair pounding mainly on the basis of comparisons to the original. The production is superb, the story is paced a lot better, and it details Captain Bligh's cruelty more thoroughly. I can't vouch for the historical accuracy of the film, Brando's concept as a foppish Mr. Christian is a bit hard to believe, although he played it extremely well. Trevor Howard's Bligh is one of the most underrated performances in the world. For him to take a role heavily identified with another actor, play it his own way, and pull it off is extremely difficult. I give him enormous credit for this outstanding performance. I think the biggest criticism of this film is that it's not the original, but still extremely well done under the circumstances and very entertaining. ***",
         "MGM's 1962 remake of their own 1935 Mutiny on the Bounty, makes the older film look hokey at best, and like an outright joke at worst. The newer version takes a far more realistic and honest look at every facet of the legendary mutiny. The movie potrays the two key characters in the story, Captain Bligh (Trevor Howard), and Fletcher Christian (Marlon Brando), as real men, and not like the cardboard cutouts as was the case in the 1935 version. Howard's Bligh is brilliant, and not at all like the prancing cartoonish Charles Laughton version in '35. And when it comes to Christian, the protaganist of the mutiny, Brando makes an admirable effort to capture the essence of the the fopish and aristocratic character as portrayed in the Nordhoff and Hall book upon which both MGM \"Bountys\" are based. Brando becomes Christian, in the 1935 movie Clark Gable as Christian is just Gable as Gable, and that's that. Richard Harris as crew member Mills, is another solid portrayal in the 1962 movie. Don't get me wrong, the 1935 movie's fun, but the 1962 movie is infinitely more impressive in all respects, especially its use of a real ship made just for the film, the awesome \"shots\" of life at see in the late 1700s, and of course the spectacular location filming in Tahiti. 1935's Mutiny on the Bounty, was a fine film in its day, but it doesn't stand the test of time, 1962's film stands that test. Is it a great movie, probably not, but it is a very good one. Considering that MGM did not deliver the ship on time for filming before the bad weather set in in Tahiti, MGM's firing of legendary director Carol Reed, and other miscalculations mainly attributable to producer Aaron Rosenberg, the film is a remarkable achievement. The studio used an off-form Lewis Milestone as a replacement for director Reed. Once they decided that Reed wasn't their cup of tea, they just tried to slide by with Milestone, instead of securing the services of one of the many still vital directing greats working in the early 1960s. A movie of epic proportions like 1962's Mutiny on the Bounty, cried out for a William Wyler, a David Lean, or a Fred Zinneman, to take over the helm once Reed was canned. When the movie didn't hit like gangbusters, MGM's publicity machine moved quickly to \"sandbag\" their star, and the lemmings of the early 60s entertainment press corps swallowed the studio's propaganda whole. It was open-season on Brando, and it was shameful, but anybody who has seen the movie and also read the book, knows that Brando's Christian is a very solid performance. I'm sure Brando was peevish and nettlesome at times during production, Trevor Howard says as much in his biography, but to blame Brando for the film's bloated final cost and its lack of epic earnings is ludicrous. I love 1962's Mutiny on the Bounty, it should have been better, but its still one beautiful movie. It is an under-appreciated and highly underrated movie. I strongly recommend it, to me calling Brando and Howard's Mutiny on the Bounty of 1962, a minor film, as one IMDb movie fan recently did, is blasphemous. The truth is MGM, just fumbled the ball on Mutiny on the Bounty in 1962, despite all of their ineptitude during production, they still had what should have been a major hit. But they opened it as a road-show movie in just a few theatres nation wide instead of in as many theatres as possible like the studios do with all major movies today. Despite MGM's poor efforts 41-years ago, movie fans today can scoop up the old lion's fumble and enjoy this exciting high seas adventure/love story. It took a better book, Richard Hough's \"Mr. Bligh and Mr. Christian,\" to produce a better movie rendition of the true life Mutiny on the Bounty. That book was the basis for the magnificent, \"The Bounty,\" starring Anthony Hopkins as Bligh, and Mel Gibson as Christian. Also adding lustre to that movie were Liam Neeson, and Daniel Day-Lewis.",
         "This is a fabulous movie. Sumptuous production, good screenplay, excellent performances, beautiful cinematography and a majestic musical score. Story follows the crew of British Naval vessel 'The Bounty' on its mission to transport 'bread fruit' plants from Tahiti to Jamaica, as food for the slaves there. Unrest is almost immediate, with the Captain (Howard) and his first officer (Brando) disagreeing over the appropriate punishment for a sailor's minor infraction. Things only get worse during the voyage as the harsh Captain responds severely to anything that opposes his ambition to please the admiralty with a speedy voyage. The crew's time spent in the paradise of Tahiti (particularly with regard to the naked and willing women) fills them with such pleasure that the prospect of a return voyage under such cruelty is unbearable. Events finally reach a summit on the way to Jamaica, when a mutiny takes place and the Captain is set adrift with most of those in disagreement with the first officer. However, this is far from an absolution for both sides... For many the film is measured by the performance of Marlon Brando in the lead role, and it is easy to see why. His first officer, Fletcher Christian, is unlike anything from him in memory; however, taken as it is: an effeminate, fair-minded character forced into an extreme dilemma, the result is a complicated man, extremely well played. Indeed, as the film progresses, Christian's predicament is increasingly sympathetic and it is to Brando's credit that he remains engaging throughout. His unexpected plea to his fellow mutineers at the end is an extraordinarily conceived and delivered moment in the film. Trevor Howard plays Captain Bligh with poise and relish. The character is completely arrogant and utterly loathsome, but never less than believable. This villain is all the more frightening because his cruel methods never stray outside the 'official' Naval regulations, as he is keen to point out. Of the supporting players, Richard Harris' roguish Mills and Richard Haydn as the Royal botanist (and film's narrator) make the strongest impressions. Overall acting is very good. Vivid use is made of the exotic island locations (on which a considerable time is spent) and the vast, isolating ocean vistas. Overall impression is of grand scale and spectacle, but illustrated with the intelligence and humanity of the scenario. Near-perfect filmmaking in glorious, old-fashioned style!",
         "Nominated for seven academy awards [1962] including Best Picture, \"this spectacular movie of grandeur and intimacy, sex and humor, cruelty and nobility\" (The Hollywood Reporter) stars two-time best actor winner Marlon Brando (The Godfather, On the Waterfront) as Fletcher Christian, a high-born English aristocrat and elegant gentleman turned Naval Lieutenant and able first officer, whose honor is inseparable from his humanity. Also in an impeccable performance, Trevor Howard's steely, sadistic Captain William Bligh commands by contempt, as malevolent toward his officers as to the crew he tortures. In idyllic Tahiti, exquisitely captured by Academy Award winner (Best Cinematography) Robert L. Surtees, Christian is seduced by Miamiti. She is portrayed by \"enchanting Tarita, a 19 year-old native whose swaying hips find their own varying levels of audience appreciation.\" (Daily Variety). \"Mr. Brando's steel-spring vigor when the patience of Fletcher Christian snaps and he whiplashes into the fateful incitement of mutiny is truly electrifying.\" (New York Times) Complete with furious storms at sea, exotic native ceremonies, magnificent South Pacific island scenery, 6000 Tahitian extras, and a larger-than-life performance by the legendary Brando, this remake of the 1935 original Mutiny on the Bounty is one of the most exciting and visually astonishing adventures ever made. \"A superb blending of direction [Lewis Milestone], photography and special effects\" (Variety) this movie became an instant classic and still lives to this day as the best rendition of the re-telling of this true story. Very rich in visual imagery and complimented by a mesmerizing original music score (Bronislau Kaper), this film features some of the best dialogue and character portrayals of recent memory (too many to name here, but worthy of note is Hugh Griffith, Richard Harris, and Noel Purcell). Truly a classic in the true sense of the word, and a must see film for all connoisseurs of fine movie making! A superb motion picture! Excellent!",
         "I first watched this film because I really liked the Mel Gibson / Anthony Hopkins version of the film (Bounty). I expected this to be a less sophisticated, dated early 60's remake of the 1930s classic. I was blown away! Brando absolutely nailed the pretentious, self styled aristocrat Fletcher Christian with such accuracy, I found myself thinking that he may have grown up with a Duke and Duchess as his parents and a castle in Edinborough. There are several scenes where Brando's performance would have to be recorded as one of Hollywood's most important moments at the Smithsonian (if there was such a thing). The supporting cast is excellent and the period imagery they evoke, with limited special effects, but spectacular location filming, makes this a HUGE classic and extremely entertaining. Unlike a lot of recent great films, this Hollywood classic does its magic while staying within the family film guidelines, while not feeling like a \"Mickey the Rat\" formulaic piece of garbage. Spectacular technicolor scenes of Tahiti (before even tourists went there), combine with great wardrobe, and accurate local customs and ceremonies, to create a very, very entertaining film.",
         "I have screened again tonight, in his memory, MUTINY ON THE BOUNTY (USA 1962) directed by Lewis Milestone. It is not a such commonly quoted movie in his filmography but it could be, all balanced in my memories of movie critic, his most wonderful performance of all : a deep and sharp \"témoignage\" - as we say in French - for humanity against inhumanity. I have screened that movie many times and each time I screen it, emotion and beauty are rising. Not only because of him : all the movie in all its aspects is reaching dramatic and aesthetic perfection. But mainly, if I should say so, because Brando manages, under the fine direction of this last Milestone directing work, during the first 157' of the movie, to bear on his shoulder the burden of humanity in front of a sadistic and inhuman being and to bear it in a rising tension till the breaking point - the mutiny itself. Rarely such part has been incarnated with such a talent and he overpasses the already memorable Gable's performance. Such a part was more difficult to play - according to me - than many of his acclaimed (and rightly acclaimed, of course)other previous and next performances. Of course anyone who wants to know what is acting has to screen ON THE WATERFRONT, JULIUS CAESAR, his directing masterpiece western ONE-EYED JACK [I want to remind or let know its French beautiful exploitation title : LA VENGEANCE AUX DEUX VISAGES], THE GODFATHER, APOCALYPSE NOW and so many others. Nevertheless, Brando will be forever (\"à tout jamais\") in my memory, the noble and human Lieutenant Fletcher rising for human value, alone and finally dying for preserving an idea of justice",
         "When the legend becomes fact, film the legend (to adapt the famous quotation from The Man Who Shot Liberty Valance). The story is the well-known one of how a British naval crew, while on a voyage to transport breadfruit from Tahiti to the West Indies, revolt against their brutal and sadistic captain under the leadership of the humane first mate and sail off to make a new life for themselves with their Tahitian sweethearts on the remote Pacific island of Pitcairn. Historical evidence, in fact, suggests that Captain William Bligh was not particularly brutal or sadistic, but this film, like its 1935 predecessor, is a film based upon legend rather than upon strict historical fact. The late 18th century is often described as the Age of Revolution, and as the Bounty mutiny took place in 1787, midway between the American and French Revolutions, there would have been an obvious temptation to play Bligh as a decadent aristocrat and Fletcher Christian, the leader of the rebels, as a man of the people, standing up for the Rights of the Common Man. The temptation to portray Christian as a proto-Jacobin is, however, firmly resisted. In this film, it is Christian who is the aristocrat and Bligh, ever insecure about his social status, who is from a humbler background. This is sometimes regarded as the film which started the decline in Brando's reputation. In his previous film, One Eyed Jacks, which he had also directed, he had gained a reputation as an obsessive perfectionist, but, artistically, the result was a very fine film with an excellent performance from Brando himself. In Mutiny on the Bounty, however, Brando proved to be equally obsessive, but the resulting film is not quite in the same class. Moreover, Brando's performance is one of his weaker ones. Much of the criticism (on this side of the Atlantic, at least) has centred upon his British accent. In terms of phonetic sound-values, in fact, Brando's effort is quite a reasonable attempt at an upper-class drawl- the real Fletcher Christian, the son of a Cumberland farmer, would probably have spoken with a strong northern accent- but it always sounds strained and unnatural. This sort of linguistic accuracy is probably unnecessary in period dramas, anyway. We do not know exactly how people spoke in the 18th century, but the available evidence suggests that the difference between British and American accents was much less marked than it is today. I was struck by the contrast with another big American star playing a British naval officer, Gregory Peck in Captain Horatio Hornblower. Although Peck's accent still sounds American, it also sounds more natural and is less distracting to the viewer. The main problem, however, is not Brando's accent, but rather the way in which his character is played. Christian is played not only as an aristocrat, but also as a languid, foppish dandy. Bligh accuses him of hating both effort and ambition, and there appears to be some justice in the accusation. For too long Christian remains a passive, emotionless character, so the clash of temperaments between him and Bligh remains a muted one. Only during the mutiny itself does he come alive. The idea was presumably to show that Bligh was such a tyrant that even a passionless fop could be roused to anger by his behaviour, but this conception seems to me to waste much of the dramatic potential inherent in the story. Brando apart, however, I found this a reasonably good film. Trevor Howard's portrayal of Bligh as a tyrannical martinet may have been historically inaccurate, but it was certainly convincing. (Even so, I still think that the best of the three actors to play the part was Anthony Hopkins in the 1984 version, which portrayed Bligh in a less one-dimensional way. Clark Gable remains the best Christian). The film is attractively shot, especially the Tahitian scenes, and Lewis Milestone handles the direction in such a way as to ensure that the story does not drag, as it easily could have done in a film of this length. (The film takes three hours to tell a story that the 1935 and 1984 versions told in just over two). Although it is not quite as good as the 1935 version, it is still a very watchable epic of the sea. 7/10"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "History",
         "Romance"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Arcola Pictures"
      ],
      "summaries": ["The Bounty leaves Portsmouth in 1787. Its destination: to sail to Tahiti and load bread-fruit. Captain Bligh will do anything to get there as fast as possible, using any means to keep up a strict discipline. When they arrive at Tahiti, it is like a paradise for the crew, something completely different than the living hell aboard the ship. On the way back to England, officer Fletcher Christian becomes the leader of a mutiny."],
      "budget": 19000000
   },
   "movielensId": 26085,
   "movielens": {
      "languages": [
         "English",
         "Magyar"
      ],
      "releaseDate": "1962-11-08",
      "dvdReleaseDate": "2006-11-07",
      "directors": ["Lewis Milestone"],
      "runtime": 178,
      "movieId": 26085,
      "title": "Mutiny on the Bounty",
      "mpaa": "NR",
      "actors": [
         "Trevor Howard",
         "Marlon Brando",
         "Richard Harris",
         "Hugh Griffith",
         "Percy Herbert",
         "Gordon Jackson",
         "Chips Rafferty",
         "Noel Purcell",
         "Eddie Byrne",
         "Tim Seely",
         "Tarita"
      ],
      "imdbMovieId": "0056264",
      "originalTitle": "Mutiny on the Bounty",
      "genres": [
         "Adventure",
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": [
         "MEmZ_A0UTrA",
         "70tfu8Ujez8"
      ],
      "plotSummary": "The Bounty leaves Portsmouth in 1787. Its destination: to sail to Tahiti and load bread-fruit. Captain Bligh will do anything to get there as fast as possible, using any means to keep up a strict discipline. When they arrive at Tahiti, it is like a paradise for the crew, something completely different than the living hell aboard the ship. On the way back to England, officer Fletcher Christian becomes the leader of a mutiny.",
      "tmdbMovieId": 11085,
      "avgRating": 3.58309,
      "releaseYear": "1962",
      "numRatings": 337,
      "posterPath": "/6dEnZkgxpsLQFyxEMdTdV2Fjul9.jpg"
   }
}