{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "africa",
            "id": 409
         },
         {
            "name": "british army",
            "id": 4100
         },
         {
            "name": "sadism",
            "id": 4426
         },
         {
            "name": "punishment",
            "id": 10886
         },
         {
            "name": "torture",
            "id": 13006
         },
         {
            "name": "soldier",
            "id": 13065
         },
         {
            "name": "cruelty",
            "id": 14624
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "gritty",
            "id": 155453
         },
         {
            "name": "military",
            "id": 162365
         },
         {
            "name": "hill",
            "id": 199981
         }
      ],
      "imdb_id": "tt0059274",
      "video": false,
      "title": "The Hill",
      "recommendations": [
         20372,
         199177,
         983,
         52726,
         198537,
         32008,
         42131,
         23397,
         31344,
         26762,
         27331,
         119555,
         43000,
         43896,
         48155,
         28484,
         36439,
         42638,
         26234,
         46059
      ],
      "backdrop_path": "/cs63mPQ8ctMj4nSRHpwbDzHI8uU.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5648a3ed9251413ade0075b7",
         "content": "You're a clever bag of tricks, you are, Roberts.\r\n\r\nHot and sweaty, bold and brutal, Sidney Lumet's The Hill is a tour de force of incarceration based cinema. Story has five new inmates sent to a North African based British Army Prison, the centre piece of which is a manufactured hill that is used as a punishment tool. The new recruits, headed by Joe Roberts (Sean Connery), quickly fall foul of the superiors, especially the venomous Staff Sergeant Williams (Ian Hendry), but these boys wont take it lying down...\r\n\r\nWith no music and Oswald Morris' monochrome photography ensuring atmosphere is perpetually claustrophobic, the harsh edges of the story strike hard. Be it overt bullying by those in charge - pushing men evidently too far - or racism, Lumet melds everything together superbly for harsh viewing experience, tightening the screws every quarter of film. Come the shattering conclusion it's a merciful release for the viewers, a chance to start breathing properly again, even if your mind is ablaze with a number of thoughts.\r\n\r\nThis is very much an actors picture, which seems a given since it's adapted by Ray Rigby from his own play, but a mightily strong cast do sterling work with the tinderbox screenplay. Ossie Davis, Harry Andrews, Ian Bannen, Roy Kinnear, Alfred Lynch and Michael Redgrave fill out the other key roles, each giving their characters vivid depth without resorting to histrionics and scenery chewing. Which of course is a testament to Lumet's skills as a director of actors.\r\n\r\nSlow burning intensity bristles with the corrosive nature of machismo fuelled authority, an unforgettable film and highly recommended to those who have not sampled it yet. 9/10",
         "url": "https://www.themoviedb.org/review/5648a3ed9251413ade0075b7"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Joe Roberts",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab09",
               "name": "Sean Connery",
               "profile_path": "/ce84udJZ9QRSR44jxwK2apM3DM8.jpg",
               "id": 738,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "R.S.M. Wilson",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab0d",
               "name": "Harry Andrews",
               "profile_path": "/1EJXH5DyJWDtHfX8MeqSrCrUlwD.jpg",
               "id": 19463,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Harris",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab11",
               "name": "Ian Bannen",
               "profile_path": "/o1M55VhFgRimGz9cNjadt8fWlXE.jpg",
               "id": 2481,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "George Stevens",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab15",
               "name": "Alfred Lynch",
               "profile_path": "/1oKKw2GzzzfUWxj0tf5BeP80nV3.jpg",
               "id": 87417,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Jacko King",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab19",
               "name": "Ossie Davis",
               "profile_path": "/9oVewASbQrzqENeKJX5CGLVzq3U.jpg",
               "id": 15531,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Monty Bartlett",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab1d",
               "name": "Roy Kinnear",
               "profile_path": "/vPG07Lh06DuUlpcd8evvJjAGq8k.jpg",
               "id": 3463,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Jock McGrath",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab21",
               "name": "Jack Watson",
               "profile_path": "/76e7aWYfYdGq7tlTIVuDEcQtfDo.jpg",
               "id": 47549,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Staff Sergeant Williams",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab25",
               "name": "Ian Hendry",
               "profile_path": "/yncW9U3Q2Pvzc1fNoCfbWdkVrgE.jpg",
               "id": 58339,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "The Medical Officer",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab29",
               "name": "Michael Redgrave",
               "profile_path": "/eQwqBfCucvLhQIKz23SzN3z6wN7.jpg",
               "id": 7640,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Commandant",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab2d",
               "name": "Norman Bird",
               "profile_path": "/lHj58cWdvdkleI7lDTpRHnwqKP4.jpg",
               "id": 16275,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Burton",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab31",
               "name": "Neil McCarthy",
               "profile_path": "/sNQxZARN2qUtNzL28oyJnmuZWGe.jpg",
               "id": 2601,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Walters",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab35",
               "name": "Howard Goorney",
               "profile_path": null,
               "id": 30676,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Martin",
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02ab39",
               "name": "Tony Caunter",
               "profile_path": null,
               "id": 129309,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02aae1",
               "name": "Sidney Lumet",
               "profile_path": "/sOo8jatHC3heDbC2FAOteBXe3z2.jpg",
               "id": 39996,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a368484e02aae7",
               "name": "Ray Rigby",
               "profile_path": null,
               "id": 115600,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a368484e02aaed",
               "name": "Ray Rigby",
               "profile_path": null,
               "id": 115600,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a368484e02aaf3",
               "name": "R.S. Allen",
               "profile_path": null,
               "id": 129308,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02aaf9",
               "name": "Kenneth Hyman",
               "profile_path": null,
               "id": 21779,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4493c3a368484e02aaff",
               "name": "Oswald Morris",
               "profile_path": null,
               "id": 10339,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a368484e02ab05",
               "name": "Thelma Connell",
               "profile_path": null,
               "id": 35839,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5a2dbd82c3a3680b8a1511b9",
               "name": "Raymond Anzarut",
               "profile_path": null,
               "id": 21780,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a2dbd98925141033014cc3d",
               "name": "Herbert Smith",
               "profile_path": null,
               "id": 1604462,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5a2dbda4925141032915c406",
               "name": "George Partleton",
               "profile_path": null,
               "id": 38060,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5a2dbdb10e0a264cbe152a2e",
               "name": "Clifton Brandon",
               "profile_path": null,
               "id": 1556555,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 9.735309,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 24395,
      "vote_count": 61,
      "budget": 0,
      "overview": "North Africa, World War II. British soldiers on the brink of collapse push beyond endurance to struggle up a brutal incline. It's not a military objective. It's The Hill, a manmade instrument of torture, a tower of sand seared by a white-hot sun. And the troops' tormentors are not the enemy, but their own comrades-at-arms.",
      "similar": [
         2652,
         9453,
         14433,
         873,
         4421,
         185,
         374720,
         1696,
         50601,
         21575,
         18,
         563,
         170,
         588,
         17295,
         13492,
         17609,
         74997,
         12877,
         18533
      ],
      "original_title": "The Hill",
      "runtime": 123,
      "poster_path": "/4ZQcVEkj3Ru2FKSczz068cVdDtk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Seventh Art Productions",
            "id": 45654,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1965-06-17",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "They went up like men! They came down like animals!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Sidney Lumet"],
      "runtime": 123,
      "synopsis": null,
      "writers": [
         "Ray Rigby",
         "Ray Rigby"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059274/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTM2Mzk3MDAwNF5BMl5BanBnXkFtZTgwNjEzNjIzMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Sean Connery, Harry Andrews, Ian Bannen | See full cast and crew »"],
      "reviews": [
         "I can't think of a film less appreciated than this one. The tragedy of THE HILL began with its horribly botched release in 1965 - a textbook example of studio stupidity. On the other side of the equation, film purists who were worshipping at the alter of goofs like Godard's \"Alphaville\" turned up their noses at this movie because it starred the \"lightweight\" commercial actor Sean Connery. Jesus wept. It is absolutely amazing that this movie is so uncompromisingly British while being directed by the so-called \"New York\" director Sidney Lumet. The man's a genius. And less you wonder, I lived for three years in England (1966-69) and am a World War II buff, so I have reason to testify to its authenticity. And for Sean Connery, at the height of his popularity (He was the Number One box office draw the year this movie came out), to play the character of SGT. Joe Roberts, sans toupee, and without the typical \"movie star out\" for his character - see the movie and compare it to THE LAST CASTLE, and you'll know what I mean - is nothing short of stunning. Can you tell I love this movie? There's not a false moment in it. And the acting! Besides Connery, there are great performances by Harry Andrews, Ian Bannen, Ian Hendry, Ossie Davis...and oh yeah, every other person in the cast. Is it hard to understand the accents sometimes? Sure. But it's nothing that can't be overcome by simply paying attention when you watch this film. And what does this movie say about the military mindset, the lust for power, racism, the duality of heroism and cowardice, the dangers of unquestioning loyalty, and more? A whole helluva lot more than 99% of the other movies - and theatrical plays - that you'll ever see. I'll just finish by saying you are missing so much if you don't see this movie. You'll come out of it seeing things a little differently than you ever did before. And that's all you can possibly ask from a movie. Come on, people. Let's get in the votes on THE HILL to get it into the IMDB Top 250 movie list. My vote: a 10.",
         "\"The Hill\" is the first of five films Sean Connery made with Sidney Lumet, and is one of the best, largely because it focuses on ensemble acting, and because each of the actors are up to the task. The film is set in a North African prison camp during World War II, where a group of five inmates (Connery, Ossie Davis, Roy Kinnear, Alfred Lynch and Jack Watson) have just been assigned. The Sergeant-Major who runs things at the camp (Harry Andrews) has a novel theory about rehabilitation -- break down the wills of the inmates by repeatedly running them up and down a sandy hill built in the middle of the compound, then rebuild them as model soldiers. Despite the martinet-type attitude, Connery and each of his fellow inmates begins to rebel against Andrews and his new, sadistic assistant (Ian Hendry), culminating in the death of one of the inmates and the consequent attempt to cover up the incident. In black-and-white, Lumet has done a remarkable job of giving the location the feel of hell-on-earth, and his noted ability to work with actors is visible here. Connery is excellent in the second-best performance of his career (the best was his 1973 performance in \"The Offence\", also with Lumet directing) as a career soldier whose not all that certain that the Army's outdated discipline is worth anything. Equally good performances are turned in by Davis as a West Indian soldier who takes the racist barbs of his jailers and rebels in his own, unique way; Watson as a brutish inmate who begins to develop a conscience; Ian Bannen as a sympathetic guard; Lynch as a sensitive man not meant for the army or jail; Andrews; and Michael Redgrave as the ineffectual doctor who finds courage at the crucial moment. Probably the best performance, however, is turned in by Hendry as the deeply insecure, sadistic loose cannon of a guard who truly sets events in motion. At once, his performance is villanous, but with an edge of immaturity that makes it almost difficult to hate him -- until the end when the other characters really begin to appreciate just how dangerous he is. Unfortunately, this film was ignored by the Oscars -- a tragedy especially from some actors who have/had generally been ignored by the Academy and other awards groups (i.e., Connery, Hendry, Andrews, Davis). It did, however, win an award at the Cannes Film Festival for Ray Rigby's superb screenplay. You may need to listen close to pick up some of the dialogue, but by all means, see it if you get the chance.",
         "In which Connery doesn't get to cop off with the customary harem of beach babes, doesn't get to save the world and more importantly gets his butt kicked by Ian Hendry! Sidney Lumet seasons Ray Rigby's claustrophobic screenplay with some stunning black and white cinematography (reminiscent of his earlier masterpiece '12 Angry Men') and then bakes it in about 6 million degrees of scorching desert sun. The story of five squaddies holed up in a military stockade at the tail end of WW11 is as preoccupied with examining political conflict within British society (through the interactions of the microcosmic cell mates) as it is with presenting a taut, compelling psychodrama. The allegorical tone of the movie is never clumsy or heavy handed though and Lumet keeps the narrative on the rails every step of the way. The dialogue crackles with blunt barrack room banter and black humour throughout perfectly offsetting the grim circumstances the prisoners find themselves in. Roy Kinnear, Ossie Davis and Ian Hendry (as a deranged martinet of a prison guard) all deserve special mention but the film surely belongs to Connery who stumbles 'bruised, battered and scarred but hard' through to the bitter climax with an extraordinary kind of dignity as he rails against the brutal injustices of 'the system'! It is a truly unmissable picture if only for Connerys' star turn but don't take my word for it. Check it out now.",
         "The Hill is obviously a movie that would interest former military personal, WWII movie buffs and Sean Connery fans. However, anybody interested to see some fine British character actors would not be disappointed with this too. There is Harry Andrews who is in his element playing a strutting disciplinarian Sergeant-Major in a British Military prison during WWII. Ian Hendry who probably never played a more nasty role, Ian Bannen as Staff Sgt Harris, Ossie Davis, Alfred Lynch, Roy Kinnear, Michael Redgrave and Jack Watson all in support. We are introduced to Sgt Major Bert Wilson played by Harry Andrews a tough as nails squared jawed career army man who takes pride in straightening out soldiers who have got out of line. A few months in his stockade and he will make new men of you, \"fit to be in his majesties army\",this is clear from the debriefing he gives to two soldiers about to be discharged from his custody. Also, he does not care for the commandant at the camp who he regards as a desk jockey and nothing but a symbolic position. He is really in charge of what goes on in the camp, he's respected by many of the inmates as tough but fair, this is made clear later in the film. However, with the intake of trooper Roberts a busted down Sgt Major (disobeyed a direct order and struck a superior officer) and a black soldier he lets his personal feelings and racial prejudice get the better of him. Wilson does things by the book and loathes Roberts also a career soldier who he thinks lets down everybody and undermines everything the army stands for. Jako King is a colored soldier who he thinks is not fit to were the uniform of a British soldier, uncivilized etc. He makes it clear that he plans to break and humiliate Roberts and make him pay, so he passes them over to the supervision of Staff Sgt Williams to drill Roberts, King and the others over a huge man made hill of sand. Staff Sgt Williams is a sadist who revels in dishing out the indignities to the men now under his supervision. He also takes exception to Roberts who would normally be barking out orders, so Williams takes the opportunity to stick it to a former superior officer. He's a bully and a coward too because he can't deal with people on equal terms but only when the odds are heavily stacked in his favor i.e. the beating he hands out to Roberts while two other staffs are holding him down and his persistent tormenting of Stevens who unlike Roberts is too frightened to stand up to him. Pvt Stevens who perhaps reminds him of his own shortcomings, is weak and totally unsuited to the army. He is way over his head in a military stockade and so Williams singles him out in particular. There is a scene at night when the conditions are cooler,Staff Williams stripped to the waist can only manage run up the hill 3 times before finding it all too much. Despite his obvious physical inadequacies he still drives the prisoners up and down again and again during the midday heat with them wearing full kit and battle fatigues until they are on the verge of exhaustion and heat stroke. Also there is Staff Sgt Harris who despises Williams and his methods but can't do anything because he is considered too soft by Sgt-Major Wilson. Lastly, the chief medical officer played by Michael Redgrave. Often in military or prison movies the medical officer either is respected and prepared to confront a superior officer on medical grounds or alternatively they are weak and useless. In this film he leans to the later as his medical is - \"turn you head and cough, ------ OK fit for punishment!\". He opts for the quiet life and really couldn't be bothered! Things had got well out of control before he started to assert himself and even then he was trying to save his own skin. In movies such as TAKE THE HIGH GROUND, FULL METAL JACKET and OFFICER AND A GENTLEMAN Richard Widmark, J. Lee Emery and Louis Gossett Jr's characters respectively, were mean SOB's who may have singled people out and even crossed the line, but they did what they did for a reason, not because they liked seeing people suffer. In the famous STANFORD EXPERIMENT in the 1970's after a few days it was called off because the jailers started to enjoy giving orders as well as punishing the prisoners. Jailers need a chain of command and close supervision too, in this movie it's an interesting character study of when things get out of hand. Although there is no doubt that some real hard cases and rotten apples pass through these camps and probably deserve a difficult time, the staff supervising have to be disciplined too. Once they bring in their personal feelings or else start to enjoy their work too much, things start to break down. In addition it raises the spectacle that if personal grudges are held the jailers certainly have the upper hand! In this case we have sympathy with the inmates who seem to be nothing but malcontents, misfits and chancers and we are led very quickly to have sympathy for Roberts who felt justified in his disobedience as his unit that he refused to lead was massacred. Also, the stress of war time conditions back in WWII on individuals that led to AOL, desertion or cowardice could now be described as post pneumatic stress disorder. The black and white print gives it a cold harsh WWII feel and a claustrophobic setting as much of the dialog was inside. It's well written, with good directing, great camera angles and close up shots too. I'd certainly recommend this movie!",
         "Sidney Lumet is one of my favorite directors. His films sometimes have weak plots or poor dialogue, but he always elicits superb performances from his cast, and seems to encourage them to really dig into the characters. This film is no exception. \"The Hill\" features top-notch performances from the entire cast in a gritty anti-war film with a unique perspective - it's filmed in a British Army prison camp. It raises the issues of racism, indolence, sadistic camp guards, a failed bureaucracy, and ultimately, the actions of true non-conformists and their treatment by a class-driven society. Connery took a 180-degree turn from James Bond at just the right time in his career, and proves he's a great actor without the babes and the gadgets. Lumet makes one of his tightest films, from the script and camera work through to the final editing. Although not always pleasant to watch, a definite 10...one of the finest anti-war films made.",
         "This was one of the most poinant lines of the film, neatly summarising the general mood and feeling of the characters. A lot of people think that this is an anti-war film, which to some degree it is. More accurately, however, it could be labelled an anti-army film. Interestingly enough both views could be maintained without there being any real warfare displayed on the screen. This is a measure of how powerful the film is. The fighting which we see is actually between the various prison officers and convicts. The film does not simply divide them into opposing groups, but rather explores the differences and tensions between the people who are in power and those who are subject to it. Like 'Full Metal Jacket', many years later, this movie is a condemnation of the dehumanising process soldiers are forced to go through in order to survive the army. Military prison, as we learn, is a further step down into the merciless and brutal world of the army. If 'The Hill' was made today, the violence we see would undoubtedly be more explicit and obvious. However, this does not take away anything from the original , as it is the mental torture more than the physical suffering which is portrayed so well in Lumet's work. It has aged fairly well, mainly due to the accomplished and original way the film is shot and the script is written. Camera angles to induce feelings of dominance, claustrophobia and pressure are utilised perfectly as are the varying degrees of light and dark contrast which accentuates the blazing sun. Every actor is well cast and gives well judged performances, most career bests. Those that stand out are Bannen, Hendry, Connery and Andrews. At the core of the film is the struggle between Andrews and Bannen's respective characters for ultimate authority in the prison. The bittersweet ending shows that Andrews' charcter, although shaken, will still reign in the hellhouse of a military prison. Superb, thought provoking film, that rewards the viewer for staying with it as the powerful ending is reached.",
         "Gritty emotional story of men being subjected to ill treatment at a British Army disciplinary camp in the desert. Human drama is of interest to anyone who has been a cog in a corporate machine, not just a veteran. Symbolic of human defiance in the face of rigid rules and inconsiderate authority. Excellent cast takes every opportunity of limited time frame to give their characters amazing depth. Every character is fully realized and recognizable by anyone who has a few tough life experiences. Naturally as good as the other actors are, the focus will always be on Connery's screen presence. Here he seems to be portraying his true personality, his face never suited Bond as much. Tough, self respecting and self disciplined sergeant who resolves not to lose his dignity in the face of harsh cruelty. This is an amazing performance, and it's too bad we don't use men like this as role models in modern American society. As good as the performances are, the best thing about this film is the photography---check out the 360 degree camera movement during the opening sequence. It's a masterpiece which is rare to see even today.",
         "Stark images, powerful script and performances, and rapid, sharp editing make this film difficult to forget. Director Sidney Lumet stamps his authority on the movie with a style that is gritty, almost documentary -like. The quick cuts are precise, like the snap of the salutes and the bark of the NCO's. Beyond Lumet's towering presence, there is a likeable performance from a young Ossie Davis, an excellent early non-Bond performance from Sean Connery, and Harry Andrews' Sargeant-Major is a remarkable creation - a little man whose job is to destroy these misfits on behalf of a system that will not tolerate individuals. This remarkable film stays in the mind long after viewing for me, mainly because it announces early on that it is not an easy picture, and like early Frankenheimer, it's aggressive style stands out from the norm. It is a quintessential sixties picture - a time when experiments in style could be taken seriously - not just a smirky in-jokes or cartoonish roller -coaster rides. Exhilarating nonetheless.",
         "It isn't often Sean Connery makes a film which becomes more memorable than his efforts to make it. Such is the way with a few he decided not mention in his filmography, such as \"Safu.\" You must see it to realize that despite Connery, the film must have a true message. Such is the case with \"The Hill.\" This film does have a message and it is harsh, brutal and to the point. The setting is a British military prison located in the desert and stocked with ex-soldiers who've been court martialed and now must be repatriated by backbreaking discipline, and grim punishment. With inmates coming and going at the prison, it is not too difficult to imagine a new lot which includes Joe Roberts (Sean Connery) a broken Sgt. Major. Pvt. Jacko King (Ossie Davis, who is superb in this role) Pvt. Alfred Lynch, (George Stevens) Pvt. Monty Bartlett (Roy Kinnear) and Pvt. Jock McGrath (Jack Watson). These men and others are new inmates and are pitted against the ruling officers who, will receive as much as they give. This includes the governing Non-commission staff like, Royal Sgt. Major Bert Wilson (Harry Andrews, superb acting) and Sgt. Harris (Ian Bannen) who despite their station are set to collide with each other as well as with the prisoners. Upon entering the prison, the audience is allowed to see how the men will be affected as they are introduced to the punishing ordeal of . . . The Hill. ****",
         "Life in a British Military prison somewhere in the Lybian desert, at a time when national service (conscription) in the UK was still in force up until the mid 60s. A superb film from Lumet that involves all sorts of political, social & personal issues. Clearly the most defined is one of Social Class between the officers & the grunts on the ground. Although Lumet doesn't make this distinction blatently obvious he makes up for it with subtle hints that are made known between Connery & Andrews in particular. Of course another issue is one of national identity. Britain was no longer the superpower it was by the 60s and her empire was being lost through independence. Meaning that the British forces, and the army in particular, was losing its place in the world of Service & honour to the Throne. Andrews represents a man of tradition, honour, breeding & standing. He is the unofficial overlord of the camp where he tries hard to reinforce those rules not only to the prisoners but also to his fellow officers. While Connery represents the other side of the coin: a working class man with principles, but also a more objective man who can see the world has changed and that Britain is out of touch and is sickened by what he sees inside Andrews' camp. But again, Lumet doesn't insult our intelligence by marking these distinctions with over the top violence. It is all cleverly interwoven throughout the film with a quality ending. Connery has never been better, with the exception of perhaps The Untouchables and The Name of the Rose. Andrews just takes the plaudits as the Sergeant caught in a timewarp, seeing his own little \"empire\" of Rules & Regulations crumble around him, and his efforts to maintain order at any cost. In addition there is remarkable support from Ian Bannen, another Sergeant but younger and more human than his superior. Bannen is excellent as he tries to help the prisoners from Andrews' sadism but he too is soon found wanting. Finally, there's Ossie Davis, who is a black prisoner proud to fight for his Queen & Country, and yet gets treated far worse by Andrews' & co simply because he is black. Although Davis gives a very good performance, I'm always concerned that quite a few of his movie roles represent the racial aspect and how he deals with it. But nevertheless, he is excellent here. A good film then, on a par with Full Metal Jacket. Tough, sweaty, loud, gripping! ****/******"
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Seven Arts Productions"
      ],
      "summaries": [
         "WWII, in a British disciplinary camp located in the Libyan desert. Prisoners are persecuted by Staff Sergeant Williams, who made them climb again and again, under the heavy sun, an artificial hill built right in the middle of the camp. Harris is a more human and compassionate guard, but the chief, S.M. Wilson, refuses to disown his subordinate Williams. One day, five new prisoners arrive. Each of them will deal in a different way with the authority and Williams' ferocity.",
         "At a British military prison in North Africa during World War II, convicted British soldiers face harsh conditions and an even harsher staff. For Trooper Joe Roberts - reduced in rank from Sergeant Major and imprisoned for striking an officer - the going is particularly difficult. Sharing a cell with four other men, they are under the command of Staff Sergeant Williams, a particularly cruel task master who takes pleasure in imposing harsh punishment especially making the men run up and down the \"hill\" until they collapse from heat exhaustion. No matter the excesses, the prison Sergeant Major will always back up his men. When one of the prisoners dies however, there is an opportunity to expose Williams' for what he is.",
         "In a North African military prison during World War II, five new prisoners struggle to survive in the face of brutal punishment and sadistic guards."
      ],
      "budget": 0
   },
   "movielensId": 26138,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1965-06-17",
      "dvdReleaseDate": "2007-06-05",
      "directors": ["Sidney Lumet"],
      "runtime": 123,
      "movieId": 26138,
      "title": "The Hill",
      "mpaa": "",
      "actors": [
         "Sean Connery",
         "Harry Andrews",
         "Ian Bannen",
         "Alfred Lynch",
         "Ossie Davis",
         "Roy Kinnear",
         "Jack Watson",
         "Ian Hendry",
         "Michael Redgrave",
         "Norman Bird",
         "Neil McCarthy",
         "Howard Goorney",
         "Tony Caunter"
      ],
      "imdbMovieId": "0059274",
      "originalTitle": "The Hill",
      "genres": [
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": [
         "ww4_ZbsDK1M",
         "ralpxNFC454"
      ],
      "plotSummary": "North Africa, World War II. British soldiers on the brink of collapse push beyond endurance to struggle up a brutal incline. It's not a military objective. It's The Hill, a manmade instrument of torture, a tower of sand seared by a white-hot sun. And the troops' tormentors are not the enemy, but their own comrades-at-arms.",
      "tmdbMovieId": 24395,
      "avgRating": 3.51562,
      "releaseYear": "1965",
      "numRatings": 96,
      "posterPath": "/4ZQcVEkj3Ru2FKSczz068cVdDtk.jpg"
   }
}