{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "space travel",
            "id": 3801
         },
         {
            "name": "space mission",
            "id": 4040
         },
         {
            "name": "space",
            "id": 9882
         },
         {
            "name": "outer space",
            "id": 12405
         },
         {
            "name": "astronaut",
            "id": 14626
         },
         {
            "name": "trapped in space",
            "id": 191586
         }
      ],
      "imdb_id": "tt0064519",
      "video": false,
      "title": "Journey to the Far Side of the Sun",
      "recommendations": [
         92272,
         451004,
         345287,
         28073,
         481849,
         88359,
         39564,
         87835,
         42633,
         40208,
         2982,
         28363,
         53834,
         209871,
         114186,
         57733,
         111208,
         283563,
         26278,
         42688
      ],
      "backdrop_path": "/yjBHjhg8J0bxMDKVKFz3oTBHWow.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Colonel Glenn Ross",
               "gender": 2,
               "credit_id": "52fe4590c3a36847f80ce6e7",
               "name": "Roy Thinnes",
               "profile_path": "/tb8ZfsFfl8Smhr719E3pRutPJa9.jpg",
               "id": 6178,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "John Kane",
               "gender": 2,
               "credit_id": "52fe4590c3a36847f80ce6eb",
               "name": "Ian Hendry",
               "profile_path": "/yncW9U3Q2Pvzc1fNoCfbWdkVrgE.jpg",
               "id": 58339,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Jason Webb",
               "gender": 2,
               "credit_id": "52fe4590c3a36847f80ce6ef",
               "name": "Patrick Wymark",
               "profile_path": "/vrXTDBBGi4UdXFt8aEupKPTee9R.jpg",
               "id": 67917,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Sharon Ross",
               "gender": 2,
               "credit_id": "52fe4590c3a36847f80ce6f3",
               "name": "Lynn Loring",
               "profile_path": "/rRzvl87HdOoW8DDv0zejHpDCdxx.jpg",
               "id": 102859,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Lisa Hartmann",
               "gender": 1,
               "credit_id": "52fe4590c3a36847f80ce6f7",
               "name": "Loni von Friedl",
               "profile_path": "/rsswIkwsLyjcSAV6wsYPfoPOCoj.jpg",
               "id": 32131,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Paulo Landi",
               "gender": 0,
               "credit_id": "52fe4590c3a36847f80ce6fb",
               "name": "Franco De Rosa",
               "profile_path": null,
               "id": 137382,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Mark Neuman",
               "gender": 2,
               "credit_id": "52fe4590c3a36847f80ce6ff",
               "name": "George Sewell",
               "profile_path": "/t0xEmRq9CpgS72fVyWa2tyq1W0n.jpg",
               "id": 109200,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "David Poulson",
               "gender": 0,
               "credit_id": "52fe4590c3a36847f80ce703",
               "name": "Ed Bishop",
               "profile_path": "/v5jVNLCSACz9yC0mhD4akfXPtc6.jpg",
               "id": 108277,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Dr. Pontini",
               "gender": 2,
               "credit_id": "52fe4590c3a36847f80ce707",
               "name": "Philip Madoc",
               "profile_path": "/xyCIAhCW1986jOD5SxpgaI6x5TZ.jpg",
               "id": 80499,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Psychiatrist",
               "gender": 2,
               "credit_id": "52fe4590c3a36847f80ce70b",
               "name": "Vladek Sheybal",
               "profile_path": "/ccutGFAuflgNyPXyXd6HE1pwZk5.jpg",
               "id": 39036,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4590c3a36847f80ce70f",
               "name": "George Mikell",
               "profile_path": "/ak4YIVTrl5KWuxbIW9n7tOjtxzp.jpg",
               "id": 137383,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Doctor Hassler",
               "gender": 2,
               "credit_id": "52fe4590c3a36847f80ce713",
               "name": "Herbert Lom",
               "profile_path": "/85tCjSGBH778wpycsIDb7mxhZia.jpg",
               "id": 14503,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4590c3a36847f80ce6c5",
               "name": "Robert Parrish",
               "profile_path": "/uffNpQc9COatvZtJnkCX9e3uTEu.jpg",
               "id": 8514,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4590c3a36847f80ce6d1",
               "name": "Sylvia Anderson",
               "profile_path": "/ytQKcG3uNZXkal8BnQgk8Bj4tBn.jpg",
               "id": 137380,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4590c3a36847f80ce6dd",
               "name": "Sylvia Anderson",
               "profile_path": "/ytQKcG3uNZXkal8BnQgk8Bj4tBn.jpg",
               "id": 137380,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4590c3a36847f80ce6e3",
               "name": "Donald James",
               "profile_path": null,
               "id": 137381,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4590c3a36847f80ce71f",
               "name": "Sylvia Anderson",
               "profile_path": "/ytQKcG3uNZXkal8BnQgk8Bj4tBn.jpg",
               "id": 137380,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4590c3a36847f80ce725",
               "name": "Derek Meddings",
               "profile_path": null,
               "id": 227557,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 0,
               "credit_id": "55628474c3a36852e9000628",
               "name": "Len Walter",
               "profile_path": null,
               "id": 1470456,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "578ce2529251410e4f00a70f",
               "name": "Gerry Anderson",
               "profile_path": "/1NYWJXXgT3M83x78Z4epBotWitG.jpg",
               "id": 1213685,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "578ce25dc3a3682bb201173c",
               "name": "Gerry Anderson",
               "profile_path": "/1NYWJXXgT3M83x78Z4epBotWitG.jpg",
               "id": 1213685,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "578ce647c3a3682bb2011898",
               "name": "Gerry Anderson",
               "profile_path": "/1NYWJXXgT3M83x78Z4epBotWitG.jpg",
               "id": 1213685,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "556284249251411946000617",
               "name": "John Read",
               "profile_path": null,
               "id": 1217064,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55628441c3a368520b0005ad",
               "name": "Ernest Holding",
               "profile_path": null,
               "id": 1470455,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "55628464c3a3685448000678",
               "name": "Brian Burgess",
               "profile_path": null,
               "id": 1217044,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "556284879251414a5f0026d2",
               "name": "Bob Bell",
               "profile_path": null,
               "id": 185040,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "556284c99251411946000643",
               "name": "Barry Gray",
               "profile_path": null,
               "id": 1470457,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 3.348385,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 40430,
      "vote_count": 38,
      "budget": 0,
      "overview": "A planet is discovered in the same orbit as Earth's but is located on the exact opposite side of the sun, making it not visible from Earth. The European Space Exploration Council decide to send American astronaut Glenn Ross and British scientist John Kane via spaceship to explore the other planet. After a disastrous crash-landing Ross awakes to learn that Kane lies near death and that they apparently have returned to Earth, as evidenced by the presence of the Council director and his staff. Released to the custody of his wife, he soon learns things are not as they seem.",
      "similar": [
         157336,
         348,
         126889,
         274870,
         2103,
         2067,
         62,
         395992,
         49047,
         286217,
         4437,
         8077,
         95,
         19995,
         118340,
         384521,
         339964,
         228161,
         68179,
         438740
      ],
      "original_title": "Doppelgänger",
      "runtime": 101,
      "poster_path": "/o0LM7Mleo9Fwl9kUl6GVqd4IGQ9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Century 21 Television",
         "id": 6141,
         "origin_country": ""
      }],
      "release_date": "1969-08-27",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "You will meet yourself face-to-face when Earth meets its duplicate in outer space!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Parrish"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Gerry Anderson",
         "Sylvia Anderson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0064519/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1NDE5OTUzNl5BMl5BanBnXkFtZTgwMjI4NTg5MDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Roy Thinnes, Ian Hendry, Patrick Wymark | See full cast and crew »"],
      "reviews": [
         "'Journey To The Far Side Of The Sun' is quite possibly the most underrated SF movie of the 1960s. It certainly has some flaws - especially the lack of character development, and a few ponderous sequences seemingly modeled on '2001: A Space Odyssey', released the previous year - but if you overlook them you'll find a quietly intelligent and fascinating movie that deserves to be rediscovered. The brains behind this movie were Gerry and Sylvia Anderson best remembered for their wildly entertaining marionette TV shows such as 'The Thunderbirds'. This movie was their first foray into live action SF and in some ways was the precursor to their 1970s cult series 'UFO'. Ed Bishop, George Sewell and some of the other supporting cast members went on from this movie to that TV show. The real stars however are Roy Thinnes, best known at the time for 'The Invaders', and Brit character actors Ian Hendry and Patrick Wymark. Hendry was the star of the little seen first series of 'The Avengers', and also appeared in Polanski's disturbing 'Repulsion' (alongside Wymark), and the camp classic 'Theatre Of Blood' with horror legend Vincent Price. Wymark appeared in another Price movie 'The Conqueror Worm', and starred in 'Blood On Satan's Claw'. Thinnes, Hendry and Wymark are all very good in this movie, albeit a little too cold and remote for my liking, but that is obviously the script's failing not the performers. I haven't mentioned much about the plot of the movie wary of spoiling it for those who have never seen it. Suffice to say it involves the discovery of a hereto unknown planet in our solar system. The less you know about it after that the more you will enjoy it. Overall, despite the script problems and one or two other minor criticisms I highly recommend this movie to all SF fans who prefer ideas over action.",
         "I had never seen this movie before it aired on a local cable sci-fi network. It reminded me of the Irwin Allen TV series of the late 60's (Time Tunnel etc). Excellent effects (they beat Star Trek 5 done 20 years later, but then that wasn't very hard to accomplish). I found the script very intriguing and mature for this type of production. They would have needed a few touch ups to tie some loose ends on the characters' level, but for a kid movie its surprisingly interesting (especially the the glimpse at futuristic euro- politics, surprisingly similar to today's European Union!) The plot is indeed reminiscent of Twilight Zone in general (as other users have pointed), but in this case it's a compliment. Great sets, by the way! 7/10",
         "Spoiler Alert!! 100 years from now scientists discover a new planet in the solar system hidden on the far side of the Sun. It shares earth's orbit and revolves at exactly the same speed so that it has remained undiscovered until now. A consortium of nations collaborate to send two men to the new planet. Security leaks frustrate their desire for secrecy. The two men crash on the surface of the planet and are surprised to wake up back on earth. They are accused of turning back halfway in their journey since a roundtrip flight would have taken twice as long as their trip. One of the men dies of his injuries and the other becomes disoriented by his surroundings -- everything is reversed: cars pass on the wrong side of the road, words and letters are flipped. His interrogators are convinced when he can quickly recite lengthy passages of text read in a mirror. When an autopsy on the dead astronaut reveals that his organs are in reversed position, the conclusion is bizarre -- the men did indeed complete the journey but landed on a parallel/mirror-imaged earth. All matter is duplicated, and each person has a doppelganger partner on the far side of the sun. They attempt to return him. With disastrous results. While it doesn't rank in the top tier of sci-fi classics, Doppelganger is still worth looking for. This film (aka, Journey to the Far Side of the Sun) is an oddity, beginning as pure SCIENCE-fiction then suddenly turning surreal -- almost fantasy. Slow by today's standards, it's intriguing if you put yourself in the mindset of its era, the space-race 60's. (Suiting up and preparing for blast-off was more carefully depicted compared to how someone would film it today) I'm particularly impressed by the art/costuming/production design; it doesn't suffer from a cliched \"vision\" of what the future would look like. It's a low-budget poor-relation to GATTACA in this regard. The movie indulges in some delightful \"gee-whiz\" gadgetry -- [A spy uses a miniature camera in his prosthetic eye to record holographic images. A trans-Atlantic flight ends with the craft disassembling itself on the runway so that the passenger section is carted separately for disembarking. Wrist-bands monitor everyone's vital stats and reminds them to take their meds.] This was the sort of attention to detail that embellished \"2001: a Space Odyssey\", but on a much cheaper budget. Often the miniatures don't look realistic -- but they were always very well crafted and painstakingly rendered. This included a large number of rocketry, vehicles and many outdoor sets (buildings, launch pads, roads). I admired them even in their artificiality; it lent a surreal tone to the project. Roy Thinnes does a serviceable job in the lead (not his usual blandness) and it's fun to find another performance by Ian Hendry (whose brief career included the first season of TV's \"The Avengers\", and the sadistic guard Sgt Williams in THE HILL) Patrick Wymark is good as the pushy authoritarian who heads up the project. After the fateful conclusion -- where all evidence is destroyed that might prove the existence of the Doppelganger world -- he is left as a broken mumbling invalid. The film ends as he rolls his wheelchair excitedly into his mirrored reflection.",
         "What if there were a parallel world to Earth's always hidden from us on the other side of the Sun? This is the question that astronauts Roy Thinnes and Ian Hendry ask themselves when they discover a parallel world of Earth always hidden on the far side of the sun in this 1969 cult science fiction melodrama, released here in America as JOURNEY TO THE FAR SIDE OF THE SUN. The plot of the film was devised by British writers Gerry and Sylvia Anderson, the creators of such TV shows as \"UFO\", \"The Thunderbirds\" and \"Space 1999\". It is exceedingly weird at times, betraying the influence of \"The Twilight Zone\" and even Stanley Kubrick's 1968 sci-fi classic 2001: A SPACE ODYSSEY. The visual effects work of Derek Meddings, who would also later work on SUPERMAN: THE MOVIE, holds up surprisingly well under the last four and a half decades of special effects advancements (including CGI); and while they are not really on the same exalted level of the Kubrick film, they are very superb. If you don't anticipate a STAR WARS-type of a film and can overcome the occasionally trite dialogue, DOPPELGANGER is a good film; it was good enough for me to rank it a '7' and consider it an undiscovered sci-fi gem.",
         "Most people who enjoy this film enough to sit through it multiple times probably first saw it, as I did, during their childhood back in the late 60's - early 70's. It was one of the first science fiction movies I saw as a child and it made enough of an impression on me for me to remember it decades later. It was more thought-provoking than your average 1960's \"space opera\" and the special effects were among the best of its time (second, at the time, perhaps only to '2001' which came out about a year earlier). And although the people behind it were definitely influenced by Kubrick's earlier masterpiece, it contains enough original thought to be fascinating in its own right. Most adults who didn't see this movie when it first came out will probably be too critical to be able to enjoy it if they were to watch it now. As for today's younger audiences, they would probably tend to measure it by the standards of today's movies with their much more advanced special effects and simply dismiss the film as too archaic for their tastes. Unfortunately, this movie is probably destined to languish in ever-increasing obscurity as its original audience gets older and eventually fades away...",
         "I'll admit that like many others here this is a movie I've seen many times as a kid in the 70's. :) The concept and story are just wonderfull. My favorite type of sci-fi, the kind that makes you think and doesn't completely bombard you with special effects. Speaking of special effects, without spilling any beans I can say if you like The Thunderbirds, you'll love the SFX in this movie. Gets a 8 on 10 for me.",
         "Fans of Gerry Anderson's productions will recognise several actors and vehicles from UFO (which was made after Doppelgänger) - as well as sound effects from various Anderson series. Barry Gray's excellent music (mostly unique to this film) adds to the feeling of familiarity. For these reasons alone, I think any Gerry Anderson fan would find Doppelgänger worth getting. Judged simply as a film, it has to be said that Doppelgänger is flawed. It is known that there were major problems during production, and I suspect this is why there is a time-consuming plot thread that ends abruptly and appears to have no relevance to the rest of the story. Presumably time/budget constraints prevented the relevance from emerging! Distractingly, the special effects range from outstandingly good - better than any 1960s film that I know of - to disappointingly bad. Nevertheless, even with these flaws, Doppelgänger's main story is well told and keeps the viewer (or, at least, this viewer) engaged throughout. The ending is perhaps not what one might expect from Anderson, yet at the same time it is typical of Anderson, and it is certainly appropriate. To find out what I mean you'll have to watch it for yourself. :)",
         "In this film, the astronauts sent to explore a newly-discovered planet must deal with several dilemmas, and they do so intelligently. The film approaches it's main plot theme in a unique way, and unfolds it gradually, though it can be guessed beforehand. The acting is very good, though sometimes stiff, as some late-60s acting can be. It can also be somewhat wordy and even melodramatic, especially after the plot theme reveals itself. Visually, it has a scene that resembles one in the previous year's \"2001: A Space Odyssey\", and that tends to date the movie. Some of the actors went on to star in the 1970 TV show \"UFO,\" which is delightfully campy and worth checking out on DVD. Despite these small points, the space flight itself is realistic, and considering this was 1969, the scenes inside the cockpit of the spacecraft also had a realistic look. (Look for some 1990s/2000s video technology in use, too!) One thing: I suspect a love scene has been cut, but I can't prove it! It would have been a distraction anyway. Unlike most Sci-Fi films, this film will make you think about the plot, and that's well worth a look. I'm pleased to have this film in my video library.",
         "All right, I'll grant you that some of the science in \"Doppelganger\" (or \"Journey To The Far Side Of The Sun\") is kind of dopey.The idea of an entire planet existing undetected (because we can't see it on the other side of our sun) doesn't hold up at all - any Astronomy 101 student knows that another planet the size of Earth would cause gravitational perturbances in the motions of other planets. That's how astronomers deduced the existence of Pluto, after all, and that's how they find comets and asteroids and moons on a regular basis. And the idea that a mirror image Earth somehow evolved in almost perfect parallel to our Earth, down to English speaking scientists and human counterparts for each human born on our Earth...that takes things out of 'hard science' fiction and into \"Twilight Zone\" territory. That's not necessarily a bad thing, but it requires a major suspension of critical thinking to accept and enjoy. But man, this movie knocked my socks off as an adolescent. I was still used to fairly cheerful, upbeat science fiction films when the hero won through in the end - even \"2001\" could be interpreted as having an 'upbeat' ending. But in this case: Thinnes attempted to dock with his orbiting mothership so he could return to his own Earth, only to be bounced back out of his docking berth (Something about 'the polarities not being reversed because his 'doppelganger' wasn't doing the same thing. Apparently Thinnes' 'doppelganger' had decided he was happy in his new home.) Thinnes' ship started the descent back to the CounterEarth launch site, and I was certain that he would somehow get the damaged craft to land safely and try again, armed with the new info that would let him and his backers succeed. He was The Hero after all, and the Hero always wins through in the end. Instead, Thinnes couldn't maintain control of the crippled craft, and the ship's subsequent crash into the launch site was so horrible and devastating that it killed everyone (except for the chief project leader) and destroyed all records of the project and Thinnes' existence. Thinnes never got to go home, and he perished uselessly, his secrets never revealed. Except for the Planet Of the Apes series, I had never seen such a sad and downbeat ending, and it always stuck in my mind - especially the ferocious devastation of the crash scene near the beginning of the move (you knew that spaceship was NEVER going to fly again!) and the one at the very end. I'd love to see this movie again, and see how well it held up over the years.",
         "I never claimed this film to be a masterwork. But, when I was a teenage boy, growing up during the Apollo project and the original Star Trek years, I found this film to be imaginative and thought provoking. The music score was especially to my liking - I didn't realize why at the time, but later in my career I came to understand what a fine composer Barry Gray was (I'm a school band director). The criticism offered in many reviews is unjustified. I recently purchased the DVD edition to add to my collection of 1950-77 sci-fi films (the \"pre Star Wars\" era). I always have held the film as one of the best of the era, largely because of its appeal to the emotions of \"awe\" and the film's visual and musical effects. Well worth owning, and far better than most of the junk produced during this era (with exceptions such as George Pal films, and of course, the entire Star Trek franchise)."
      ],
      "genres": ["Sci-Fi"],
      "productionCompanies": ["Century 21 Television"],
      "summaries": [
         "A planet is discovered in the same orbit as Earth's but is located on the exact opposite side of the sun, making it not visible from Earth. The European Space Exploration Council decide to send American astronaut Glenn Ross and British scientist John Kane via spaceship to explore the other planet. After a disastrous crash-landing Ross awakes to learn that Kane lies near death and that they apparently have returned to Earth, as evidenced by the presence of the Council director and his staff. Released to the custody of his wife, he soon learns things are not as they seem.",
         "The European Space Exploration Council sends two astronauts to explore a planet similar to the Earth but located on the opposite side of the sun."
      ],
      "budget": 0
   },
   "movielensId": 26206,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1969-08-27",
      "dvdReleaseDate": "2008-06-24",
      "directors": ["Robert Parrish"],
      "runtime": 101,
      "movieId": 26206,
      "title": "Journey to the Far Side of the Sun",
      "mpaa": "G",
      "actors": [
         "Roy Thinnes",
         "Ian Hendry",
         "Patrick Wymark",
         "Lynn Loring",
         "Loni von Friedl",
         "Franco De Rosa",
         "George Sewell",
         "Ed Bishop",
         "Philip Madoc",
         "Vladek Sheybal",
         "George Mikell",
         "Herbert Lom"
      ],
      "imdbMovieId": "0064519",
      "originalTitle": "Doppelgänger",
      "genres": ["Science Fiction"],
      "youtubeTrailerIds": ["Zyv6n2TLWco"],
      "plotSummary": "A planet is discovered in the same orbit as Earth's but is located on the exact opposite side of the sun, making it not visible from Earth. The European Space Exploration Council decide to send American astronaut Glenn Ross and British scientist John Kane via spaceship to explore the other planet. After a disastrous crash-landing Ross awakes to learn that Kane lies near death and that they apparently have returned to Earth, as evidenced by the presence of the Council director and his staff. Released to the custody of his wife, he soon learns things are not as they seem.",
      "tmdbMovieId": 40430,
      "avgRating": 2.97222,
      "releaseYear": "1969",
      "numRatings": 18,
      "posterPath": "/o0LM7Mleo9Fwl9kUl6GVqd4IGQ9.jpg"
   }
}