{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "elves",
            "id": 603
         },
         {
            "name": "dwarf",
            "id": 604
         },
         {
            "name": "orcs",
            "id": 606
         },
         {
            "name": "rivendell",
            "id": 619
         },
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "gold",
            "id": 1321
         },
         {
            "name": "magic",
            "id": 2343
         },
         {
            "name": "spider",
            "id": 3986
         },
         {
            "name": "eagle",
            "id": 5350
         },
         {
            "name": "dragon",
            "id": 12554
         }
      ],
      "imdb_id": "tt0077687",
      "video": false,
      "title": "The Hobbit",
      "recommendations": [
         1361,
         123,
         102188,
         223021,
         231411,
         197481,
         16378,
         197467,
         53219,
         15035,
         85196,
         19975,
         20468,
         27144,
         44528,
         17644,
         59158,
         27074,
         79500,
         53828
      ],
      "backdrop_path": "/fcZDxvCD4Pg7lO2RwHNS0DC1B3m.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Bilbo Baggins",
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd3b",
               "name": "Orson Bean",
               "profile_path": "/mFClcHz7Tn9iaT0qkuGYXxcszeV.jpg",
               "id": 863,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Smaug",
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd3f",
               "name": "Richard Boone",
               "profile_path": "/kmNMYGDIxSPwgfXTrwXMawhyj29.jpg",
               "id": 16420,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Thorin",
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd43",
               "name": "Hans Conried",
               "profile_path": "/7JnEMvdZEoA1uumb0HG2qKFh6ZP.jpg",
               "id": 16421,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Gandalf the Grey",
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd47",
               "name": "John Huston",
               "profile_path": "/1YV2m0943zGmgQaHHgtFuQhOEKl.jpg",
               "id": 6593,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Elvenking",
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd4b",
               "name": "Otto Preminger",
               "profile_path": "/t9eetEzRgKAanGRDCSEF9h3KyTW.jpg",
               "id": 834,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Elrond",
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd4f",
               "name": "Cyril Ritchard",
               "profile_path": "/4hFgt3BrViXVILR6v4hWmm8JD9V.jpg",
               "id": 7393,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Gollum",
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd53",
               "name": "Brother Theodore",
               "profile_path": "/2OLcOFM5vzJuINo8zDKWiFCRkgH.jpg",
               "id": 16413,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Bombur/Troll #1",
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd57",
               "name": "Paul Frees",
               "profile_path": "/ey4xNbw7AfFW7brHnb3C9ADL34Q.jpg",
               "id": 16417,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Balin/Troll #3/Goblin/Lord of the Eagles",
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd5b",
               "name": "Don Messick",
               "profile_path": "/2JfSTw3cqnsbpcW4ShaNTa4cWH9.jpg",
               "id": 16422,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Dori/Great Goblin/Bard",
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd5f",
               "name": "John Stephenson",
               "profile_path": "/5atzhAYw83cax7bEgN22YGoEgu1.jpg",
               "id": 15869,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd0d",
               "name": "Jules Bass",
               "profile_path": "/6QU9zlGh3BA4DN4h4bNv5ZfLo6e.jpg",
               "id": 16410,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd13",
               "name": "Arthur Rankin, Jr.",
               "profile_path": "/ea8EC04C9VhDd0iMpIyCmZHnMak.jpg",
               "id": 16411,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd19",
               "name": "J.R.R. Tolkien",
               "profile_path": "/z7KBk4TTP1gTXnN01jWNI8FgzkA.jpg",
               "id": 129,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd1f",
               "name": "Jules Bass",
               "profile_path": "/6QU9zlGh3BA4DN4h4bNv5ZfLo6e.jpg",
               "id": 16410,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42eec3a36847f802dd25",
               "name": "Masaki Îzuka",
               "profile_path": null,
               "id": 16414,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd2b",
               "name": "Arthur Rankin, Jr.",
               "profile_path": "/ea8EC04C9VhDd0iMpIyCmZHnMak.jpg",
               "id": 16411,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42eec3a36847f802dd31",
               "name": "Maury Laws",
               "profile_path": null,
               "id": 16415,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42eec3a36847f802dd37",
               "name": "Arthur Rankin, Jr.",
               "profile_path": "/ea8EC04C9VhDd0iMpIyCmZHnMak.jpg",
               "id": 16411,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe42eec3a36847f802dd65",
               "name": "Romeo Muller",
               "profile_path": null,
               "id": 105639,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 4.945072,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1362,
      "vote_count": 96,
      "budget": 3000000,
      "overview": "Bilbo Baggins the Hobbit was just minding his own business, when his occasional visitor Gandalf the Wizard drops in one night. One by one, a whole group of dwarves drop in, and before he knows it, Bilbo has joined their quest to reclaim their kingdom, taken from them by the evil dragon Smaug. The only problem is that Gandalf has told the dwarves that Bilbo is an expert burglar, but he isn't...",
      "similar": [
         57158,
         120,
         49051,
         68735,
         122917,
         121,
         259316,
         12445,
         27022,
         809,
         674,
         767,
         808,
         122,
         10882,
         10719,
         10140,
         284052,
         68728,
         321068
      ],
      "original_title": "The Hobbit",
      "runtime": 77,
      "poster_path": "/xP93GoIe8MI23n5ZQ7aZLTzLE0g.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/65PkdDSyh6fwXgwg47x73pvgWiW.png",
         "name": "Rankin/Bass Productions",
         "id": 688,
         "origin_country": ""
      }],
      "release_date": "1977-11-27",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": "/uUG532EWfyhtKDzsA0sLb1PsHhL.jpg",
         "name": "The Lord of the Rings Animated Collection",
         "id": 141290,
         "poster_path": "/pQuazFOlGRdn2Lb3oWFJYPeASOc.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Jules Bass",
         "Arthur Rankin Jr."
      ],
      "runtime": 77,
      "synopsis": null,
      "writers": [
         "J.R.R. Tolkien",
         "Romeo Muller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0077687/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0ODY3NTkwOF5BMl5BanBnXkFtZTcwODU3NzIyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Orson Bean, John Huston, Brother Theodore | See full cast and crew »"],
      "reviews": [
         "I must say that I actually remember this movie with fondness. I've read comments that slam the film for either technical faults or the fact that it has left out a number of things. All these things are true, of course. Though I thought the artwork itself was quite good, the animation could use some work. Certainly things were left out. Come on people! Certainly the film is no ten, but it is a decent version, given the fact that to fit the book into a film at all some liberties will be taken. Especially when it seems apparent that the film is aimed at children. If you can't unwind a bit and just sit back and watch the film without always pointing out every little omission or alteration, then this film will disappoint. But if you can, then give this film a chance.",
         "It seems that everyone who gives this movie a low rating comments on the same problems, poor animation, poor adaption from the book, etc. However it seems to me that they are forgetting three very important things: 1. This movie was made for TV, so it had a lower budget than it would have in Hollywood, 2. It was made in 1977, so it has a lower quality animation than we are now used to now, and 3. It is a children's movie, they had to make it child friendly. I remember spending a whole summer of my childhood watching this movie over and over again, nearly wearing out the tape. I have since read the book and still love and own the movie. In fact, to this day every time the subject of LOTR comes up I start humming \"the greatest adventure...\".",
         "First - it's a wonderful introduction to full scale Fantasy, for anyone. But, for small children it's truly a gift. This is the Gateway for reading that most parents would die for. Children that watch this cry for more because it's usually the first thing in their lives that is not so dumbed down that they realize they've been had. Second - for all those that love a quality story, this is the Grand-daddy of them all for modern times. Sure the story is told from a more artistic viewpoint than the Book is, but that just adds to the enjoyment. * read the Book. Third - Since the current (wonderful) movies are coming out, this provides a foundation that makes them even more enjoyable. Finally - Even in this animated version, one can tell why J.R.R. Tolkien is celebrated as one of the finest writers of the 20th century. These books provided the foundation of nearly all quality Fantasy/Sc-Fi books and movies for the last 75 years and will continue to inspire writers and moviemakers for a long long time to come.",
         "I saw the Rankin/Bass 'Hobbit' for the first time when I was about eight or nine years old. I was enchanted by the movie, and I credit it with motivating me to read 'The Hobbit' and later 'The Lord of the Rings', thereby transforming me into a lifelong Tolkien fan (albeit not as die-hard as some, I admit). This is probably the highest praise I can give it. I re-viewed the movie recently. How does it stand up now that I am older and better-versed in Tolkien? So-so, I would say. Some comments/criticisms, in no particular order: * The movie, I now realize, was seriously hampered by time constraints. The creators attempted to squeeze a very eventful novel's story into a two-hour TV movie, with commercials. The result is that everything seems very hurried, events are piled on top of each other with great speed and moments that ought to be savored get rushed. Also, the periodic fade-outs/fade-ins for commercials are distracting. * A product of its time, the movie is wall-to-wall with songs, most with lyrics written by Tolkien, one written originally for the film, all sung to '70s folk ballad melodies. Tolkien's elves should not sound like hippie chipmunks. * The '70s context also gives the movie a strongly pacifist message. All scenes of fighting are rendered, somewhat awkwardly, so as to avoid any actual blood or carnage (a mortally wounded character will be glimpsed in a freeze frame that will then spin into a blur, mirroring the character's disappearance from this life, I suppose). Speeches about the glory of war are presented so as to make the advocates look ridiculous. None of this is a bad, and is even refreshing, but it is the work of Rankin/Bass, not Tolkien. * Some of the key players are perfect: Orson Bean as Bilbo, John Huston as Gandalf, Richard Boone as Smaug and Theodore as Gollum bring great life and character to the movie. The one-on-one scenes between Bilbo and each of the other three are easily the best part of 'The Hobbit'. Overall, the movie is best suited for the audience for whom it was intended, children. Kids will probably like it, and might even want to explore Tolkien further.",
         "They pulled out all the stops on this one. A glorious ensemble of voices including the legendary John Huston and Otto Preminger gave life to Tolkien's creation while the outstanding folk and fantasy score illuminates the story. You'll see why Frodo was supposed to be an actor in his 50's for the LOTR trilogy (though Peter Jackson's opus was well cast anyway in every position). This will whet your appetite until \"Hobbit\" is a full-length feature in theatres (fingers crossed) and no doubt, Mr. Jackson and his screenwriters will pull visuals and more from this timeless adaptation. The only shame of it is annually, Rankin-Bass's Christmas offerings are still aired while The Hobbit and its sister production of Return Of The King (starring Roddy McDowell as Samwise The Brave!) aren't. Catch that feature too as it picks up where the Ralph Bakshi stab at The Fellowship Of The Rings/Two Towers left off. -Matt Sherman",
         "'The Hobbit' in its animated shape is what we have to go with until Peter Jackson finishes the LotR prequel (hey, it's bound to happen...), but it doesn't mean all one should do is wait for that occasion. Watch the Rankin-Bass classic! Rankin-Bass are behind the huge 80's successes 'Thundercats', 'Silverhawks' etc and also shine here with their interpretation of Tolkien's masterpiece. 'The Hobbit' is in this shape more of a family/children's movie than the new Lord of the Rings movies, and its runtime of only 78 minutes makes it feel a little stressed through since the scenes aren't given much time each. But nevertheless, it features good animation, solid voicework and music that is FAR MORE fantasy-like than the more majestic approach in Peter Jackson's movies. See this movie with your children! Only backdraft I have to say is the runtime. 8/10",
         "When I saw this movie around 1984 it sparked my interest in the Lord of the Rings series. I thought the drawing were outstanding (the thin lines on the characters shows the animators took the time to get details correct). The songs seemed a bit silly, but I thought the directors were trying to reflect the attidude of the book. Although fans of the book might say the movie had an oversimplifed plot, I thought the directors did an excellent job condensing a 200 page story into an adventuorous hour and half movie.",
         "Many Tolkien fans who have written reviews say that this movie has done bad things to the book. They say it oversimplifies it, that it takes out parts that shouldn't've been taken out, that it turns it from a novel for mature readers into a movie for 'kids'. I've read the book, and been watching this movie for many years. I have to disagree that this is a movie just for children-- when I was younger and watched this movie, I did not realize the philosophical lessons present from beginning to end. Bilbo begins his day just like any other day-- he washes his dishes, cleans his hobbit hole, and leaves it to go outside and smoke his pipe. Then, from the suddeness of destiny, his life is changed. He's taken from his quiet home in the Shire, to begin his Greatest Adventure. An adventure that changes him from shy, unsure, afraid, and reluctant, into a confident, wiser, and better man. \"The Chances, the Changes, are all yours to make. The mold of your life is in your hands to break.\" This happens to all of us in our lives. We leave our happy, unknowing-of-danger homes, and are taken through hard times, until finally, we take those steps into the cave, and we face our fears. \"...but to take those last steps. That would be the bravest of all things. Whatever happens afterwards is nothing.\" The songs are beautiful, with tunes that will have you humming at work. The song 'The Greatest Adventure', if you listened to carefully, can tell you much about what you will have to do in your own hard times. This is a beautiful, wonderful movie. Not just the animation and the music, but the lesson it can teach. \"So, Mr. Bilbo Baggins... Do you turn back?\"",
         "It's certainly not what PJ could do with the Hobbit, but it certainly is nice. I think it captures the overall story pretty well. In fact, the only real complaint that I have is that sometimes the artistry lacked. OK, so they made everyone but Bard have fat or thin faces with either beaks, rocks, or boulders for noses. But other than that, it's quite enjoyable. Oh, and I was a little disappointed that they didn't have Beorn. But, I stopped crying after the first ten minutes when I realized they skipped him (ha ha). There are some nice songs in it that kind of help the story along. The Riddles in the Dark part was pretty good too (although, I think they took the description in the Lord of the Rings of Gollum looking like a starved frog a little too far). While it is a children's cartoon, adults can enjoy this too. If you happen to see it on the shelf of a store, pick it up. You might be surprised by what's in it.",
         "This was what introduced me to the Lord of the Rings, back in '77, when I was in 6th grade, it got the kids in my class to reading the trilogy and etc. Personally, I was all up for watching this, in the fall of '77, then the local TV station ran something else(MULLIGANS' STEW?!?) in its place. We were crushed in my family. I DID buy the record/sound track instead and listened to it to Death. Loved it-the voices and artwork both. Didn't actually See this til '85...though had caught parts here and there...my thinking then and now is the same--Rankin-Bass did a fine job with it. Yes its done by Japanese animators, and No it isn't outta Allen Lee or whomever else' kind of drawing. But they stuck some interesting spins on what elves, dwarves, Wizards, Dragons and Hobbits look like, along with trolls and whatever, personally I found it to be interesting. And how can you knock the voices-I mean-John Huston? Hans Conried, Cyril Ritchard, Theodore Bikel, Richard Boone, Don Messick, Orson Bean-and last but not least-Otto Preminger. Some legends here guys, esp. Otto and JHuston. I loved it! Rankin-Bass did make it more for kids, definately, and took some cuts here and there-Beorn and the Arkenstone bye-bye, for example, and no one is claiming the animation is up to, say, 'Aladdin' standards, but on its own, it works fine. *** outta ****, pretty good, actually. And Where is Leonard Maltin's review? somehow he missed this one..."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": [
         "ABC Video Enterprises",
         "Rankin/Bass Productions",
         "Topcraft"
      ],
      "summaries": [
         "Bilbo Baggins the Hobbit was just minding his own business, when his occasional visitor Gandalf the Wizard drops in one evening . One by one, a whole group of dwarves drop in, and before he knows it, Bilbo has joined their quest to reclaim their kingdom, taken from them by an evil dragon named Smaug. The only problem is that Gandalf has told the dwarves that Bilbo is an expert burglar, but he isn't....",
         "A homebody hobbit in Middle Earth gets talked into joining a quest with a group of dwarves to recover their treasure from a dragon."
      ],
      "budget": 3000000
   },
   "movielensId": 26403,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1977-11-27",
      "dvdReleaseDate": "2001-09-11",
      "directors": [
         "Jules Bass",
         "Arthur Rankin",
         " Jr."
      ],
      "runtime": 77,
      "movieId": 26403,
      "title": "The Hobbit",
      "mpaa": "NR",
      "actors": [
         "Orson Bean",
         "Richard Boone",
         "Hans Conried",
         "John Huston",
         "Otto Preminger",
         "Cyril Ritchard",
         "Brother Theodore",
         "Paul Frees",
         "Don Messick",
         "John Stephenson"
      ],
      "imdbMovieId": "0077687",
      "originalTitle": "The Hobbit",
      "genres": [
         "Family",
         "Fantasy",
         "Animation",
         "Adventure"
      ],
      "youtubeTrailerIds": ["o4YJfc_7zNk"],
      "plotSummary": "Bilbo Baggins the Hobbit was just minding his own business, when his occasional visitor Gandalf the Wizard drops in one night. One by one, a whole group of dwarves drop in, and before he knows it, Bilbo has joined their quest to reclaim their kingdom, taken from them by the evil dragon Smaug. The only problem is that Gandalf has told the dwarves that Bilbo is an expert burglar, but he isn't...",
      "tmdbMovieId": 1362,
      "avgRating": 3.36585,
      "releaseYear": "1977",
      "numRatings": 369,
      "posterPath": "/xP93GoIe8MI23n5ZQ7aZLTzLE0g.jpg"
   }
}