{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "canada",
            "id": 1329
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "school",
            "id": 10873
         },
         {
            "name": "miniseries",
            "id": 11162
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "orphan",
            "id": 13014
         },
         {
            "name": "historical",
            "id": 15126
         },
         {
            "name": "kids",
            "id": 161155
         },
         {
            "name": "redhead girl",
            "id": 214484
         }
      ],
      "imdb_id": "tt0088727",
      "video": false,
      "title": "Anne of Green Gables",
      "recommendations": [
         40724,
         103886,
         98986,
         430762,
         120506,
         170578,
         170623,
         104638,
         107673,
         116696,
         212136,
         143529,
         132994,
         423179,
         194238,
         115360,
         79359,
         103130,
         102344,
         235443
      ],
      "backdrop_path": "/9qUvWPRou0KnsUfMxsEOpm8uzDv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Anne Shirley",
               "gender": 1,
               "credit_id": "52fe473d9251416c7509265d",
               "name": "Megan Follows",
               "profile_path": "/dlKpppqXcGgqcwMQ4ljFQYnm7CN.jpg",
               "id": 45446,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Marilla Cuthbert",
               "gender": 1,
               "credit_id": "52fe473d9251416c75092661",
               "name": "Colleen Dewhurst",
               "profile_path": "/44nikIUvc84f1OZboSCQqZQZ6V.jpg",
               "id": 10559,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Matthew Cuthbert",
               "gender": 2,
               "credit_id": "52fe473d9251416c75092665",
               "name": "Richard Farnsworth",
               "profile_path": "/dS8N3GEDzrr0rrCQo6Q3ZyNdX8b.jpg",
               "id": 5605,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Gilbert Blythe",
               "gender": 2,
               "credit_id": "52fe473d9251416c75092675",
               "name": "Jonathan Crombie",
               "profile_path": "/nIbYlyH5rYgBZ3XRUnZLAk6tKwR.jpg",
               "id": 93646,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Rachel Lynde",
               "gender": 1,
               "credit_id": "52fe473d9251416c75092669",
               "name": "Patricia Hamilton",
               "profile_path": null,
               "id": 93643,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Miss Muriel Stacy",
               "gender": 1,
               "credit_id": "52fe473d9251416c7509266d",
               "name": "Marilyn Lightstone",
               "profile_path": null,
               "id": 93644,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Diana Barry",
               "gender": 0,
               "credit_id": "52fe473d9251416c75092671",
               "name": "Schuyler Grant",
               "profile_path": null,
               "id": 93645,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Aunt Josephine",
               "gender": 1,
               "credit_id": "52fe473d9251416c75092679",
               "name": "Charmion King",
               "profile_path": null,
               "id": 79400,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe473d9251416c7509267f",
            "name": "Kevin Sullivan",
            "profile_path": null,
            "id": 134306,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 10.153777,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         }
      ],
      "id": 17663,
      "vote_count": 89,
      "budget": 0,
      "overview": "At the turn of the century on Prince Edward Island, Matthew Cuthbert and his sister Marilla decide to take on an orphan boy as help for their farm. But they get an unexpected jolt when they're mistakenly sent a girl instead: Anne Shirley. Anne's a dreamer with an unusual point of view, far removed from Marilla's pragmatic ways, and it's only on trial that Marilla agrees to keep Anne.",
      "similar": [
         11224,
         17612,
         23168,
         34584,
         4476,
         8392,
         2454,
         411,
         13,
         73,
         20352,
         4347,
         278927,
         595,
         10545,
         22971,
         51828,
         177572,
         228205,
         342473
      ],
      "original_title": "Anne of Green Gables",
      "runtime": 199,
      "poster_path": "/rw12vUIMVXqUbqYDmKamUCI4CVs.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Sullivan Entertainment",
         "id": 12296,
         "origin_country": ""
      }],
      "release_date": "1985-12-01",
      "vote_average": 8.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.anneofgreengables.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 199,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0088727/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDI4MjA2MzUxOV5BMl5BanBnXkFtZTcwNjE0MjE2MQ@@._V1._CR53,69,306,401_SY317_CR14,0,214,317_AL_.jpg",
      "actors": ["Stars: Megan Follows, Colleen Dewhurst, Richard Farnsworth | See full cast and crew »"],
      "reviews": [
         "Every time I watch Anne of Green Gables, I am transported out of my living room in California in 1999 and into the beautiful colorful time of 1908 and Avonlea, PEI. It is such a simple yet beautiful story. As a person who usually prefers movies nothing at all like this, I am shamelessly admitting that I adore everything about these stories from L.M. Montgomery. And even if they had put in a special order, they never could have found anyone more suitable to play Anne than Megan Follows. No matter what else I see her in, she's Anne Shirley, and she will always be the only Anne Shirley. If I'm stressed or upset, I have only to go to Anne's world. It's like an inexpensive vacation!!! : )",
         "This film is absolutely gem (sequel included). The direction, acting, script and cinematography is spot on. I feel that the casting director should get a special mention as I don't believe you can find a better cast to play out the characters in the book. I feel this is where it mainly succeeded where other versions have failed. Megan Follows is Anne in every way. Excellent performances from Coleen Dewhurst and Richard Farnsworth help bring the story to life as well. A film translation from a book is never better than the book itself. I think this film and it's sequel are an exception.",
         "When I read these books as a child.. I would read an installment and then watch the installment on television. I have been in love with the stories ever since. The characters are truly the embodiment of L.M. Montgomery's written word. She would be proud. I grew up wanting Gilbert Blythe to be in love with me and for Diana Barry to be my best friend. I think that this series was and is excellent. If you like this one, make sure to watch the sequel. It is a little more romantic and a little less adventurous, but aren't we all when we grow up??",
         "For those of us who have loved L.M. Montgomery's books as both children and adults every depiction of them is very closely scrutinised. This Kevin Sullivan production is the only one that has come up to scratch, which isn't surprising as earlier attempts have failed abysmally (one even had Diana played by an insipid blonde!).But with faithful scripting, inspired casting, excellent direction and beautiful camera work, there is simply nothing negative to be said about this show. Sullivan sticks very closely to the original book and all the characters, from the central ones right down to those we hardly ever see, such as silly Ruby Gillis and spiteful Josie Pye, are superbly and sensitively observed by the actors portraying them. I have read and re-read many favourite books but never before have I found myself imagining the characters as the actors who played them on screen - especially having read the books at least twice over before seeing any production of them. The highest complement I can pay to the cast of Sullivan's \"Anne of Green Gables\" is that any previous images I might have had of these much loved characters were wiped out of mind by their wonderful depictions of them. Richard Farnsworth, Colleen Dewhurst, Schuyler Grant, Jonathan Crombie and Patricia Hamilton were all brilliant. As for Megan Follows - well, what can I say? She is a truly wonderful actress (not only on the strength of this performance) and no one could ever match her portrayal of Anne Shirley. One last thing - if there are any fans of \"The Kids in the Hall\" reading this watch out for Bruce McCulloch as Fred Wright... you'll fall out of your chair! (And Dave Foley has a cameo in the sequel).",
         "This movie is my all time favourite. Still to this day I cry & get emotional during certain scenes & no matter how many times Ive seen this. Megan Follows, Jonathan Crombie, Colleen Dewhurst and Richard Farnsworth did a tremendous job. The story of a little orphan girl who finally is adopted by the right people is great. The scenary is breath taking, what a marvelous place to have been while making this movie. Any one who enjoys a good love/drama watch this. You will be surprised in how much you enjoy it. Dont forget the sequels they are just as great. Especially if you want to know what happens to Anne & Gilbert.....",
         "I was highly impressed with this production when I first saw it over ten years ago. The cinematography is very intimate, and does a fine job of showing some very picturesque coastal and rural scenery. The costuming and overall art direction is first class in both this production and it's followup \"Anne of Avonlea.\" The acting is very rich and natural from all the female leads, though somewhat dry from the younger males. There's a touch of melodrama in all their performances, but this aspect reflects accurately I think the behavioral norms for the period. The stories are personal reflections of author Lucy Maud Montgomery, set around Prince Rupert Island, and placed in a 3rd person narrative for her series of books. The books are once again transcribed to screenplay format for this mini series, and though I've never read the books I must say I'm very impressed with the production. The blend of colors, costumes, acting talent and overall direction really make this and its sequel very enjoyable to watch. Sadly the third installment doesn't quite live up to the standards set by the first two mini series, but is still watchable. The SFX were also very convincing (what few there were). I won't spoil the film by pointing them out, but nevertheless they help set the general visual feel of the characters, and better establish their ages. Myself, I'm a guns-n-spaceships movie kind of guy, but I do appreciate a gentle reflection on the more important things in life. In this case the story of the pains and fortunes of growing up. I highly reccomend this to anyone who needs a break from real life or wants a change in pace from the usual Hollywood offerings.",
         "Highly amusing TV miniseries. It's hampered a bit by an unimaginative style and rather flat pace, but the droll performances and witty script make up for any shortcomings. Megan Follows takes a completely straight-faced approach to the occasionally ridiculous Anne, and her decision not to overplay the part keeps her from seeming irritating or unlikable. Colleen Dewhurst is ideally cast as Marilla, turning the character into a perfect balance of hard*ss and softie. Richard Farnsworth shows great charm as Matthew, and manages to find considerable eloquence in this monosyllabic character. The supporting cast is strong, too. The series has a reputation for sentimentality, but viewers who haven't seen it in a few years might be surprised by just how funny it is. It has its emotional moments, of course, and then some, but its consistent dry humor makes them palatable even to the most cynical of viewers. Recommended. 8.5 out of 10.",
         "first saw this when first shown on channel 4 and have loved it since. Have all the videos but ration myself to watching them only every couple of years to keep them special...even so, know all the words!! megan follows is perfect as anne, and gilbert is also perfect. i love the way the writer has caught the essentials of the stories without ruining them. Kind of wish they hadnt attempted the 3rd series tho - the story was so way off the mark of the books and just didnt seem to carry on properly from the first 2. And anne being tempted by another man?! impossible with lovely gilbert around! i read somewhere that megan follows had been in an accident before filmim=ng of the continuing story, which accounts for her looking so much older in that one. is this true?",
         "This movie is such a wonderful piece of art!!! It truly follows all that L. M. Montgomery imagined!!! I definitely recommend its sequels, starring the same cast!! The romance between Anne and Gilbert is enchanting, the scenery is beautiful, Anne and Diana's friendship is overwhelming, and Marilla, Matthew, and Rachel Lynde will all become dear to your heart. If you love the movie, you will love the books!!! I know that I did, and I feel as if Green Gables and all of Anne, Diana, and Gilbert's \"haunts\" (aka Lover's Lane, Dryad's Bubble, the Lake of Shining Waters, the Haunted Wood) are a part of me, as well as Avonlea and everywhere else Anne goes.",
         "ohmigosh! this movie has become a part of my life..i relate to all of anne's characteristics and principles in life..probably the most wonderful movie ever there is..certainly nothing compares with it..i've watched this film when i was about 7 yrs. old..and i am just so crazy about it..it's silly but i felt like i know everyone on the film..this movie is flawless..i love everything in it..the characters..the scenery..oh i wish i could go to prince edward island..i really wish i could..and meet all the cast of the film..the music too is very heartwarming..very touching....i thank God for such a wonderful film..i'd never get bored with it even if i watch it a thousand times..my whole family including my relatives loves it..and my brothers and sisters from the church love it..THE BEST, the MOST WONDERFUL TOUCHING BEAUTIFUL movie of all! sorry just can't help meself..I LOVE THIS FILM!"
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Anne of Green Gables Productions",
         "Sullivan Entertainment",
         "TV-60 Filmproduktion"
      ],
      "summaries": [
         "At the turn of the century on Prince Edward Island, Matthew Cuthbert and his sister Marilla decide to take on an orphan boy as help for their farm. But they get an unexpected jolt when they're mistakenly sent a girl instead: Anne Shirley. Anne's a dreamer with an unusual point of view, far removed from Marilla's pragmatic ways, and it's only on trial that Marilla agrees to keep Anne...if Anne can keep out of trouble, only Anne has a positive genius for it. As Anne falls into a series of scrapes (and off a roof), makes a bosom friend, searches (and finds) several kindred spirits, Matthew and Marilla discover that their lives have become a great deal richer, now that Anne is at Green Gables.",
         "In the early 1900s, elderly Matthew Cuthbert and his spinster sister Marilla Cuthbert live on a farmstead in Avonlea, Prince Edward Island, the house on the property known as Green Gables. To assist with the farm work, they decide to adopt an orphan boy. Through an error, they instead receive a twelve year old orphan girl named Anne Shirley. Anne is outspoken, opinionated and stubborn, but she is also kind, good-hearted and bright. She is extremely self conscious of her looks, especially the fact of her freckles and her red hair. She has a vivid imagination tending toward fantasized romance and tragedy, this a mechanism to escape the harsh life she's endured thus far. Upon meeting Anne, Matthew does not have the heart to send her back. Although the Cuthberts have no practical use for a girl, Matthew talks a begrudging Marilla into keeping Anne, if only on a trial basis. In addition to Marilla, Anne has to win over many of the people of Avonlea, who see an orphan as being nothing but trouble. But in Avonlea, Anne also has many kindred spirits as she calls her dearest friends, including Matthew, classmate Diana Barry, Diana's Aunt Josephine and school teacher Muriel Stacey. Another colleague with whom she has a rocky beginning is classmate Gilbert Blythe, although Gilbert sees Anne in a different light. Through trials and tribulations, Anne does win over those important to her, including Marilla, who ultimately cannot even imagine what life would have been like without Anne. As Anne matures into young womanhood into her late teens, she demonstrates her many talents at Green Gables, at public school and at Queen's College in Charlottetown. When tragedy strikes the Cuthbert family, Gilbert shows Anne how true a kindred spirit he really is.",
         "An orphan girl, sent to an elderly brother and sister by mistake, charms her new home and community with her fiery spirit and imagination."
      ],
      "budget": 0
   },
   "movielensId": 26528,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-12-01",
      "dvdReleaseDate": "2001-11-13",
      "directors": ["Kevin Sullivan"],
      "runtime": 199,
      "movieId": 26528,
      "title": "Anne of Green Gables",
      "mpaa": "PG",
      "actors": [
         "Megan Follows",
         "Colleen Dewhurst",
         "Richard Farnsworth",
         "Patricia Hamilton",
         "Marilyn Lightstone",
         "Schuyler Grant",
         "Jonathan Crombie",
         "Charmion King"
      ],
      "imdbMovieId": "0088727",
      "originalTitle": "Anne of Green Gables",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "At the turn of the century on Prince Edward Island, Matthew Cuthbert and his sister Marilla decide to take on an orphan boy as help for their farm. But they get an unexpected jolt when they're mistakenly sent a girl instead: Anne Shirley. Anne's a dreamer with an unusual point of view, far removed from Marilla's pragmatic ways, and it's only on trial that Marilla agrees to keep Anne.",
      "tmdbMovieId": 17663,
      "avgRating": 3.92929,
      "releaseYear": "1985",
      "numRatings": 693,
      "posterPath": "/rw12vUIMVXqUbqYDmKamUCI4CVs.jpg"
   }
}