{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "louisiana",
            "id": 3134
         },
         {
            "name": "vigilante",
            "id": 7002
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "neo-noir",
            "id": 207268
         }
      ],
      "imdb_id": "tt0091637",
      "video": false,
      "title": "No Mercy",
      "recommendations": [
         19380,
         31618,
         11060,
         10859,
         31633,
         34014,
         2162,
         21666,
         12623,
         15556,
         31608,
         31962,
         55922,
         4823,
         219575,
         29185,
         2612,
         9409,
         31597,
         19345
      ],
      "backdrop_path": "/2BLk25CMNl22IHqVJSAu3nkWoUj.jpg",
      "revenue": 12303904,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Eddie Jillette",
               "gender": 2,
               "credit_id": "52fe4518c3a368484e048577",
               "name": "Richard Gere",
               "profile_path": "/hqMhNyTqIStibnhBh8SjyfpU665.jpg",
               "id": 1205,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Michel Duval",
               "gender": 1,
               "credit_id": "52fe4518c3a368484e04857b",
               "name": "Kim Basinger",
               "profile_path": "/xpv6NgpY0mDr5QSWjZLXy5KlFn9.jpg",
               "id": 326,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Losado",
               "gender": 0,
               "credit_id": "52fe4519c3a368484e04857f",
               "name": "Jeroen Krabbé",
               "profile_path": "/A5Mks6zi6Xzt9A8fxBWc3wdlvhx.jpg",
               "id": 1924,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Stemkowski",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e048583",
               "name": "George Dzundza",
               "profile_path": "/jyjr4P3uCpfrbwk8ySXNaDpBMbc.jpg",
               "id": 10477,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Joe Collins",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e048587",
               "name": "Gary Basaraba",
               "profile_path": "/7CMnYNxHjB9yRDc9MqYL0Q5aJQd.jpg",
               "id": 96228,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Allan Deveneux",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e04858b",
               "name": "William Atherton",
               "profile_path": "/ulUP6CRnC3F6XmD3NH0AMJpVmln.jpg",
               "id": 7676,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Paul Deveneux",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e04858f",
               "name": "Terry Kinney",
               "profile_path": "/hv6CObyItPeEg5eJzzTb4L1j6DP.jpg",
               "id": 11067,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Lieutenant Hall",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e048593",
               "name": "Bruce McGill",
               "profile_path": "/r9UNvqwTYB9C3AcGyBpcjzkCnVD.jpg",
               "id": 14888,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4519c3a368484e048599",
               "name": "Richard Pearce",
               "profile_path": null,
               "id": 73496,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4519c3a368484e04859f",
               "name": "Howard Feuer",
               "profile_path": null,
               "id": 1530,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0485a5",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4519c3a368484e0485ab",
               "name": "James Carabatsos",
               "profile_path": null,
               "id": 62038,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.816912,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26789,
      "vote_count": 48,
      "budget": 0,
      "overview": "An unconventional undercover Chicago cop and his partner are recruited to commit the murder of a New Orleans criminal kingpin.",
      "similar": [
         979,
         15069,
         23587,
         4771,
         357096,
         26390,
         39918,
         74997,
         281957,
         281,
         1266,
         17494,
         429733,
         3134,
         45569,
         10651,
         2149,
         13538,
         479,
         141733
      ],
      "original_title": "No Mercy",
      "runtime": 106,
      "poster_path": "/iQozlPXgadwTvymHWH1mPWzM80a.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1986-12-19",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "When passion and hatred know no limits, expect no mercy.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Pearce"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["James Carabatsos"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091637/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0ODI5ODA0N15BMl5BanBnXkFtZTcwODkwNDkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Richard Gere, Kim Basinger, Jeroen Krabbé | See full cast and crew »"],
      "reviews": [
         "Richard Gere is a Chicago cop on the vengeance trail as he follows his partner's killers to New Orleans to settle his own personal score. The film moves at a brisk pace as Gere and a Cajun sexpot flee through the Louisiana bayous from a murderous crime lord who wants his baby doll back and to destroy the Chicago detective who would avenge his partner's murder. Gere and Kim Basinger go very well together, and the chemistry between them adds to the film's realism. Basinger is the sexy swamp girl type who finds herself falling for Gere, although they clash repeatedly while handcuffed together as they attempt to elude the brutal underworld figure and his henchmen. George Dzundza is also good as Gere's superior and Jeroen Krabbe is measured and deliberate as the Cajun butcher. The film's final moments are explosive and predictable and close out an exciting thriller.",
         "On the surface, this film, which I like, is like dozens of other revenge-the-death-of-a-cop-partner stories. But the saving grace of the movie is the characters, and some of the dialogue. Spoilers in the following Eddie Jilette is a tough cop. A tough Chicago cop. But what distinguishes the film that his Captain is tougher and nastier. In a later scene in the film, the captain and Eddie are in an airport where, in the Men's washroom, after making sure that they're alone, the captain gives Eddie a weapon to kill the villain, and expects him to use it. In most such films, a tough cop usually has a captain who's either a politician or a wimp. How refreshing! The film also has a nice touch. Eddie rents all the rooms of a hotel in Algiers. The only inhabitants were the clerk and a cat. Eddie tells the clerk to beat it, because he's expecting a showdown battle there. Shortly before the battle commences, we see the cat leave the building. One I've watched several times and one that's in my library.",
         "No Mercy is a great movie that offers a lot of action, a great cast of actors and actresses, a very haunting melody as the base music in the soundtrack, and additionally, some really beautiful scenery. All of the actors do a really great job portraying their characters and there is a lot of action and subtle bits that endear the movie watcher to the character played by Kim Basinger. Richard Gere was a very cool \"tough cop\" in this film and he was a real looker needless to say. I have seen this movie more than once and still think it is a really entertaining film. Lots to offer INCLUDING a great soundtrack that has eluded me all these years. I would appreciate any tip that would help me locate one of the \"out of print\" CD's of this soundtrack. I most definitely would pay a reasonable price. thanks!",
         "This is not one of my top 10 films of all times, but it is a solid genre piece with some interesting variations and local color. After Katrina, a film about New Orleans has a special interest that adds a certain sauce. If there are any weaknesses, some of Bassinger's line deliveries are a bit weak. Otherwise, superb acting all around. I have always thought Gere was something of a lightweight, but very solid work here. Unlike many films, they get the weapons handling VERY right. I am a bit confused as to why this film has been rated so low on average. I have the video, and watch it about once a year.",
         "Kim Basinger is young and gorgeous. Richard Gere is, well Richard Gere. He's dapper, sexy semi-nude and the good guy. What else is new? He's a Chicago cop who's partner gets murdered and he thinks Basinger, can lead him to the killer. Beautiful scenes of Louisiana bayou and attention-grabbing chase scenes make this an enjoyable movie for all. And don't forget the love scenes for the women and the fighting and torching of New Orleans for the men. A fun couple of hours.",
         "After receiving a tip from a suspect, Chicago cop Eddie Jillette poses as a hit man, he's to meet with a mysterious guy from New Orleans and from there uncover the plans. But things go awry and Eddie's partner and friend is brutally murdered, a stunningly gorgeous blonde seems to hold the key to it all, so Eddie heads South with revenge and anger driving him on. 80s popcorn thrillers get a hard deal on IMDb, it seems that many people visiting them for the first time post 1990, seem determined to judge them against the likes of multiplex favourites like Bad Boys. The 80s was far from being a great decade for action/drama movies, but there was a ream of tidy pieces that fulfilled the genre requirements for those so inclined. Here in Richard Pearce's No Mercy we have a protagonist hell bent on revenge {Richard Gere, lots of hair but acting with force}, a sultry blonde stirring passions {Kim Bassinger in the same year she turned heads in Nine 1/2 weeks}, and a weasel baddie with a pony tail {Jeroen Krabbé enjoying himself}, throw in swearing before it was a fashionable accessory, explosions aplenty and an ability to have the viewer shouting for our cop to bloody succeed at all costs. Yes there is the obligatory simmering romance under trying circumstances, and yes the ending holds few surprises to anyone who has watched films since 1930, but it's a very credible piece that is certainly more entertaining than some of the dross action pictures that are churned out weekly for the MTV generation these days. 7/10",
         "In 1986, when No Mercy was released, two names that would be near the top of any \"World's Sexiest Man\" and \"World's Sexiest Woman\" lists would have been Richard Gere and Kim Basinger. In getting these two gorgeous people together, the makers of No Mercy then committed the age-old sin - they forgot to provide them with a decent story! Gere plays Chicago cop Eddie Jillette. Whilst on a case, Eddie's partner Joe (Gary Basaraba) is brutally murdered by French gangster Losado (Jereon Krabbe). Jillette heads down to Losado's New Orleans lair to avenge his partner's death. There, he meets gangster's moll Michel (Kim Basinger), a stunning woman desperate to get away from her sadistic lover but too afraid to do so. She and Jillette end up handcuffed together, hiding out in the dangerous Louisiana swampland from Losado and his heavies. Immediately, you can see that No Mercy is riddled with stale plot devices - cop avenging the death of his friend; hero stealing a lover from the villain; usual fish-out-of-water ideas (this time a Chicago cop working in New Orleans); even the swamp sequence has a whiff of The Defiant Ones and The 39 Steps about it. The film is also excessively grim and nasty, with Krabbe in particular struggling to do anything as a one-dimensional, knife-wielding sadist. The action high-spots, including a climactic shootout in a burning hotel, are quite expensive-looking sequences but, like the rest of the film, are oddly uninteresting and unoriginal.",
         "\"No Mercy\" is a film which draws upon two cinematic traditions. The first is the \"tough cop\" thriller which first saw the light of day in the late sixties and early seventies in films like \"Dirty Harry\" and \"The French Connection\" and which was enjoying a new lease of life in the eighties. The hero of this film is Eddie Jillette, a Chicago cop who is investigating Paul Deveneux, the scion of a wealthy New Orleans family who has travelled to Chicago to hire the services of a professional hit man. In an attempt to entrap Deveneux, Jillette and his partner Joe pose as assassins for hire, but something goes wrong. Losado, the man Deveneux wants dead, is aware of his plans, and sends his own team of killers to Chicago. In a shootout, Jillette escapes, but Deveneux and Joe are killed. Jillette heads to New Orleans to investigate, but his presence is welcomed neither by Deveneux's family nor by the local police, and he soon finds himself in danger from Losado, who turns out to be a powerful local crime baron. Jillette's only ally (and she at first a reluctant one) is Michelle, Losado's beautiful mistress. (In the cast list her name is spelled as \"Michel\", but as that is the masculine form of the name this is presumably an error). The other tradition on which the film draws is that of neo-noir, the genre which uses modern cinema techniques in order to produce a contemporary equivalent of the classic films noirs of the forties and fifties. The film contains some of the traditional noir devices, such as the blonde femme fatale, with Kim Basinger playing the part that in the heyday of film noir would have been played by the likes of Lauren Bacall, Lizabeth Scott, Gloria Grahame or Rita Hayworth. (Well, I know Rita wasn't normally a blonde, but she was one in \"Lady from Shanghai\"). As with many films noirs the hero has an idiosyncratic morality based on personal honour; in his pursuit of Losado he is inspired not so much by an abstract belief in law or justice (like many \"tough cops\" he has a \"shoot first, ask questions later\" attitude) but a desire to avenge Joe, who was not only his partner but also a close personal friend. Like most neo-noirs, or at least like most good neo-noirs, \"No Mercy\" manages to find a visual equivalent to the brooding monochrome photography which was a frequent hallmark of the original noirs. As with many films in the genre, much of the action takes place at night, with the darkness acting as a visual symbol for the moral darkness which lies at the heart of the plot. There are some striking scenes of the industrial areas of Chicago, of the Louisiana bayous and of the sleazy, rundown quarters of New Orleans in which Losado operates. Richard Gere makes a stylish hero, but he is perhaps rather too laid back, lacking the sort of intensity that the likes of Mel Gibson, Bruce Willis and Gene Hackman brought to their tough cop heroes. Kim Basinger, however, is excellent; of all her performances that I have seen I would rank this one second only to the one she gave in an even better neo-noir, \"L.A. Confidential\". Kim brings to the role not only her usual sex appeal (in my view she was, together with Michelle Pfeiffer, the loveliest Hollywood star of the eighties) but also some subtle acting. At first she seems, both to the audience and to Jillette, like a hard, brassy femme fatale; Jillette even assumes that she is a hooker. Gradually, however, she softens as her tragic story becomes apparent (she was \"sold\" to Losado as a child) and both we, and Jillette, come to realise that she too is a victim. Like some of the other reviewers here, I am at a loss to understand why this film should have such a low rating on this board any why it should have attracted so many negative comments, with many seeing it as merely a \"hackneyed\" or \"clichéd\" thriller. Yes, it is a thriller, but it is possible to work creatively even within the confines of a formulaic genre, and \"No Mercy\" is in my view one of the better thrillers of the eighties. The action sequences, especially the final shootout in the burning flophouse, are effective enough to satisfy action-movie junkies, but there is more to the film than that. It is well acted, well photographed and well written- in all a superior sort of thriller. 7/10",
         "**SPOILERS** Clash of culture film that goes from Chicago to the swamps bayous and streets of New Orleans with windy city cop Eddie Jillette, Richard Gere, looking to get even for the savage murder of his partner undercover cop Joe Collins, Gary Basaraba, by Cajun gangster Losado, Jeroen Krabbe. At the time Losado was in town to get back his runaway and personal slave girl. Chicago police officers Jillette & Collins getting a tip from a local Chicago pot pusher Angles Ryan, Ray Starkey, that they busted that he was hired to do a hit for somebody from out of town. The two policemen acting as hit men meet later that evening New Orleans businessman Paul Deveneux, Terry Kinney, and his girlfriend Michel Duval, Kim Basinger, at a Chicago restaurant. Deveneux wants the two to take out this very dangerous and brutal New Orleans gangster, Losado, and is willing to pay big money to get the \"Job\" done. Before anything could happen Deveneux is blown to pieces and officer Jillette barley escapes with his life as they were caught in a street ambush by the targeted Losado and his gang. Back at the hotel were police officer Collins is staying Michael Losado and a bunch of his hoods breaks in and catch Collins by surprise. slicing Collins open with a huge hunting knife Losado then takes off with Micheal who he considered to be his private property. Getting to the hotel room too late to save his partner officer Jillette is deeply hurt for not being there in time to prevent Collins from being murdered. Trying to find Collins' killer in the city of New Orleans Jillette finds Michel at the Blue Parrot nightclub. Jillette had a hunch she would be there from the blue parrot tattoo she had on her right shoulder. The movie then goes into overdrive with Jillette on the run with Michel as a hostage as Losado and his gang try to track down and kill him as well as rescue Michel. Jillette on the other hand is on a mission of revenge to find officer Collins murderer and bring him to Justice with him being the sole judge jury and executioner. Getting away from Losado's goons Jillette makes it back to the main New Orleans police station with Michel only to get arrested and then told to check out of the city by the New Orleans police Lt. Hall, Bruce McGill. Determined not to leave without taking care of Lasado Jillette has Michel, who had since fallen in love with him, used as bait to get him out in the open which leads to the movies fiery conclusion in a deserted New Orleans hotel. Average suspense/drama that's helped a lot by the presence of Jeroen Krabbe as the cold-blooded and murderous Cajun gangster Losado. Creepy yet soft spoken who without even the slightest show of emotions Lasado would lash out at his unsuspecting victim with his deadly blade like a coiled rattlesnake. The showdown at the Algires Point Hotel had Lasado and his entire gang shoot and knife it out with an almost suicidal officer Jillette who didn't care if he lived through it or not. With him only wanting to take out the Cajun killer so he could finally feel that his partner didn't die in vain and that his killer didn't live to get away with murdering him.",
         "Released in late 1986, \"No Mercy\" stars Richard Gere as a Chicago cop who travels to New Orleans to track down a blond (Kim Basinger) who is linked to the murderer of his beloved partner. The film features a great love-to-hate villain, Losado, played by Jeroen Krabbé; a notable survival-in-the-swamp sequence wherein Gere & Basinger are handcuffed to each other; and an action-packed showdown in an old city hotel. Actually, I could do without the hotel showdown, as it comes off too cartooney and contrived (like when one of the villains barges right through a wall with his rifle -- Why sure!), but I suppose it can be accepted on the grounds of Western-like artistic license. There's loads of foul language but I found it realistic for these types of individuals in such critical situations. So I didn't mind it too much but my wife took (minor) offense. Gere's still relatively young here (36). I realize many hate him, but I'm a fan of quite a few of his pictures, e.g. \"The Mothman Prophecies\", \"King David\" and \"An Officer and a Gentleman\". Kim Basinger doesn't do much for me personally, although she's certainly pretty and her acting is effective here. I know it's a matter of taste but \"No Mercy\" provides zero 'babe appeal' for me. The film was shot in Chicago and Louisiana (and some parts in NC). The score is moving despite the dated mid-80s electronic drums. FINAL WORD: It's hard to put into words why I like this film to the extent of writing a review. It's nothing exceptional, but it somehow 'works' and gets better with repeat viewings. I bought the DVD a year & a half ago and have watched it three times since, which is something I rarely (if ever) do. I think what attracts me is that it's more than just a mindless cop/action flick, although it has the thrills if that's all you're looking for. \"No Mercy\" has something to say about love, loyalty, courage, justice, freedom and happiness, but it's smart enough to not spell it all out. Hence, not only is the picture enjoyable to watch due to the 'movie magic' but it can also leave you contemplating. The film runs 106 minutes. GRADE: B"
      ],
      "genres": [
         "Action",
         "Crime",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "Delphi IV Productions",
         "Delphi V Productions"
      ],
      "summaries": [
         "Maverick Chicago cop Eddie Jillette poses as a hit man to meet with someone in from New Orleans looking to have a job done. The result is that both the guy and Jillette's partner wind up very dead, while a stunning blonde in on the setup disappears. He heads south to settle the score and soon finds himself being hunted, with the girl in tow and the local police anything but happy. New Orleans may never be the same again.",
         "An unconventional undercover Chicago cop and his partner are recruited to commit the murder of a New Orleans criminal kingpin."
      ],
      "budget": 0
   },
   "movielensId": 2741,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-12-19",
      "dvdReleaseDate": "1998-05-12",
      "directors": ["Richard Pearce"],
      "runtime": 106,
      "movieId": 2741,
      "title": "No Mercy",
      "mpaa": "R",
      "actors": [
         "Richard Gere",
         "Kim Basinger",
         "Jeroen Krabbé",
         "George Dzundza",
         "Gary Basaraba",
         "William Atherton",
         "Terry Kinney",
         "Bruce McGill"
      ],
      "imdbMovieId": "0091637",
      "originalTitle": "No Mercy",
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": ["ehtJo9B98TQ"],
      "plotSummary": "An unconventional undercover Chicago cop and his partner are recruited to commit the murder of a New Orleans criminal kingpin.",
      "tmdbMovieId": 26789,
      "avgRating": 2.85942,
      "releaseYear": "1986",
      "numRatings": 345,
      "posterPath": "/iQozlPXgadwTvymHWH1mPWzM80a.jpg"
   }
}