{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "cyborg",
            "id": 679
         },
         {
            "name": "android",
            "id": 803
         },
         {
            "name": "japanese",
            "id": 907
         },
         {
            "name": "future",
            "id": 2964
         },
         {
            "name": "elite unit",
            "id": 8498
         },
         {
            "name": "futuristic",
            "id": 9685
         },
         {
            "name": "sexual violence",
            "id": 11534
         },
         {
            "name": "cyberpunk",
            "id": 12190
         },
         {
            "name": "hong kong",
            "id": 12354
         }
      ],
      "imdb_id": "tt0347246",
      "video": false,
      "title": "Ghost in the Shell 2: Innocence",
      "recommendations": [
         14092,
         9323,
         18874,
         196750,
         18839,
         9606,
         149,
         4977,
         823,
         11633,
         240341,
         212168,
         279254,
         13981,
         11299,
         33320,
         111224,
         919,
         10494,
         334376
      ],
      "backdrop_path": "/LIbv8rXsi7AuDpBCbyrUy1zv2n.jpg",
      "revenue": 9789651,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Motoko Kusanagi (voice)",
               "gender": 1,
               "credit_id": "52fe44bd9251416c7503f435",
               "name": "Atsuko Tanaka",
               "profile_path": "/tM2mIRVxO7TehX35cpSbDvgEByq.jpg",
               "id": 34923,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Batō (voice)",
               "gender": 2,
               "credit_id": "52fe44bd9251416c7503f425",
               "name": "Akio Ohtsuka",
               "profile_path": "/33uwf6AtjtqckGH6kUfr8GGDqJu.jpg",
               "id": 40451,
               "order": 1
            },
            {
               "cast_id": 18,
               "character": "Togusa (voice)",
               "gender": 2,
               "credit_id": "55df5a9492514179820000d4",
               "name": "Kouichi Yamadera",
               "profile_path": "/m5su8OKD2rZn9XWJfh8aPC403Nz.jpg",
               "id": 20664,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Section 9 Department Chief Aramaki (voice)",
               "gender": 2,
               "credit_id": "58d957af925141448e029234",
               "name": "Tamio Ohki",
               "profile_path": "/yRoaWUblTlU98adYjFUNXr9THzv.jpg",
               "id": 12199,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Ishikawa (voice)",
               "gender": 0,
               "credit_id": "58d95861925141448e02931a",
               "name": "Yutaka Nakano",
               "profile_path": null,
               "id": 83933,
               "order": 4
            },
            {
               "cast_id": 21,
               "character": "Kim (voice)",
               "gender": 2,
               "credit_id": "58d958739251411faa07139d",
               "name": "Naoto Takenaka",
               "profile_path": "/9mAwzOZCWvaqDNOT3a0cIZVByRw.jpg",
               "id": 68704,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "58d958b5925141442f027b41",
               "name": "Gou Aoba",
               "profile_path": null,
               "id": 1247593,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "58d958c9c3a368128907242f",
               "name": "Eisuke Asakura",
               "profile_path": null,
               "id": 1247906,
               "order": 7
            },
            {
               "cast_id": 24,
               "character": "Gynoid/Rescued Girl (English Version, voice)",
               "gender": 1,
               "credit_id": "5aaf579dc3a36836fe01dc2e",
               "name": "Sherry Lynn",
               "profile_path": "/kQDSC2z7sb6S5HcpOH6cmeJokKE.jpg",
               "id": 214701,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44bd9251416c7503f3f1",
               "name": "Mamoru Oshii",
               "profile_path": "/2MXFEwxLu7gT9vvi5Otx4LQgsvZ.jpg",
               "id": 12180,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bd9251416c7503f3f7",
               "name": "Mamoru Oshii",
               "profile_path": "/2MXFEwxLu7gT9vvi5Otx4LQgsvZ.jpg",
               "id": 12180,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bd9251416c7503f3fd",
               "name": "Kenji Kawai",
               "profile_path": "/jIhpBTVJ4JmPFUbTlXROgL6GMCT.jpg",
               "id": 57304,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bd9251416c7503f403",
               "name": "Mitsuhisa Ishikawa",
               "profile_path": null,
               "id": 12183,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bd9251416c7503f409",
               "name": "Toshio Suzuki",
               "profile_path": "/k5YYt3VYjCEGRP4eCPx9bCLNtE4.jpg",
               "id": 1417,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bd9251416c7503f40f",
               "name": "Miki Sakuma",
               "profile_path": null,
               "id": 71429,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bd9251416c7503f415",
               "name": "Sachiko Miki",
               "profile_path": null,
               "id": 71430,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bd9251416c7503f41b",
               "name": "Chihiro Nakano",
               "profile_path": null,
               "id": 71431,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bd9251416c7503f421",
               "name": "Junichi Uematsu",
               "profile_path": null,
               "id": 71432,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55344cf7c3a3682223005fb4",
               "name": "Shin'ya Ôhira",
               "profile_path": null,
               "id": 1456632,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "553451a6c3a36848ca0053ec",
               "name": "Masashi Ando",
               "profile_path": null,
               "id": 40336,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 8.730016,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 12140,
      "vote_count": 290,
      "budget": 0,
      "overview": "Groundbreaking director Mamoru Oshii continues to push the boundaries of art and anime with this universally acclaimed cyber thriller following cyborg detective Batou as he tries to unravel the reasons for a murderous robot revolt in the year 2032. A quest for a killer that becomes a mind bending search for the meaning of life.",
      "similar": [
         9323,
         14092,
         605,
         78,
         604,
         87101,
         335984,
         5548,
         218,
         534,
         296,
         603,
         644,
         17431,
         2048,
         263115,
         262543,
         157336,
         157350,
         281
      ],
      "original_title": "イノセンス",
      "runtime": 100,
      "poster_path": "/1KSMfpMWMzlvR2DN2fzv31vZ66B.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bandai Visual Company",
            "id": 528,
            "origin_country": ""
         },
         {
            "logo_path": "/rwB6w2aPENQbx756pBWSw44Ouk.png",
            "name": "Production I.G",
            "id": 529,
            "origin_country": "JP"
         }
      ],
      "release_date": "2004-03-06",
      "vote_average": 7.3,
      "belongs_to_collection": {
         "backdrop_path": "/xt0E8CHXzLxEoiPqrjZMRrM4Izi.jpg",
         "name": "Ghost in the Shell Collection",
         "id": 23026,
         "poster_path": "/xEQVBrAd1hWtwCeK39RQ84CRqB7.jpg"
      },
      "tagline": "When machines learn to feel, who decides what is human...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mamoru Oshii"],
      "runtime": 100,
      "synopsis": "An insectoid single seat helicopter flies over a high rise city at night. Down below Batou drives his car through a pedestrian filled street and arrives at a crime scene. The cops tell him a perp killed two cops. Batou cocks his shotgun and goes into a dark alley by himself. He finds the dead police and also a female figure sitting quietly. She attacks Batou, but he punches her out easily. She whispers \"Help me\" and reveals herself to be a cyborg. Title sequence showing a stylized birth/genesis of a cyborg form. Section 9 view a briefing describing eight recent killings by the Locus Solus #2052 \"Hadaly\" type gynoids, which then self-destruct. Aramaki explains Section 9 is now involved because there have been no civil lawsuits, a politician and a retired public servant are among the victims and terrorism is a possibility. He tells Batou and Togusa to check out the gynoids while Ishikawa and Azuma check background. In the car Togusa and Batou discuss the missing Major Kusanagi. They drive to the police Forensics lab. They meet a chain-smoking weary cyborg technician, Miss Haraway, who has been examining the alley-way gynoid Batou captured. The gynoids are somehow able to free themselves of moral code #3, not to harm humans. She theorizes on why robots commit suicide. Haraway also explains the gynoids are \"sexaroids\" equipped with otherwise unnecessary organs. Togusa understands why the victim's families have settled out of court. The alley-gynoid brain was wiped clean except for the audio phrase \"help me\". Back in the car the two S9 agents plan to find the manufacturer's inspector when the Section 9 dispatcher reports a \"602\", the victim is the Locus Solus inspector at a boathouse. On scene they find Ishikawa already there. The dead man is Jack Volkerson, age 54 who has been missing for five days. The kitchen sink and bathroom are splattered with blood and bloody knives. Batou finds a 3D photo of a young girl. The three men leave as a Forensics CSI team arrive. Ishikawa drives Batou home, they stop to buy some dog food, Ishikawa suggests dry food is better. Batou gets out of the car and misdirects Ishikawa on where his apartment is. Entering his flat Batou is greeted by a playful large basset hound. Batou carefully cooks a meal for the dog and quietly relaxes with a beer. Section 9 view a forensics report on Volkerson, it indicates he was killed with a hit to the neck and then dismembered and eviscerated. A deformed door knob at the scene suggests someone with an illegal cyber hand \"claw\" was there. Also, a car registered to a local yakuza group \"Kojinkai\" was found nearby. It turns out a gynoid killed the head of the Kojinkai group three days ago. It may be a revenge killing but Aramaki tells Togusa and Batou to continue, the rest go back to regular duties. In a private moment, Aramaki cryptically asks Togusa to keep an eye on Batou's emotional state. In the garage Batou loads heavy weapons into the trunk, Togusa is alarmed and only wants to talk to the yakuza. Arriving at the Kojinkai club with several men lounging about, they demand to see Wakabayashi, the new leader. The gangsters draw weapons but Batou is quicker and starts cutting them down with his own automatic rifle. More yakuza arrive and a wild firefight continues, Batou takes them all out. The two agents explore upstairs and find the leader and the mutant claw cyborg. Batou makes short work of the cyborg, a terrified Wakabayashi claims Locus Solus told them where Volkerson was but he doesn't know what the former leader was doing with the robot company. Later, Aramaki mildly reprimands Batou and Togusa for acting like vigilantes. Togusa drops Batou off at his favourite mini-mart. A short figure warns him of a kill zone and Batou warily scans the other shoppers. A gunfight erupts and Batou is hit several times, his cyber vision starts to fail. Suddenly ishikawa appears with a pistol grip plugged into the back of Batou's neck. Back in the Section 9 lab Batou awakens with a new arm. He had been brain hacked and made to shoot himself. Ishikawa and Togusa arrive with the pet basset. Batou always went to that store because it was the only place that had the special dog food. Batou and Togusa decide to go after Locus Solus in the Northern Frontier. They fly to a strange industrial looking city, tall towers that resemble oil refinery cracking towers and radio antennae. A former special economic zone it is now a crumbling lawless place. The bird-like VTOL craft lands at an old medieval-style cathedral. An elaborate and colourful parade makes it's way down a canal. Batou and Togusa find an old snitch, Lin, and ask him about a man named Kim. Outside a large mansion Batou explains that Kim is a former military electronics expert. They enter the house and into a luxurious foyer. A female doll-like figure has the letters \"aemaeth\" displayed before it. The two S9 men go upstairs to a library. They find a dessicated corpse-like cyborg. Batou realizes the body is a sham and tells Kim to talk, they know each other from the war years earlier. Kim explains that Locus Solus is making the gynoids on a factory ship in international waters. Kim talks rhetorically about dolls and humans. Togusa finds a model of the mansion and looks into a window. He sees himself and Batou as they walk toward the mansion as a replay. Once again they enter as before, the foyer is slightly different, this time the doll has the letters \"maeth\". Kim's body upstairs is now a replica of Togusa. Kim continues to philosophize on men, machines and computers. Suddenly another replay of the two entering the mansion. In the foyer the doll is gone and the letters on the floor are \"2501\". Now the Kim body is a Batou replica. Offshore a battleship starts to shell the mansion, in the wreckage Togusa sees himself as a cyborg. Back to reality, Batou tells Togusa he has been hacked. He also explains the \"maeth\" message is from his \"guardian angel\" warning them. While Kim is a dead end, Batou decides to attack the Locus Solus ship, he rides a robo-whale underwater as Togusa clears security by hacking the system from an escort vessel using what is left of KIm's ebrain. Batou enters the ship. The security system realizes there is an intruder and makes attempts to stop Batou. Togusa and Kim are zapped by a bolt of energy. On the ship the robo-guards go after Batou. One of the gynoids comes to life and starts fighting the guards. Other gynoids attack Batou, he is surrounded. One gynoid descends to fight alongside Batou, after a lull they talk and Batou realizes it is Major Kusanagi, using the body as a remote puppet. The two continue to mow down the attacking gynoids. Kusanagi opens a data terminal and plugs in to hack the shipboard system. She is able to shut it all down just as Batou empties his last ammo clip. Kusanagi directs the ship to move south to Japan waters, it will be evidence against Locus Solus. Exploring further they enter a room where there are large devices. Locus Solus was illegally brainwashing girls supplied by the Kojinkai mob and dubbing the ghosts into the gynoids. Batou hears a faint \"help me\" and rescues a young girl from the dubbing apparatus, she is the same as from the 3D photo at the ea;l. They realize Volkerson had changed the ethics codes so that when the gynoids made trouble someone would notice and eventually come to save the girls. Kusanagi departs the puppet body after telling Batou she'll always be in the 'net. At Togusa's house Batou gets his pet back and notices the daughter's life-like doll.",
      "writers": [
         "Masamune Shirow",
         "Mamoru Oshii"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0347246/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTE5NTgwNzQ2NV5BMl5BanBnXkFtZTYwOTM4MTY3._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Akio Ôtsuka, Atsuko Tanaka, Tamio Ôki | See full cast and crew »"],
      "reviews": [
         "Ghost in the Shell 2: Innocence. I went to this movie worried that it would end up like just about every Peter Framptom Album after Frampton Comes Alive; they were all pitiful albums only because Frampton comes alive did not leave much room for improvement. The original Ghost in The Shell is a classic. It was a good action film that had some deep undertones. Well made to say the least, full of memorable characters. Ghost in the Shell 2 was so different that there could be no comparison. As opposed to an Action film with deep undercurrents, this is a philosophical film that occasionally had some action sequences. The basic plot is very simple: Android created for pleasure killing their owners. Cyborg cops trying to get to the bottom of these strange crimes. The cops, section nine operatives Batou and Togusa spend more time quoting everything from Bazooka Joe to Milton as long as it serves a purpose. This is not Ghost in the Shell. This is a Mamorou Oshii original, with his own ideas and philosophies not being bound by the original manga. I venture to say that I actually prefer Innocence to the first one, because it struck chords in me the first one did not. Somebody who has a different outlook on everything, however, would disagree. If you have seen the first one, remember how there is more or less a quest for humanity? THis one takes an opposite spin on things. As well as takes a look at how humans feel this need to immortalize their own image. The animation was enough to prove that traditional and computer animation could work together and create a beautiful picture. However, the underwater and in air scenes seemed to rely too heavily on the computers, which then completely made up the world. The world itself was not the world I remember from Ghost in the Shell. THis was a whole new futuristic world as opposed to a slightly more advanced modern setting. This film also focused a lot on the relationship between Batou and the now 'missing' Kusanagi. This film seemed to be lost on many. There are many scenes of complete silence, which are intended as 'breathing time' and and other points really to build tension. The film also slows down at a few points so that the audience can absorb the scenery, and gives extra time for the audience to catch the symbolism. The film ended with so many angry groans. It would seen that the film was lost upon those who wanted to see a sequel to Ghost in the Shell with the same themes and ideas. The only similarity to the first film would be that most of the story is superficial, and what the film is really about is the deeper meanings. This was an excellent film, and though it can be seen as superior, it will never be as well known and recognized as the first film. Though this is not just a sequel: This is a whole new Ghost in the Shell altogether. **** out of ****",
         "Ghost in the Shell 2: Innocence. I went to this movie worried that it would end up like just about every Peter Framptom Album after Frampton Comes Alive; they were all pitiful albums only because Frampton comes alive did not leave much room for improvement. The original Ghost in The Shell is a classic. It was a good action film that had some deep undertones. Well made to say the least, full of memorable characters. Ghost in the Shell 2 was so different that there could be no comparison. As opposed to an Action film with deep undercurrents, this is a philosophical film that occasionally had some action sequences. The basic plot is very simple: Android created for pleasure killing their owners. Cyborg cops trying to get to the bottom of these strange crimes. The cops, section nine operatives Batou and Togusa spend more time quoting everything from Bazooka Joe to Milton as long as it serves a purpose. This is not Ghost in the Shell. This is a Mamorou Oshii original, with his own ideas and philosophies not being bound by the original manga. I venture to say that I actually prefer Innocence to the first one, because it struck chords in me the first one did not. Somebody who has a different outlook on everything, however, would disagree. If you have seen the first one, remember how there is more or less a quest for humanity? THis one takes an opposite spin on things. As well as takes a look at how humans feel this need to immortalize their own image. The animation was enough to prove that traditional and computer animation could work together and create a beautiful picture. However, the underwater and in air scenes seemed to rely too heavily on the computers, which then completely made up the world. The world itself was not the world I remember from Ghost in the Shell. THis was a whole new futuristic world as opposed to a slightly more advanced modern setting. This film also focused a lot on the relationship between Batou and the now 'missing' Kusanagi. This film seemed to be lost on many. There are many scenes of complete silence, which are intended as 'breathing time' and and other points really to build tension. The film also slows down at a few points so that the audience can absorb the scenery, and gives extra time for the audience to catch the symbolism. The film ended with so many angry groans. It would seen that the film was lost upon those who wanted to see a sequel to Ghost in the Shell with the same themes and ideas. The only similarity to the first film would be that most of the story is superficial, and what the film is really about is the deeper meanings. This was an excellent film, and though it can be seen as superior, it will never be as well known and recognized as the first film. Though this is not just a sequel: This is a whole new Ghost in the Shell altogether. **** out of ****",
         "I agree with an earlier reviewer that both hardcore Oshii fans and narrow-minded American viewers are missing the point by not viewing this movie on its own terms. In many ways, it's more thoroughly conceived, and less action-justified (more thoughtful) than Ghost in the Shell. For me, it progressed naturally from its predecessor: Where Ghost in the Shell asks questions about the nature of human individuality, Innocence asks the next set of questions, about human existence. And it asks them in ways so much more directly pertinent to our own lives than utterly fantastic treatments like the Matrix films and silly diversions like The Butterfly Effect. The ideas of the story are genuinely original, and thoroughly conceived. I don't think I've ever seen a science fiction film that was as true to the real spirit of the genre as this pair; Japan in general seems to take science fiction much more seriously than any western film-culture, and so out of Japan we get real, serious attempts to tell science-fictional stories, filled with real ideas and real characters, instead of the Bat-Durstonized monstrosities we get in the west. For me, the integration of 2D and 3D elements was jarring; but the story stands on its ideas and the strength of its plot.",
         "On the same page, this movie is called both \"Intellectually Weak,\" and \"In love with its own intelligence\" by different IMDb users. Clearly, that alone makes this film worth your time and worth forming your own opinion about. The thing is, this is not a stupid film by any means. 'Visually stunning,' it is constantly called, but it's not just that: It's an assault on the senses (in a good way), both visually and aurally. The sound is incredible, the images stick with you. Even a simple, seemingly underthought image like the final two shots of the movie will stick with you long after the closing credits roll. But how is the story? I haven't seen the original in years, but this one held my attention, and kept my brain engaged. I remember not liking the first one when I first saw it (too many scenes of nothing moving, while we listened to voice-over), but I give this one an enthusiastic thumbs up, plus a wink and a smile. It FEELS like the middle chapter in a story... there is too much left unresolved, and while seeing the first one isn't necessary to understanding this one, there ARE many references the original \"Ghost in the Shell.\" It's not so much a continuation of the story, as it is a continuation of the characters. Which I think is the better call. Constant quotes from literature is not a sign of intellectual weakness, I don't think. People accuse the movie of not having a brain of its own, but I think any movie that engages the brain of its audience needn't make apologies. This one remains interesting on all levels; I just hope it doesn't take them another nine years to produce part three. 10/10",
         "A new Japanese cyberpunk masterpiece that makes the original GiTS look primitive by comparison. Mamoru Oshii and his crew did a masterful job creating a worthy successor to their 1995 adaptation of Masamune Shirow's original manga. As in the original movie \u0096 as well as in that other quintessential proto-cyberpunk movie, Blade Runner \u0096 the movie explores human nature in a world that is becoming more technological all the time, to a point where people ARE technology, the boundaries are rapidly fading away. What does it mean to be human? If we join with technology, would we become something else? Should we welcome it, or fear it? Will humanity lose or gain from the changes? After the events of the first movie, Major Motoko Kusanagi has seemingly disappeared; focus of the second movie has shifted to Bateau, who is still working for the secret government \"Section 9\". This is by no means a bad thing, since Bateau is at least as interesting a character as Kusanagi ever was. Going beyond your basic cyberpunk cyborg tough guy with attitude, he is very intelligent, and has some nice human touches (like the dog he loves taking care of). At various points he and other characters routinely indulge in philosophical debate, often quoting literature, from Milton to biblical psalm verses. Just to say this isn't your typical sci-fi action movie, although there is some action, and when it comes, it's fast, brutal & violent. The actual plot involves an incident with a sophisticated robotic \"pleasure model\", if you will, gone berserk. The investigation leads us through the darker parts of near-future Japanese society, including yakuza, companies with questionable ethics, and mysterious hackers. Visually, the movie is stunningly beautiful, using a combination of traditional cell animation and state of the art CGI. Many of the movie's backgrounds are gorgeous to just look at; even dark and dirty back alleys are shown so rich in color and detail, you could gaze at them all day. Like in the first movie, Oshii lets the movie halt at times, immersing the viewer in the richly detailed world he created. Many of the computer screen readouts resemble those seen in Oshii's \"Avalon\" a lot \u0096 which again is not a bad thing, as they look both high-tech and yet elegant & artistic. Last but not least, the music by Kenji Kawai is hauntingly beautiful, adding more layers to the sophisticated richness of it all. I cannot recommend this movie highly enough. Anyone who likes science fiction, anyone who was blown away by movies such as Blade Runner and of course the first \"Ghost in the Shell\" (which you should see before watching this one) will enjoy this.",
         "The first thing that must be said about this film, is that the visuals and imagery are breathtaking. Yet it does not rely solely on our awe. The plot, although very complicated and often convoluted, is rich and laden with allegories, philosophy, analysis and even theology. At first glance, the characters appear to be static and somewhat stoic, but when one thinks about it, the characters are that way to represent the similarities we share with \"dolls.\" Does an effigy infused with meaning and symbol constitute as a being on it's own accord? Or are we simply defined by the mere fact that we are alive? The film is laden with imagery suggesting the war/hybridization of: nature vs. machines/synthetic life, how machines mimic nature, how tradition becomes assimilated by it, and how reality may or may not be a virtual construct based on our own perspective. This is an intellectual, symbolic film that not only gives eye-candy galore, but also delivers more cerebral fare than most films. Although the characters are ultimately forgettable (save the expressive dog owned by Bateau,) one can perceive that too as being a tool to suggest that ultimately, we are all drones living our predictable lives...perhaps unaware of more intricate powers and forces surrounding us. Whether you watch this film for the state-of-the-art visuals or the perceivably potent content, I recommend this film enthusiastically for anyone who would like to think...or just say \"ah\" at the incredible scenery.",
         "I just got through watching this film and it amazed me. I agree with the previous post that Innocence is full of philosophy, Descartes is even mentioned by name, and this is by no means a negative. Constant rhetorical statements within the film make you think which is very refreshing. Nothing whatsoever to do with the first film, which i am a fan of, but isn't improvement a good thing? Who wants to see a rewritten film anyway? Look elsewhere for films like that, I'm thinking Cruel intentions 1, 2 & 3 etc etc etc I might even like this more than 'Akira', but ill see if i manage to watch Innocence another 14 times and still love it... I would highly recommend this film to anyone, not just Anime/Manga fans.",
         "On the surface this is the story of an investigation of sex bots that kill, in reality this is an examination of what it means to be alive and to experience the world. Its a head trip. I'm finding it hard to express what I feel about this film. Visually this film pushes animation and visual story telling to new places. I know that some of the look of this film can be found in video games but never has the current state of art on many levels been brought together to rattle, nay destroy, the cage of the status quo. Much of this film had my jaw hanging open, often with tears welling up at the beauty of the imagery. This film rocks and then some. The computer generated worlds of Immortel and Sky Captain are blown away by the magic worked here. The plot is too murky. Frankly, I was lost half way into the movie as to what the plot was, however I was seriously getting off on the visuals and most of all the ideas that were being batted about. How do we know whats real and what isn't? This film makes it very clear that we can never know, nor can we know what it is to be alive. Certainly not all of it works but enough does, and all I can say is wow. I have no idea how to adequately rate this film. I'm sure some people will find it form over substance and others will think little of the visuals. Me they rocked my world and I gave it a 9 out of 10, but I'll add that your mileage may vary.",
         "The artwork in this is simply gorgeous. It is without a doubt one of the most visually engaging animes ever created. From start to finish the animation is pure excellence. The story focuses around a murder investigation. It quickly gets very strange and hard to follow as many animes seem to do. However, if you don't try to over analyze it, it is really just a cool sci-fi detective story. Some of the characters are continued from the first movie which is rewarding to those who have seen it, but won't confuse everyone else. This is a beautiful anime that will be enjoyed by both long time anime fans, and even first time viewers.",
         "Possible spoilers within, although I wouldn't worry too much about it. I will be the first to admit that the original Ghost in the Shell (GITS) is one of my favorite movies and so I was not exactly a hard sell on this film. That being said, GITS2 (or Innocence) is both a fine sequel and film in its own right. Thankfully, no real extensive knowledge is required to view Innocence. I enjoyed Bateau as a supporting player in the first movie and felt he made a fine protagonist here. Although it will help to have seen the first GITS, for those new to the franchise I think there is some real pleasure to be had in the development of Bateau as his own man, as opposed to a mere sidekick (totally bad-ass though he may have been). The sidekick this time around is Togusa, a mostly human ex-detective handpicked for Section 9 by the now missing Major Motoko Kusanagi. A nice touch is the addition of the traditional Oshii Beagle (the dog) as a real character, not just an enigmatic set piece. Actually, I think the dog is the single most realistic depiction of an animal I've ever seen in animation, Japanese or otherwise. Funny and cute, too. If you liked the visuals in GITS, Innocence should blow you away. The traditional animation is smooth and detailed, while the CGI is absolutely stunning. The colors are wonderful, ranging from a washed out sepia coloring in some aerial shots to dark but rich tones in several night scenes to amazingly vibrant and bright colors in a fantastic parade scene. The music has also been improved. Kenji Kawai reworks much of it to produce an evolved score that is reminiscent of GITS's slow, lyrical one, but original enough to be extremely engaging. For example, the vocal and string piece that is the signature song of GITS has been changed around and now has an energetic Japanese drum element that greatly picks up the tempo and really brings it to life. Another new component that Innocence adds is some humor (however oblique it may be) that was mostly missing in GITS. Some of the interaction between the Section 9 members is quite amusing, as in later on in the movie when, after Togusa has rattled off one too many quotes, Bateau tells him he can barely understand their conversation, with all the obscure references and all. It is Bateau's dog, however, that is responsible for much of this humor. Most of it is visual, but it's reactions and interactions with Bateau are so real as to be almost absurd. I wish I could be clearer, but it really has to be seen to be believed. The action in Innocence is also great, with fantastic pacing and cinematography. The martial arts look convincing and the blows really seem to have weight and power behind them. The gunfights, while few and far in between, are fast paced and actually quite inventive in how they play out. I don't want to ruin any surprises, so you'll have to check it out for yourself. In a very nice touch, the sound effects over all were well done. Blows sound solid and painful, as opposed to the wimpy \"swish\u0085paft\" style of the Matrix, and guns are as loud and imposing as in real life. I also want to touch on several criticisms of the film. The most relevant being that Innocence is mostly a rehash of other Oshii films. I think this is relatively valid, as the movie closely resembles the TV series, virtually steals several scenes from Oshii's live action Avalon and has a plot very similar to that of GITS. On the other hand, Oshii, like many other great directors (Kurosawa, Spielburg, Kubrick, etc.), has themes and devices that often appear in his work and should only interfere with viewing enjoyment if you get hung up on them. I mean, does Miyazaki get knocked for almost always having a flying scene in his wonderful movies? Of course not. The other decent criticism is that the story is too hard to follow and filled with too much philosophy. To a certain extent this is true and both Oshii and Shirow, whose manga forms the bases for GITS and Innocence, have a long history of using complex, almost Byzantine plots mixed with philosophical musings. What is also common in both creators work is the accompanying struggle by the characters to deal with these maddening situations, which is where I think Innocence shines. Bateau is a person so heavily modified (which provides, I think, the best hidden weapon scene in any movie since Robocop) that he doesn't even bother having his cybernetic eyes resemble the real McCoy, a decidedly creepy and unique characteristic. As with Kusanagi in GITS, there is the distinct possibility that he too has lost his humanity, if he was ever human at all and not simply a robot with a false memory. Is it any wonder such a person is given to reading and reference philosophy discussing the meaning of identity? Togusa, on the other hand, has only some brain modification and remains mostly biologically human. This makes him so completely outclassed by his partner and many of the enemies they face that he seems more of a burden in many situations that an asset. His fear for himself and his family, as he makes increasingly powerful enemies, is utterly realistic and understandable, as is his concern that he can never live up to the standards set by Kusanagi. Yes, Innocence is flawed but if you go with an open mind, wanting to be entertained rather than enlightened, I think there is enough to please almost any viewer. One of my personal favorites, but please find out for yourself."
      ],
      "genres": [
         "Animation",
         "Drama",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Bandai Visual Company",
         "Buena Vista Home Entertainment",
         "DENTSU Music And Entertainment"
      ],
      "summaries": [
         "Batô is a living cyborg. His whole body, even his arms and legs, are entirely man-made. What only remains are traces of his brain and the memories of a woman. In an era when the boundary between humans and machines has become infinitely vague, Humans have forgotten that they are humans. This is the debauchery of the lonesome ghost of a man, who nevertheless seeks to retain humanity. Innocence... Is what life is.",
         "In the year 2032, Batô, a cyborg detective for the anti-terrorist unit Public Security Section 9, investigates the case of a female robot--one created solely for sexual pleasure--who slaughtered her owner."
      ],
      "budget": 0
   },
   "movielensId": 27728,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2004-03-06",
      "dvdReleaseDate": "2004-12-28",
      "directors": ["Mamoru Oshii"],
      "runtime": 100,
      "movieId": 27728,
      "title": "Ghost in the Shell 2: Innocence",
      "mpaa": "PG-13",
      "actors": [
         "Atsuko Tanaka",
         "Akio Ohtsuka",
         "Kouichi Yamadera",
         "Tamio Ohki",
         "Yutaka Nakano",
         "Naoto Takenaka",
         "Gou Aoba",
         "Eisuke Asakura"
      ],
      "imdbMovieId": "0347246",
      "originalTitle": "イノセンス",
      "genres": [
         "Animation",
         "Drama",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["fPCpcB2RjiM"],
      "plotSummary": "Groundbreaking director Mamoru Oshii continues to push the boundaries of art and anime with this universally acclaimed cyber thriller following cyborg detective Batou as he tries to unravel the reasons for a murderous robot revolt in the year 2032. A quest for a killer that becomes a mind bending search for the meaning of life.",
      "tmdbMovieId": 12140,
      "avgRating": 3.78685,
      "releaseYear": "2004",
      "numRatings": 1703,
      "posterPath": "/1KSMfpMWMzlvR2DN2fzv31vZ66B.jpg"
   }
}