{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "journalism",
            "id": 917
         },
         {
            "name": "media",
            "id": 6007
         },
         {
            "name": "bias",
            "id": 6324
         },
         {
            "name": "fox news",
            "id": 11999
         },
         {
            "name": "tv news",
            "id": 158584
         },
         {
            "name": "media manipulation",
            "id": 162339
         },
         {
            "name": "expose",
            "id": 162340
         }
      ],
      "imdb_id": "tt0418038",
      "video": false,
      "title": "Outfoxed: Rupert Murdoch's War on Journalism",
      "recommendations": [
         240634,
         45664,
         36523,
         47360,
         21769,
         30798,
         37049,
         40454,
         60823,
         82465,
         7234,
         41972,
         25953,
         89904,
         96340,
         38716,
         37608,
         82259,
         26753,
         18031
      ],
      "backdrop_path": "/vJf9bjbWMJe8u9FwAwQA06wzRoL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Herself (archive footage)",
               "gender": 1,
               "credit_id": "52fe45609251416c750545f7",
               "name": "Christiane Amanpour",
               "profile_path": "/zJGVUg4vDWmEpQFlLMWJjWwvCVe.jpg",
               "id": 73641,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe45609251416c750545fb",
               "name": "George W. Bush",
               "profile_path": "/8X7iJym7kDUBMFxsk6RPhWpFz3q.jpg",
               "id": 19011,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe45609251416c750545ff",
               "name": "George Carlin",
               "profile_path": "/xmSn6p5QVn66UK2ueEJisrUR5Bg.jpg",
               "id": 15903,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe45609251416c75054603",
               "name": "Tom Brokaw",
               "profile_path": "/m1Hhuadcq0NO3hvvM70QjEYK46X.jpg",
               "id": 533174,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe45609251416c75054607",
               "name": "Harry Belafonte",
               "profile_path": "/fSSsExSbBbkr6ZV5uwTMZqZyDwh.jpg",
               "id": 33162,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe45609251416c7505460b",
               "name": "Neil Cavuto",
               "profile_path": "/5g8JrMrWj3XXKxkxweEIAKacbG1.jpg",
               "id": 279287,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe45609251416c7505460f",
               "name": "Al Franken",
               "profile_path": "/ynVu5T7vxiGkpHtXF6UAxTyna4S.jpg",
               "id": 65348,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Himself (archive footage)",
               "gender": 0,
               "credit_id": "52fe45609251416c75054613",
               "name": "Bill O'Reilly",
               "profile_path": "/pX6ft9MEU683jTv4RlMZTnx3tsJ.jpg",
               "id": 95777,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Himself (archive footage)",
               "gender": 2,
               "credit_id": "52fe45619251416c75054617",
               "name": "Jon Stewart",
               "profile_path": "/88UHrwCXTPOrrsG2A33G4fMvN62.jpg",
               "id": 12219,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 0,
               "credit_id": "561efbc492514171c700138e",
               "name": "Richard Clarke",
               "profile_path": null,
               "id": 1522580,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45609251416c750545ed",
               "name": "Robert Greenwald",
               "profile_path": "/rj5ViWRRIDccVsr0DZ41aDHbHeC.jpg",
               "id": 51521,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45609251416c750545f3",
               "name": "Robert Greenwald",
               "profile_path": "/rj5ViWRRIDccVsr0DZ41aDHbHeC.jpg",
               "id": 51521,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 2.16148,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13372,
      "vote_count": 26,
      "budget": 0,
      "overview": "This film examines how media empires, led by Rupert Murdoch's Fox News, have been running a \"race to the bottom\" in television news, and provides an in-depth look at Fox News and the dangerous impact on society when a broad swath of media is controlled by one person.  Media experts, including Jeff Cohen (FAIR) Bob McChesney (Free Press), Chellie Pingree (Common Cause), Jeff Chester (Center for Digital Democracy) and David Brock (Media Matters) provide context and guidance for the story of Fox News and its effect on society.  This documentary also reveals the secrets of Former Fox news producers, reporters, bookers and writers who expose what it's like to work for Fox News.  These former Fox employees talk about how they were forced to push a \"right-wing\" point of view or risk their jobs. Some have even chosen to remain anonymous in order to protect their current livelihoods. As one employee said \"There's no sense of integrity as far as having a line that can't be crossed.\"",
      "similar": [
         8699,
         242582,
         109443,
         29444,
         36947,
         358761,
         315974,
         514982,
         449742,
         502517,
         423125,
         348437,
         361642,
         427757,
         392578,
         137811,
         344503,
         424036
      ],
      "original_title": "Outfoxed: Rupert Murdoch's War on Journalism",
      "runtime": 74,
      "poster_path": "/pf909w5e4nmIL3QysbvX0RFWGno.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2004-07-14",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.outfoxed.org/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Greenwald"],
      "runtime": 75,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0418038/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEyMzI1NDIxMl5BMl5BanBnXkFtZTcwNTg5NDYyMQ@@._V1_SY317_CR18,0,214,317_AL_.jpg",
      "actors": ["Stars: Douglas Cheek, Walter Cronkite, Roger Ailes | See full cast and crew »"],
      "reviews": [
         "This documentary confirmed my worst suspicions about Fox \"News\". As a European in the US I was shocked to watch biased, unresearched vitriol spew out of a channel which then sanctimoniously called itself a news channel. The documentary shows employee after employee confirm what most in the industry already know. Interference with news content, selection and misrepresentation of news content, presentation of opinion as news content. Murdoch makes Citizen Kane look like a saint. Unfortunately, this is not a movie, it is for real. It is not much of a democracy when one man (Rupert Murdoch) can decide the presidency of the United States. (And he not even a US native).",
         "Liberal filmmaker Robert Greenwald's \"Outfoxed\" provides a fascinating insight into the Fox News Channel, which, those who watch it regularly with an open mind realize, really is an extension of the propagandist arm of the Republican Party. If you believe that Fox News Channel is actually fair and balanced, then you probably also believe the moon is made of cheese, the war in Iraq actually was crucial to the war on terrorism and that \"a compassionate conservative\" runs the nation. FNC seems to believe that advocating and promoting rabid nationalism is the news media's responsibility and to that end it spouts the Republican Party and this administration's talking points. There's FNC host Bill O'Reilly damning as un-American anyone who disagrees with the war after it began because, apparently, one cannot voice opposition to the war and support our troops at the same time. And there's FNC cutting off dissenting opinions, fear-mongering (paranoia is patriotic, after all) and exploiting the American flag to make the most blatant of propagandists blush. FNC's motto should be, \"We propagandize because you shouldn't decide.\" Through hundreds of hours of research, Greenwald assembled a good array of clips to prove his point that Fox is anything but fair and balanced. We see Neil Cavuto, anchor of FNC's business show, telling a guest, \"assuming the unthinkable happens and that Senator (John) Kerry becomes president...,\" and reporter Carl Cameron telling then-Gov. George W. Bush about how much Cameron's wife enjoys working for the Bush presidential campaign in 2000. Cameron then proceeds to interview Bush for a \"news\" story. That's fair and balanced at Fox. Cameron now covers the Kerry campaign and is the reporter who recently, soon after the first presidential debate in Florida, poked fun of Kerry in a story with fake quotes; the story then wound up on the Fox News Channel's Web site as a legitimate news article. Imagine the furor from conservatives and FNC had this happened about Bush at, say, at CNN or NBC. We see O'Reilly completely distorting the views of one guest - the son of a Port Authority worker who was killed on 9/11 - because the young man disagreed with the Bush administration. O'Reilly seems obsessed by this guest, even berating him on air months later. Too bad Greenwald didn't include the clip of O'Reilly promising to apologize if the US found no WMD in Iraq. \"Outfoxed\" has flaws. Greenwald doesn't interview anyone from FNC - would they have agreed? - or FNC supporters. We do see FNC owner Rupert Murdoch telling Congress his channel employs liberals, but can only name two. Even without thinking about it, I can name more prominent conservatives at CNN, which Republicans accuse of being liberal, though it clearly puts more conservatives on its shows than Fox does liberals. Greenwald also doesn't differentiate between op-ed talking-heads, such as Cal Thomas, and so-called news anchors, such as Brit Hume. Then again, the line between opinion and news is blurred on FNC. One effective montage shows how FNC anchors use variations of \"some people say\" to spout their own opinion as news. Greenwald uses surveys showing how Hume's evening news show airs, by a 5 to 1 margin, more negative than positive stories on Kerry. If you watch Hume regularly, you will realize how slanted his show is. Liberal commentators and former Fox News employees and consultants opine on how unbalanced FNC's coverage is. There's former CIA analyst Larry Johnson, a contracted Fox News contributor, who, despite having 8 weeks left on his contract, isn't called back after telling Sean Hannity the war in Iraq would divert attention from the real war on terrorism, an opinion Hannity disagreed with. But the most damning evidence against FNC: Internal memos from John Moody, senior VP for news, that show how slanted the coverage is, how FNC promotes the Bush administration and conservative agenda and how a lopsided view of patriotism trumps real news at Fox. In one memo, Moody urges staff not to make the 9/11 Commission report into another Watergate. \"This is not 'what did he know and when did he know it' stuff. Remember the fleeting sense of national unity that emerged from this tragedy. Let's not desecrate that,\" Moody wrote. In another, he orders reporters to tout Bush's \"political courage and tactical cunning\" throughout the day. While on Sen. Kerry, Moody urges his staff to concentrate on the \"flip-flops\" and that Kerry's \"perceived disrespect for the military could be more damaging to the candidate than questions about his actions in uniform.\" What's frightening is how blindly FNC's viewers buy into the propaganda, especially when Greenwald points to surveys that show 67 percent of FNC viewers believe there's a link between Saddam Hussein and the 9/11 attacks. It's almost as if they're...dumb dittoheads. It would be nice if more people got their news from varied sources - newspapers, magazines and TV from around the world - instead of relying solely on a news channel that reiterates their beliefs. \"Outfoxed\" proves that just because FNC says it's fair and balanced doesn't mean it is. Just as saying you're a compassionate conservative doesn't make you one, or saying you're constantly pursuing the truth doesn't make it so, even if you have talent on loan from OxyContin.",
         "Well if you go on the vote history you can tell who is a Fox fan or not -- almost all votes are 10 or 1. My vote was 8 -- the only one. That's what this work deserves because although it is very good it has flaws. One problem with this movie is that it is based on the ringing message (paraphrased): For democracy to work you have to have a media that does its job based on journalistic principles and ethics. Thing is, fans of Fox News could not care less about any of that. They want \"their side\" to win win win and to them Fox News is the ONLY outlet that made it possible to hear the \"truth\" over the tyranny of the \"liberal media.\" They also what professional-wrestling style drama where the bad guy (Kerry, Kennedy, Clinton etc) is built up into some sort of super-monster (that is also cowardly and cheats all the time) which makes the victory all that much more sweeter. So Fox delivers. Outfoxed shows how it works -- but the story is just as much \"what went RIGHT at Fox News\" as opposed to \"what went WRONG with TV journalism.\" It is very satisfying to see documented what many of us have already known -- how Republican/White House talking points become injected into the zeitgeist with almost no resistance. From Fox to CNN to MSNBC, then from there into talk radio and mainstream media. When you hear a keyword like \"flip flopper\" repeated by a dozen different anchors/pundits in 1-second shots strung together it is really impressive. Outfoxed is part of the backlash to Fox News and right-wing dominance of media. It will be interesting to see how far right-wingers will go to \"debunk\" this \"propaganda.\" In any case it should be required viewing for all media consumers and most particularly all journalism and political science students. We'd be better off for it.",
         "When I was at university, it was the left-wing politicians who spun the best propaganda. They wore cooler clothes, had better slogans and made up bright snappy posters satirising 1950s domesticity (in itself a form of propaganda). But if 1967 film The Battle of Algiers is a training manual for terrorists, consider Outfoxed, the new documentary about Rupert Murdoch's Fox News cable channel, a how to for right-wing misinformation. Rupert Murdoch is up-front about his goals for Fox \u0096 America's most watched cable network \u0096 to promote conservative values. Outfoxed: Rupert Murdoch's War on Journalism demonstrates just how fundamentally this distorts the truth, misinforms the public and compromises the integrity of any journalist employed by Fox news. Government surveys show that of all news consumers, Fox viewers had the most inaccurate perceptions of the truth \u0096 for example one-third of them believed that weapons of mass destruction were found in Iraq. Fox's slogans include \"Fox News \u0096 Fair and Balanced\" and \"We Report \u0096 You Decide\". Does the second one remind you of anything? That's right, the ABC's CNNNN, who more accurately transformed the slogan into \"We Report \u0096 You Believe\". I never realised that CNNNN's Firth Factor had a real-life counterpart, Fox's The O'Reilly Factor, and was nauseated by Bill O'Reilly. He's the most biased and aggressive shock jock I could envisage, who disrespects the truth and annihilates any guest who dares disagree with him. In comparison, Jeff Kennett in his heyday was as innocuous as a little fluffy kitten. In the US, most Fox viewers wouldn't even understand that CNNNN is a comedy. Outfoxed is an argumentative essay rather than an impartial examination of the truth, but considering the propaganda machine it's taking on, how could it be otherwise? What's so impressive about this film is its pace. In a rapid-fire 77 minutes, filmmaker Robert Greenwald interviews dozens of former Fox employees, media analysts, and intersperses it with Fox footage to prove his points. Not only is the film jaw dropping, but it's as entertaining and shocking as anything the Fox behemoth could pump out. It made me cry. *****/***** stars.",
         "Outfoxed does an excellent job of diagnosing why people talk so much about the Fox News network. For while Fox has some of the highest ratings of any of the news networks, it is also commonly criticized for its not so \"fair and balanced\" programming. It is chronicled in this film how Fox succeeds in bringing in the viewers the same way that best-selling polemics and political talk radio do, they serve up to their audience heroes and villains. This method is so effective because the major issues facing this country and the world are generally very complicated, and require a reasonable amount of background information in order to make a sober judgments. However, most people have neither the time, nor the inclination for anything like that. Most do not follow politics to learn, to be challenged, or to take action, they simply want to feed their outrage. If their anger about the world around them can be explained away by blaming the people they already have ideological differences with, well that's just awesome. So, they often take refuge in the consistent, simplified, outrage-inducing commentary of their oh-so familiar talking heads. This, to me is the essence of Fox News. From its on-air discussion groups, to its choice of stories, as well as its evening talk shows, it is all about spoon-feeding people with stories of heroic conservatives, fighting to strengthen America against its enemies, both foreign (terrorists) and domestic (liberals). The film demonstrates how Fox news achieves this through a steady feed of news reporting that is highly regulated, intentionally biased, and aligned around a predetermined ideological slant. As far as I'm concerned, to explain the behavior of FoxNews by saying that it is simply \"standing up for the conservative perspective in a sea of mainstream media liberalism\" as many conservatives do, is highly misleading. I believe one can rightfully stand up for any perspective they want, just so long as they aren't forced to resort to dishonest, intentionally biased reporting in order to make or bolster their case. In Outfoxed, director Robert Greenwald makes a very compelling case that Fox News, in the interests of carving out that niche for itself, does that far more than the other news networks. However, since it is exposing the methods of a successful conservative organization, the conservatives who hear of Outfoxed will most likely write it off as nothing more than liberal propaganda. That to me is the ultimate problem with the polarized American political scene. Just about anyone who would be interested in the subject matter of this film as politically oriented as it is, has probably already made up their mind about Fox News one way or the other.",
         "I remember the first time I was confronted with Fox News, and their \"news\" content. At the time I was studying media in England and had read quite a bit about Rupert Murdoch's impact on global media, and how he was believed to have been boasting Thatcher and Thatcherism in the UK tabloid press when she was prime minister. As well as part of my studies we had been covering the subject of objectivity in news, and how this in actual fact is an impossibility considering that any process of selection will result in some degree of subjectivity. This does not necessarily mean the news journalists will be lying to promote their own opinions, but the process of selecting what to put emphasis on will easily result in supporting one ideology over another. As coming media journalists we were made aware of the subjectivity involved in everything down to the selection of which images to show and which not to when in the editing suites. Credible news journalists will necessarily have to be their own watchdogs, and be aware of his/her own perspective and thereby able to stop him/herself if portraying something inaccurately to boast the impact of the news story. The first time I had a look at Fox News was soon after the 9/11 attacks. The terrible events of this day was very much featured in all the world media, and I was following the coverage from various media institutions studying the way they all approached the subject. It was very interesting to see how every channel reported the news in a slightly different way depending on the supposed ideology of the target audience. I even found variations according to time of day and day of the week. Naturally I was curious how the American media was covering this as well. When confronted with Bill O'Reilly for the first time, I was simply wondering if this would be the last day of work for this guy, as he was throwing all of the responsibility one has as a news broadcaster out the window. Within only an hour of watching Fox News I had numerous notes on big \"no no's\" being performed right in front of me. If there was only one glitch, I would have been less shocked, being confident that the person responsible would be called into the producer's office for a serious talk. However, the charade just continued on and on, and I was shaking my head in despair wondering if ANYONE would actually take this as news. None on this network seemed to even attempt not to blurt out subjective comments, and covering all aspects of the conflicts seemed to be something none of these \"journalists\" was even considering. Even though all news I had been following had variations, Fox News stood out as the absolute extreme by far. I guess most of Europe and especially those who have gone into the subject studying media, has known about this for quite some time already. Therefore I believe Outfoxed is a very important film for America, shedding light on some very questionable developments in the commercial media over there. This is a documentary, which means it's arguing a point opposed to what news media is supposed to do. It builds on facts that have been apparent for years, so the argument put forwards does have a strong root in reality, however harsh the critique might be perceived. One does almost get a feeling this is too bad to be true when watching Outfoxed, but as any media knower will point out \u0096 American media and also Hollywood (producing films like Rambo) has for a long time been questioned in terms of attempting to lead their audience's opinion and obscure the perception of reality. I believe watching documentaries like Outfoxed results in big sighs of relief around the world, as it finally seems also America is realizing and focusing on these issues. Thumbs up to those who dared to make this documentary, and a pat on the back to those who has watched it and realizing the seriousness of the issues raised.",
         "As with FARENHEIT 9/11 (2004), I will split this review up into two parts. One, the technical part, and two, the political part. The movie itself is well made, even though the first 20 minutes or so have a bit of sloppy editing. Too fast clips make the text a bit hard to read. The interviews are often cut, which can be seen as a \"shift\" in the interviewees position, but this is not always clear. Usually, when making such editings, you make a white flash to indicate that you have omitted some words from this interview. Particulary in this movie this is very important, since the whole issue here is FOX's use of the words \"fair and balanced\". This documentary however isn't fair and isn't balanced, but then again, no documentary is. The moviemakers doesn't use, or even pretend, to say that this documentary is \"fair and balanced\", so they might get away with it, but I still believe they should make these things a bit clearer to the viewer. Second, I must say that the length of the film (approx 1 hour and 20 minutes or so) is perfect. It is not too long and not too short. The moviemakers get their point through and in a very good way. Where other filmmakers usually spend too much film on themselves, these guys let the FOX's material speak for itself. And does it work? Oh yes! This film is so hilarious sometimes that one can only wonder if ANYONE with an IQ over 80 can take this O'Reilly guy seriously. He is a total jerk and treats everyone like trash, and most of what he says himself is either \"shut up\" or some lies. The fun part is the way this material is edited, since we can actually tell for ourselves that O'Reilly IS lieing. I had the most fun with the O'Reilly parts, but he is quite a character to make fun of too. Not much is needed, you just have to watch him and hear him and you begin to laugh. I haven't watched FOX \"News\" so I was stunned over the fact that they have someone that is so ridiculus on the air. O'Reilly is so embarrasing that if I was related to him in any way I would change my name. The other part of this review, the political part: Obviously this movie is made and released in good time before the 2004 election. And it is quite obvious that the makers of this film doesn't like Bush, and that they like Kerry. With that said, I believe this film will hold better after the election than, say, FARENHEIT 9/11 will. This film will still be important after the election, and I think that is this movies strongest point. It is quite clear that the techniques used by Murdoch in his FOX \"News\" channel is in many ways the same techniques Joseph Goebbels used when he was working for Hitler back in the 1930's and 1940's. Similarities like censorship, bashing of political sides they don't like, use of symbols, use of fear. I am not saying here that Murdoch or anyone associated with FOX are Nazis - I just say they use the same techniques to get their propaganda through. And it is propaganda. Watching the FOX \"News\" material is quite shocking, especially the parts which deals with hard subjects like 9/11 and the Iraqi war. Not counting O'Reilly here (because no one can take that guy seriously anyway), the rest of the FOX \"News\" staff seems to give quite a good impression. This is where it gets dangerous, since they are literary saying the same things that O'Reilly does, but with a calm and intelligent voice that can't be ignored. Murdoch and the Italian PM Berlusconi has also some interesting similarities. Even though Murdoch can't create his own laws, he seems to have a strong link to the US Government (especially if there is a Republican as President) which kind of grants him this power anyway. That is, of course, not free press. And if the FOX \"News\" channel just said that they were Republican or Conservative or that they said that \"we support Bush - not Kerry\", then there would be nothing wrong with this, or at least very little. But when FOX uses the words \"Fair and balanced\" and even have this as a logotype used in their shows and on their website with the impression that it is a registered trademark (!) - THEN it is something really wrong. That is actually a lie, and when a news network lies about something, what parts of what they say is true? Obviously this is FOX' view. Intelligent people can, as FOX say, \"decide\" for themselves. And last time I was in the USA I only met intelligent people, so I wonder... Does anyone really take FOX seriously? I give this documentary 8 of 10. It is interesting, fun and will still be an important film after the election. It is not perfectly edited and have some other issues, but overall, it is a good film that I hope many people watch, even if you don't agree with the point of view.",
         "'Outfoxed', directed by Robert Greenwald is a documentary examining the institution known as the Fox News Channel, a cable news network that is as fierce in its conservative agenda as it is about denying said agenda. Greenwald dissects the channel and disproves their credo 'Fair and Balanced' with interviews by former Fox News employees, media watchdog groups, anonymous sources and plenty of Fox's own footage. Through these various sources, Greenwald aims to prove that the obvious conservative slant that poses as 'fair and balanced' is the king of the mountain on a dangerous slippery-slope. In 'Outfoxed', Greenwald more than backs up his assertion, and is able to do it with an obviously low budget. (You have to love the Power Point-esque captions and scene breaks) But the most compelling aspects of the documentary are the interviews and footage itself. Because of the near-dictatorship status of its owner, Rupert Murdoch, there is an obvious sense of danger surrounding the former employees who appear on camera; because it is clear that their current jobs could be in danger just for speaking out about the proceedings at the channel. This fear is most exemplified by the three former employees who not only refuse to talk on camera, but won't talk unless their voices are obscured as well. Probably the best coup was getting veteran journalist Walter Conkrite to speak out on the subject, because even his brief time on the screen lends a definite air of respectability and trueness to the subject. Of course, the footage is amazing, particularly the pieces on Bill O'Reilly. Not having seen Fox News (I chose to ignore it in the past) I knew he was a blowhard by reputation only, but watching the way he treats his guests was enough to make my blood boil. The film 'Outfoxed' was made with the help of various grass-roots organizations; one of them being MoveOn.org, and the last ten minutes of the film examines what the average outraged viewer can do to take action against this kind of dirty journalism. Without seeing the film, one could construe this as an unnecessary addition, or a 'bleeding heart liberal' moment, but once one looks at the ramifications of the actions of the network, particularly in this fairly precarious political climate we exist in today, I very firmly feel that the call to action was not only warranted but necessary. I watched the film twice in one afternoon because, after being completely outraged the first time, I had to take it and show it to my boyfriend a couple of hours later. While there were times I was so aghast at the lies and dirty journalism I laughed, the truth is that this subject is anything but funny, and 'Outfoxed' is a good, (and short) documentary that should be watched, particularly by Fox News Channel viewers. 7/10. Shelly",
         "This is a scathing dismantling of Fox News. It is in effect a total obliteration of any notion that the station is fair and balanced. It is a simple and systematic explanation of how Fox works and why they report what they do. My politics are decidedly all over the place. I am neither wholly liberal nor wholly conservative, it all depends on the subject. I do regularly watch Fox because I do like some of their reporting. However after seeing this I'm left to question everything that they do on every level. Fair and unbiased indeed. The film is light years better than the earlier \"Uncovered\" about the Iraq War. I would say that its a perfect position paper against Fox News except for the final ten minutes or so where the film shifts focus and asks the viewer to become active in changing how news is reported. Its a valid track to take, but it somehow takes away from the films central point of Fox's biased reporting. 9 out of 10.",
         "The documentary, although flawed (which republican is going to actually view it with an open mind...?), has some major points and the annihilation of \"journalism\" as it is known elsewhere is made obviously. What comes out as obvious is the fact that, as a person puts it, this form of control is even more vicious than authoritarian governments: leaving the people \"free\" of believing that they are indeed free and well informed is a machiavelic way of control. What is sad is that it works so well. Watch it, just so as to make sure you never watch Fox (ever or ever again)."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Carolina Productions",
         "MoveOn.Org"
      ],
      "summaries": ["Documentary on reported Conservative bias of the Rupert Murdoch-owned Fox News Channel (FNC), which promotes itself as \"Fair and Balanced\". Material includes interviews with former FNC employees and the inter-office memos they provided."],
      "budget": 200000
   },
   "movielensId": 27912,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-07-14",
      "dvdReleaseDate": "2004-07-13",
      "directors": ["Robert Greenwald"],
      "runtime": 74,
      "movieId": 27912,
      "title": "Outfoxed: Rupert Murdoch's War on Journalism",
      "mpaa": "NR",
      "actors": [
         "Christiane Amanpour",
         "George W. Bush",
         "George Carlin",
         "Tom Brokaw",
         "Harry Belafonte",
         "Neil Cavuto",
         "Al Franken",
         "Bill O'Reilly",
         "Jon Stewart",
         "Richard Clarke"
      ],
      "imdbMovieId": "0418038",
      "originalTitle": "Outfoxed: Rupert Murdoch's War on Journalism",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["w39FnpuMRfo"],
      "plotSummary": "This film examines how media empires, led by Rupert Murdoch's Fox News, have been running a \"race to the bottom\" in television news, and provides an in-depth look at Fox News and the dangerous impact on society when a broad swath of media is controlled by one person.  Media experts, including Jeff Cohen (FAIR) Bob McChesney (Free Press), Chellie Pingree (Common Cause), Jeff Chester (Center for Digital Democracy) and David Brock (Media Matters) provide context and guidance for the story of Fox News and its effect on society.  This documentary also reveals the secrets of Former Fox news producers, reporters, bookers and writers who expose what it's like to work for Fox News.  These former Fox employees talk about how they were forced to push a \"right-wing\" point of view or risk their jobs. Some have even chosen to remain anonymous in order to protect their current livelihoods. As one employee said \"There's no sense of integrity as far as having a line that can't be crossed.\"",
      "tmdbMovieId": 13372,
      "avgRating": 3.70846,
      "releaseYear": "2004",
      "numRatings": 674,
      "posterPath": "/pf909w5e4nmIL3QysbvX0RFWGno.jpg"
   }
}