{
   "tmdb": {
      "original_language": "sr",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "gypsy",
            "id": 394
         },
         {
            "name": "yugoslavia",
            "id": 449
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "cat",
            "id": 977
         },
         {
            "name": "grandparent grandchild relationship",
            "id": 1158
         },
         {
            "name": "bathing",
            "id": 2069
         },
         {
            "name": "unexpected happiness",
            "id": 2203
         },
         {
            "name": "black market",
            "id": 2449
         },
         {
            "name": "russian",
            "id": 2808
         },
         {
            "name": "bad luck",
            "id": 4671
         },
         {
            "name": "small person",
            "id": 5290
         },
         {
            "name": "superstition",
            "id": 6156
         },
         {
            "name": "gypsy music",
            "id": 7386
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "money",
            "id": 10594
         },
         {
            "name": "debt",
            "id": 11061
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "train",
            "id": 13008
         },
         {
            "name": "wedding",
            "id": 13027
         },
         {
            "name": "youth",
            "id": 14751
         },
         {
            "name": "danube",
            "id": 215205
         },
         {
            "name": "anarchic comedy",
            "id": 236316
         }
      ],
      "imdb_id": "tt0118843",
      "video": false,
      "title": "Black Cat, White Cat",
      "recommendations": [
         11902,
         20123,
         20128,
         8269,
         11044,
         19155,
         190085,
         36161,
         46343,
         121967,
         554,
         19035,
         902,
         49340,
         36265,
         20156,
         63375,
         113,
         18352,
         71592
      ],
      "backdrop_path": "/2ZhystUM6vsnSwIJ3fgdyL2xmCf.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 15,
               "character": "Matko Destanov",
               "gender": 2,
               "credit_id": "52fe42e6c3a36847f802b785",
               "name": "Bajram Severdzhan",
               "profile_path": null,
               "id": 15264,
               "order": 0
            },
            {
               "cast_id": 16,
               "character": "Dadan Karambolo",
               "gender": 2,
               "credit_id": "52fe42e6c3a36847f802b789",
               "name": "Srđan Todorović",
               "profile_path": "/tzv3Zg06mkDY1CnmXo8iMpPY5pe.jpg",
               "id": 15265,
               "order": 1
            },
            {
               "cast_id": 17,
               "character": "Zarije Destanov",
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b78d",
               "name": "Zabit Memedov",
               "profile_path": null,
               "id": 15266,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Zare Destanov",
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b791",
               "name": "Florijan Ajdini",
               "profile_path": null,
               "id": 15267,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Ida",
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b795",
               "name": "Branka Katić",
               "profile_path": "/6dtxxJyeGL5kHpUEeshDfe3T4wB.jpg",
               "id": 15268,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Sujka",
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b799",
               "name": "Ljubica Adzovic",
               "profile_path": null,
               "id": 15269,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Grga Pitic",
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b79d",
               "name": "Sabri Sulejmani",
               "profile_path": null,
               "id": 15270,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Grga Veliki",
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b7a1",
               "name": "Jashar Destani",
               "profile_path": null,
               "id": 15271,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Priest",
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b7a5",
               "name": "Predrag Laković",
               "profile_path": "/iI70w7b5sNa14JMQY9KFfMWo9xh.jpg",
               "id": 15272,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Second Priest",
               "gender": 2,
               "credit_id": "5a7feda6925141410101816a",
               "name": "Miki Manojlović",
               "profile_path": "/mIQ7f8wQ18AAGkrR7qMIsurosDM.jpg",
               "id": 48791,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42e6c3a36847f802b733",
               "name": "Emir Kusturica",
               "profile_path": "/qjpI8i30Kjv9bWphOdWhVW0ldAI.jpg",
               "id": 15254,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe42e6c3a36847f802b739",
               "name": "Emir Kusturica",
               "profile_path": "/qjpI8i30Kjv9bWphOdWhVW0ldAI.jpg",
               "id": 15254,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe42e6c3a36847f802b73f",
               "name": "Gordan Mihić",
               "profile_path": "/74vAj53ZXAcINFBLn227cH2gxaR.jpg",
               "id": 15255,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe42e6c3a36847f802b745",
               "name": "Karl Baumgartner",
               "profile_path": null,
               "id": 1193,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42e6c3a36847f802b751",
               "name": "Maksa Catovic",
               "profile_path": "/yKl8L3Y6JfgFaxuE7RHClbymbFC.jpg",
               "id": 15256,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b757",
               "name": "Marina Girard",
               "profile_path": null,
               "id": 15257,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42e6c3a36847f802b75d",
               "name": "Thierry Arbogast",
               "profile_path": null,
               "id": 997,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b763",
               "name": "Vojislav Aralica",
               "profile_path": null,
               "id": 15258,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b769",
               "name": "Nele Karajlić",
               "profile_path": null,
               "id": 15259,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b76f",
               "name": "Dejan Šparavalo",
               "profile_path": null,
               "id": 15260,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b775",
               "name": "Svetolik Zajc",
               "profile_path": null,
               "id": 15261,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe42e6c3a36847f802b77b",
               "name": "Milenko Jeremić",
               "profile_path": null,
               "id": 15262,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e6c3a36847f802b781",
               "name": "Nebojša Lipanović",
               "profile_path": null,
               "id": 15263,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.342851,
      "production_countries": [
         {
            "iso_3166_1": "RS",
            "name": "Serbia"
         },
         {
            "iso_3166_1": "RO",
            "name": "Romania"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "AT",
            "name": "Austria"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 1075,
      "vote_count": 207,
      "budget": 0,
      "overview": "Matko is a small time hustler, living by the Danube with his 17 year old son Zare. After a failed business deal he owes money to the much more successful gangster Dadan. Dadan has a sister, Afrodita, that he desperately wants to see get married so they strike a deal: Zare is to marry her.",
      "similar": [
         171,
         40807,
         1597,
         810,
         8273,
         88,
         3933,
         118,
         41630,
         55721,
         177572,
         10330,
         433,
         7345,
         8967,
         587,
         244772,
         110415,
         277216,
         10054
      ],
      "original_title": "Crna mačka, beli mačor",
      "runtime": 127,
      "poster_path": "/yofEv6q0vdtErGo49z1vQL7RdWT.jpg",
      "spoken_languages": [{
         "name": "Srpski",
         "iso_639_1": "sr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Ciby 2000",
         "id": 105,
         "origin_country": ""
      }],
      "release_date": "1998-06-01",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Federal Republic of Yugoslavia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Emir Kusturica"],
      "runtime": 127,
      "synopsis": "Grga Pitic and Zarije Destanov are two old friends - and rivals - who haven't seen each other in years. But a series of events beyond their wildest dreams leads to a raucously funny reunion filled with gypsy mobsters, dirty deals and shotgun weddings. After Matko, Grga's low-life son, botches a train robbery and is double-crossed into debt, he is obliged to force his son into an arranged marriage to one of Zarije's kin. As the wedding day approaches - highlighted by the long anticipated reunion between Grga and Zarije - family and friends must cope with betrayals, lust, mishaps, death, farm animals and, ultimately, the pursuit of true love and enduring friendship.",
      "writers": [
         "Emir Kusturica",
         "Gordan Mihic"
      ],
      "originalLanguage": "Romany",
      "imdbLink": "http://www.imdb.com/title/tt0118843/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0OTk0MDQ5Nl5BMl5BanBnXkFtZTcwOTMyMzMzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Bajram Severdzan, Srdjan Todorovic, Branka Katic | See full cast and crew »"],
      "reviews": [
         "This movie, like Underground, is so brilliant, so inventive, so full of ideas & images & imagination & feeling & humanity & humor that beside it american/hollywood movies are like campbell's chicken noodle soup, with too much water, all of them, no exception. Kusturica has to be the greatest living film director & the greatest director in at least 50 years. One would have to go back to Renoir & Rules of the Game to find a film with the energy & brilliance of Black Cat White Cat. Bravo, Kusturica. BRAVO!!!",
         "This is an extremely quirky film, riddled with crazy caricatures of East European mafiosi and small time crooks. It sports some of the most imaginative characters I have ever seen on a screen (a woman who pulls nails with her buttocks?) and some of the most bizarre scenes.And yet the film is beautifully balanced, never falling into outright lunacy or losing the plot. The scenes are at times almost nostalgic, a throwback to some simpler time when you could just have fun, no holds barred. And that is exactly what this film does for me - I have not had as much fun in ages. You will leave the theater with a feel-good factor 10 and thank out loud the people who created this gem. Kusturica is a phenomenon.",
         "Few films just simply fascinate me. As an American Boomer, I am admittedly spoiled and quite jaded, when it comes to movies. This film tantalized me and enthralled me. I felt like a kid at a carnival. The rich cinematography was palpable. The beauty of the chaotic and very non-Pasteurized world of these kooky gypsies and country folk was unexpectedly stunning. And it was so funny! Just plain old funny! The acting was superb. I recognized some favorite character actors from other films I have seen from Yugoslavia. (Look for the Nail Lady). The only glitch for me was an occasional sense that the subtitles could not convey the full impact of the obviously earthy and colloquial dialogue. The film seems to proudly carry on the zany comedy tradition of Europe in the sixties, such as the Pink Panther series and the Czech \"Firemen's Ball\". I regret I did not see this in a theater with the howling audience it deserves.",
         "\"Underground\" may still be the most monumental and brilliant work from Kusturica, yet this movie is just so damn feel-good and enjoyable that the man earns my highest praises yet again. Being a sort of comedic parallel to \"Time of the Gypsies,\" old ways clash with the new in this hilarious comedy about Gypsies living on the bank of Danube river. Gangsters, dirty deals, weddings, eccentric characters, great music (played by the orchestra from \"Underground\"), delicious Eastern European atmosphere - \"Black cat, white cat\" has it all. I love it. Kusturica is a master of his craft. I tink, dis is de begining of a beautiful frendship...",
         "Emir Kusturica's films all pulsate wildly to the wonderful sounds of authentic gypsy music. Guitars, fiddles, accordians and all manor of horns are as much a part of their lives as eating and sleeping. Song and dance feature heavily in \"Black Cat, White Cat,\" Kustruica's finest and most complete film to date. The music isn't really a soundtrack, but is largely, physically written into each scene (performed with gusto by musicians who often follow the characters around). Indeed, the 'bad-guy' character of Dadan scarcely has a scene where he isn't swinging or dancing along to something (even a bizarre pop/rock song makes a comic cameo). But the other characters have their musical moments as well. \"Black Cat, White Cat\" has a large cast and a sprawling storyline, largely resolving around two gangsters - Dadan and the hapless Marko - and their attempts to outwit each other. Things come to a head when Dadan tries to force Marko's son to marry his spinster sister as a repayment for one of his father's debts. But the plot is largely unimportant in a film of this type. The viewer is simply swept away in a good natured deluge of funny lines, inventive slap-stick, unusual settings and colourful supporting characters (a particular favourite: the old man who continually re-watches the last two minutes of \"Casablanca\"). All you need to do is sit back and enjoy. Oh...and listen to the music.",
         "Flawless example of higher quality cinematography schooling, inspiration and resources, Black Cat, White Cat is one of the most comprehensive descriptions of the gypsy communities along the lower Danube aswell as their differences in both nature and character. The Marquez like type of narration illustrated and photographed by the most talented crew and performers, the drama of the perpetual search for true love embodied in a gangster like conflict, spiced with refined humor and raw local language aphorisms brings both life and character to the sequel of the Time Of The Gypsies. Much faster paced, this work of art leaves no time to contemplate but urges the viewer to follow the stream like story line, bringing forward all the aspects of the society of the nomads. Influences from hindu, middle eastern, balkanic and latin cultures are absorbed into the sponge of the gypsy spirituality, one of the last ones to reach fulfillment by just singing and dancing. Bravo Kusturica, another great work of art and thank all gypsies for all their deeds, right or wrong, still beautiful!",
         "A return welcome for Emir Kusturica. His BLACK CAT, WHITE CAT is light entertainment, fun and uplifting. It's great to see all the \"old Gypsies\" back. They haven't aged much in 12 years. Maybe TIME OF THE GYPSIES, the English title of his darker classic on the subject, meant that the gypsies, and Kusturica's in particular, are TIME-less. Vibrant, and colorful, this master director's latest masterpiece turns cliche' into new fresh entertainment.",
         "With the chaos that engulfed the former Yugoslavia in the 1990s, many people probably would have guessed that comedies could never come out of there. \"Crna macka, beli macor\" (called \"Black Cat, White Cat\" in English) would disprove that completely! After hustler Matko Destanov's (Bajram Severdzan) business fails, he agrees with gangster Dadan Karambolo (Srdan Todorovic) to marry his son off to Karambolo's daughter. But the two youngsters aren't quite ready to be married off just yet, and they'll do whatever they have to in order to fulfill their own wishes! \"Black Cat, White Cat\" is mainly interesting because we get to see a culture that we rarely see. Life in the Balkans doesn't look pretty, but this movie makes everything look funny. Emir Kusturica is truly one of a kind.",
         "This is a gangster film with lively, exaggerated characters, excentric men and resolute women, a weird plot and many visual gags. Kusturica shows the gypsies' life-style again in his last movie, with less depth and power than in \u0084Underground`, but with more ribald humour. Ugly and not too intelligent people (without exception!) chase and kill each other and their animals through a nice-looking landscape in the Balcans, listening to modern but also traditional gypsy music; loud, sometimes too loud, but original and in love with life. It's refreshing to see a convincing gangster movie without people in black suits and sun-glasses.",
         "Emir Kusturicas new film is a great example of good movie-entertainment. From the very first moment on it appears sympathetic to us. You see a man lying lazily in the sun, above him a hamster running in a wheel that drives a strange mechanical fan. In the background we hear some traditional Jugoslav music. A boat arrives with Russian goods and we see the little crook making a deal with the people on the ship. Of course everything goes wrong. Kusturica makes us love the strange environment and the strange people he presents us. The plot is complex as there are many people involved. Yet their patterns of behavior seem familiar to us; the jokes are mainly slapstick and the viewer can easily guess how the fairytale-like story will end. The director also puts very much thought into details, that eventually give the story the \"final touch\". One can sometimes compare his talent in this field to the great master Jacques Tati. There for example is a pig which is about to eat the inner parts of an old German \"Trabant\"-car, every time we see it (about four times) the car is more wrecked. There are the two cats that are seen coupling next to two ice-cooled corpses in the attic of an old house. The big difference to other comedies using the same structures and methods is that Kusturica really loves his characters and shows that all their \"faults\" are part of their personality; the figures in this strange society are basically like you and me."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "CiBy 2000",
         "Pandora Filmproduktion",
         "Komuna"
      ],
      "summaries": ["Matko is a small time hustler, living by the river Danube with his 17 year old son Zare. After a failed business deal he owes money to the much more successful gangster Dadan. Dadan has a sister, Afrodita, that he desperately wants to see get married so they strike a deal: Zare is to marry her. But none of the two care much for an arranged marriage: Zare is in love with Ida, Afrodita is waiting for the man of her dreams."],
      "budget": 0
   },
   "movielensId": 2843,
   "movielens": {
      "languages": ["Srpski"],
      "releaseDate": "1998-06-01",
      "dvdReleaseDate": null,
      "directors": ["Emir Kusturica"],
      "runtime": 127,
      "movieId": 2843,
      "title": "Black Cat, White Cat",
      "mpaa": "R",
      "actors": [
         "Bajram Severdzhan",
         "Srđan Todorović",
         "Zabit Memedov",
         "Florijan Ajdini",
         "Branka Katić",
         "Ljubica Adzovic",
         "Sabri Sulejmani",
         "Jashar Destani",
         "Predrag Laković",
         "Miki Manojlović"
      ],
      "imdbMovieId": "0118843",
      "originalTitle": "Crna mačka, beli mačor",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Matko is a small time hustler, living by the Danube with his 17 year old son Zare. After a failed business deal he owes money to the much more successful gangster Dadan. Dadan has a sister, Afrodita, that he desperately wants to see get married so they strike a deal: Zare is to marry her.",
      "tmdbMovieId": 1075,
      "avgRating": 4.02362,
      "releaseYear": "1998",
      "numRatings": 1778,
      "posterPath": "/yofEv6q0vdtErGo49z1vQL7RdWT.jpg"
   }
}