{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "assassination",
            "id": 441
         },
         {
            "name": "spy",
            "id": 470
         },
         {
            "name": "casino",
            "id": 585
         },
         {
            "name": "exotic island",
            "id": 911
         },
         {
            "name": "card game",
            "id": 1317
         },
         {
            "name": "space marine",
            "id": 1826
         },
         {
            "name": "intelligence",
            "id": 2051
         },
         {
            "name": "jamaica",
            "id": 3266
         },
         {
            "name": "secret base",
            "id": 3268
         },
         {
            "name": "secret mission",
            "id": 3269
         },
         {
            "name": "baccarat",
            "id": 3270
         },
         {
            "name": "secret organization",
            "id": 3271
         },
         {
            "name": "secret intelligence service",
            "id": 3272
         },
         {
            "name": "nuclear radiation",
            "id": 3275
         },
         {
            "name": "villain",
            "id": 3289
         },
         {
            "name": "secret agent",
            "id": 4289
         },
         {
            "name": "atomic reactor",
            "id": 18268
         },
         {
            "name": "caribbean",
            "id": 167861
         }
      ],
      "imdb_id": "tt0055928",
      "video": false,
      "title": "Dr. No",
      "recommendations": [
         657,
         658,
         660,
         667,
         681,
         253,
         668,
         700,
         682,
         691,
         698,
         699,
         709,
         707,
         708,
         710,
         714,
         36643,
         36670,
         36669
      ],
      "backdrop_path": "/9QcYwm5af4JaUSOyuysVEYOyEXn.jpg",
      "revenue": 59600000,
      "reviews": [{
         "author": "talisencrw",
         "id": "57bc86c0c3a368301300aea8",
         "content": "An extraordinary manifesto for not just the longest-running film series to date, but for an entire genre. People often forget just how important in the grand scheme of things a first film is, and how it was so requisite that Sean Connery had to be just right, the Bond girls, the action, music cues, opening scene, credits sequence, etc. Even though recently, Daniel Craig has at least captivated audiences to almost the same extent, he only reminded me of Connery's endearing qualities, and through completely lacking humour and charisma, simply showed by omission why Connery (who had already made five films as Bond before Craig was even born) was so essential in the first place.\r\n\r\nWatching my blu from the complete Bond boxed set, it wasn't dated or a lesser experience for me in the slightest. Long may Sir Connery live--the enjoyment his work has given me over the years is inestimable! =)",
         "url": "https://www.themoviedb.org/review/57bc86c0c3a368301300aea8"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "James Bond",
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aa9d",
               "name": "Sean Connery",
               "profile_path": "/ce84udJZ9QRSR44jxwK2apM3DM8.jpg",
               "id": 738,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Honey Ryder",
               "gender": 1,
               "credit_id": "52fe4263c3a36847f801aaa1",
               "name": "Ursula Andress",
               "profile_path": "/omY7AbTTKODYR730aHtB9UNaGM0.jpg",
               "id": 9871,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Dr. No",
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aaa5",
               "name": "Joseph Wiseman",
               "profile_path": "/dh5BTlenUZIMHT7WwT0nGxvrPhx.jpg",
               "id": 9872,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Felix Leiter",
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aaa9",
               "name": "Jack Lord",
               "profile_path": "/b85Nm0YGKByPEiKuxHRi5ItrdAD.jpg",
               "id": 9873,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "M",
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aaad",
               "name": "Bernard Lee",
               "profile_path": "/vCLXqcJNAijcVrRrJuoduc5VnSd.jpg",
               "id": 9874,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Professor Dent",
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aab1",
               "name": "Anthony Dawson",
               "profile_path": "/yzh26eyKJBtORjLlz8nyLQT7C1d.jpg",
               "id": 7682,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Miss Taro",
               "gender": 1,
               "credit_id": "52fe4263c3a36847f801aab5",
               "name": "Zena Marshall",
               "profile_path": "/bRWYvcVasxg5B2lbP9MKcLfUmol.jpg",
               "id": 9875,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Quarrel",
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aab9",
               "name": "John Kitzmiller",
               "profile_path": "/1CnMhVqNMAvCD8I7gXWDk9tV6dC.jpg",
               "id": 9876,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Sylvia Trench",
               "gender": 1,
               "credit_id": "52fe4263c3a36847f801aabd",
               "name": "Eunice Gayson",
               "profile_path": "/6RPWL9GKYydJvecrFkqeC4xP0s9.jpg",
               "id": 9877,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Miss Moneypenny",
               "gender": 1,
               "credit_id": "52fe4263c3a36847f801aac1",
               "name": "Lois Maxwell",
               "profile_path": "/uQneO3fT5H7vmjxusi3lJmm3xT3.jpg",
               "id": 9878,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Major Boothroyd",
               "gender": 0,
               "credit_id": "5400ff750e0a2658e9003176",
               "name": "Peter Burton",
               "profile_path": "/yf0UFNGiCrpIkCSSaU29lGGpIk7.jpg",
               "id": 9879,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aa5d",
               "name": "Terence Young",
               "profile_path": "/vXufUCM2ybRgYggqxoV5479a03Y.jpg",
               "id": 9855,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aa63",
               "name": "Ian Fleming",
               "profile_path": "/3Pld5n7f5AAVjP0HdsAkgSvrlJg.jpg",
               "id": 9856,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aa69",
               "name": "Richard Maibaum",
               "profile_path": "/5esfG4HckFBs9MRxywwLwPnNpfV.jpg",
               "id": 9858,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4263c3a36847f801aa6f",
               "name": "Johanna Harwood",
               "profile_path": null,
               "id": 9859,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4263c3a36847f801aa75",
               "name": "Berkely Mather",
               "profile_path": null,
               "id": 9860,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aa7b",
               "name": "Albert R. Broccoli",
               "profile_path": null,
               "id": 9861,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aa81",
               "name": "Harry Saltzman",
               "profile_path": null,
               "id": 9863,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aa87",
               "name": "Monty Norman",
               "profile_path": null,
               "id": 9864,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aa8d",
               "name": "Ted Moore",
               "profile_path": null,
               "id": 9867,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4263c3a36847f801aa93",
               "name": "Peter R. Hunt",
               "profile_path": null,
               "id": 9868,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aa99",
               "name": "Ken Adam",
               "profile_path": null,
               "id": 9869,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4263c3a36847f801aac7",
               "name": "Syd Cain",
               "profile_path": null,
               "id": 7756,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 25.622592,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 646,
      "vote_count": 1199,
      "budget": 950000,
      "overview": "In the film that launched the James Bond saga, Agent 007 battles mysterious Dr. No, a scientific genius bent on destroying the U.S. space program. As the countdown to disaster begins, Bond must go to Jamaica, where he encounters beautiful Honey Ryder, to confront a megalomaniacal villain in his massive island headquarters.",
      "similar": [
         714,
         657,
         708,
         691,
         253,
         954,
         667,
         682,
         817,
         9486,
         6637,
         563,
         707,
         27576,
         37834,
         37724,
         36955,
         22,
         206647,
         177677
      ],
      "original_title": "Dr. No",
      "runtime": 110,
      "poster_path": "/gRdfLVVf6FheOw6mw6wOsKhZG1l.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": "/czmPjPlpsJwsWuuTub2iATe2sgR.png",
            "name": "Eon Productions",
            "id": 7576,
            "origin_country": "GB"
         }
      ],
      "release_date": "1962-10-04",
      "vote_average": 6.9,
      "belongs_to_collection": {
         "backdrop_path": "/6VcVl48kNKvdXOZfJPdarlUGOsk.jpg",
         "name": "James Bond Collection",
         "id": 645,
         "poster_path": "/HORpg5CSkmeQlAolx3bKMrKgfi.jpg"
      },
      "tagline": "NOW meet the most extraordinary gentleman spy in all fiction!",
      "adult": false,
      "homepage": "http://www.mgm.com/#/our-titles/566/Dr.-No",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Terence Young"],
      "runtime": 110,
      "synopsis": "John Strangways, the British Intelligence (SIS) Station Chief in Jamaica, is ambushed, killed, and his body taken by three assassins known as the \"Three Blind Mice\". In response, MI6 agent James Bond (007) is summoned to the office of his superior, M. Bond is briefed to investigate Strangways' disappearance and to determine whether it is related to his cooperation with the American Central Intelligence Agency (CIA) on a case involving the disruption of Cape Canaveral rocket launches by radio jamming. Upon his arrival at Kingston Airport, a female photographer tries to take Bond's picture and he is shadowed from the airport. He is picked up by a chauffeur, who Bond determines to be an enemy agent. Bond instructs him to leave the main road and, after a brief fight, Bond starts to interrogate the driver, who then kills himself with a cyanide-embedded cigarette. During his investigation Bond sees a picture of a boatman named Quarrel with Strangways. Bond locates Quarrel but finds him to be un-cooperative when he interviews him. Bond also recognises Quarrel to have been the driver of the car that chased him from the airport. Bond follows Quarrel and is about to be beaten by him and a friend when the fight is interrupted by the man from the airport who has been following Bond: he reveals himself to be CIA agent Felix Leiter and that not only are the two agents on the same mission, but also that Quarrel is helping Leiter. The CIA has traced the mysterious radio jamming of American rockets to the Jamaica vicinity, but aerial photography cannot see the exact location of its origin. Quarrel reveals that he has been guiding Strangways around the nearby islands to collect mineral samples. He also tells about the island of Crab Key, owned by the reclusive Dr. No, who operates a bauxite mine which is rigorously protected against trespassers by an armed security force and low-scan radar. After finding a receipt in Strangways' house about mysterious rocks naming, Professor R.J. Dent, Bond meets with Dent who says he had assayed the samples for Strangways and determined them to be ordinary rocks. This visit makes Dent wary and he takes a boat to Crab Key where Dr. No expresses displeasure at Dent's failure to kill Bond and orders him to try again, this time with a large venomous spider. Bond survives and kills the spider. Bond becomes friendly with Strangways' secretary, Miss Taro and agrees to meet her at her home in the hills above Kingston. While driving there, Bond is attacked by several men driving a large hearse. He is able to outmaneuver them and the hearse is run off the mountain road and explodes. When Bond shows up at Taro's house, she's surprised to see him, a fact that Bond notes easily. She goes into her bedroom and talks on the phone to her boss, who tells her to keep Bond occupied for a few hours. Bond and Taro spend that time in bed. Bond makes a phone call, ostensibly asking for a taxi but actually talking to the local police, who show up soon after and arrest Taro. Bond then sets a trap for Dent and waits for him to show. Dent steals into the bedroom and fires several silenced shots into the bed, which Bond rigged to look like it was occupied. Bond forces Dent to drop his pistol and begins to interrogate him about Strangways and his radioactive rock samples, which Dent tried to cover up. Dent is able to recover his pistol, finding it empty and Bond coldly shoots him dead. Having detected radioactive traces in Quarrel's boat, where Strangways' mineral samples had been, Bond convinces a reluctant Quarrel to take him to Crab Key. On the beach there, Bond meets the beautiful Honey Ryder, dressed only in a white bikini, who is collecting shells. At first she is suspicious of Bond but soon decides to help him, leading them all inland to an open swamp. After nightfall they are attacked by the legendary \"dragon\" of Crab Key which turns out to be a flame-throwing armoured vehicle. In the resulting gun battle, Quarrel is incinerated by the flame-thrower whilst Bond and Honey are taken prisoner. Bond and Honey are decontaminated and taken to quarters before being drugged. Upon waking they are escorted to dine with Dr. No. He reveals that he is a member of SPECTRE (SPecial Executive for Counter-intelligence, Terrorism, Revenge, and Extortion) and plans to disrupt the Project Mercury space launch from Cape Canaveral with his atomic-powered radio beam. After dinner Honey is taken away and Bond is beaten by the guards. Bond is imprisoned in a holding cell but finds a way to escape through a vent. Disguised as a worker, Bond finds his way to the control centre, a multi-level room full of high-tech instrumentation with an atomic reactor set into the floor, overseen by Dr. No from a command console. Bond overloads the nuclear reactor just as the American rocket is about to take off. Hand-to-hand combat ensues between Bond and Dr. No, with the scientist being pushed into the reactor's cooling vat, in which he boils to death. Bond then finds Honey and the two escape in a boat just as the entire lair explodes. Their boat later runs out of fuel and they drift for a while before being found by Leiter and the Coast Guard. They throw Bond a rope and begin to tow him and Ryder back to shore, but Bond deliberately drops the rope, leaving them drifting again on the tide.",
      "writers": [
         "Richard Maibaum",
         "Johanna Harwood"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0055928/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTU3NzExMTQ4N15BMl5BanBnXkFtZTcwMjkzNzQzNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sean Connery, Ursula Andress, Bernard Lee | See full cast and crew »"],
      "reviews": [
         "I recently embarked on a mission of my own. To watch all the Bond films in order. Believe me, it's not as easy as it sounds. Finding all of them is nearly impossible. Blockbuster's weak collection hardly does any justice, so I ended up buying most of my favorites. I'm sorry to say, but to me Sean Connery is the only Bond. With the single exception being Craig in \"Casino Royale\". When I was growing up, I did enjoy Moore's villains, but now his portrayal seems almost goofy. Moore was just an old guy in a tight suit. Connery seems to be the only actor that understands who or what Bond is. He is a well-paid assassin. But he is not simply a murderer. Not afraid to close fist punch a woman in the face or hold the door open for her. Later actors too often forgot that Bond is supposed to be graceful yet brutish. Approachable yet cold hearted. \"I admire your courage, Miss...? Sylvia Trench: I admire your luck, Mr...? Bond. James Bond.\" This could well be my favorite line in cinema history. Not the often lame interpretations, but during the opening scene at the card table. It still gives me chills. I just wish they would get back to the basics. How many explosions and car chases does a person need to see. I thought he was a spy, they went and turned him into Rambo.",
         "Commenting on DR NO is a little like being asked to review 'Genesis\" or \"The Gospel According to Matthew.\" It IS what it is! Connery WAS Bond from the instant he appeared on screen and remember Ian Fleming, his creator was still alive at this stage. (Fleming in fact saw the first three Bonds but died before the release of THUNDERBALL) DR NO set the standards, albeit with a limited budget, for the entire series. Action, pretty girls, one-liners and impossibly cashed-up enemies. My own father was a confirmed Bond addict (having worked in army intelligence during WW2) and had been greatly looking forward to the release of this film. Cruelly, he died just a couple of weeks before its premiere in London in 1962. I made up for it however by seeing it four days running. At the time, just about as exciting as films got, it was an enormous box office smash and vindicated the studio's decision to sign Connery. Fleming in fact had wanted Roger Moore for the role, who was then riding high with THE SAINT worldwide and was unavailable for filming. Connery, who's only claim to fame at the time was as a part time male model and bit-part actor, his biggest role having been as a truckie in HELL DRIVERS three years earlier. Of course DR NO is dated now - its 40 years old! and deserves to be looked at from that standpoint The action sequences were raw in parts, pretty good in others. Sure the car chase scenes in Jamaica with the laughable back-projections are a cackfest now but none of this matters. The sets were imaginative, the fights good stuff, Ursula Andress enough for any young man's wet dream and Wiseman as DR No himself probably the best villain of them all, despite his very limited screentime. Very imaginative sets for the time and pyrotechnics to please. When it came to my home-town I took several days off college and watched it with fellow students. This was way better than Latin and calculus!",
         "The James Bond franchise has so many films in its library, so many that one can get confused as to which film to watch, which story to pay attention to and which star to be seen. And with the current trend of making action films (big budget special effects and tons of action) today, mystery, suspense and character-driven plots have all suffered badly in the 007 franchise. As for the original Bond movie Dr. No, I can start by saying that its simplicity as well as Sean Connery make it one of the BEST BOND FLICKS ever! Why do I like Dr. No better than most other Bond flicks?: 1) There is no overload of explosions or special effects or action scenes. These elements never overwhelm the story telling. 2) The story is simple yet more detailed and more enjoyable to watch than that of other flicks like Man With The Golden Gun, Tomorrow Never Dies and Licence to Kill. In addition, Dr. No's story can be taken seriously. 3) Story is character-driven and the use of mystery and suspense is VERY refreshing after watching too many explosions and special effects happen on screen (Die Another Day anyone?). 4) Sean Connery's performance is no less amazing and his use of charm, coolness and cruelty truly defined James Bond. No matter how hard others tried, Connery will always be the king of Bonds. 5) Ursulla Andress, similar to Connery, is STILL the queen of all Bond Girls not only because of her hot look but also of her excellent portrayal of Honey Rider. On screen, Ursulla has both the appeal of a fighting lady, the helplessness of damsels and the beauty that satisfies viewers. If Bond were to marry again, Honey is number 1 for him. 6) Director Terence Young succeeded in keeping the pace right (mostly moving in medium-pace) which effectively balanced the presentation and prevented it from boring or exciting the viewer too much.. There are lots of details to pay attention to plus the characters are very well told. 7) Dr. No is definitely one of the best Bond villains, probably the best. Joseph Wiseman's performance as the half-German/half-Chinese villain is great to watch and like Connery he had coolness and cruelty on screen\u0085note how cool Dr. No was when he resisted Bond's attempt to provoke him. To check things carefully, Bond and Dr. No are essentially as bad as each other. One works to kill and destroy like the other. The makeup work on Wiseman is excellently convincing. Performance-wise, Wiseman's Dr. No is better and more appealing than that of villains Gustav Graves, Stromberg, Largo and others. 8) Dr. No's production values, despite the movie's age, still stands up well until now. The interior sets are very well designed (Dr. No's chamber where Bond and Honey had dinner with him plus Bond's Jamaica hotel room) and has mostly good props (some props look dated though). Dr. No is worth viewing not only as a classic spy movie but also as a historical art piece of motion pictures! No matter what nay-sayers say, Dr. No will always be the model Bond flick for all sequels to be compared with. And let us not forget that 007 creator Ian Fleming himself was greatly involved with this movie's production. Dr. No has a plot that can be told clearly, be taken seriously and enjoyed from start to finish. And it has a cast of characters greatly delivered by the actors. Many other Bond films failed when compared to Dr. No on these categories. Highly recommended viewing!",
         "DR. NO, the first of the \"James Bond\" film series, was a dazzling adventure that would change the 'look' of action films, forever. While the film's 'plot' would become 'Standard Bond' (a maniac attempts to 'heat up' the cold war by provoking America, in this instance, by crashing it's rockets), and reappear in many incarnations over the years, the story behind the first film is still fascinating. From the completion of his first 007 novel, \"Casino Royale\", in 1952, 41-year old author Ian Fleming believed that movies and television would be the best 'forum' for James Bond. But deals usually fell through (one that didn't, resulting in an American TV adaptation of \"Casino Royale\", in 1954, was a flop), and failed screenplays would be rewritten into best-selling short stories and novels, instead. Not surprisingly, the novels impressed many film producers with their cinematic sweep and potential. Two of the producers, American Albert (Cubby) Broccoli, and Canadian Harry Saltzman, would become the key players in bringing DR. NO to the screen. Saltzman had managed to obtain an option to most of Fleming's work, but the move left him too financially strapped to produce them. Broccoli had wanted to produce the Bond novels, himself, but didn't own the rights. When Saltzman refused to sell, but offered a partnership, instead, Eon Productions was created, and United Artists, impressed by both men's enthusiasm and vision, agreed to bankroll their proposed \"Bond\" series. DR. NO was chosen as the first to be filmed, and, after several directors (including future Bond legend Guy Hamilton) passed on the project, Terence Young, as smoothly elegant as 007, himself, signed. Who would play James Bond? Fleming jokingly suggested 52-year old star David Niven (who would, in fact, later play Bond in the spoof, CASINO ROYALE). Broccoli wanted Roger Moore, 34, but he was under contract for \"The Saint\". Then, independently of each other, both Broccoli and Saltzman heard about Scottish actor Sean Connery, 31. After viewing DARBY O'GILL AND THE LITTLE PEOPLE, Broccoli arranged an interview, was greatly impressed, and hired Connery, assigning director Young to teach the 'rough-edged' actor some style and sophistication. Connery was a quick learner, and soon was so impressive that even Ian Fleming would call him perfect, and would, in fact, incorporate elements of Connery into the Bond of the novels. New York actor Joseph Wiseman was chosen as Dr. No, after Noel Coward refused the role (\"Dr. No? No! No! No!\"), and Fleming cousin, actor Christopher Lee, was unavailable. Future \"Hawaii 5-0\" star Jack Lord, a protégé of longtime Broccoli friend Gary Cooper, was cast as C.I.A. agent Felix Leiter, and Swiss bombshell Ursula Andress became Honey Ryder, Bond's first leading lady (her voice dubbed, because of her thick accent). With Bond 'regulars' \"M\" (Bernard Lee) and Miss Moneypenny (Lois Maxwell) in place, the Bond legend began. A few bits of trivia: the 'gunbarrel' introduction, created by 'Opening Credits' designer Maurice Binder, featured stunt 'double' Bob Simmons, rather than Connery, as it was added after shooting was wrapped; Ken Adam's futuristic sets would not only become Bond highlights, but would influence 'real' interior design styles for a generation; and the film's score was by London theatrical composer Monty Norman, with John Barry's participation consisting of conducting the orchestra, and orchestrating Norman's \"James Bond Theme\"...which Barry did so well that he would become THE Bond composer for over twenty years! DR. NO was a hit, particularly in Great Britain, and it received a HUGE boost in the U.S. when it was discovered President Kennedy was a 007 fan (FROM RUSSIA WITH LOVE was chosen as the second film, in part, because it was a favorite novel of JFK). While the film lacked the 'overabundance' of gadgets and style elements of the later Bond entries, it was a remarkable debut! And James Bond WOULD return...",
         "At the Chemin De fer, European Bacarat, Bond has his back to the camera and remains unrevealed until that precise moment when the very first Bond girl, Sylvia Trench portrayed by Eunice Gayson, uttered her first line of dialogue, \"I admire your luck, Mr. ...?\" and he is seen for the first time lighting his cigarette and announcing himself as \"Bond. James Bond.\" Bond has dark, rather cruel good looks and a slight scar down one cheek... Tall, handsome, well-dressed, exquisitely mannered, and enormously charismatic, Sean Connery had all the bravura of Ian Fleming's secret agent... He has powerful sex appeal, and is a real lady killer... He drinks a lot of Smirnoff vodka, but prefers Dom Pérignon'53... Bond\u0097licensed as 007 by his superiors to kill\u0097is an embodiment of pure fantasy... He frequently travels under his own name, making no effort to hide his taste for luxury rivals, and his loves for sensual pleasure... He continually provokes his superiors, and ignores common sense and danger in his combat with villains... Characterized as a cultivated gentleman and good officer who knows his wines, paintings and weaponry, Bond must often take a back seat to the super-spy hardware with which he is equipped... The technology exhibition play an important part in any Bond films... With an essential Chinese look, Canadian actor Joseph Wiseman brought to life Dr. No\u0097the first megalomaniac super villain of the atomic age\u0085We first see his black steel hands when he pulls back the bed sheets covering a sleeping 007\u0097Bond's code name\u0085 Wiseman looked the perfect combination of crippled scientist and criminal: From his heavily staffed underground base and using atomic energy, Dr. No\u0097on behalf of the SPECTRE organization\u0097was operating a device on the tropical island of Jamaica that massively interferes with the critical rocket launchings from Cape Canaveral... The plot concerns a British agent, John Strangways, missing in Jamaica... Bond is sent to investigate\u0085 He discovered that Strangways was on the track of a certain Dr. No, owner of a mine on the nearby island of Crab Key\u0085 The locals avoided Crab Key, believing it haunted\u0085 Bond landed there, but instead of ghosts, came upon a girl named Honey on the beach\u0085 He was soon caught up in a deadly battle of wits with Dr. No, who planned to destroy the entire US space program\u0085 Ursula Andress coming out of the water on Crab Key, dressed in a skimpy bikini, is the most famous introduction for a performer in screen history\u0097paralleling Omar Sharif's arrival on camel in David Lean's \"Lawrence of Arabia,\" the same year\u0085 Jack Lord was the first to portray CIA agent Felix Leiter... Bernard Lee established himself as the perfect authority figure in the first eleven James Bond movies... Anthony Dawson had the memorable role of Grace Kelly's attempted murderer in Hitchcock's 1954 thriller \"Dial M For Murder.\" As the chief agent of 'Dr No,' this lean-faced Scottish character actor planned numerous assassination attempts to eliminate Bond... Lois Maxwell is the tall, distinguished-looking woman who portrayed M's secretary, Miss Moneypenny, in 14 James Bond films... Eunice Gayson is the extremely sexy brunette Sylvia Trench who seduces our hero... Zena Marshall is the seductive Miss Taro, who appeared fresh from the bath, wrapped in a towel in the hallway of her Blue Mountain cottage... She is the quintessential enemy agent\u0097voluptuous, deadly and expendable... Peter Burton made his one and only appearance as armorer Major Boothroyd who replaced Bond's gun, the .25 Beretta by the Walther PPK... In following films, his character was renamed 'Q' and was given to Desmond Llewellyn, who made the role his own... If you really like mystery spoof, this is your chance to see the first and best adaptation of an Ian Fleming spy fantasy, mixing sex, violence and campy humor against expensive sets and exotic locales... \"Dr. No\" had great Calypso ballads: the romantic, \"Underneath The Mango Tree\", the animated \"Jump Up Jamaica\", and the calypso version of \"Three Blind Mice\" to introduce the three blind beggars...",
         "Still going strong four decades later, it is sometimes hard to recall where the James Bond franchise began. Dr. No was released in 1962 with the relatively unknown Sean Connery in the leading role. The original Bond author, Ian Fleming, was still alive at the time and wasn't very pleased with the casting of Connery, though he soon warmed to the actor's interpretation of the role when he saw the film. The big question is: how does Dr. No hold up over forty years on? Personally it has always been my favourite Bond movie and probably will never be surpassed. Even now, it is a step ahead of its counterparts. Connery never appeared in a better Bond flick (some were close), much less Lazenby, Moore, Dalton or Brosnan. James Bond (Connery) of the British Secret Service is sent to Jamaica to investigate the death of an operative named Strangeway. He learns that Strangeway was looking into alarmingly high radiation readings generating from a nearby island called Crab Cay. Bond heads to the island and learns that it is a suspiciously heavily guarded place, patrolled by gunmen, dogs and armed boats, and none of the local islanders dare venture near because of rumours that a dragon also guards the area. Aided by a Jamaican agent called Quarrel (John Kitzmiller) and beautiful diver Honey Ryder (Ursula Andress), Bond searches the island's interior for answers. He discovers that the island is run by the deadly Dr. No (Joseph Wiseman), a visionary megalomaniac who plans to disrupt the American space programme by sabotaging their shuttles from his secret island base, using gyroscopic interference to bring them down mid-flight. As the series went on, it became less and less related to the Bond of Fleming's creation, and increasingly akin to a comic book. Part of the strength of Dr. No is that it is faithful to its source. I've read Dr. No, and it is such a good book that it didn't really need altering beyond all recognition in order to be filmable - so, it's nice to report that scripters Richard Maibaum, Johanna Harwood and Berkely Mather have adapted it accurately. The performances are excellent: Connery confident and masculine as Bond, Andress jaw-droppingly gorgeous as Honey, and Wiseman fabulously sinister as Dr. No. Terence Young directs with urgency, getting plenty of excitement as well as some lovely location photography into his film (hard to believe he would go on to make such inept bombs as Poppies Are Also Flowers, Bloodline, and Inchon). Dr. No is a milestone in cinema history. It is the film that gave us our first big-screen 007; it is the grand-daddy of all globe-trotting adventure flicks; and it is a classic action film in its own right to boot.",
         "No matter whether or not you like this film in the end...if you don't get some feeling of joy the first time Sean Connery says \"Bond. James Bond.\" at the card table, I feel sorry for you. This Bond film has a lot less stuff going in it than most, but for what it's worth, and what it has inspired, it's a classic. People who can't tolerate and appreciate older cinema from the 60's might laugh at the action scenes, set and costume design of the movie, but if one considers the year in which this was made, it's all rather exquisite. The film is also full of things that would be considered politically incorrect, and the way Bond and Moneypenny flirt in the office would ensue mass sexual harassment lawsuits in this day and age. The film has an underused villain in Dr. No. Joseph Wiseman sets the standard on how Bond villains, and the majority of how other movie villains, act. One of the things that I love about Bond films is that you will see things that you will never see in other movies. I mean where else but a Bond film would a half Chinese, half German man with metal hands and a compulsive paranoia about radiation, with metal hands live on an island with a \"dragon-mobile\"? Dr. No is a definite good start to the Bond series. Ursula Andress as Honey Ryder may only be there for eye candy...but she's great eye candy. Sean Connery is Bond, and pure enjoyment while in this role. So if you are looking for a classic enjoyable movie, this is just what the doctor ordered.",
         "Ahhh...let's go back to the year 1962. What was going on than? Well, Marilyn Monroe was found dead in her L.A. home, the Cuba crisis, racial integration in U.S. and yes, the first 007 was released in London. The legend was born. They launch into the orbit until till than fairly unknown actor, and they hit the jackpot. Stalwart, confident, cool under pressure and witty. Sean Connery was all that and more. Beside him, was gorgeous and talented Honey Ryder (26-years old Ursula Andress) as the main \"love bird\" beside Sylvia Trench (Eunice Gayson) and villain Miss Taro (Zena Marshall). And as always trusty allies from Q (this time played by Peter Burton and only appeared for 10 seconds) to CIA and of course M. Thus, we can't forget his Jamaican friends Puss-Feller and Quarrel (a nice play from John Kitzmiller). On the other hand we have interesting villains in this one. Though we have seen toughest and better opponents in other Bond movies, Dr. No have some class and helpful friends such as \"funny\" three blind assassins and Professor Dent (great scene by the way in the cabin). So, is the first also the best in series? No, but it definitively ranks in top 5 Bond movies ever. It got best Bond actor (Sean Connery), great woman (Ursulla Andres) though we have seen better chemistry, superb jazzy score by Monty Norman with nice Jamaica sounds, witty bond humor (\"i think that they were on the way to a funeral\" or \"make sure that he doesn't escape\"), dreamy locations (Jamaica) and the component director who made the timeless classic. For this reasons, although not the best in the series, it still deserves a highest possible rate 10 out of 10.",
         "Watching DR NO after all these years the first thing to strike me is how gritty it all is . The villains are cruel and not below shooting unarmed women in the back so who better to take them on than an equally cold hearted killer namely James Bond 007 . Bond must have shocked cinema audiences in the 1960s , no one described as a good guy in pre Bond cinema ever shot one of the bad guys in the back no matter what the provocation . John Wayne didn`t do it and neither did Errol Flynn but here we see Sean Connery doing it even though he didn`t have to . And I`m making no distinction between Sean Connery and the character he plays , James Bond is Sean Connery . Try saying \" James Bond \" out loud . Done it ? Notice the slightly slurred Scottish brogue . Try it again . See it`s impossible not to say \" Bond. Jamesh Bond \" Let`s not forget Connery made Bond a cultural icon and Connery was at one point the world`s most famous and highest paid movie star .Not bad for a man who started off life in an Edinburgh tenement and whose first paid job was as a milk boy One final thing I noticed about DR N0 is how tightly written and paced it is. Plot point is followed by murder attempt followed by plot point followed by murder attempt followed by plot point. At no time does any of this seem forced and at no time do we see 15-20 minutes padded out with a ridculous stunt sequence . If only all Bond films were as good as this or GOLDFINGER",
         "\"Dr. No\" is not my favorite James Bond film. But I'm glad it succeeded, because it led to subsequent 007 films that were really very entertaining, especially \"Goldfinger\". Everything about \"Dr. No\": the story, the music, the special effects, the dialogue, even the acting is so ... tentative. The film lacks the self-confident flair and cinematic flamboyance that characterize later 007 films from the 1960s. That is not a criticism, given that \"Dr. No\" was the first Bond film, and was low-budget. No one knew how the film would be received. Through the years Sean Connery is the only actor who has done justice to the James Bond character, in my opinion. Although his acting in \"Dr. No\" is probative at best, he still manages to convey an aura of intelligent charisma. And that charisma would become less restrained in later films. The visuals in \"Dr. No\" are very dated. What seemed futuristic in 1962 seems stodgy now. All that engineering design, those clunky computers, and that modernistic interior decor, all included to wow viewers then, seem, half a century later, quaint, obsolete, even archaic. The film's story, about an evil genius out to scuttle the U.S. missile program and dominate the world, likewise seems dated. I must admit, however, that Joseph Wiseman, as the villain, is well cast, with his passive face and those eyes that seldom blink. That the James Bond character and his adventures have survived all these years demonstrates the enduring appeal of cinematic heroes who, like superman, embody all that is good and strong, in their successful efforts to conquer evil. I just wish that contemporary 007 films had the cinematic credibility of those 1960's Bond films: \"You Only Live Twice\", \"From Russia With Love\", \"Thunderball\", and of course \"Goldfinger\", all of which owe their existence to the success of \"Dr. No\"."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Thriller"
      ],
      "productionCompanies": ["Eon Productions"],
      "summaries": [
         "James Bond (007) is Britain's top agent and is on an exciting mission, to solve the mysterious murder of a fellow agent. The task sends him to Jamaica, where he joins forces with Quarrel and a loyal CIA agent, Felix Leiter. While dodging tarantulas, \"fire breathing dragons\" and a trio of assassins, known as the three blind mice. Bond meets up with the beautiful Honey Ryder and goes face to face with the evil Dr. No.",
         "When the British agent John Strangways and his secretary vanish in Jamaica, James Bond is assigned by M to investigate what might have happened with the agents. 007 teams-up with the CIA agent Felix Leiter and the native Quarrel that works with him and 007 learns that Strangways was investigating the Crab Key Island that belongs to the mysterious Dr. No and is very well protected by armed guards. Soon they learn that Dr. is toppling the rockets launched by the NASA Cape Canaveral and 007 goes to Crab Key with Quarrel to seek evidences against Dr. No. They meet the sexy Honey Ryder collecting seashells in the island. They stay together but soon they are found by the security guards and arrested in Dr. No's facility, and James Bond learns the evil plan of Dr. No and The SPECTRE.",
         "An agent of the British Secret Service, James Bond (007), is sent out to the West Indies in order to find out why another of his number was killed. His arrival is not welcomed by everyone, but it is not long before he is on the trail of the killer. The trail leads to a secretive scientist, Dr. No, but the discovery has wider implications...",
         "Bond's mission takes him to the steamy island of Jamaica, where mysterious energy waves are interfering with U.S. missile launches. As he unravels the astonishing truth, 007 must fight deadly assassins, sexy femme fatales and even a poisonous tarantula. With the help of crack CIA agent Felix Leiter and the beautiful Honey Ryder, he searches for the headquarters of Dr. No, a fanatical scientist who is implementing an evil plan of world domination. Only James Bond, with his combination of wit, charm and skill, can confront the madman and save the human race from a horrible fate.",
         "James Bond 007, seductive British secret agent, has been sent to the West Indies to investigate the disappearance of British agent John Strangway and his secretary. Once arriving, 007 becomes suspicious of scientist Proffesor Dent, who was the last person to have seen Strangway before he disappeared. After learning Professor Dent is working for a terrorist with a metal hand Dr. Julius No and Strangway is dead, 007 meets CIA agent Felix Leiter and his assistant Quarrel in Jamiaca. 007 and Quarrel head to the tropical island Crab Key, after encountering the beautiful Honey Ryder, 007 finds the island is Dr. No's secret lair and 007 and Honey are captured but Quarrel is killed. Where 007 learns Dr. No is has been disrupting the American rocket launches at NASA and he is out for world domination and plots to unleash his vengeance on the United States of America. Can James Bond defeat Dr. No and save the world?",
         "A suave and skilled government agent named James Bond, looks for answers about a missing colleague and the disruption of the American space program."
      ],
      "budget": 1100000
   },
   "movielensId": 2949,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1962-10-04",
      "dvdReleaseDate": "1997-11-18",
      "directors": ["Terence Young"],
      "runtime": 110,
      "movieId": 2949,
      "title": "Dr. No",
      "mpaa": "PG",
      "actors": [
         "Sean Connery",
         "Ursula Andress",
         "Joseph Wiseman",
         "Jack Lord",
         "Bernard Lee",
         "Anthony Dawson",
         "Zena Marshall",
         "John Kitzmiller",
         "Eunice Gayson",
         "Lois Maxwell",
         "Peter Burton"
      ],
      "imdbMovieId": "0055928",
      "originalTitle": "Dr. No",
      "genres": [
         "Adventure",
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "AyTyMfh57_g",
         "pw61uyA0F8A",
         "rwL6sN2Wqbs"
      ],
      "plotSummary": "In the film that launched the James Bond saga, Agent 007 battles mysterious Dr. No, a scientific genius bent on destroying the U.S. space program. As the countdown to disaster begins, Bond must go to Jamaica, where he encounters beautiful Honey Ryder, to confront a megalomaniacal villain in his massive island headquarters.",
      "tmdbMovieId": 646,
      "avgRating": 3.66855,
      "releaseYear": "1962",
      "numRatings": 8686,
      "posterPath": "/gRdfLVVf6FheOw6mw6wOsKhZG1l.jpg"
   }
}