{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "stone age",
            "id": 4428
         },
         {
            "name": "prehistoric",
            "id": 10506
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "cavemen",
            "id": 159955
         },
         {
            "name": "prehistoric man",
            "id": 192918
         }
      ],
      "imdb_id": "tt0104187",
      "video": false,
      "title": "Encino Man",
      "recommendations": [
         13203,
         9536,
         13595,
         13997,
         12475,
         11622,
         2616,
         15413,
         1649,
         8873,
         11381,
         9612,
         11814,
         10276,
         9304,
         9622,
         11597,
         10442,
         11418,
         11017
      ],
      "backdrop_path": "/zkY5c8UlV6vD9VA8dCkKb2Ff8YA.jpg",
      "revenue": 40693477,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dave Morgan",
               "gender": 2,
               "credit_id": "52fe43699251416c7500f3f3",
               "name": "Sean Astin",
               "profile_path": "/m40tSOPKJScFY7acY0hEWtE1ncR.jpg",
               "id": 1328,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Link",
               "gender": 2,
               "credit_id": "52fe43699251416c7500f3f7",
               "name": "Brendan Fraser",
               "profile_path": "/n8VOWXp94nhIEo5nS9o6bOpUHiN.jpg",
               "id": 18269,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Stoney Brown",
               "gender": 2,
               "credit_id": "52fe43699251416c7500f3fb",
               "name": "Pauly Shore",
               "profile_path": "/rCoEeH3jmwpNjMHAVv9SchtnNJh.jpg",
               "id": 64998,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Robyn Sweeney",
               "gender": 0,
               "credit_id": "52fe43699251416c7500f3ff",
               "name": "Megan Ward",
               "profile_path": "/tkdBrtF2uq5v9d2g32JRnoKQFji.jpg",
               "id": 64999,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ella",
               "gender": 1,
               "credit_id": "52fe43699251416c7500f403",
               "name": "Robin Tunney",
               "profile_path": "/oQGr5vfYbkarmJQmhGmSpIhSapL.jpg",
               "id": 17346,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Matt Wilson",
               "gender": 2,
               "credit_id": "52fe43699251416c7500f407",
               "name": "Michael DeLuise",
               "profile_path": "/ogvSHUb0jakiR7CyIph7TfQp9gV.jpg",
               "id": 55557,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Nora",
               "gender": 1,
               "credit_id": "52ffcad89251416adb0cbbe8",
               "name": "Rose McGowan",
               "profile_path": "/llI2Fc6G0wqZlASpIEGWnLViZxD.jpg",
               "id": 16850,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Raji",
               "gender": 2,
               "credit_id": "52ffcaf39251416ae70c7e67",
               "name": "Erick Avari",
               "profile_path": "/aO53uKgLUCID9rCI0SRAIEdsIex.jpg",
               "id": 18917,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Kathleen",
               "gender": 1,
               "credit_id": "56a3cffa9251417202003938",
               "name": "Michole Briana White",
               "profile_path": "/A96VJgE6mUnr1dj5yhm4bLgqWse.jpg",
               "id": 1214165,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Phil, Matt's Thug #1",
               "gender": 2,
               "credit_id": "56a3d03f92514154f00019f3",
               "name": "Patrick Van Horn",
               "profile_path": "/j8ghO8LacpOtBA2l1VY7nLv35Cg.jpg",
               "id": 64715,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Will, Matt's Thug #2",
               "gender": 0,
               "credit_id": "543fc1b0c3a3685e4b0018ae",
               "name": "Dalton James",
               "profile_path": "/8QG4JUgvlsqiGzD81JZhqageWew.jpg",
               "id": 65400,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Mr. Brush",
               "gender": 0,
               "credit_id": "56a3d0e4c3a3683890003f11",
               "name": "Rick Ducommun",
               "profile_path": "/reHrybVr1GjF4pGXhtN9EUxS0zD.jpg",
               "id": 1538,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Kim",
               "gender": 0,
               "credit_id": "56a3d11b925141720700393f",
               "name": "Jonathan Ke Quan",
               "profile_path": "/1cKtw6cBhWPHtjUBiY3si8odVIE.jpg",
               "id": 690,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Mrs. Morgan",
               "gender": 1,
               "credit_id": "56a3d170c3a36838a30032e5",
               "name": "Mariette Hartley",
               "profile_path": "/pvpw37HlFxMhJwYy9tUSkPy0Aol.jpg",
               "id": 16131,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Mr. Morgan",
               "gender": 2,
               "credit_id": "56a3d1a3c3a368389e0036de",
               "name": "Richard Masur",
               "profile_path": "/w8qQdmxLRRSXNXkjHKHlY5vawXG.jpg",
               "id": 15416,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Cave Nug",
               "gender": 1,
               "credit_id": "56a3d20f92514172140035ac",
               "name": "Sandra Hess",
               "profile_path": "/x4lwd09GHJsUABhMyIAFGnrrGam.jpg",
               "id": 59642,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43699251416c7500f40d",
               "name": "Les Mayfield",
               "profile_path": "/qFl6z4jAfvb3bfMeGDMD4ch61tI.jpg",
               "id": 56911,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe43699251416c7500f413",
               "name": "Shawn Schepps",
               "profile_path": null,
               "id": 65001,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43699251416c7500f419",
               "name": "Hilton A. Green",
               "profile_path": null,
               "id": 6935,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43699251416c7500f41f",
               "name": "George Zaloom",
               "profile_path": null,
               "id": 65000,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43699251416c7500f425",
               "name": "J. Peter Robinson",
               "profile_path": null,
               "id": 28156,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43699251416c7500f42b",
               "name": "Robert Brinkmann",
               "profile_path": null,
               "id": 56988,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43699251416c7500f437",
               "name": "Eric A. Sears",
               "profile_path": null,
               "id": 21140,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59119c26c3a368646b0462cf",
               "name": "Michael Kelly",
               "profile_path": null,
               "id": 1442567,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 9.507497,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10406,
      "vote_count": 235,
      "budget": 0,
      "overview": "High school misfits Stoney and Dave discover a long-frozen primeval man from the past in their back yard. But the thawed-out Link, as the boys have named him, quickly becomes a wild card in the teens' already zany Southern California lives. After a shave and some new clothes, Link's presence at school makes the daily drudgery a lot more interesting.",
      "similar": [
         425,
         10567,
         17610,
         18905,
         18890,
         30505,
         3591,
         35002,
         49519,
         88751,
         62204,
         278154,
         888,
         351286,
         58691,
         13363,
         339526,
         387893,
         13853,
         11571
      ],
      "original_title": "Encino Man",
      "runtime": 88,
      "poster_path": "/xSjdE12wXgdJwX3mvGAniNFMbTi.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Touchwood Pacific Partners 1",
            "id": 8830,
            "origin_country": ""
         }
      ],
      "release_date": "1992-05-22",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "When the stone age meets the rock age.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Les Mayfield"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "George Zaloom",
         "Shawn Schepps"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104187/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxMDk2NTc2NF5BMl5BanBnXkFtZTcwNzM5OTQxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Sean Astin, Brendan Fraser, Pauly Shore | See full cast and crew »"],
      "reviews": [
         "I Mean that literally! I was going through a rough time in my life, and Encino Man was the only thing that could make me laugh! Brendan Fraser was terrific, and I even learned how to like Pauly Shore after this movie...who up to this point I couldn't stand! I saw it 8 (yes, that's EIGHT) times at the theatre in a four week period when it was out, and have watched it dozens of times since on video. Despite it's absurd premise, the movie worked for me, in the relationships that developed between Link, Dave, and Stoney, and the little family the three of them made. It's goofy, it's at times stupid..and it's all around FUNNY! Just one of those little movies that if you will allow yourself to put reality on hold for 90 minutes, it can and will charm the socks off of you.",
         "Encino Man is a comedy influenced by the wackiness of the grunge generation. The young cast, which stars Astin, Shore, and Fraser, is likely to be a major draw for teenagers and younger viewers, who will likely enjoy this movie. The story is pretty goofy. Dave (Sean Astin) has major plans for putting a swimming pool in his backyard to at least get some popularity points with the neighborhood teens who could lounge by the water in the blazing California summer sun. But, when he's breaking ground, he digs up a block of ice with a casualty of the Ice Ages, primitive fellow who he and his hip buddy, Stoney (Pauley Shore), clean off and try to disguise him as a regular American teenager. Needless to say, a lot of mishaps arise out of this. But eventually, the grizzly Link (Fraser), is a pretty popular kid at the high school, and one that Dave thinks will help him get popular, too, in that popularity-by-association kind of way. Matt Wilson, a jerky jock (Michael DeLuise) interferes with Dave's plans to just try and pass off Link as a normal exchange student. Already p***ed with Dave and Stoney for getting friendly with his girlfriend Robyn (Megan Ward), and with their increasing popularity--especially Link, who Robyn has a little crush on. Matt figures out Link's real identity, and it's a question of whether anyone will believe his story that Link is really from the Ice Ages. Not even the school's most popular jerk can get off easy with a line like that. The cast and this silly story make it an enjoyable comedy. Teens are likely to enjoy Pauley Shore's scenes as the happy-go-lucky hippie throwback friend, Stoney, as he just seems like such a nice, giant goofball who can really have fun with this material. It's also pretty funny to watch a fellow from the Ice Age trying to adapt to modern teenage life, much like the historical dudes did in Bill & Ted's Excellent Adventure. It's even got some sweet tunes on the soundtrack. So loosen up and enjoy it already.",
         "I really like this movie. Maybe its ending is a little predictable, still it's good fun, easygoing and one of these movies you can watch over and over again. The characters are brilliant, Brendan Fraser's performance as an unfrozen stoneage guy in modern California is simply great. my absolute favourite scene is the one in the bathroom - no matter how often i watch it, it always makes me laugh.",
         "I'm not sure why, but still to this day I love to sit down to Encino Man. I think because I just loved it as a child and it's like that blankie you can't get rid off. Also, you need those comedies that you can just sit down too and just have fun and relax. Yes, it has Pauly Shore which granted can be scare-E! :D But he's actually amusing as well in the film. We see a very young Brendon Fraser as Link the caveman, yes, he doesn't have much to work with the grunting and such. But he was just priceless in that club scene and the seven eleven with Pauly. He's also just so cute and lovable when he sees Dave and Stoney getting into a fight and he pulls David back screaming to him \"Family!\". It was actually touching, I'm serious. Sean Austin plays Dave, he's come such a long way and in my opinion is the most successful child star to not get hooked on drugs or let the industry take him over. He does such a good job as the pretty self centered and insecure but nevertheless lovable guy who wants to get the girl. Pauly plays Stoney, a well, I think he's somewhat of a stoner. :D But he's pretty funny in the film with some of his lines. Come on, I think we all dug him in his day. While yes, Encino Man is not Oscar material, it's just a fun time to sit down and enjoy with your friends. So, a 5.0? It's just a movie, let go and grab the popcorn for a few laughs. If you didn't laugh at that scene where Link speaks Spanish to the Hispanic gang members, you have some serious issues. 7/10",
         "On weekends, after a long day of partying, I feel ready for a laugh. So, I put ENCINO MAN in the VCR and laugh myself silly. I have seen this movie so many times, that I could probably mimic the entire thing. Pauly Shore is a riot. And even better that they have him casted as a high school student. He's about ten years out of high school. But he is what makes the movie. Brendan Fraser wasn't really known all that well when he made this one. It pretty much began his career. See this if you are in a mood where everything seems funny to you. Those are the kinds of moods that make you pass out from laughing too hard. This one is definitely good for a laugh.....5/5.",
         "*about a Cro-Magnon man attending high school. *featuring Sean Astin as a non-hobbit. *that's got Pauly Shore in it. I just saw this movie again after many, many hundreds of years, and bugger me if it hasn't IMPROVED with age! (er, by that I mean it HAS...) I was a bit like the Sean Astin character when I was at school. If only I'd had a caveman of my own to help me pull chicks, how differently things might have turned out... Okay, so the movie has no basis in reality, but who would expect it to? Cavemen aside, it's a TEEN movie, and they NEVER depict real people or situations. At least, not on any planet I've ever been to. This movie doesn't pretend to be anything outstanding. It's intended purely as entertainment, and that's what it is. It appears to have been promoted as one of those frightful \"Pauly Shore movies\", but it's not. He's really just a supporting player (and is nowhere near as annoying in small doses, it turns out). This is Brendan Fraser's flick. If anyone else had played Link, I can't imagine the movie being as good as it is. My one beef is that Sandra Hess (\"Cave Nug\") wasn't given enough screen time (but then, as far as I'm concerned, she's NEVER given enough screen time). I never knew Scatterbrain had covered \"Mama Said Knock You Out\", either. That's cool. Okay, I'm going for a lie down now. Bye.",
         "Excellent light hearted comedy with Brendan Fraser giving an excellent performance and well supported by Pauly Shore. Brendan seems to handle these caveman type roles well, see George of the Jungle, Monkeybones. Good family fun.",
         "I have loved California Man for a long, long time. Pauly Shore has got to be the favourite, and with his own added 'unique weasel' it just makes the film for me. It seems this is where Brendan Fraser started his usual 'big, dumb, lovable' characters, but still he plays it to perfection. Sean Astin is quite cute in it, but doesn't add that much to the film. My favourite scene has to be when Stoney and Link go to the Mountain and 'beat up' a guy in a panda costume. Classic. Of course there's a corny ending but it wouldn't be a teenage feel good movie otherwise. Do yourself a favour - watch this movie and have a right good laugh.",
         "Encino man is brilliantly witty and funny and sums up an era, Fraser is adorable as Link and Pauly Shores humour keeps you giggling throughout the duration of the movie. It's one to watch. It certainly shows the typical life of the early 90's teen, trying to be cool and realising life ain't about that.",
         "I expected the usual stoner-gross-out-high-school-comedy and had also heard that Pauly Shore was a comedic one-trick-pony (I'd read about all those Razzies he had been awarded). Also, the premise of high-school kids finding a thawed-up \"cro-magnon\" man and becoming friends with him didn't bide well, so I kind of watched this out of completism and deep-rooted cinematic masochism. Turns out I was way off the mark. \"Encino Man\" is thoroughly enjoyable, and one of the best movies of its genre. And Pauly Shore is my god now, he really made this movie. Well, he may be a one-trick-comedian, but at least at he's the godfather of this one trick. The stoner-surfer-dude has been done ad nauseam in high-school comedies, but Pauly Shore is the stoner-surfer-dude to rule all other stoner-surfer-dudes. His figure is not just funny and dude-ish, but also eccentric and frail (almost a bit camp). When I read that he comes from a family of comedians, I wasn't surprised. I see a lot of comedic and dramatic talent in him, and it's a shame that he seems to have fallen out of favour recently. Anyway, the movie. Luckily, the pretty goofy plot doesn't put it in harm's way. Two likable social dropouts find a stone age survivor in their back yard, and decide to smuggle him into their school in order to heighten their own peer standing. This goes terribly awry when the hunky pre-human becomes a hit with the ladies. Man seems to be set in atavistic struggle against pre-human (and stoner dude), but luckily they eventually find their moral bearings: the humans learn the benefits of sticking together from their thawed-out friend, and the cro-magnon learns to go \"halfies\" on his microwave burrito. Like I said, I really enjoyed Pauly Shore here. He made this movie. The other actors are also good, there's great dialogue, and the babes are babe-alicious. I also enjoyed the fact that the underdogs were the protagonists here. To give you a ballpark comparison, it's au pair with Ferris Bueller's Day Off. Yes, it's that good, buuuh-dy."
      ],
      "genres": [
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": [
         "Encino Man Productions",
         "Hollywood Pictures"
      ],
      "summaries": [
         "Stoney and Dave find a caveman (Link) trapped in ice, thaw him out, and show him around town. Although Link is slow to catch on to basic concepts of 20th century life, he has no trouble impressing all the girls and helping Stoney and Dave find the coolness they've been searching for.",
         "Dave Morgan and Stoney Brown are two high school outcasts who, while digging in Dave's backyard for a swimming pool, find and thaw out a block of ice containing a man from the Ice Ages. Dave and Stoney try to pass him off as a regular teenager and Link becomes seriously popular at school and this causes Dave and Stoney to become popular in the process. But Matt Wilson, the school's most popular guy, after being pissed at Dave and Stoney for getting friendly with his girlfriend Robyn Sweeney, discovers Link's real identity and it's a question if whether anyone will believe his story that Link is really from the Ice Ages.",
         "When they find a frozen cave-man in their back yard, two high-school outcasts thaw him and introduce him to modern life while he in turn gets them to actually enjoy life."
      ],
      "budget": 0
   },
   "movielensId": 3243,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1992-05-22",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Les Mayfield"],
      "runtime": 88,
      "movieId": 3243,
      "title": "Encino Man",
      "mpaa": "PG",
      "actors": [
         "Sean Astin",
         "Brendan Fraser",
         "Pauly Shore",
         "Megan Ward",
         "Robin Tunney",
         "Michael DeLuise",
         "Rose McGowan",
         "Erick Avari",
         "Michole Briana White",
         "Patrick Van Horn",
         "Dalton James",
         "Rick Ducommun",
         "Jonathan Ke Quan",
         "Mariette Hartley",
         "Richard Masur",
         "Sandra Hess"
      ],
      "imdbMovieId": "0104187",
      "originalTitle": "Encino Man",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["1xkTN1Z1rTQ"],
      "plotSummary": "High school misfits Stoney and Dave discover a long-frozen primeval man from the past in their back yard. But the thawed-out Link, as the boys have named him, quickly becomes a wild card in the teens' already zany Southern California lives. After a shave and some new clothes, Link's presence at school makes the daily drudgery a lot more interesting.",
      "tmdbMovieId": 10406,
      "avgRating": 2.59955,
      "releaseYear": "1992",
      "numRatings": 2883,
      "posterPath": "/xSjdE12wXgdJwX3mvGAniNFMbTi.jpg"
   }
}