{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cheerleader",
            "id": 2920
         },
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "dating",
            "id": 13043
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "fashion",
            "id": 15479
         },
         {
            "name": "unlikely friendship",
            "id": 167982
         },
         {
            "name": "valley girl",
            "id": 177303
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "cliques",
            "id": 197077
         },
         {
            "name": "teenage mortality",
            "id": 197110
         }
      ],
      "imdb_id": "tt0103893",
      "video": false,
      "title": "Buffy the Vampire Slayer",
      "recommendations": [
         1649,
         10406,
         14361,
         12158,
         11814,
         8866,
         11967,
         11377,
         11630,
         14367,
         10442,
         1648,
         10859,
         11597,
         10631,
         11584,
         9409,
         10057,
         11980,
         10019
      ],
      "backdrop_path": "/sEx5TxWlWynwZrqqXdPKbKJXQHl.jpg",
      "revenue": 16624456,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Buffy Summers",
               "gender": 1,
               "credit_id": "52fe43429251416c75009819",
               "name": "Kristy Swanson",
               "profile_path": "/wxLklfVHTuVg3O7XT4vBpgzc0Tm.jpg",
               "id": 56128,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Merrick Jamison-Smythe",
               "gender": 2,
               "credit_id": "52fe43429251416c7500981d",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Amilyn",
               "gender": 2,
               "credit_id": "52fe43429251416c75009821",
               "name": "Paul Reubens",
               "profile_path": "/qiY2maQ1iFnoaUiGNGLTKnaj3Xu.jpg",
               "id": 5129,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lothos",
               "gender": 2,
               "credit_id": "52fe43429251416c75009825",
               "name": "Rutger Hauer",
               "profile_path": "/2x1S2VAUvZXZuDjZ4E9iEKINvNu.jpg",
               "id": 585,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Oliver Pike",
               "gender": 2,
               "credit_id": "52fe43429251416c75009829",
               "name": "Luke Perry",
               "profile_path": "/78TAr0wLoRHyubnYxjyHNCt70V2.jpg",
               "id": 8395,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Kimberly Hannah",
               "gender": 1,
               "credit_id": "52fe43429251416c7500982d",
               "name": "Hilary Swank",
               "profile_path": "/zVM2gbZhuipISCoALn6iEN1bmop.jpg",
               "id": 448,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Jennifer",
               "gender": 1,
               "credit_id": "52fe43429251416c75009855",
               "name": "Michele Abrams",
               "profile_path": "/4Kxi2i3TRj6EGzCoGsodDawd9K0.jpg",
               "id": 77012,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Benny",
               "gender": 2,
               "credit_id": "564e45659251414b010008d1",
               "name": "David Arquette",
               "profile_path": "/p5l4pnL9xhbHiKSipcdsCekoD52.jpg",
               "id": 15234,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Cassandra",
               "gender": 1,
               "credit_id": "564e4571c3a368070a00090f",
               "name": "Natasha Gregson Wagner",
               "profile_path": "/g4k8hwH33fbFbCJGzaV57YujCvV.jpg",
               "id": 3270,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Zeph",
               "gender": 2,
               "credit_id": "564e457dc3a368070d00091f",
               "name": "Thomas Jane",
               "profile_path": "/xAES23Ll0JT0lJADA1SIdTAN0bf.jpg",
               "id": 11155,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Charlotte",
               "gender": 1,
               "credit_id": "564e458d9251414afd0008e6",
               "name": "Ricki Lake",
               "profile_path": "/y0nbFpKzWKLkziM9rZYYRUqciyn.jpg",
               "id": 70233,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Basketball Player",
               "gender": 2,
               "credit_id": "564e45959251414b07000afa",
               "name": "Ben Affleck",
               "profile_path": "/lowyjtC3tZcNEGrxCGoEwjqgdvk.jpg",
               "id": 880,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Gary Murray",
               "gender": 2,
               "credit_id": "576c8c47c3a36830b80006d5",
               "name": "Stephen Root",
               "profile_path": "/sceCvLiv8xe2jQzrVn39wvosVHG.jpg",
               "id": 17401,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Grueller",
               "gender": 2,
               "credit_id": "576c8c659251411519001799",
               "name": "Sasha Jenson",
               "profile_path": null,
               "id": 58000,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Buffy's Mom",
               "gender": 1,
               "credit_id": "576c8c7ec3a3682f640006bd",
               "name": "Candy Clark",
               "profile_path": "/6pGZGgHa09ktPwEcFWNAU3PLFdi.jpg",
               "id": 12407,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe43429251416c75009833",
               "name": "Fran Rubel Kuzui",
               "profile_path": null,
               "id": 64170,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43429251416c75009839",
               "name": "Howard Rosenman",
               "profile_path": null,
               "id": 47054,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43429251416c7500983f",
               "name": "Joss Whedon",
               "profile_path": "/dTiVsuaTVTeGmvkhcyJvKp2A5kr.jpg",
               "id": 12891,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43429251416c75009845",
               "name": "Carter Burwell",
               "profile_path": "/feAqzRbewe6r2icciqiTeaqzTm4.jpg",
               "id": 1225,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43429251416c7500984b",
               "name": "James Hayman",
               "profile_path": "/fltytRzN7oNYxYOyCiEMMfeRBzE.jpg",
               "id": 64171,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe43429251416c75009851",
               "name": "Jill Savitt",
               "profile_path": null,
               "id": 17766,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 11.726762,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10206,
      "vote_count": 248,
      "budget": 7000000,
      "overview": "Blonde, bouncy Buffy is your typical high school cheerleader-- her goal is to \"marry Christian Slater and die\" and nothing gets in her way when it's time to shop. But all that changes when a strange man informs her she's been chosen by fate to kill vampires. With the help of a romantic rebel, Buffy is soon spending school nights protecting L.A. from Lothos, the Vampire King, his sidekick. Lefty and their determined gang of bloodsuckers. It's everything you'd expect from a teen queen in the Valley.",
      "similar": [
         15037,
         376660,
         43923,
         133805,
         49017,
         112160,
         76492,
         2108,
         8193,
         315635,
         272693,
         8363,
         449176,
         346672,
         3597,
         9603,
         10625,
         9880,
         16723,
         26123
      ],
      "original_title": "Buffy the Vampire Slayer",
      "runtime": 86,
      "poster_path": "/r0feHChsxNVMpqwT6Wk9GIJxs2n.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sandollar",
            "id": 23236,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kuzui Enterprises",
            "id": 2516,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1992-07-24",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "She knows a sucker when she sees one.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Fran Rubel Kuzui"],
      "runtime": 86,
      "synopsis": "\"Since the dawn of man, the vampires have walked among us, killing and feeding. The only one with the strength or skill to stop their heinous evil is the slayer, she who bears the birthmark, the mark of the coven. Trained by the watcher, one slayer dies and the next is chosen.\" In 1992 Los Angeles, the new vampire slayer is cheerleader Buffy [Kristy Swanson]. Three bodies have been found with \"really gross hickies\" on their necks. It takes Merrick the Watcher [Donald Sutherland] some time, but he finally convinces Buffy that she is indeed the chosen one. When Merrick is killed by the master Lothos [Rutger Hauer] and Buffy links up with nerdy Pike [Luke Perry], she realizes how serious the vampire business really is. Things come to a head when vampires crash the senior prom.",
      "writers": ["Joss Whedon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0103893/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMTkyNTc2MF5BMl5BanBnXkFtZTcwMDQ4ODAwMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kristy Swanson, Donald Sutherland, Paul Reubens | See full cast and crew »"],
      "reviews": [
         "Buffy the vampire slayer is not a terrific film. It is not the type of cinema that leaves you breathless and reeling, nor is it the type of cinema that idles at first creeps through your dreams with pervasive intensity. No, this is Time Capsule Cinema, a voyage to the neon panoply of early 90's California in the self described \"Lite Age.\" Kristy Swanson is lovely as the wise cracking eponymous star, nicely alternating between clinical sarcasm and tenderness in what is, essentially, a limited role. Donald Sutherland and Rutger Howard are hilarious as ancient figures who just happen to be hip to the slangy nature of late 20th century teen dialog. Luke Perry, David Arquette and Hillary Swank (far from her best role, but my favorite film of hers!) and a few others are fine as the assemblage of irreverent teenagers, eye rolling to the max! A highlight of the film is Stephen Root, playing the principal, regaling Buffy with a cautionary tale of his experiences with LSD in the 60's...\"I was at a Doobie Brothers concert...\" Oh, and by the way, that's PEE WEE FREAKIN HERMAN as the fanged creep Lefty. Boy he got outta jail just soon enough. Paul Ruebens is phenomenal, of course, and it may be his presence that allows me to shamelessly enjoy the rest of the film through my rose colored glasses of guilty nostalgia! Too many serious films reek of Los Angeles- you can almost taste the soy burgers and smog- when they take place elsewhere. This makes it difficult to differentiate the cast of actors from the characters they are paid to represent. This film revels in LA's lack of charm and sophistication. I half expected an In-N-Out Burger commercial to pop up half way through. Not enough comedies are as unselfconscious as this one, content to poke fun at themselves till the vampires come home! 7*/10 CAMPY FUN",
         "First off I have to say my review of this movie may be somewhat coloured by my adoration of the television series. Despite sharing a few superficial elements - a character called Buffy who slays vampires and who has a watcher - the two are quite distinctive (even if Joss Whedon penned them both). \"Buffy\" here is very much played with a tongue-in-cheek. It's Clueless meets Dracula. Buffy and her cohorts are shallower than an evaporated puddle and Buffy can only learn to grow up when heaped with the responsibility of being the Chosen One, destined to slay vampires. The vampires in question are just people with white faces played up in quite a camp manner and bare little resemblance to the sharp, wise, smart vampires favored by both the TV series and other movies. There's no acting of any note and the plot is wet-paper thin. The direction isn't memorable... so what stops the movie getting a 0 or a 1? The humour. The movie is played for laughs, taking a bit of a dig at pop culture and vampire lore. There's some great lines in it - particularly the \"kill him A LOT!\" line. Watch the coach at the basketball game for similar humour, and there is an unforgettable vampire staking towards the movie end that's very amusing. The movie looks like it was shot on a shoe-string budget (adding to the camp tongue-in-cheek parody feel) and has none of the production values we'd see Whedon employ later on. What it does have is a sometimes very amusing line in black humour offset somewhat by an irritating need to follow the \"Clueless\" mould of teenagers (which was, admittedly, the trend at the time). It's not an awfully bad movie but it's not really all that good. In the end it's a 5.5/10 from me.",
         "I loved this movie. I'd seen it waaaaay before the series was a twinkle in anyone's eye. This film is built for total entertainment and some of the dialog is the best around just because it is so ridiculous. When the series started, I couldn't believe it was soo dark and brooding. I figured I'd never watch it because it was not faithful to the movie. Well, I did start watching it and now I can say I get great satisfaction out of both Buffy entities. For those of you who are avid (or rabid) viewers of the series and are thinking about watching the movie beware that it is absolutely NOTHING like the series. If you are hoping for something that is like the TV series, you are bound for disappointment. Just let go of your expectations and you will find lots of humor and pleasantness in Buffy (the movie). And remember....Pike's not a name....it's a fish.",
         "I can't believe other reviewers called this moving \"boring and idiotic\". Um...hello...what were they expecting, a serious, contemplative piece of cinema? It's completely silly, as it's supposed to be. If it wasn't good, would it have inspired a (far inferior, in my opinion) television spin off? Watch it with no expectations. You'll be impressed. Kirsty Swanson does that Alicia Silverstone in \"Clueless\" thing perfectly. My friends and I have made it a ritual to watch this movie every couple months with a bottle of wine and a big bowl of popcorn. Nothing better on a rainy night. Don't listen to the bozos who said this isn't worth seeing. It's hilarious, trust me.",
         "This is a terribly fun movie. The acting is deliberately over the top and does quite well. Everyone from Swanson to Perry to Reubens to Stephen Root does an excellent job. I don't understand people who didn't like this - it's simply fun.",
         "Buffy the Vampire Slayer is an instant campy classic. Of course, it does not measure up to the series that followed-- to compare them would be like comparing apples and oranges. The movie was funny and had a lot of slapstick comedy, while the series is dark and contains dark humor. Luke Perry and Kristy Swanson rock as a couple and Donald Sutherland is classic in his role as \"Merrick\". Buffy-the movie- makes us all wish we were vampire slayers with special strength and abilities. The Chronicler's Caves, home of Buffy the Vampire Slayer.",
         "I am a big fan of all movies that portray ditzy blonds as the heroes, showing the world just how much we can do! I really enjoyed Buffy, especially since I am not a big horror fan and this movie lightened the scare with humor! I think that Kristy Swanson is a great heroine for bumbling blonds! She is a modern day Jean Arthur!",
         "This is one of my favorite movies. It's full of extremely clever one-liners that I never get tired of. \"Oh, yeah? Clap!\" The main character acts like a brainless bimbo but, if you pay attention, the movie gives you subtle hints she's a lot smarter than she lets on. Acting brainless is a little social camouflage so she fits in with her airhead friends. It's fun to watch everyone playing it way over the top: Rutger Hauer is the perfect creepy head vampire, Paul Reubens seems to relish his role as the main vampire henchman, and Donald Sutherland delivers yet another quirky performance in a career full of quirky performances. Oh, and watch for a fairly obvious continuity error about, maybe, halfway through.",
         "This movie was meant to be funny not serious and dark. It is great for a few laughs provided you keep an open mind. Paul Reubens has one of the best death scenes. It is hilarious. Joss Whedon has made his apologies for the film and has made up for it. If you want good, serious and a bit dark watch the Buffy TV show.",
         "underrated action/comedy: witty, intelligent, nuanced humor in the writing and acting. Lest people forget, this was an early entry in the no-longer-waiting-for-her-prince, newly-empowered, women-who-can-kick-butt genre ....full of satire and irony for the non-literal viewer.....truly delightful!"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": [
         "Twentieth Century Fox Film Corporation",
         "Kuzui Enterprises",
         "Sandollar"
      ],
      "summaries": [
         "Buffy Summers has the lifestyle any young woman could want. Cheerleading, dating the captain of the basketball team, and copious amounts of time spent shopping with friends. She had no idea of her true calling until a mysterious man named Merrick approached her and told her that she is the Slayer; one woman called to defend the world from vampires. Reluctant to concede to the fact, Buffy soon learns that Merrick speaks the truth and so begins to take her new life seriously while trying to maintain the sense of normality her life had once been. With her best friends slowly abandoning her, Buffy finds solace in the town outcast, Pike, who knows very well the terrors that have arisen. Together, they combat the forces of the old and powerful vampire, Lothos, who has his eyes set on Buffy.",
         "Buffy thinks very highly of her keen fashion-sense. In fact, fashion, cheerleading, movies and parties are all she ever thinks about. Then one day, Merrick approaches her; telling her she has a specific mission in life - killing vampires. What good is her \"keen fashion-sense\" in her new daily tasks?",
         "Buffy is an air-head cheerleader who is chosen by a guy named Merrick to fend the world of Vampires. When Merrick first informs Buffy that she is the \"chosen one,\" she thinks he's crazy, but then strange things begin to happen. First, Buffy's friend Cassandra and many other kids form her school turn up missing and are later found \"dead\" with bite marks on their necks. After many other strange ocurrences, Buffy then realizes that those bite marks were made by vampires, and that they really are out there. She comes to to horrifying truth that she is the \"chosen one.\"",
         "Buffy is a bimbo! She shops and shops and, well, shops! That is until one day she comes across a man who informs her that she is the chosen one!!! She has been chosen to kill vampires and must now train to do so! With the help of her instructor he learns the kicks, moves and attitude essential to any vampire killer. With the help of her friend, Pike (played by Luke Perry) she defeats the master vampire and saves the planet....",
         "A flighty teenage girl learns that she is her generation's destined battler of vampires."
      ],
      "budget": 7000000
   },
   "movielensId": 3264,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-07-24",
      "dvdReleaseDate": "2001-09-04",
      "directors": ["Fran Rubel Kuzui"],
      "runtime": 86,
      "movieId": 3264,
      "title": "Buffy the Vampire Slayer",
      "mpaa": "PG-13",
      "actors": [
         "Kristy Swanson",
         "Donald Sutherland",
         "Paul Reubens",
         "Rutger Hauer",
         "Luke Perry",
         "Hilary Swank",
         "Michele Abrams",
         "David Arquette",
         "Natasha Gregson Wagner",
         "Thomas Jane",
         "Ricki Lake",
         "Ben Affleck",
         "Stephen Root",
         "Sasha Jenson",
         "Candy Clark"
      ],
      "imdbMovieId": "0103893",
      "originalTitle": "Buffy the Vampire Slayer",
      "genres": [
         "Action",
         "Comedy",
         "Horror"
      ],
      "youtubeTrailerIds": ["pnZkV_aR_9w"],
      "plotSummary": "Blonde, bouncy Buffy is your typical high school cheerleader-- her goal is to \"marry Christian Slater and die\" and nothing gets in her way when it's time to shop. But all that changes when a strange man informs her she's been chosen by fate to kill vampires. With the help of a romantic rebel, Buffy is soon spending school nights protecting L.A. from Lothos, the Vampire King, his sidekick. Lefty and their determined gang of bloodsuckers. It's everything you'd expect from a teen queen in the Valley.",
      "tmdbMovieId": 10206,
      "avgRating": 2.91329,
      "releaseYear": "1992",
      "numRatings": 5559,
      "posterPath": "/r0feHChsxNVMpqwT6Wk9GIJxs2n.jpg"
   }
}