{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "egypt",
            "id": 1160
         },
         {
            "name": "pyramid",
            "id": 1949
         },
         {
            "name": "wonderlamp",
            "id": 4894
         },
         {
            "name": "treasure hunt",
            "id": 6956
         }
      ],
      "imdb_id": "tt0099472",
      "video": false,
      "title": "DuckTales: The Movie - Treasure of the Lost Lamp",
      "recommendations": [
         11135,
         9994,
         15789,
         4978,
         11319,
         11497,
         10380,
         12233,
         12144,
         12335,
         15969,
         9078,
         10948,
         14813,
         15947,
         46929,
         9369,
         9929,
         10957,
         11360
      ],
      "backdrop_path": "/k0DpC04G7tHanxDGdNksxvSH63A.jpg",
      "revenue": 18115724,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Scrooge McDuck",
               "gender": 2,
               "credit_id": "52fe43bf9251416c7501c927",
               "name": "Alan Young",
               "profile_path": "/n7JSQURI4ldcPXViQVkLpdhM6q2.jpg",
               "id": 21874,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Launchpad",
               "gender": 0,
               "credit_id": "54440598c3a3683e0e005720",
               "name": "Terence McGovern",
               "profile_path": "/85ceNcXJd4XE0elNSxzHVCCKwuV.jpg",
               "id": 162323,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Huey Duck / Dewey Duck / Louie Duck / Webbigal \"Webby\" Vanderquack",
               "gender": 1,
               "credit_id": "52fe43bf9251416c7501c933",
               "name": "Russi Taylor",
               "profile_path": "/3rfnBDgLRc7CjoIw9bGRBlDXxMf.jpg",
               "id": 6035,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dijon",
               "gender": 2,
               "credit_id": "52fe43bf9251416c7501c937",
               "name": "Richard Libertini",
               "profile_path": "/yPJRC8N0ITxLuJzIbIDeGgT6lz6.jpg",
               "id": 20163,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Merlock",
               "gender": 2,
               "credit_id": "52fe43bf9251416c7501c92f",
               "name": "Christopher Lloyd",
               "profile_path": "/iQzG9apaIsHnn7iGrer3YEDp8Zo.jpg",
               "id": 1062,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Mrs. Featherby",
               "gender": 1,
               "credit_id": "5444054ac3a3683e0b005651",
               "name": "June Foray",
               "profile_path": "/rb4iVQ5kP6m138i7CME4Uw5fzc7.jpg",
               "id": 15098,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Duckworth",
               "gender": 2,
               "credit_id": "544407240e0a26633a00596d",
               "name": "Chuck McCann",
               "profile_path": "/vRsH2ZDfrrXe8ldfsUpd5qqTx2t.jpg",
               "id": 88450,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Mrs. Beakley",
               "gender": 1,
               "credit_id": "544407340e0a26633d0058d2",
               "name": "Joan Gerber",
               "profile_path": "/bu3rNMpcxoptlBlKi1xNoxCEhn.jpg",
               "id": 90301,
               "order": 7
            },
            {
               "cast_id": 2,
               "character": "Genie",
               "gender": 2,
               "credit_id": "52fe43bf9251416c7501c92b",
               "name": "Rip Taylor",
               "profile_path": "/6ruuuoWklaWQyHcJNMcbpaJxKDR.jpg",
               "id": 37438,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Additional Voices",
               "gender": 2,
               "credit_id": "54467e55c3a3683e0500af6b",
               "name": "Charlie Adler",
               "profile_path": "/eSZtf1oCn8PY3VEBclD7VkCEWS.jpg",
               "id": 81178,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Additional Voices (voice)",
               "gender": 1,
               "credit_id": "59f54b4f9251414282005d41",
               "name": "Sherry Lynn",
               "profile_path": "/kQDSC2z7sb6S5HcpOH6cmeJokKE.jpg",
               "id": 214701,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Additional Voices (voice)",
               "gender": 0,
               "credit_id": "5aaf50b10e0a26658801fb5c",
               "name": "Mickie McGowan",
               "profile_path": "/k7TjJBfINsg8vLQxJwos6XObAD6.jpg",
               "id": 84493,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Additional Voices (voice)",
               "gender": 2,
               "credit_id": "5ab41d880e0a265f2a012b0b",
               "name": "Jack Angel",
               "profile_path": "/qYvR57QBtXpdvj1jm2a8hjh7E4L.jpg",
               "id": 19545,
               "order": 12
            },
            {
               "cast_id": 26,
               "character": "Additional Voices (voice)",
               "gender": 2,
               "credit_id": "5ab726380e0a261feb015b93",
               "name": "Frank Welker",
               "profile_path": "/b3gImArbw13mMKJIe9leFc9YYb7.jpg",
               "id": 15831,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43bf9251416c7501c93d",
               "name": "Bob Hathcock",
               "profile_path": null,
               "id": 67056,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43bf9251416c7501c943",
               "name": "Carl Barks",
               "profile_path": "/ouqbuqICPdBxJoCQJBmP3OZaSMm.jpg",
               "id": 34479,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe43bf9251416c7501c949",
               "name": "Alan Burnett",
               "profile_path": null,
               "id": 34936,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe43bf9251416c7501c94f",
               "name": "Bob Hathcock",
               "profile_path": null,
               "id": 67056,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43bf9251416c7501c95b",
               "name": "Charlie King",
               "profile_path": null,
               "id": 67057,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "553a0039c3a3684c5b00468e",
               "name": "David Newman",
               "profile_path": "/vncTIJaBWoYmpdNCPkDnA8hT3PM.jpg",
               "id": 3393,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55257e4792514166c100592a",
               "name": "James Baxter",
               "profile_path": "/dRTLlsnpqDTqfqMJ0OHDUnPaJEY.jpg",
               "id": 1450331,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "55346fe9c3a36848ca005820",
               "name": "Paul Brizzi",
               "profile_path": null,
               "id": 56147,
               "department": "Crew",
               "job": "Sequence Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5543fcc8c3a3680ce6002aaa",
               "name": "Caroline Cruikshank",
               "profile_path": null,
               "id": 1447375,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 7.984524,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 10837,
      "vote_count": 262,
      "budget": 0,
      "overview": "Scrooge McDuck, his dimwitted pilot Launch Pad, and his newphews Huey, Dewey and Louie, with Webby, arrive in Egypt where Scrooge finds the lost treasure of Collie Baba, unbeknownst to Scrooge, a magic lamp was included inside the treasure, so while the nephews have fun with the genie, they all have no idea that they're being stalked by a power hungry sorceror named Murlock and his dimwitted thief.",
      "similar": [
         564,
         1996,
         85,
         9326,
         9838,
         10303,
         1995,
         9710,
         87,
         2059,
         6637,
         89,
         217,
         1734,
         17578,
         1735,
         9016,
         18,
         691,
         9837
      ],
      "original_title": "DuckTales: The Movie - Treasure of the Lost Lamp",
      "runtime": 74,
      "poster_path": "/dPikP4LLcw2JV2LSBKKVtcl5d4v.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/jTPNzDEn7eHmp3nEXEEtkHm6jLg.png",
         "name": "Walt Disney Television Animation",
         "id": 3475,
         "origin_country": "US"
      }],
      "release_date": "1990-08-03",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Scrooge McDuck's First Full-Length Animated Feature Film.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bob Hathcock"],
      "runtime": 74,
      "synopsis": "Scrooge McDuck, his nephews (Huey, Dewey & Louie), Webby, and Launchpad McQuack are off to search for the lost treasure of Collie Baba and his Forty Thieves. At an excavation site, what should be the treasure, appears to be a bunch of rags and whatnot. However, hidden among them, is a map. As Scrooge examines it, one of the diggers disappears. The digger, Dijon, reports to his master, an evil wizard named Merlock, who has been seeking Collie Baba's treasure, since it contains a magic lamp with a genie inside. Merlock has promised Dijon (who is also a bumbling thief), his own mountain of gold if he obtains the lamp. Scrooge and the others set out to find the treasure, and come across a miniature pyramid. However, it turns out it is the tip of an enormous pyramid that was buried in a sandstorm. After much digging, the pyramid is unearthed, and the group explore inside. After tripping off several traps, they finally discover Collie Baba's treasure. Among them is the lamp, which Scrooge lets Webby have at her request, since he feels it has no value. Dijon is assigned to gather up the treasure in sacks. Unknown to him, the lamp is still in Webby's possession. As he transports the last one, Merlock appears, and sets off another trap, sending Scrooge and his group to a pit of snapping claw-creatures. The group manages to escape out of the pyramid, but Scrooge is upset that his search for Collie Baba's treasure has resulted in nothing. Meanwhile, Merlock has searched through the sacks, and is angered that the lamp is nowhere to be found. Figuring that Scrooge must have it, Merlock transforms into a bird, and flies off towards Duckburg. Back in Duckburg, Scrooge is still in a bad mood having lost the treasure. His secretary, Ms Featherby, shows that he has been invited to a special society part of treasure-seekers, but this supposed good news just further infuriates him, and he heads home. Back at the mansion, Webby is trying to polish her new tea pot (aka the lamp), when it starts hopping around. Suddenly, out of it's spout comes a genie. After talking with Webby and the Nephew, Webby makes the first wish: for a baby elephant. However, the genie chastises her that this can only lead to trouble. As is expected, Mrs Beakley finds out about the elephant and freaks out. One of the nephews wishes the elephant away to keep things under control. Scrooge almost finds out about the genie, but the nephews dress him in street clothes, and say his name is 'G.' After this incident, the group take the genie outside, where they wish for several things, including a miniature train, and a large ice cream sundae. That night, a shadow passing by the nephews' window spooks the genie, causing him to think Merlock has come for him. The genie then explains to the boys about his former master. Merlock was responsible for a number of disasters, including the sinking of Atlantis, and the volcanic explosion of Mt Vesuvius that buried the city of Pompeii. Also in Merlock's possession is a magic talisman, that gives him the ability to have unlimited wishes, as well as change form into any creature he chooses. The nephews assure genie that he'll be safe with them. However, the next day, Merlock and Dijon find Scrooge's mansion. Merlock infiltrates the mansion in the guise of a rat, spooking Mrs Beakley. Meanwhile, Webby also makes another wish, wishing for her stuffed animals to come to life. The mayhem soon creates quite a stir amid everyone, and one of the nephews uses his last wish to return the toys to normal. Though now, Scrooge knows genie's secret, and giddily crows about what he could wish for. Scrooge then wishes for the treasure of Collie Baba, and now in good spirits, decides to attend the societal function, demanding the genie come with him. The nephews and Webby decry this, but Scrooge refuses to listen to their pleas. Scrooge takes off for the function, with Merlock and Dijon following. At the social function, Scrooge happily takes to the stage, but is pulled away by the genie when he spots Merlock in the audience. Both the genie and Scrooge hide from Merlock, who turns into a bear, and then a bird. Once he leaves, Scrooge blames the genie for getting him into this mess. However, the genie tells of what his one wish is, which is to be free and live a life like Scrooge's nephews. Scrooge then tells the genie that they will get him to his vault in the money bin, which should be safe. However, in a mad dash out of the building, Scrooge bumps into a service trolley, and confuses the lamp with a gravy pourer. It is soon after that Dijon finds the lamp and giddily plans to turn it over to Merlock in exchange for the promised mountain of money that he dreams of. Not wanting to be in Merlock's possession, the genie tries to trick Dijon into thinking that he (Dijon) could be his own master. Scrooge and Launchpad take off for Duckburg. Upon arrival, Scrooge is shocked to find that Dijon has taken control of the money bin, and all his assets. The genie explains that he never expected Dijon to wish for Scrooge's fortune, as Scrooge is taken away and locked in jail. Scrooge's family comes to get him out, and they formulate a plan to break into the bin, and get the lamp and genie back. Unknown to them, Merlock has also returned to Duckburg, and has turned himself into a flying roach, following their every move. Scrooge manages to make it to Dijon's residence in the bin, but before he can retrieve the lamp, Merlock appears and takes possession of it. Now in control, his first wish turns Dijon into a squealing pig. His next wish is that the genie transform the bin into a fortress worthy of him. Against the genie's wishes and to the shock of Scrooge, the bin is transformed into a twisted, mountainous castle. Once the transformation is complete, Merlock wishes that his 'new home' be transported back to the desert where he lived. Scrooge angrily demands that Merlock stop what he's doing, only to have the sorcerer wish for Scrooge to be cast out of his home. The genie, against his own will, causes a violent wind storm meant to blow Scrooge off the castle, which is now several miles up in the air. As Merlock laughs, the nephews and Webby use the opportunity to knock the lamp out of his hands. One of them throws it to Scrooge, who misses it, and goes over the edge. Merlock turns into a griffin, and flies after the lamp. Upon claiming it, Scrooge scuffles with the sorcerer, who loses his talisman in the fight. Without it, Merlock returns to human form, and falls to his death. Scrooge manages to obtain the lamp, and wishes for his family and the bin to be returned to Duckburg. Back in Duckburg, Scrooge is overjoyed to have his fortune back, but realizes that he still must contend with the lamp. To prevent the lamp from falling into the wrong hands, Scrooge wishes for genie to become a real boy. Now that he's a real boy, the lamp disintegrates, and genie runs off to play with the nephews and Webby. Meanwhile, Scrooge goes to take a swim in his money bin, only to find Dijon (turned back from a pig because of Scrooge's wish to free the genie) making off with part of his fortune. Dijon high-tails it out of Scrooge's bin carrying off some of his fortune, as Scrooge then gives chase.",
      "writers": ["Alan Burnett"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0099472/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MDY0Mjg5MF5BMl5BanBnXkFtZTYwMzAxNTg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Alan Young, Christopher Lloyd, Terence McGovern | See full cast and crew »"],
      "reviews": [
         "I recently watched the \"DuckTales\" movie again, because it was a slow evening, and I still have fond memories of the series since its inception in '86. I think that's why I watched the movie all the way through. Don't get me wrong, the first (and only) Disney Movietoon isn't bad as far as films go. There were just a few things that didn't sit well with me, namely the animation. It was a step beyond television animation and a step below feature film animation. The result was better use of shading and lighting, but wasn't nearly as fluid as say, \"Aladdin\", \"Beauty and the Beast\" or any of Disney's other films during the early '90's. The soundtrack didn't really detract or enhance the film, but the show's theme provided a snappy, upbeat tune to end the film with. The story itself wasn't bad, but some of the 30-minute shows seemed to have more interesting plots and faster pacing. That, and the \"wacky Genie\" schtick was done much better two years down the road with Robin Williams in \"Aladdin\". What really pulled this film through was the voice cast from the series, as they know their characters, and that's apparent. The film wisely kept its cast exclusively to the show's main characters, the genie, and the main villain and sidekick, but I got the feeling they should have all been given more to do. As I said before, it's not a bad film, and I don't know if this film will ever be re-issued by Disney, but the main strength of this film lies in how much you like Scrooge McDuck and company. The television show was the best of any of Disney's non-feature animation, and for that reason, it kept me through the film until final credits.",
         "Okay, it is true that the graphics of this movie are not as good as those of the 1990s Disney classics, but still, despite that it is a nice movie. The beginning, I mean the treasure hunt is typical of earlier Ducktale cartoons - adventures in some ancient land. The rest is a modernised adaptation of the story of Aladdin. It is quite gripping for kids, and adults are bound to like it too. The best thing about it, I think, is that the adventure starts away from home but it ends up at Duckberg. Fantasy plays a large role as with all Disney cartoons. Enjoyable.",
         "I still remember seeing this at the theater with my grandparents and two younger siblings in 1990. I liked the story of the McDucks trying to find the treasure, and I really liked the genie. I think that this is a great film for the kids to watch. Who knows, maybe you'll enjoy it too!",
         "In this tale, which is roughly based on Ali Baba lore, we find Scrooge McDuck and his nephews on the trail of a magic lamp. Also on the trail is Merlock the Magician (voiced by Christopher Lloyd of 'Back to the Future'.) The film has a slight resemblance to the likes of Indiana Jones and Disney's own later film series of 'Aladdin' and 'Aladdin and the King of Thieves'. Based primarily on the television series of the same name, 'DuckTales' and created by the brand new (at the time) Disney Toon Studios and released theatrically in 1990, this is a timeless film that children and adults will both enjoy. The only downfall for those who love this film is that the only DVD release (so far) has been through the Disney Movie Club. So delightful, I gave it 10/10!",
         "\"Duck Tales: The Movie\" is a great movie. I've always loved it. It's basically a 74-minute episode of \"Duck Tales\" with some classic Disney magic mixed in. If you haven't seen the movie, I recommend you do; I find it to be suitable for kids and adults equally. If you haven't watched the movie before, then (as Strong Bad would say) I recommend the faint of heart and the faint of butt to stop reading this review, for it might spoil the magic for those who want to be surprised. The movie starts with Scrooge McDuck and his nephews along with Launchpad and Webby out in Egypt looking for the treasure of Collie Baba, a famous thieve. When they find it, they find out that their guide, Dijon, turned out to be the little sidekick of an evil sorcerer named Merlock who steals the treasure from Scrooge leaving him empty-handed. Little did Scrooge know, Webby managed to keep from the treasure a lamp, which she had mistaken for a teapot. While polishing it, she and Huey, Dewey and Louie unveiled the genie of the lamp that they become friends with, as well as his new masters. The four kids each got three wishes; Webby makes all these crazy wishes, which causes one of the boys to waste one of their wishes to wish them back. After the kids use up all their wishes, Scrooge finds out about the genie and becomes his new master. What the family didn't know much about was that the genie's meanest master was still out looking for him. Even though, it has been centuries, he's still out there looking for him due to his wish for immortality. The genie accidentally stumbles onto Dijon, who becomes his new master and wishes to take over Scrooge's money bin. Unluckily for Dijon, Scrooge knew exactly how to trigger all the alarms in his bin, so he planned to invade it with the kids. However, Merlock manages to sneak in too, and he beats Scrooge to the lamp and wishes for his money bin to transform into a sky fortress. Scrooge manages to steal the lamp back and makes his last two wishes. This was just a very well made movie. Rip Taylor did an unbelievable job as the voice of the genie. The same thing goes for Christopher Lloyd as Merlock. This film is highly recommended by me for Duck Tales fans and even Duck Tales haters! If there was a special edition DVD of this movie, I'd get it!",
         "After the series has come to an end, Disney found it so successful that they have made a movie version of it; it is called \"DuckTales: The Movie - Treasure of the Lost Lamp,\" and it was an animated film made in 1990 from Disney MovieToons, a very short lived division of the Disney company (at least for its time; there, of course, was \"Teacher's Pet: The Movie,\" but it is nothing as good as this!!!!!) Here, our adventurous gang of Scrooge, Launchpad, Huey, Dewey, and Louie fly out to the desert to find a pyramid, filled with traps and treasure; one of which holds the lamp of the genie!!!!! After they reach home, Huey, Dewey, and Louie are friends with the genie and the fun begins!!!!! I've rented this and seen this on the Old Disney Channel as a kid. Then this was released on DVD in Europe, Australia, and Latin America, and finally, in March or April of 2005, the BAD Disney Channel, for some reason, decided to show this movie. What a treat!!!!! Oh sure, it's on DVD in America now, but only if you're a member of the Disney Movie Club!!!!! Hey, at least it's in 16x9 widescreen!!!!! \"DuckTales: The Movie\" is a great way to wrap up the series; much better than that \"Lizzie McGuire Movie,\" in my opinion!!!!! 10 stars!!!!!",
         "While Disney has not been producing much of high quality animated films these days, few will deny that in the late 1980's and mid 1990's, the Mouse House was in its heyday. After a period of turmoil without their former founder, the company had risen to stardom with its 1989 musical, THE LITTLE MERMAID. The success of that film led to other equally acclaimed masterpieces, notably BEAUTY AND THE BEAST, which was fortunate enough to win the Oscar for Best Picture. In the period between these two works of art, though, the company released two animated features that were pleasant diversions but didn't ignite ticket sales at the box office. One of them was THE RESCUERS DOWN UNDER, a non-musical sequel to a mediocre 1970 film (which actually improved on its predecessor in many ways). The other--and even lesser known--production was DUCKTALES: THE MOVIE--TREASURE OF THE LOST LAMP. An unashamedly small, likable film, DUCKTALES--THE MOVIE did not quack up much box office gold in its theatrical release. Based on Disney's popular animated series of its time, this theatrical feature--as you might expect--plays very much like an extended episode of the series, with slightly beefed up production values. Audiences unfamiliar with the show are most likely to be confused with its unexplained references to terms like \"Junior Woodchuck\"--a problem not uncommon with other theatrical spin-offs of television shows, e.g. THE CARE BEARS, TRANSFORMERS, MY LITTLE PONY, etc. The stars of DUCKTALES, which include self-proclaimed \"quad-zillionaire\" Scrooge McDuck (impeccably voiced by Alan Young) and his mischievous nephews, Hewy, Dewey, and Louie, are household names with many people, but their co-stars--which include bumbling pilot Launchpad McQuack and Webby (Webbigail for you completists)--are only familiar with those who have tuned into an episode or two of the show. This is probably what sealed DUCKTALES--THE MOVIE's box office fate; it caters more to fans of the show rather than a mainstream audience. That said, DUCKTALES--THE MOVIE is a very pleasant way to spend 74 minutes. The film bounces along at a fast pace and maintains a kinetic sense of energy, particularly the opening and climactic sequences. And there's nothing at all about the film that may be deemed too unsettling or inappropriate for children (what, you expected an R-rated material from Disney?). The best way to describe the plot is a mixture of an INDIANA JONES adventure and Disney's own ALADDIN. The first 20 minutes of the movie, in which the ducks--on a hunt for Collie Baba's treasure--find themselves braving a booby-trap infested hidden pyramid and outrunning scorpions, recall the roller-coaster excitement of the aforementioned Spielberg- Lucas series. Things get slightly slower around the middle when the ducks unleash the contents of a magic lamp containing, yes, a genie. Voiced with zest and humor by Rip Taylor, this Genie may not have the adult appeal of, say, Robin Williams' Genie in ALADDIN, but he manages to extract a giggle from the audience without being too over-the-top. His lively presence--and the nephews' dilemma of trying to keep his identity a secret from their miserly uncle--makes it easier to sit through the middle portion. The final 20 minutes of the film, in which Scrooge and company attempt to recapture their money bin from a compulsively greedy weasel, Dijon (Richard Libertini), only to deal with the Genie's former master, Merlock, a centuries old villainous sorcerer with the commanding voice of Christopher Lloyd, builds to a high-flying (literally) climax that I've rarely seen other Disney films match. Based on the above description of the plot, it is tempting to dismiss this movie as an inferior imitation of ALADDIN, particularly where the Genie sub-plot is concerned, but since this movie was made long before that film, it instead holds up as an original story. Technically, DUCKTALES isn't exactly on the same level as, say, THE LITTLE MERMAID or other Disney Renaissance features, but then again it was hardly intended to be. The animation, produced by the now defunct Disney Animation Studios in Paris, is appropriately matched and showcases some spectacularly exciting effects, particularly any moment when Merlock morphs into eagles, rats, bears, cockroaches, panthers, etc., and especially at the climax when Scrooge's money bin is transformed into a creepy-looking castle. Simultaneously, though, the artwork is more \"simplified\" than the usual Disney treatment--not that it is a bad thing for this type of feature, but it's noticeable in places. More pleasing about the film is its kinetic musical score, composed by David Newman (THE BRAVE LITTLE TOASTER and ANASTASIA). This is one of the finest ever written for a Disney film, and it's a shame it hasn't been commercially released on CD. It should also be noted that there are no songs in this film (unless you count the DUCKTALES theme over the closing credits)--this gives DUCKTALES the distinction of being one of Disney's \"songless\" productions (other notable entries including THE BLACK CAULDRON, THE RESCUERS DOWN UNDER, and ATLANTIS--THE LOST EMPIRE). Although not on par with Disney's better classics, DUCKTALES--THE MOVIE: TREASURE OF THE LOST LAMP is a breezy, fun romp that actually holds up pretty well even after its initial 1990 release. It's too bad that Disney reduced themselves to churning out direct-to-video sequels, none of which matched the excitement or energy of this film or even the heart or human appeal of A GOOFY MOVIE, another inspired by a TV series movie. Compared to most of these other pointless secondary chapters, DUCKTALES--THE MOVIE remains fresh, funny, and enjoyable, especially for youngsters and, yes, fans of Disney-cartoons in general.",
         "If you have ever seen the animated series starring Scrooge McDuck and his nephews Huey, Dewey, Louie and Webby ducks, then you'll love this film. tom thumb's Woody, Alan Young as Scrooge McDuck is really good at the Scottish accent, and being a grumpy type of character. Basically Scrooge and the gang are looking for a lost treasure. The only bit they manage to recover (after finding it) is a lamp. This lamp contains a genie. The three nephews and Webby keep Genie (Rip Taylor) secret, but there is both Scrooge, and villain Merlock (Christopher Lloyd) wanting him. A very good cartoon when I was a kid, I used to love the TV series a bit too. Worth watching!",
         "This is a fun movie based on the Disney cartoon Ducktales, a story about Scrooge McDuck and the gang out to search for a magic lamp, with an evil wizard out to get his hands on it as well. I remember watching Ducktales on the Disney Afternoon after I got home from elementary school, and it was one of my favorite cartoon shows. It was great seeing classic Disney characters like Huey, Duey and Louie star in a more modern show to keep up with the times, but still maintaining that special Disney charm. It's equally awesome to see the show making it to the big screen with this movie, and it brought along the show's elements: colorful animation, upbeat music, fun and daring characters and exciting adventures. It's a little on the short side, with a running time of only 74 min. So, the movie may seemed rushed through at times. Other than that, if you love Ducktales, you would love this movie - great fun for the entire family. Grade B+",
         "While this movie feels most like an extended episode from \"Ducktales\" (Only with better animation) that's fine for me, mostly because I love \"Ducktales\" and even when this isn't at the same level of the animated masterpieces done by the Disney company in the nineties (Such as \"The Beauty and the Beast\" or \"The Lion King\") it was certainly something very entertaining and enjoyable to watch. The plot from this movie is very simple, but also funny and very easy to follow, respecting most of the dynamic existent in the characters from the original series, though it is not necessary to watch any episode from \"Ducktales\" to enjoy this. This \"Ducktales\" movie is a perfect complement for the series, and it offers a decent entertainment for the whole family. I highly recommend it."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Disney Television Animation",
         "DisneyToon Studios",
         "Walt Disney Animation France S.A."
      ],
      "summaries": [
         "Scrooge McDuck, his dimwitted pilot Launch Pad, and his newphews Huey, Dewey and Louie, with Webby, arrive in Egypt where Scrooge finds the lost treasure of Collie Baba, unbeknownst to Scrooge, a magic lamp was included inside the treasure, so while the nephews have fun with the genie, they all have no idea that they're being stalked by a power hungry sorceror named Murlock and his dimwitted thief counterpart, Dijon.",
         "Scrooge McDuck, along with his grandnephews Huey, Dewey and Louie, Webby Vanderquack and dimwitted pilot Launchpad McQuack search for the treasure of Collie Baba and his forty thieves. They find a magic lamp and a genie that can grant them all kinds of wishes. Unfortunately, Merlock the Magician wants that lamp, and he and his sidekick, Dijon the Thief, would do anything to get their hands on it.",
         "Scrooge McDuck searches for a magic lamp that holds a genie. But an evil wizard is after it too."
      ],
      "budget": 0
   },
   "movielensId": 33463,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-08-03",
      "dvdReleaseDate": "2006-01-01",
      "directors": ["Bob Hathcock"],
      "runtime": 74,
      "movieId": 33463,
      "title": "DuckTales: The Movie - Treasure of the Lost Lamp",
      "mpaa": "G",
      "actors": [
         "Alan Young",
         "Terence McGovern",
         "Russi Taylor",
         "Richard Libertini",
         "Christopher Lloyd",
         "June Foray",
         "Chuck McCann",
         "Joan Gerber",
         "Rip Taylor",
         "Charlie Adler",
         "Sherry Lynn"
      ],
      "imdbMovieId": "0099472",
      "originalTitle": "DuckTales: The Movie - Treasure of the Lost Lamp",
      "genres": [
         "Adventure",
         "Animation",
         "Family",
         "Comedy",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["0kgjtjdlEkM"],
      "plotSummary": "Scrooge McDuck, his dimwitted pilot Launch Pad, and his newphews Huey, Dewey and Louie, with Webby, arrive in Egypt where Scrooge finds the lost treasure of Collie Baba, unbeknownst to Scrooge, a magic lamp was included inside the treasure, so while the nephews have fun with the genie, they all have no idea that they're being stalked by a power hungry sorceror named Murlock and his dimwitted thief.",
      "tmdbMovieId": 10837,
      "avgRating": 3.40683,
      "releaseYear": "1990",
      "numRatings": 161,
      "posterPath": "/dPikP4LLcw2JV2LSBKKVtcl5d4v.jpg"
   }
}