{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mother",
            "id": 456
         },
         {
            "name": "e-mail",
            "id": 4700
         },
         {
            "name": "man-woman relation",
            "id": 5756
         },
         {
            "name": "single",
            "id": 9457
         },
         {
            "name": "matchmaking",
            "id": 10132
         },
         {
            "name": "suitor",
            "id": 11707
         },
         {
            "name": "relationship",
            "id": 14534
         },
         {
            "name": "single mother",
            "id": 14768
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "moving",
            "id": 18253
         },
         {
            "name": "secret admirer",
            "id": 171612
         },
         {
            "name": "catfishing",
            "id": 219849
         },
         {
            "name": "perfect man",
            "id": 240070
         }
      ],
      "imdb_id": "tt0380623",
      "video": false,
      "title": "The Perfect Man",
      "recommendations": [
         14024,
         10118,
         11247,
         39285,
         18736,
         10025,
         10735,
         11132,
         11025,
         13374,
         13159,
         14844,
         10760,
         13969,
         11137,
         27902,
         9779,
         4599,
         14008,
         10188
      ],
      "backdrop_path": "/6TOm5Y2FkEyzM4CruG9db4JtsIc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Holly Hamilton",
               "gender": 1,
               "credit_id": "52fe466e9251416c75078249",
               "name": "Hilary Duff",
               "profile_path": "/ctUVqYM9tqXlfJFSUS9bvgsKD59.jpg",
               "id": 5958,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jean Hamilton",
               "gender": 1,
               "credit_id": "52fe466e9251416c7507824d",
               "name": "Heather Locklear",
               "profile_path": "/ryFO3TlhGi0mddbHECswjzsiF51.jpg",
               "id": 58691,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ben Cooper",
               "gender": 2,
               "credit_id": "52fe466e9251416c75078251",
               "name": "Chris Noth",
               "profile_path": "/3jcFzNuD9rXu1h9EwMlItNe4PZn.jpg",
               "id": 38026,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lenny Horton",
               "gender": 2,
               "credit_id": "52fe466e9251416c75078255",
               "name": "Mike O'Malley",
               "profile_path": "/9VwiKnQySJN7buvCg53v4NB5Tj7.jpg",
               "id": 87192,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Adam Forrest",
               "gender": 2,
               "credit_id": "52fe466e9251416c7507825f",
               "name": "Ben Feldman",
               "profile_path": "/rkeWzPgcvs8MRF6RMMqJkhZoYBq.jpg",
               "id": 78431,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Amy Pearl",
               "gender": 1,
               "credit_id": "52fe466e9251416c75078263",
               "name": "Vanessa Lengies",
               "profile_path": "/vU4syqfb0PYE9efbBq9YZQu24cY.jpg",
               "id": 52938,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "52fe466e9251416c75078267",
               "name": "Caroline Rhea",
               "profile_path": "/iaRAjnqUMqq6CsIyDpbTpYqWirT.jpg",
               "id": 86905,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Dolores",
               "gender": 1,
               "credit_id": "52fe466e9251416c7507826b",
               "name": "Kym Whitley",
               "profile_path": "/87Zy7o5giRo2SpnhNJSvZRhYJue.jpg",
               "id": 80597,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Zoe Hamilton",
               "gender": 1,
               "credit_id": "52fe466e9251416c7507826f",
               "name": "Aria Wallace",
               "profile_path": "/7sIL9easp2yJG0NmQ32l4QAVeXE.jpg",
               "id": 147477,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Amber",
               "gender": 1,
               "credit_id": "52fe466e9251416c75078273",
               "name": "Michelle Nolden",
               "profile_path": "/a72FYiArZuG0TjYXtdzPsNvtTyY.jpg",
               "id": 95635,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Lance",
               "gender": 0,
               "credit_id": "52fe466f9251416c75078289",
               "name": "Carson Kressley",
               "profile_path": "/mW4WHGOnNCwYNCscLrdpBAhRLmI.jpg",
               "id": 1215451,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Wedding Usher",
               "gender": 0,
               "credit_id": "590cd0b79251414e80002412",
               "name": "Curtis Fletcher",
               "profile_path": "/jJczsHzXOfkodsPrPDDAdOO4Hx.jpg",
               "id": 1811110,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe466e9251416c7507825b",
               "name": "Mark Rosman",
               "profile_path": "/vOyUS7Z64KVV3VJZu2Li4r0j2Cg.jpg",
               "id": 68770,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe466f9251416c75078279",
               "name": "Billy Higgins",
               "profile_path": null,
               "id": 60280,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe466f9251416c7507827f",
               "name": "Gina Wendkos",
               "profile_path": null,
               "id": 59972,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe466f9251416c75078285",
               "name": "Cara Silverman",
               "profile_path": null,
               "id": 56716,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "553fd5eec3a3683c630000b6",
               "name": "Harold Parker",
               "profile_path": null,
               "id": 1119658,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 2,
               "credit_id": "56b295cc92514114db000026",
               "name": "Marc Platt",
               "profile_path": "/4BRkyTQ5NEbxcdm6KDWb9r9vAJm.jpg",
               "id": 23485,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.119108,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15648,
      "vote_count": 268,
      "budget": 0,
      "overview": "Holly is tired of moving every time her mom Jean breaks up with yet another second-rate guy. To distract her mother from her latest bad choice, Holly conceives the perfect plan for the perfect man, an imaginary secret admirer who will romance Jean and boost her self-esteem.",
      "similar": [
         2539,
         293768,
         11631,
         49519,
         93456,
         150540,
         693,
         392,
         1547,
         5176,
         8392,
         601,
         225886,
         587,
         745,
         242224,
         77875,
         8390,
         382614,
         158907
      ],
      "original_title": "The Perfect Man",
      "runtime": 100,
      "poster_path": "/vXMqz8oiDTi0Mvz7ah5PKcKxuYW.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "2005-06-17",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Is it all too good to be true?",
      "adult": false,
      "homepage": "http://www.watchvideoseries.com/movies/the-perfect-man-2005/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mark Rosman"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Michael McQuown",
         "Heather Robinson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0380623/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwNDExMzIyOV5BMl5BanBnXkFtZTcwOTI3ODkyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Hilary Duff, Heather Locklear, Aria Wallace | See full cast and crew »"],
      "reviews": [
         "OK. I'm a Caucasian male in my 30's, there is no reason this film should appeal to me. So, I had the opportunity to see it last night. It has been a long time since I've been so pleasantly surprised in a movie theater. Firstly, the performances were great- Duff and Locklear (I never liked her before, but she's funny and beautiful and delivers... crazy) were dynamic and interesting. Noth is kind of irritating, but I guess some people find him sexy. Anyway, what on the face is a silly small tale is in fact a movie of surprising depth about relationships, the fear of solitude, and familial interaction. Who the hell knew a director of pulpy TV stuff had this in him? I'm considering that perhaps I was emotionally available or vulnerable, but objectively, the film-making is consummate. It looks great- like a big 80's comedy, nice and vivid and bright. So, don't fight if you are taken by a wife/daughter... you will be nicely surprised.",
         "Tonight I saw a \"Perfect Man\". While there were a few inconsistencies such as bad Brooklyn Accents and that Holly (Hillary Duff) was 16 and driving in NYC, you must be 18 to drive within the city limits, the movie itself was great. I am the daughter of divorced parents, as so many of us in today's world. I always resented that my mother changed my sister and my lives to benefit her own. However we saw this movie together and after we both had a really good cry. She related to Jean (Heather Locklear), a single mother who moved over a man. And I related to Holly (Duff) who didn't want to move and had to leave her friends behind. Although it's not clear if the mother was divorced or never married, this movie was an amazing account of the divorcée and her daughters attempts to get things right.",
         "THE PERFECT MAN is another one of those fluff romantic comedies that just keep recycling - single mom and pseudorebellious daughter make everything work after plotted plans go astray. This is one of those films that you rent because the video store is closing and you need a somnolent-inducing DVD. But in the case of THE PERFECT MAN there are some nice surprises! Jean Hamilton (Heather Locklear) is a 40ish single mom who bakes specialty cakes and can't land a man. Whenever she gets close to a commitment or when she is passed by, she runs, family in tow, to a new city, new friends, new opportunities to find a man before she is too old. Her daughters Holly (Hilary Duff) age 16 and little Zoe (Aria Wallace) go along with the transplanting moves, understanding and supportive of their mother but yearning for some permanence. The newest move is to Brooklyn: Jean is welcomed back to a bakery of friends, Holly finds reasons to like her new school (friends female and male) and Zoe starts on a run toward a spelling bee. Since Jean is so desperate for a man, she is swept off her feet by a fellow baker who is sweet but otherwise fairly low on the food chain. Holly and her new friend Amber (Michelle Nolden) plan a way to capture Jean's attention from a created secret lover, their information comes from Amber's restaurateur Uncle Ben (Chris Noth) who tells them the secrets to winning a woman's heart. Let the games begin: first flowers, then gifts, then letters, then email, then I'm, and Jean feels as though there really is someone special out there who loves her. But as all games go, this one has its successes and major failures and as Holly grows to understand her mother's dilemma, she finds her own in her reluctance to accept the fact that her friend Adam (Ben Feldman) has fallen for her and wants her around. From that point it is a comedy of errors until the final frames where, as expected, all works out for the best for everyone. Shallow, yes. Been there, done that, yes. But the surprise is the growth of Heather Locklear as an actress! She has come along ways from her 'Dynasty'/'Melrose Place' days as basically set decor and has accepted her age gracefully, coupling that with a nuanced acting ability that makes her a welcome 'newcomer' to the screen. She is worth sitting through this little yawner, making it come alive every time she is on screen. Grady Harp",
         "Hilary Duff once again steps into her comfortable role as the good girl next door, this time as Heather Locklear's daughter. Tired of her mom having a breakdown and moving every time she gets dumped by another third rate guy. To prevent going on another \"adventure\", and to save her mother's self esteem, Holly concocts a plot for the imaginary perfect man for her mother. The film is charming. Although it's no Oscar contender, this film exists to entertain and make audiences laugh. There are some cheesy moments and lines, but it doesn't hurt the film. Hilary Duff has improved her acting even more since 2004's \"Raise Your Voice\" and Heather Locklear adds a certain flair to the story not always seen in a Hilary Duff movie. The sub romantic plot between Holly and Ben is sweet, and you get some scenic views of New York, all of which helps to make a pleasurable movie that should've been a hit but instead got swallowed up by blockbusters at the box office.",
         "Hilary Duff has never made a movie on her own that I've liked. \"A Cinderella Story\" was mediocre at best and \"Raise Your Voice\" had to be on the worst films of 2004. \"The Perfect Man\" is another Duff vehicle that received horrid reviews, which is funny because I actually thought it was sort of decent. It is the type of movie that is bland and indistinguishable, yes, but also decently so. The storyline zips along with enough plausibility and chuckles for you to feel like the rental fee was worth it. Unlike \"A Cinderella Story\" and \"Raise Your Voice,\" Duff is not a victim this time, which was refreshing. In fact, she's can be narcissistic and cruel. Heather Locklear plays her distressed mom, and I haven't seen any of her other films but I thought she was believable enough. Ben Feldman is affable as Duff's love interest and Chris Noth is quite good as a charming restraunteer. Speaking of Noth, a good way to sum up \"The Perfect Man\" is that it plays out a more extended version of a Sex and the City episode, only without the risqué humor or racy subject matter, which makes it a good fit for moms and their daughters. Not a great film, but it follows its dubious formula well enough for me to recommend it to some. GRADE: B",
         "Holly Hamilton (Hilary Duff) is sick of her single mother (Heather Locklear) embarrassing her and ruining her life with her bad choices in men and her breakdowns when they don't work out. To try to break the cycle, Holly invents the perfect man, a secret admirer who romances her mother from a distance and then borrows her friend's Uncle Ben (Chris Noth) to maintain the ruse. The Perfect Man is a bland, sweet piece of fluff that will entertain it's target audience though everyone else may have trouble forgiving the flaws. The film is obviously unrealistic so if you're going to watch it, keep that in mind. It has an interesting story, though I have been told that it's a rip off of Mermaids which I never saw so that didn't bother me. Mark Rosman is pretty good at making kids films/shows after A Cinderella Story and Even Stevens. Most people over the age of 15 probably hate his work but if the kids like it than he gets the job done but their was something missing here. Even my sister, the biggest lover of fluff films, said it wasn't very good. The biggest problem with The Perfect Man is that all the characters are unlikable. Holly's mom is selfish for moving the kids to different places after each breakup. Instead of dealing with the problems, she just runs away from them and it's hard for her daughters to grow up. Holly doesn't really seem to care about her mom and when they move to Brooklyn, she does everything to make her stay. This includes writing fake love letters and seducing her own mom online. Most of the characters are also pretty annoying and even the short running time becomes a challenge to get through. The main actors are all pretty good but the supporting actors are weak. Hilary Duff is a decent actress and this film is defiantly better than her last flop Raise Your Voice. This is a better role for her since it lets her grow as an actress and it doesn't require her to sing. Duff isn't as good as Heather Locklear though. Heather is really good in this role and she would never have trouble finding a man. Chris Noth does an okay job but I really don't see the appeal of him as an actor. Caroline Rhea and Carson Kressley tie each other for the most annoying performance in the movie. Both of their characters were added for comedy relief but they will most likely give the audience a headache. In the end, The Perfect Man is far from perfect but it's nice entertainment for Hilary Duff fans and tweens. Rating 5/10",
         "While the title states \"Complete Suck Job\" this can be a bit misleading. As a suck job would feel good, and this movie is excruciatingly painful. First of all, the entire premise is completely unreasonable. No one just gets up and moves by default after each breakup. Especially if you have kids to uproot every time you do it. However, if you have any chance of surviving this movie you will have to overlook that fact. Let you be warned. If you ever watch this movie (which I whole-heartedly discourage) bring as many land-scaling devices (ladders, bridges, etc.) as possible to get over ALL the plot-holes. I can't even remember them all because I was lost in one for so long that I forgot SO many of the other ones. But I must mention a few of them: Where in the world did Amy go at the end of the movie? Just completely disappears and is forgotten about. Perhaps she went with Carmen Sandiego. If you are someone of the Christian faith, you will love this movie. Because apparently Holly and her sister were immaculately conceived. No one even mentions where their father is or why he left. Therefore, it is believed he was never there for Holly when she was growing up, but he managed to knock Jean up one more time NINE years later. 9!! You wouldn't think that an actual timeline would have to be plastered on the writers' walls while they were writing the script. But you would be sorely mistaken. On the flip side, this movie does give me a glimmer of hope for my future, because apparently you can afford a comfortable NYC apartment for 3 in a quality neighborhood, nice furnishings, and a brand new laptop all on a BAKER'S salary. Are you kidding me? I know this movie was supposed to be a romantic comedy, but was that the joke? If so, it was easily the best one in the entire movie. To be completely honest with you, Reader, I don't know what to protect you from next. The acting is adequate (not really, just trying to be nice) but the script is sooo outrageously bad that it has absolutely no chance of recovering from the depths of movie s**thood. The Lenny character had no business being in this movie (or any movie for that matter). He could have easily been excluded and everyone would have been better off for it. He was annoying, poorly written, stereotypically overly obnoxious. The out-of-nowhere proposal? COME ON WRITERS!! Lets work that one out on the first read-through of the rough draft. Moving on, Holly meets her \"best friend\" and romantic interest IMMEDIATELY when she goes to school. The FIRST and ONLY people she talks to at school. That is quality writing right there. Cut out all the fat; it's bad for you. I would have loved to see how long this movie would have been if all the plot-holes were filled in and the p*ss-poor writing corrected. Probably longer than it took to actually write the final script. The only redeeming quality this movie has is Hilary (pre-punk makeover, which is horrible on its own right, but that is neither here nor there). Where am I going with this comment? I'm not quite shore. The only thing I am quite shore about is that this movie blows. And blows gently at that. Even Hilary at her best could not save this movie. Oh but wait!! There is a magical \"twist\" at the end of the movie that will enchant the entire audience for years to come!! It makes everything turn out OK. I wish I could reveal it to you but, alas, I will not, for it is the only thing that saves this movie. Or is it? I'm not quite shore. Not quite shore...",
         "Saw this at a press preview and was sadly disappointed. Even though Heather Locklear is nice to look at, I disliked her selfish character right from the beginning. This dark subject was portrayed with too much fluff and the movie was wrought with simple errors and missing elements. In one scene, Jean is asked to go to a Styx concert and says, \"Who is Styx?\" In the next scene, she knows the band well enough to know the people on stage aren't the real singers. (They're a tribute band.) Holly's young friend (and niece to Pefect man) disappears 3/4 into the movie never to be seen again. The flaming gay stereotyped bartender added nothing to the plot but comic relief. Don't waste your money at the box office. If you must see it, wait for Netflix.",
         "Skip the movie, and rent Mermaids from Netflix instead. I'm so sick of production companies recycling good movies to make them vehicles for their new \"It Girls\". They wonder why theater attendance is down...all they have to do is realize people aren't going to pay $8.50 to see a movie that was made and released 15 years ago, remade with a different cast. Get some original screenplays, hire some real actors and show me something I haven't seen before. Come on Sheeple!! What the heck are they doing here. I love going to the movies, but they seriously need to start competing with themselves. I mean, they might as well just dust off the old black and white westerns and colorize them.",
         "\"Perfect Man\" follows the life of Holly (Duff) as she struggles with her inept mother, Jean (Locklear). Firstly, the plot itself is a sinker. Basically, Jean is a single mother of 2 who finds the need to move to another state every time she gets dumped by a guy. That is the most unreasonable thing I've heard since Veronica got mad at Betty after she had a dream that Betty kissed Archie (take my word for it - it was pretty unreasonable). However, according to the makers of \"Perfect Man\", such unreasonable behavior breeds comedy (\"I'm jeopardizing my children's future. HAHA - that's so funny\") Because of her mom's lack of rational thinking, Holly has never been to a prom (shock horror). Perhaps if she got up and told her mom that she was being utterly crazy and selfish instead of just sitting there complaining on her weblog and calling herself a \"teenage gypsy\", she could've made some progress with the situation. Then again, if Holly was smart enough to do that, we wouldn't have this movie. In fact, that'd be true if ANYONE in the movie was smart. No wait...Holly's little sister is smart - after all, she did win the spelling bee. My bad. It gets worse. Holly moves to Brooklyn where BAKER mom manages to afford an amazingly pretty, spacious apartment. Jean starts work and immediately, the loser bread-maker (O'Malley) asks her out. Holly freaks because this means she'll have to move again in the not-so-distant future as mom goes into selfish mode again. Holly's life is also full of surprises. First day of school, she becomes best friends forever with Amy (Lengies) and already has an admirer in quiet comic book guy Adam (Feldman). Apparently, taking someone's seat makes you very attractive...that's what made Adam take an interest in her. Back to freako-mom's case. Holly doesn't want to move anymore and so teams up with Amy to \"trick\" her mom into thinking she has a secret admirer. The two base this \"perfect man\" on Amy's restaurant owner uncle, Ben (Noth...who was also the reason why I actually watched this sad sad film) and subsequently ask him for advice on how to woo women. Ben, being in the movie, is also not very bright and actually believes that the girls need this type of information for school. So, following Ben's advice, they start sending Jean flowers and letters. Jean, who just arrived in town does not find it creepy that she already has an admirer who knows where she lives and happily accepts these gifts. Chalk one up for Holly's brilliant plan!! As expected, the lie gets more complicated and Holly eventually has to send her mom a picture of her admirer to convince her that he's real. Being so shrewd, she sends Ben's photo and even names the imaginary admirer \"Ben\". In the 21st century when we have access to magazines and internet to look up pictures of people, she chooses to send a picture of a man who lives in the same neighborhood. A lot of wooing ensues which is quite disturbing in many ways. One, the wooing is between mother and daughter which is just wrong. Two, Jean STILL doesn't find it creepy that this \"secret admirer\" who she's never met in her life is sending her some pretty mawkish messages. Three, Holly enlists Adam to act as Ben and talk to Jean on the phone. He starts imaging that he's talking to Holly and starts to say that he loves her...pretty disgusting considering mom's on the other line. Holly is probably addicted to deception. Not only does she lie to her mom and toy with her emotions, she also uses Ben. In one part, Jean goes to Ben's restaurant. Scared that they might see each other, Holly sets off the sprinklers in the eatery, chasing out ALL of Ben's customers and practically destroying his restaurant. Does Holly feel bad? Nope! At another point, she goes up to Ben's house alone despite only meeting him 2 times (if I were Ben, I'd be pretty freaked) and realizes that he TRULY is perfect for her mom. Her reason? They both do the Times crossword puzzle in pen!! Like Duh! OK, I exaggerate, there was also something about the moon and having a nice kitchen. Holly has some really weird way of determining whether two people are soul-mates or not. After realizing that Ben is perfect, Holly runs, in a very dramatically, to stop what she believes to be Ben's wedding to another woman. This woman and Ben could've had an 8 year relationship or something before but Ben and Jean both do crossword puzzles in pen so whatever to the other woman - she's not Ben's soul-mate. Turns out, Ben was just best man at the wedding but Holly manages to wreck it anyways. Does Holly feel bad? Nope! Ben gets angry (FINALLY) and Holly amazingly manages to make it seem like he's the unreasonable one. When Jean finds out that the whole admirer thing was just a scam, Holly's the one who yells at her mom. Not once does she apologize for her totally unacceptable behavior. Well, it's a Hilary movie so it all ends well. Holly finally opens up and admits that she likes Adam and she realizes her dream of going to the prom. Ben finally meets Jean and they hit it off. All loose ends are tied off which should be very satisfying but sadly, is not because this is such a ridiculous movie about how lying and cheating can get you what you want. None of the actors are convincing in their roles (Locklear as woman who can't get a decent boyfriend? Hilary Duff as the insecure outcast-ish character? Like in ALL her movies? Someone as cute as Ben Feldman as the not-so-noticed geek?). Still I HIGHLY recommend watching this movie to see how UNBELIEVABLE and selfish these people really are!!"
      ],
      "genres": [
         "Comedy",
         "Family",
         "Romance"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Marc Platt Productions"
      ],
      "summaries": [
         "Teenager Holly Hamilton is tired of moving every time her single mom Jean has another personal meltdown involving yet another second-rate guy. To distract her mother from her latest bad choice, Holly conceives the perfect plan for the perfect man.. an imaginary secret admirer who will romance Jean and boost her shaky self-esteem. When the virtual relationship takes off, Holly finds herself having to produce the suitor, borrowing her friend's charming and handsome Uncle Ben as the face behind the e-mails, notes and gifts. Holly must resort to increasingly desperate measures to keep the ruse alive and protect her mom's newfound happiness, almost missing the real perfect man when he does come along.",
         "Holly's mother Jean has devoted her entire life to taking care of her and her sister and has not regretted it. But she also knows that eventually Holly and her sister will leave the nest and she will be alone, so she wants to meet a great guy but unfortunately, when the guy she is seeing turns out to be not the great guy she thought he was, she uproots her family and moves to another city. This time they find themselves in New York, and Holly not wanting to move thinks that the best thing she should do is to make up a suitor for mother, who is the perfect guy, and hopefully she won't want to move again. So on advice from her friend's uncle she starts sending her mother flowers and gifts with words he provides her and before she knows it, her mother is taken with this perfect man. But eventually her mother wants to meets this guy but can't so what can Holly do?"
      ],
      "budget": 25000000
   },
   "movielensId": 33815,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2005-06-17",
      "dvdReleaseDate": "2005-11-01",
      "directors": ["Mark Rosman"],
      "runtime": 100,
      "movieId": 33815,
      "title": "The Perfect Man",
      "mpaa": "PG",
      "actors": [
         "Hilary Duff",
         "Heather Locklear",
         "Chris Noth",
         "Mike O'Malley",
         "Ben Feldman",
         "Vanessa Lengies",
         "Caroline Rhea",
         "Kym Whitley",
         "Aria Wallace",
         "Michelle Nolden",
         "Carson Kressley",
         "Curtis Fletcher"
      ],
      "imdbMovieId": "0380623",
      "originalTitle": "The Perfect Man",
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Romance"
      ],
      "youtubeTrailerIds": ["uXhk2QJm-14"],
      "plotSummary": "Holly is tired of moving every time her mom Jean breaks up with yet another second-rate guy. To distract her mother from her latest bad choice, Holly conceives the perfect plan for the perfect man, an imaginary secret admirer who will romance Jean and boost her self-esteem.",
      "tmdbMovieId": 15648,
      "avgRating": 2.93009,
      "releaseYear": "2005",
      "numRatings": 329,
      "posterPath": "/vXMqz8oiDTi0Mvz7ah5PKcKxuYW.jpg"
   }
}