{
   "tmdb": {
      "original_language": "hi",
      "keywords": [
         {
            "name": "tradition",
            "id": 941
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "hindu",
            "id": 4096
         },
         {
            "name": "faith",
            "id": 6150
         },
         {
            "name": "hinduism",
            "id": 6194
         },
         {
            "name": "singer",
            "id": 10229
         }
      ],
      "imdb_id": "tt0150992",
      "video": false,
      "title": "Hum Dil De Chuke Sanam",
      "recommendations": [
         20359,
         41902,
         20929,
         20364,
         115124,
         41188,
         20129,
         108368,
         46387,
         62883,
         49679,
         93519,
         19637,
         20651,
         20495,
         97351,
         20492,
         25510,
         21906,
         56969
      ],
      "backdrop_path": "/7gwTTNPPEIs7t65pa4Suc8n2Pxo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Vanraj",
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d16b",
               "name": "Ajay Devgn",
               "profile_path": "/A8i7Qe7vvdyrgLIOal7W0KURZNk.jpg",
               "id": 42803,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sameer",
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d167",
               "name": "Salman Khan",
               "profile_path": "/2s1mcPmCOPLn7tDwXulgRR9ecGm.jpg",
               "id": 42802,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Nandini",
               "gender": 1,
               "credit_id": "52fe4402c3a36847f807d163",
               "name": "Aishwarya Rai Bachchan",
               "profile_path": "/3iSTsyBx5FwfbIrMJXMKFJ0eWlL.jpg",
               "id": 87773,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Pundit Darbar",
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d199",
               "name": "Vikram Gokhale",
               "profile_path": "/q66OaRjgOpR9LEZM4dCkgp23eeL.jpg",
               "id": 43413,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Amrita",
               "gender": 1,
               "credit_id": "52fe4402c3a36847f807d19d",
               "name": "Smita Jaykar",
               "profile_path": "/iWUEXvktqDqiei99svmyrsuJoPq.jpg",
               "id": 43414,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Dadi",
               "gender": 1,
               "credit_id": "52fe4402c3a36847f807d1a1",
               "name": "Zohra Sehgal",
               "profile_path": "/uMj29GjQ34xKoqNyldMnygLWKWQ.jpg",
               "id": 35783,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Vikramjeet",
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d1a5",
               "name": "Rajeev Verma",
               "profile_path": "/t808bGCBMEkUoSRSrOdhLESjKRg.jpg",
               "id": 35818,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Tarun",
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d1ad",
               "name": "Vinay Pathak",
               "profile_path": "/wv0apsAUY1knnQ146p6nqvTvTnE.jpg",
               "id": 43416,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "5965c78fc3a368293b12b9e2",
               "name": "Sheeba Chaddha",
               "profile_path": "/rYVDWNzerWsacxe91J4Etk9oyi1.jpg",
               "id": 1246564,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 1,
               "credit_id": "5965c86cc3a36825e810cc86",
               "name": "Helen",
               "profile_path": "/i71XRME3MCKrboV5drbty69SKfI.jpg",
               "id": 110102,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Bhairav",
               "gender": 0,
               "credit_id": "52fe4402c3a36847f807d1a9",
               "name": "Kermati Desai",
               "profile_path": null,
               "id": 43415,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d171",
               "name": "Sanjay Leela Bhansali",
               "profile_path": null,
               "id": 42804,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d177",
               "name": "Sanjay Leela Bhansali",
               "profile_path": null,
               "id": 42804,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d17d",
               "name": "Sanjay Leela Bhansali",
               "profile_path": null,
               "id": 42804,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4402c3a36847f807d183",
               "name": "Anjan Biswas",
               "profile_path": null,
               "id": 43410,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4402c3a36847f807d189",
               "name": "Ismail Darbar",
               "profile_path": "/9HiGFYBX58FZVtSFsSTh8Ss32rg.jpg",
               "id": 43411,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4402c3a36847f807d18f",
               "name": "Anil Mehta",
               "profile_path": null,
               "id": 35738,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4402c3a36847f807d195",
               "name": "Bela Segal",
               "profile_path": null,
               "id": 43412,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5ab08d3a92514111c7005126",
               "name": "Vaibhavi Merchant",
               "profile_path": "/4RlEVz9A21P4cx83cbGrf421iWS.jpg",
               "id": 231595,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.492023,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 5319,
      "vote_count": 35,
      "budget": 0,
      "overview": "Indian-based traditional family of Pundit Darbar (Vikram Gokhale) gets a visit from Sameer Rafilini (Salman Khan), from Italy, who has come as a pupil to learn music and singing. Darbar and his family accept him. Sameer meets Nandini (Aishwarya Rai), Darbar's daughter, and both fall in love. But Darbar wants Nandini to wed Vanraj (Ajay Devgan), and has Sameer swear that he will leave India.",
      "similar": [
         145,
         605,
         604,
         87827,
         10557,
         361063,
         1404,
         361059,
         361039,
         211086,
         360992,
         930,
         268677,
         361046,
         334054,
         360916,
         360873,
         334070,
         32429
      ],
      "original_title": "Hum Dil De Chuke Sanam",
      "runtime": 188,
      "poster_path": "/x28pUIfzQrQXLj2tAW7LWazEqqt.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Bhansali Films",
         "id": 1892,
         "origin_country": ""
      }],
      "release_date": "1999-06-18",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Straight from the heart...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": "INR ",
      "directors": ["Sanjay Leela Bhansali"],
      "runtime": 188,
      "synopsis": "The story begins with Nandini (Aishwarya Rai) a beautiful, yet rebellious favorite daughter of a rich singer. During Diwali, her father decides to invite Samir (Salman Khan) a half-Italian, half-Indian aspiring singer to their home from Italy for a year in order for him to learn music. Nandini is not happy with this news when she discovers that she must share her room, which also happens to be the nicest room in the house, to Samir. Her father commands her to share her room. She vows later that she will make him so miserable that he will not want to stay, and writes horrible things about him in her diary. Samir travels across the desert to get to India and talks to his deceased father, which he does throughout the film, and asks him for luck in his new home. Upon arrival, his silliness and antics win over the entire family with laughter, that is, except Nandini. When he is shown to his room, Nandini lighting the lanterns of a glass chandelier and is very rude towards Samir, but he doesn't seem phased and even compliments her eyes. She claims her eyes can stare into ones very soul and he proposes a staring match to see who will blink first. Nandini raises the chandelier with a rope, and Samir says that if it drops and the glass shatters, she will blink. She lets go of the rope, dropping the lantern, but Samir catches it and they continue to stare. Samir tells her that if she keeps staring she will fall in love with him. She doesn't respond. Later, at dinner, Samir shows up in just a towel, disgusting Nandini's father. He gets dressed, but Nandini tells him that to make it up to him he must greet him in a special way and shows him a ridiculous dance, which Samir does. It angers her father, and he demands Samir to sing or deny him of lessons. Samir gives quite the performance that entertains everyone, especially Nandini's father. Later, Samir asks Nandinis father what his fees he will have to pay for lessons, but he says that his music is not for sale. However, he may or may not asks for fees when the time comes. After that, Samir, Nandini, and her father spend all day singing. One night, Nandini is on a veranda looking at the stars. Samir comes up and asks her if she is thinking about him, she says yes at first, but quickly corrects herself. She then goes on to talk about stars and destiny, and asks Samir if he believes in destiny. He says that he can read it, and reads Nandini's foot. He tells her that she will travel across the seven seas in the name of love, and end up in Italy. Slowly, the two begin to fall for each other. One day, Nandini's sister Anu (Sheeba Chaddha) is to be married off to a husband arranged by her parents, and they throw a party for her the night before, but she doesn't seem happy. Samir shows up to see Nandini, and she dances and sings for him and they share a good laugh together. Eventually, Samir tells Nandini that he loves everything about her (her voice, hair, eyes, etc.) and an excited Nandini urges him to go on. He names just about everything until Nandini gets frustrated and leaves. He could not bring himself to say it, but when she leaves he tells his father aloud that he does, indeed, love Nandini. The day of Anus wedding, Nandini goes to get her sister, but Anu does not open the door for her. Little does she know, Anu is her room with another lover. She confesses to him that she does not love her future groom, only him. He suggests that they run away together, but she says that it's too late and her parents will never accept it, and he leaves. At Anu's wedding, Samir and Nandini cannot keep away from each other. They make each other laugh and share intimate moments, but they stay secretive about their love at the ceremony. As the wedding draws to a close, they take a family photograph, and Samir causes Nandini to look up, ruining the picture. Nandini gets irritated and storms away afterwards. Samir goes after her, saying that he was only joking and that he wants to tell her what he was going to tell her the day before. She says that if he couldn't tell her yesterday, she doesn't want to hear it now. He grabs her playfully from behind, begging to tell her. In public, Nandini becomes embarrassed and angry and tells him to let go, but he does not so she turns around and slaps him. Samir then becomes very angry and locks himself in his room while Nandini bangs on the door, telling him how sorry she is, and that she will listen to what he has to say now. He says that now she is not worthy of his love, this angers her and she says that if that's the way he feels then if she meets someone at the celebrations that asks her to marry him, Samir will be left helpless. He throws a book at the door. At the celebrations, Nandini performs the song Nimbooda and a young lawyer named Vanraj (Ajay Devgan) sees her and instantly falls in love with her. So, his sister suggests to arrange a marriage. At first, Vanraj resists because he says that she is so beautiful, he would be too embarrassed to speak with her, but she persists and he agrees. When her parents find out, her mother is thrilled, but her father is reluctant to let her go. Eventually, he agrees as well. Later, the family laughs at the family picture in which Nandini looks so silly and she runs to show Samir, but he pushes her away, still angry. At dinner, it is pointed out that Nandini has cooked, and Samir says that it's a bit spicy, and Nandini gives a smart remark. Offended, Samir begins to eat many spicy peppers, and the family begs him to stop, as he is burning his mouth, but he just storms away from the table. Her mother tells Nandini to apologize to him and take him something to cool his mouth. She does so, and tries to give Samir spoonfuls of honey, but he persistently smacks it away. Eventually, he lets her give some to him and she begins to get up when he grabs her arm, breaking her bangles and cutting her skin. She says that her hand deserves the punishment for slapping him, and they are back in love again. Nandini runs down to a pool and runs her bleeding wrist dreamily over the water, lovestruck. The next day, as the girls prepare to fly their kites, they speak of how now that Anu is married, it's Nandini's turn to be married to the man they've arranged for her. She becomes irritated by this and offends her aunt by suggesting that she is getting old and may never get married. Her mother demands her to apologize, but she just storms off. During the kite flying, Samir cuts the string of her fathers kite and becomes very excited. He rushes off to tell Nandini who is in the library, but Nandini is just more angered by his silliness. She tells Samir how angry she is that a marriage is being arranged for her and that she and Samir can never be together. Samir assures her that her father likes him, and that if he asks for her hand instead, he will accept. Nandini protests that Samir could not even tell her of his love, so how can he tell her father? He then, finally, tells her that he loves her and they kiss. They hear someone and she leaves to see who it is, and it is her aunt, who did not see them, but she tells Nandini to straighten her clothes. Nandini gets smart with her again, and her aunt begins to develop a plan against Nandini. Later, Anu returns from her husband's house in a terrible state. She refuses to return to him, and is slapped for it. Her father tries to convince her that they are husband in wife now, and therefore, bound by marriage. Nandini stands up for Anu saying that she cannot possibly stay with a man she does not love, and her father sends her away. So, Nandini and Samir come up with a plan for Anu to finally run away with the man that she really loves and they do so, but Nandini's aunt sees what they've done. The next day, there is an uproar at Anu's disappearance and Nandini's aunt suggests that Nandini may have had something to do with it. But her father forbids any bad talk about Nandini, saying that he trusts her and the day that she is proven unpure is the day he quits music forever. Her aunt urges him to see what Nandini is up to, which he does, and finds Nandini and Samir attempting to elope. Later, Nandini tells her mother of their affair, and she is appalled. Nandini bursts into tears and goes into a rage, begging her mother not to separate her from Samir because they love each other so much and that her mother must help her by convincing her father for her. Her mother agrees, but says Nandini must stay put while she does so. Meanwhile, her father is telling Samir that he had decided to quit music and can no longer teach him. Now, he wants to collect fees. As a fee, he forbids Samir from ever seeing Nandini again. Samir is heartbroken and begins to leave the palace. Her mother rushes to Nandini to tell her the news, and Nandini runs to see her love just one last time, or she may never see him again. She reaches to him from over the balcony, and reaches to her, silently telling her to become a statue. She does, but her tears keep flowing, and Samir leaves the palace. Her mother carries her away as Nandini remains a statue. Later, a song plays while Samir walks through the desert and curses his father for his bad luck. Nandini cuts her wrist in the same place Samir did with her bangles and lays it in the pool as her blood flows freely. ~~Intermission~~ Today is the day of Nandini's wedding, but she is not downstairs with the groom and families, she is upstairs reading the love letters Samir has written her. He says that living without her is very hard, but he knows their love will reunite them one day. Later, Nandini is married, but walks around like a ghost. And in her wedding bed with her new husband, he tells her how unbelievably beautiful she is, and that they are so different, he cant believe she would marry him. But they must tell each other everything about themselves from the start, because he despises lies. She says she must get up early in the morning and wants to sleep, and that night, Vanraj attempts to make love to her. Unable to bear it any longer, she jumps up and objects. He says that she is not at all the same Nandini he fell in love with. He begs her to tell him what the matter is and he will support her, but she remains silent, and the tension between them persists. After prayers the next day, Nandini fantasizes about being with Samir again. The next day, Nandini's mother comes to visit her, saying that the family misses her so much, but is shocked to discover that she has not made herself up and hasn't even done her hair. Nandini tells her that she is still in love with Samir and can never love Vanraj, and her mother demands that she let go of the past. She is married now. Later, Vithal (her assistant from back home) brings Nandini more letters from Samir, but implores her to burn them, which, of course, she does not. She runs up to the bedroom to read them all, but one blows to the ground. As she is reading, Vanraj comes in without her knowing and reads the letter. Enraged, he grabs her and drags her out of the palace, saying that she has humiliated him and cannot live there anymore. Nandini begs him to let her explain, but she tosses her, sobbing into a car. Vanraj tries to explain to his father that he wants to take Nandini to Italy to reunite with Samir, and his father calls him mad. Vanraj says he doesnt care what people will think of him, but while Nandini's body belongs to him, her heart and soul do not. Therefore, he has no right to keep her any longer. He says it will hurt, but seeing her happy will erase his pain. Eventually, his father supports him. In Italy, Vanraj tries his best to be courteous to Nandini, reassuring her that they will find Samir even though it is such a big city and they don't even have a photo, but she continues to shut him out and act rudely. They go around the city asking music stores and music schools where he is. At one school, Vanraj tells Nandini that they have finally found him, to which she gets excited, but it is certainly not him, and Vanraj laughs. Later in their hotel room, an angry Nandini shows Vanraj a funny caricature drawn by Samir and tells Vanraj that this is what he looks like. She says that the whole search and even she herself is a joke to her. He tries to apologize, but she doesn't let him. The next day, Vanraj and Nandini are at an Italian restaurant. Vanraj orders a sandwich, while Nandini orders the first thing she sees. Her order turns out to be disgusting, and Vanraj offers her his sandwich, which she refuses and begins to eat many peppers instead. Vanraj offers her water, which she refuses, and he demands that she not make a scene, and she takes the water eagerly. In the back of book the waiter gives Vanraj, he finds the same caricature Nandini showed him the previous night! He asks the waiter who drew it, and he points to Samir who is headed down the street. Nandini runs after him, calling his name, but he does not hear her and boards a train. She chases after that as well, but ends up in the path of another train. When she finally sees it, she falls, and Vanraj tackles her out of the way of the train at just the right moment. Back in the hotel room, Nandini yells at Vanraj for causing her to lose Samir, and he says that he saved her life. She says that if she had died, he would have lost nothing because there was no relationship between them. She asks why he even brought her to Italy. He starts to say it is because he loves her, but tells her she doesnt even know what love is. Later, he obtains Samir's address, and the couple end up on a train. The ticket taker, cannot take their tickets, however, because the couple next to them are in a passionate embrace. As the train moves along, Nandini apologizes for what happened the previous day, and he accepts her apology. He then tells her stories and jokes about cases hes lost, making her laugh. He watches her and then asks if he can say something, she agrees, but she says to forget it. As soon as they arrive at Samir's home, his mother recognizes her and tells her how much Samir talks about her and how he misses her, but that he is not there. He had just caught the bus somewhere. As Vanraj and Samir run after him, her mother tells them that he sings every Friday at the Viscounty Bar. Vanraj manages to stop a car of a couple of tourists and tells them to follow the bus, they do so, driving like maniacs, and just when they catch up to it, turn down a different road and stop. They then demand the couple to give them all of their money and jewelry, holding them at gunpoint. They do so, but when they demand Vanraj to give up his wedding ring, he refuses, so the man goes to yank it from his hand. Vanraj fights the man and the woman threatens to shoot. She does, shooting Nandini, who falls to the ground, unconscious. The tourists run away, while Vanraj tries to flag down someone to take them to a hospital. He takes her there, and takes good care of her. She survives. However, they doctor says they will have no choice but to stop treatments if Vanraj does not pay the bill. To this Nandini offers her wedding ring. Later, Vanraj goes to a church and Samir sits behind him. But Vanraj does not know who he is. They speak about their love for a woman, not knowing they are talking about the same one. Vanraj tells Samir that the woman he loves is suffering, so he is suffering. Samir offers to pray for her with him, and even asks his father to give his friend whatever he prays for. They begin to exchange names, Vanraj tells Samir his name, but Samir is interrupted from telling his. Later at a cafe, Vanraj tells Samir that he has come to Italy looking for someone, a musician. Samir asks Vanraj if he sings. When Vanraj says 'no', Samir teaches him to sing the song Dholi Taro and they have great fun singing it together. Meanwhile, Nandini is fantasizing herself and Samir singing the very song together. When Vanraj returns to the hospital he gives her flowers given to him by Samir and says that she has been discharged because she is okay now. When she asks how he knows she liked those flowers, he tells her they are from a nice man he met and begins to sing Dholi Taro as he gets his her clothes together. Nandini, shocked, asks him where he learned the song. At that point, he realizes that is new friend is Samir and runs back to the café, but it is deserted. But Vanraj tells Nandini not to worry, they will go to Viscounty Bar on Friday. She asks how, because they have no money for tickets, and he says they will go no matter what. On the train, the ticket taker approaches and Nandini begins to get worried, but says she has an idea. She pulls Vanraj to her in a loving embrace, and when the taker comes up to collect their tickets, they continue to embrace and he gets frustrated and goes away. They arrive at the bar, but find that Samir will probably not show that night. They end up dancing together and both have fun. Later that night, Vanraj is very drunk and tells Nandini what a nice man Samir is, and he knows that he will make her very happy, and when they reunite, Vanraj will yell her name from the bridge. He repeatedly asks her if he can tell her something, she says yes, but he always says Forget it. He eventually passes out on her shoulder. The next morning Nandini is in her room, torn between the two men that love her. Realizing that Vanraj is awake, she goes to him and he apologizes for anything he may said the previous night if he misbehaved (he doesn't remember), but she assures him that he said nothing. She goes on to say that she has finally begun to realize what love is. At that moment, the phone rings and Vanraj answers it. It is Samir's mother, telling Vanraj that Samir has an opera that night and that she has not told him yet of Nandini's arrival, but that they should reunite before the show. It would make Samir very happy. Vanraj tells her that they will come right away. As Nandini slowly gets ready, she holds her mangalsutra (symbol of Hindu marriage) firmly in her hand and meets Vanraj to leave. Meanwhile, Samir's mother goes to tell him the news, and he is overjoyed. They go out to pick flowers and things for Nandini when she comes. On the way to the opera, Vanraj and Nandini are walking by a river and he takes pictures of her. She then stops someone to take a picture of both of them. They stand apart, and the man urges them to stand closer, they start to, until they hear Samir yelling Nandinis name from the bridge. She turns and sees him, and immediately begins to cry happily. They run towards each other, Samir repeatedly yelling that he loves her, and come together in an embrace as Vanraj watches from below. But, it is only Vanraj's fantasy. He and Nandini are still in the taxi. When they arrive at the opera house, Nandini realizes the time has come to finally reunite with her love, but before she leaves, she begins to touch her husbands feet, but he stops her. He starts to say something, but Samir's mother rushes and takes her away to Samir before he can. Vanraj looks on with tears running down his face as he recognizes that he has lost his wife to her love. He leaves. Nandini ends up in a dark room, and when the lights come up, there he is: Samir. He tells her that he knew she would come, his father said so, and rushes up to her. He gives her a hug, claiming they shall soon marry, but she does not return it. Shocked, he slowly backs away, asking if hes done anything wrong, and she looks at him for the first time. Samir is devastated. He says that the love for him she once had in her eyes is gone. Nandini tells him that he taught her to love, but it was her husband that taught her to abide by it. Samir is stunned. Nandini opens her hand and shows Samir her mangalsutra, telling her that she was married. She told Samir of all of the selfless things Vanraj has done for her. Without thinking about what people would think or how much it would hurt him, he brought the woman he loved, his wife, across a long distance to meet the man she loved. She said thats when she realized that true love was sacrifice. She reveals that his friend, Vanraj, is her husband, and he finds it ironic that the one time his father has granted his wish, it was for someone else. He says that Nandini will be his again in another life, but for this one, Nandini asks Samir to let her go to her husband, and he does. After he leaves, Samir is heartbroken, and goes crying into his mother's arms. Nandini, runs after Vanraj, who she finds walking sadly on the bridge. He turns and sees her running toward him, and when she approaches, she asks if she must leave her. To that, he asks if he may say something, she says yes, and he says what he has been wanting to say all along: \"I cannot live without you.\" And they embrace, as husband and wife, who love each other, truly.",
      "writers": [
         "Sanjay Leela Bhansali",
         "Amrik Gill"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0150992/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0MDQ3MTMyNV5BMl5BanBnXkFtZTcwNzM4NzkyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Salman Khan, Ajay Devgn, Aishwarya Rai Bachchan | See full cast and crew »"],
      "reviews": [
         "One day, a movie called \"Dilwale Dulhania Le Jayenge\" was released. It was one of the best movies in Hindi movies and remained that way only until a few months ago. I believe we have a movie to take that place. Sanjay Leela Bhansali is a genius. What more is there to say? This movie is undoubtedly the best movie I've seen in years, packed with superb acting, beautiful costumes and dazzling scenery. It's better than Dil To Pagal Hai, Kuch Kuch Hota Hai and Duplicate put together! This is THE best movie of the year. I know the word \"TAAL\" comes into mind, but that was junk compared to this. Aishwarya Rai gives a MUCH better performance in this movie. She is the most surprising thing about the movie. She has proven herself to be one of the best, if not the best, talented actress. Now Aishwarya has risen to the number one actress spot on my list. This is an absolute must for any person who watches Indian movies or even once did and now doesn't. This movie WILL NOT fail you. If possible, try to get the movie on DVD, that is the only way to recapture the actual colour from the film.",
         "One of the best Bollywood movies... Very lovely,sentimenatal,emotional,touching .... very near to real life. Acting superb Direction superb Music superb a new definition of love and perfect presentation of this new meaning. Aishwarya and salman in love in first part but then ajay enters and studd acting and how he acts when he knows truth after his marriage with aishwarya. 10/10 from my side...",
         "This is a superb movie that everyone has got to see. In my opinion, Aishwarya Rai has given her best performance till now. The movie has captured the breathtaking beauty of Rajhasthan and Gujarat and you can also view the cultural settings of India. Everyone is decked in elaborate clothes and jewellery and it's huge family living in a mansion. The story begins with a famous classical singer and his family all living in this huge mansion. He has a student coming from Italy named Sameer (Salman Khan) to learn classical music from him. Sameer meets and falls in love with his beautiful and talented daughter Nandini (Aishwarya Rai). Soon, her father finds out about this affair and orders Sameer to leave and as part of his 'gurudakshina', never to see Nandini again. He leaves and Nandini becomes really depressed. Her parents arrange her marriage with a family friend whose son Vanraj (Ajay Devgan) is a lawyer. Nandini is 'cold' to her new husband and he soon finds out why when he reads Sameer's letters to Nandini. He becomes angry but soon realizes that in order to make his wife happy, he's going to have to find Sameer. He therefore sacrifices his love for her and takes her to Italy in search for Sameer which becomes tough because Nandini doesn't have a picture of Sameer. While they are searching, Nandini gets shot by theives who take all their money and jewellery. Vanraj takes good care of her. While Nandini is in the hospital, Vanraj meets Sameer but he doesn't realize that this is the guy they are looking for. Soon, they become friends. Finally, Nandini has a chance to meet Sameer but she realizes that her feelings for him have changed. So, whom will Nandini chose? To know, you've got to watch the movie! Ajay Devgan has given one of his best performances ever. It is definitely a movie worth watching. Ash looks stunningly beautiful decked in traditional Indian clothes. The songs are also extremely good.",
         "Yes. Simply Outstanding. This is truly one of the best Bollywood movies to come out in a long, long time. A great commercial hit back in our India, it also swept all the major awards. Though I'm from India where Bollywood movies are compulsory watching, I dislike them for their absurdity but this film has me raving about it. Its simply fabulous. Set in western India in a prosperous Gujarti household overflowing with people, lives Nandini, our heroine (the beautiful Ashwariya Rai), daughter of a renowned singer Pandit Durbar. Sameer (Salman Khan), a handsome young Italian who comes to learn classical music from the Pandit falls in love with his daughter. As the movie enfolds, we watch the beautifully enacted comedy of the star crossed lovers. But once the father comes to know, all hell breaks loose. Sameer is thrown out of the house, Nandini's heart is broken and she is married of to a young, respectable and well mannered suitor Vanraj (Ajay Devgan) who truly loves her but is detested by Nandini. But the husband also discovers about the affair, is heartbroken too, but decides to take Nandini to Italy to meet her lover. As the plot moves to Italy (Hungary actually, which the director would have us believe as Italy), we are engaged in Nandini's and Vanraj's troubles of living in a foreign country, finding Sameer and living with each other. As she searches for her love, Nandini comes to know her husband and how much he truly loves her and realizes his grief and sense of loss in losing her. When she finally does find Sameer, she's torn between the two and must choose one of the them and break the heart of the other. This is Bollywood at its best. Here the wonderful music that goes with this film, it underlines each scene with its sparkling melody. Also the set pieces are lavishly mounted and the music numbers burst upon the seen. The movie is also very beautifully shot. This movie also captures Ashwariya Rai at her best. She is miraculously beautiful and lights up the screen whenever she's on it. All in all a must watch Bollywood affair. Iwould also recommend the same director's (Sanjay Leela Bhansali) Black, which is the story of a dumb, deaf and blind girl.",
         "HDDCS must have come straight from Sanjay Leela Bhansali's heart. Each and every scene is well-executed. It's a little unrealistic to have the husband help find the wife's lover, but movies have that little license to stretch the truth and I suggest we just let loose once in a while. Aishwarya Rai has been presented more beautifully than she already is. It's so ironic that she was once written off as wooden because she truly shines in this film. Her emotional scenes are a delight to watch. Even when she's not speaking, she communicates with her eyes, which is lovely. Even Salman Khan acts FAIRLY well in here. You can't tell when he's crying or laughing, but every time he irritates you, just turn to Ash for solace. Ajay Devgan does what he's best at. The romantic, silent hero. Hey, he's good at it, so I have no complaints. The sceneries are beautiful. There's not a song on the soundtrack which I don't like. Chand Chupa Badal and the title song are especially beautiful. The choreography is superb. The \"Tadap Tadap\" scene is perhaps one of the best I've ever come across. I confess. I actually cried during that song. :P The characters are so well-etched that you really don't know who to root for. You want Salman to get the girl, but you feel for Ajay, too. Bhansali is an artistic genius. He has surpassed his previous film (Khamoshi) with this flick. Can't wait for his Devdas.",
         "This movie is 3hrs long, but the pace of the movie was sufficient,so that the passage of time wasn't an issue. It's about a girl(Ash) who meets an Italian-Indian (salman).He stays at her home learning music/song from her father Initially she doesn't like the foreigner, but in time they fall in love with each other. At the same time a lawyer (ajay) see Ash and falls in love with her...in fact he asks for her hand in marriage. Her family agrees to the marriage, and she's reluctantly married to ajay. Meanwhile salman had asked to marry her and he was refused,so he goes away dejected. Ash is \"cold\" to her husband and he finally finds out why. He loves her so much that he's prepared to sacrifice his love by taking her to Italy to find salman and reunite the lovers........",
         "I'm a foreign film fan but new to Bollywood movies. However, I have noticed that when they are good, they are really, really good but when they are bad, they stink. Hum Dil De Chuke Sanam falls decidedly into the \"good\" category. What a wonderful movie! Despite the formulaic Bollywood theme, there is so much texture to this movie. The sets and locations visually match the narrative, the music evokes the range of emotions experienced by the characters, and the characters are well developed because they feel and grow just like real people (except for Italian-Indian, Sameer, played as a hulking, buffoon by Salman Khan who overacts as if he's in a cartoon and takes his shirt off way too much.) This movie \"had\" me with the first glimpse of Nandini ( Aishwarya Rai) walking home in the desert with her festival lantern. What a vision---the desert, the camel, and Nandini. Nobody runs in slow motion like Aishwarya Rai! The accompanying song Mitta Ki Hai is so full of energy and pumps up the fun and excitement of the desert game she plays with her friends. But it also tells you about Nandini who at the beginning of the film is still a girl at heart. She is playful, petulant, competitive and still childish. While the movie has a number of interesting characters, it really is Nandini's story because it tells of her transformation into womanhood in the context of first love and the temptations of an outsider (Sameer), the demands of her family and her culture, and the real love of a real man, Vanraj (played so honestly by Ajay Devgan.) At the start, like teenagers, Nandini and Sameer share a friendly and teasing relationship. Their antics include pranks, farting (yes, really), and 3-Stooges-like shtick. They have fun, flirt and as their interactions become more familiar, they develop a physical attraction to each other (afterall, wouldn't you be attracted to SK running around without a shirt!) and while they both believe it is love, it seems more of a crush than an \"abiding\" love. They have their first fight and a few opportunities to \"make out\". And poor naïve Nandini even believes she can become pregnant from kissing. Enter the good lawyer, Vanraj, who is smitten with Nandini when she performs Nimbooda. Aishwarya Rai just eats up the screen looking so heavenly and happy when she dances. Well, the course of true love never runs smoothly in Bollywood and Nandini and Sameer's \"affair\" is discovered. Poor Sameer is banished and Nandini is \"arranged\" to be married to Vanraj. Of course, Nandini, responding like any broken-up teenager would, is despondent and rebellious and Ms. Rai sinks her acting chops into these emotions quite competently. Intermission and the second half begins with the sexual tension rising. Nandini denies Vanraj his conjugal rights as well as any morsel of kindness because unbeknownst to Vanraj she is still \"in love\" with the buffoon. Vanraj doesn't get it but he is patient though frustrated. It is in the second half that the character of Vanraj is brought to the surface. A visit by Nandini's mother brings Sameer's letters via her servant which ultimately reach Vanraj's eyes. He is furious at first as he loves Nandini and feels she has lied to him. Ajay Devgan exudes a fine balance of strength and sensitivity here. There is also a good performance by Smita Jaykar as Nandini's mother who loves her daughter but wisely counsels her to smarten up�. and grow up. As her husband drags her out of the house, frightened Nandini starts to realize her life isn't a high school melodrama anymore but much more complex. Vanraj's character is revealed poignantly in his explanation to his father about why he must bring Nandini to \"Italy\" to find Sameer. His definition of love and what makes a real man should be plastered on billboards across the world for all to see. Nandini travels along on this quest with Vanraj and , at first, is quite surly and sullen not giving him any slack for this most generous act. As they spend more time together and have a few adventures, Nandini grows to understand his selfless motivations and then comes to respect and love him. This develops gradually as Vanraj earnestly sets out to find Sameer, as he cares for her after they are robbed and later as they clutch together in a long, soulful embrace on the train to avoid the ticket-checker. It finally culminates in their walk along the river as a drunken Vanraj releases all his emotion knowing that soon he will reunite Nandini and Sameer. As reunion time arrives, the scenes leading up to it are filled with such tenderness. Vanraj sits meditating as Nandini, now looking so womanly, so married, prepares to leave. You know she loves him when she helps him on with his jacket. The daydream scene with Sameer running across the bridge expresses Vanraj's resignation to losing her but he doesn't know that Nandini isn't feeling any ambivalence at this point. Sameer has lost. The taxi ride and their last moments together convey the true feelings of Nandini for Vanraj and vice versa as their eyes talk to each other but they don't utter a word. Ms. Rai's face sweetly expresses her interior thoughts and Mr. Devgan shows such understated agony as he watches Nandini climb the stairs to meet Sameer. Nandini's speech to Sameer reveals her maturation and new understanding that love is \"giving your heart\" ---hum dil de chuke sanam. Her return to Vanraj on the bridge is just beautiful�.the power and importance of the mangalsatra (marriage beads) are revealed just as her mother said. Shall I say something? See this movie for the beautiful script/story, romantic music, great characters, lush cinematography, fine acting by all (except SK and the Hungarians) and Bhansali's brilliant direction.",
         "This movie is one of the best Hindi movies i have ever watched. Aishwarya Rai as Nandini was simply wonderful, Salman Khan as Samir added a little comedy in the film. The story is a romance and drama. Samir(Salman Khan) is an indo-Italian student who comes to learn to sing from Nandini's father(Vikram Gokhale)and stays a year there. In the process Nandini and Samir fall in love, but she is arranged to be married to Vanraj(Ajay Devgan). Nandini sees Samir behind her father's back. Her father finds this out and Samir is sent away. Nandini Marys Vanraj. One day she receives letters from Samir and Vanraj sees them and becomes angry. But since Vanraj loves Nandini....he takes her to Italy to find Samir. What happens next in the story....it is up to you to find out! The movie was wonderful, the locations were beautiful, the songs were the best! The acting was great!!! overall i give this movie a 9/10!",
         "Hum Dil De Chuke Sanam (English title \"Straight from the Heart\") is an epic story with gorgeous landscapes, singing, dancing, romance, danger, betrayal, humor, religion, family and cultural tradition all balanced and directed masterfully to produce the most beautiful film. I saw this movie at the Berlinale International Film Festival, and I knew from the start that it was a real gem. By the end I had decided that it was the best movie I had ever seen. Some of the backgrounds and special effects are not perfect, but I never would have paid any attention to that except that lots of people in the theater were laughing. Some people might grow tired of the singing and dancing, but they're really quite superb. This movie is worth watching every of its 187 minutes.",
         "I missed the first half which was supposed to be the \"comedy\" section I suppose.There were no subtitles and since I speak no Hindi,it took me some time till the first commercial to find the title and look up what the plot was supposed to be. By that time,I was already aware that Salman Khan had broken his teacher,student relationship and been banished,that he loved Nandini,that she was allowed to break things willy nilly but not to refuse marriage with a man she didn't love. The comedy part escaped me. I was about to change channels when I realized the husband was played by the young man who did such a good job in the recent movie about a young Sikh freedom fighter. When he,playing Raj, and Nandini, left for Hungary,I thought it was for a belated honeymoon. Remember-no subtitles. But THAT was supposed to be Italy????? My only complaint was that the hotel staff on the phone spoke English with an Italian accent when they were so obviously Hungarian. Silly me. I don't understand the lure of Italy perhaps when Hungary is so distinctive and charming. Why couldn't Sameer be half Hungarian? I'll buy the movie for my kids,since they ARE half Indian and half Hungarian and it was nice to hear the language and see how well the people fit in. I loved the Hungarian dance sequence. Maybe they'll redub it and take out the reference to Italy.It just wasn't right."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Musical",
         "Romance"
      ],
      "productionCompanies": [
         "Bhansali Films",
         "Jhamu Sughand Productions"
      ],
      "summaries": [
         "When Sameer asks for Nandini's hand in marriage her family refuses. They have already chosen a husband for their daughter. Sameer returns to Italy. When Vanraj, Nandini's husband realizes that his new bride has been in love with someone else, he is prepared to sacrifice his love for her and take her to Italy to be reunited with her true love, Sameer.",
         "Indian-based traditional family of Pundit Darbar (Vikram Gokhale) gets a visit from Sameer Rossellini (Salman Khan), from Italy, who has come as a pupil to learn music and singing. Darbar and his family accept him. Sameer meets Nandini (Aishwarya Rai), Darbar's daughter, and both fall in love. But Darbar wants Nandini to wed Vanraj (Ajay Devgan), and has Sameer swear that he will leave India, and not marry Nandini, as his fee, to which Sameer agrees. Nandini is heartbroken, but does reluctantly marry Vanraj. When Vanraj finds out that Nandini is in love with Sameer, he takes her to Italy, so that both can be together again. Nandini must now come to terms with living with Sameer in Italy, or alienating her family and her new groom.",
         "Nandini has to choose between Sameer, the man who taught her to fall in love; and Vanraj, the man from whom she learnt how to abide and fulfill promises of love."
      ],
      "budget": 60000000
   },
   "movielensId": 34466,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "1999-06-18",
      "dvdReleaseDate": null,
      "directors": ["Sanjay Leela Bhansali"],
      "runtime": 188,
      "movieId": 34466,
      "title": "Hum Dil De Chuke Sanam",
      "mpaa": "",
      "actors": [
         "Ajay Devgn",
         "Salman Khan",
         "Aishwarya Rai Bachchan",
         "Vikram Gokhale",
         "Smita Jaykar",
         "Zohra Sehgal",
         "Rajeev Verma",
         "Vinay Pathak",
         "Sheeba Chaddha",
         "Helen",
         "Kermati Desai"
      ],
      "imdbMovieId": "0150992",
      "originalTitle": "Hum Dil De Chuke Sanam",
      "genres": [
         "Comedy",
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "8LPH9F2vWpY",
         "mXuKDazxSnI",
         "2n_Zw3Mi05A",
         "6VBAGMkTjTs",
         "UIYW8IZ89rQ"
      ],
      "plotSummary": "Indian-based traditional family of Pundit Darbar (Vikram Gokhale) gets a visit from Sameer Rafilini (Salman Khan), from Italy, who has come as a pupil to learn music and singing. Darbar and his family accept him. Sameer meets Nandini (Aishwarya Rai), Darbar's daughter, and both fall in love. But Darbar wants Nandini to wed Vanraj (Ajay Devgan), and has Sameer swear that he will leave India.",
      "tmdbMovieId": 5319,
      "avgRating": 3.40278,
      "releaseYear": "1999",
      "numRatings": 36,
      "posterPath": "/x28pUIfzQrQXLj2tAW7LWazEqqt.jpg"
   }
}