{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "corruption",
            "id": 417
         },
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "chase",
            "id": 3713
         },
         {
            "name": "collector",
            "id": 4295
         },
         {
            "name": "farm",
            "id": 4932
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "kansas city",
            "id": 11016
         },
         {
            "name": "extortion",
            "id": 11259
         },
         {
            "name": "drug dealing",
            "id": 11733
         },
         {
            "name": "business",
            "id": 12094
         },
         {
            "name": "prostitution",
            "id": 13059
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "cornfield",
            "id": 156802
         },
         {
            "name": "white slavery",
            "id": 192248
         },
         {
            "name": "small community",
            "id": 210455
         },
         {
            "name": "meatpacking",
            "id": 211214
         }
      ],
      "imdb_id": "tt0069121",
      "video": false,
      "title": "Prime Cut",
      "recommendations": [
         32087,
         20942,
         114442,
         42252,
         28110,
         72639,
         29142,
         42738,
         23330,
         22112,
         20802,
         24229,
         1834,
         12239,
         36191,
         89160,
         18643,
         27331,
         42597,
         26652
      ],
      "backdrop_path": "/yKV7XUz0X9bb6JVszBPVvwM5gTr.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "MoHA",
         "id": "550b95ff9251413554000747",
         "content": "Want to talk about a movie that broke the mould when it was made?\r\nLet’s talk about Prime Cut.\r\nStarring Lee Marvin, Gene Hackman and Sissy Spacek, this 1972 film is eighty-eight minutes of pulp weirdness – part exploitation flick, part brutal, hard-boiled, crime story.\r\nPrime Cut was directed by Michael Ritchie, who did no other work of any consequence (with the possible exception of The Candidate, also made in 1972), and written by another relative unknown, Robert Dillon.\r\nMarvin plays Nick Devlin, a tough as nails enforcer who is hired to go to Kansas City and retrieve half a million dollars owed to the Chicago mob by a slaughterhouse Kingpin called Mary Ann (Hackman).\r\nDriving all night, Devlin and his men arrive at Mary Ann’s ranch in the middle of a livestock auction. The slaughterhouse is a legitimate business as well as being a front for a white slavery racket. Groups of well-dressed men wander around the inside of a giant barn, bidding on drugged, naked women, Mary Ann’s ‘livestock’, who have been sourced from orphanages and bus stops.\r\nOne of the girls, Poppy (Spacek), manages to ask for help through her drug haze. Marvin takes her ‘on credit’ and leaves, after getting Mary Ann’s agreement to meet him next day and hand over the money.\r\nDescribing what happens next is not so important, given the over the top, weird, at times surreal nature of the story and fact that so much is unexplained.\r\nThe film makes no attempt to explore how Mary Ann amassed such a huge debt or the origins of the obvious animosity between he and Devlin. Ditto, no detail is provided on the previous relationship between Devlin and Mary Ann’s scheming, platinum blonde trophy wife, Clarabelle (Angel Tompkins).\r\nSuffice to say, the money exchange doesn’t go down as planned leaving Devlin with no choice but to take Mary Ann’s organisation apart piece by piece. Nothing unusual in any of that. But amidst the action there are some truly wonderful touches and themes.\r\n1. The opening credits\r\nThe opening credits show cattle being brought to a slaughterhouse, killed and made into sausages. Lalo Schifrin did the score, and used elevator muzak overlayed with the sound of a meat saw cutting through bone. It’s pretty disturbing, especially when a tall, muscular man (‘Weenie’, Mary Ann’s brother), interrupts the operation of the sausage making machine with a “special order”, the disposal of the most recent group of debt collectors dispatched by the mob. They are made into sausages and mailed to their bosses in Chicago.\r\n\r\n2. Marvin\r\nThis is by no means Marvin’s best role (that gong would go to Point Blankor The Dirty Dozen). Indeed, it feels as if he’s almost doing the role on autopilot. It doesn’t matter, from the moment we lay eyes on him downing boiler makers in a Chicago bar and eying off the mob boss’s girl friend, its classic Marvin, a mixture of quiet tough guy intensity and wry humour.\r\n3. Spacek\r\nPrime Cut was Spacek’s first major screen role, and her performance shifts between doe eyed ingénue and avenging angel. In one of the film’s best scenes, she accompanies Devlin to dinner at the best restaurant in Kansas City, clad only in a see through green dress. As the rest of the clientele, Kansas City’s finest, look on, she tells Devlin about how she came to be Mary Ann’s captive. Given the content, it’s a strangely asexual scene, the relationship between the two more like father and daughter than anything else.\r\n4. The combine harvester chase\r\nAfter the money exchange goes bad, Devlin and Poppy are forced to flee through a huge wheat field, where one of Mary Ann’s soldiers chase them with giant combine harvester. If you,ve ever wondered what would come off best in an encounter between a combine harvester and a speeding car, this is your chance to find out.\r\n5. American gothic\r\nKansas is depicted as a nightmare version of American Gothic, a corrupt, all white kingdom presided over by Mary Ann and his army of blond haired, shot gun wielding young men dressed uniformly in denim overalls. The backdrops for the action include country fairs and vast expanses of wheat and sunflowers. There are also some terrific locations in early seventies Kansas City, including the half-way house for derelicts and piss bums, where Weenie lives.\r\nFresh from The French Connection the previous year, Hackman plays Mary Ann with a sense of playful malevolence, like a bent Republican politican spruiking the virtues of the all-American heartland. Between mouthfuls of offal, he tells Devlin  “Chicago is crumbling. Nothing left there but kids and old men. What hasn’t been burned down has been picked over.”\r\nDevlin and his men make absolutely no concession to the bizarre rural landscape and their role as outsiders in it. Devlin smokes cigars, wears only a grey suit and white shoes, while his men are clad in black. They cruise around in a giant black Cadillac and stay in the best hotel in town. I couldn’t help but make an analogy with the Vietnam War, which was raging at the time. Marvin and his men are like an occupying force, compensating for their conspicuousness with superior fire power.\r\nUnlike a lot of the films I review on this blog, Prime Cut is not expensive or hard to find. Don’t waste any more time, get it and enjoy one of the genuinely strangest cinematic crime offerings of the early seventies.",
         "url": "https://www.themoviedb.org/review/550b95ff9251413554000747"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Nick Devlin",
               "gender": 2,
               "credit_id": "52fe453cc3a368484e04f57b",
               "name": "Lee Marvin",
               "profile_path": "/xsXdqvZpxlo7iEm2ODMnXbfNgZM.jpg",
               "id": 18391,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Mary Ann",
               "gender": 2,
               "credit_id": "52fe453cc3a368484e04f583",
               "name": "Gene Hackman",
               "profile_path": "/qEKcmwc1XstymEniGuCs3KIsGfP.jpg",
               "id": 193,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Clarabelle",
               "gender": 1,
               "credit_id": "52fe453dc3a368484e04f587",
               "name": "Angel Tompkins",
               "profile_path": "/uKsybLhwT46UWpA9lsJpaa5SNfP.jpg",
               "id": 45002,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Weenie",
               "gender": 2,
               "credit_id": "52fe453dc3a368484e04f58b",
               "name": "Gregory Walcott",
               "profile_path": "/oTGgXPEOqGR8Yu7N9mRSaWLbMkE.jpg",
               "id": 41279,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Poppy",
               "gender": 1,
               "credit_id": "52fe453cc3a368484e04f57f",
               "name": "Sissy Spacek",
               "profile_path": "/zauFMssYujKk7Kadz0t100VU5WE.jpg",
               "id": 5606,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Violet",
               "gender": 1,
               "credit_id": "52fe453dc3a368484e04f58f",
               "name": "Janit Baldwin",
               "profile_path": "/tFVhMJKYORPRG6vGSB7kb7CNOPd.jpg",
               "id": 97594,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Shay",
               "gender": 0,
               "credit_id": "558f1600c3a36843cf007b95",
               "name": "William Morey",
               "profile_path": null,
               "id": 1482168,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Delaney",
               "gender": 0,
               "credit_id": "558f161c9251416512000031",
               "name": "Clint Ellison",
               "profile_path": null,
               "id": 1482170,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Shaughnessy",
               "gender": 2,
               "credit_id": "558f16329251413484000cc4",
               "name": "Howard Platt",
               "profile_path": null,
               "id": 159041,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "O'Brien",
               "gender": 2,
               "credit_id": "558f164dc3a3684de8003b0a",
               "name": "Les Lannom",
               "profile_path": null,
               "id": 119856,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Jake",
               "gender": 2,
               "credit_id": "558f165a9251410ca7000733",
               "name": "Eddie Egan",
               "profile_path": "/jII3pRDiprB96WDNy7zyXCXDH2m.jpg",
               "id": 152680,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Jake's Girl",
               "gender": 0,
               "credit_id": "558f1668c3a36843cf007ba8",
               "name": "Therese Reinsch",
               "profile_path": null,
               "id": 1324918,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Desk Clerk",
               "gender": 2,
               "credit_id": "59fbbb77c3a3681a6401c75f",
               "name": "Hugh Gillin",
               "profile_path": null,
               "id": 73349,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Milk Lady",
               "gender": 0,
               "credit_id": "558f167f9251416489000045",
               "name": "Gladys Watson",
               "profile_path": null,
               "id": 1482171,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Orphan Sold at Auction (uncredited)",
               "gender": 0,
               "credit_id": "558f169dc3a3685a310054cb",
               "name": "Jerry Tracey",
               "profile_path": null,
               "id": 1482173,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Orphan Sold at Auction (uncredited)",
               "gender": 0,
               "credit_id": "558f16adc3a368434900111c",
               "name": "Judy Williams",
               "profile_path": null,
               "id": 1268683,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe453cc3a368484e04f577",
               "name": "Michael Ritchie",
               "profile_path": "/62566NoTLMRVLdoE07RG1B55zxy.jpg",
               "id": 12964,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546ec024c3a3682fa4000dd7",
               "name": "Robert Dillon",
               "profile_path": null,
               "id": 66919,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "558f16f29251410ca7000743",
               "name": "Joe Wizan",
               "profile_path": null,
               "id": 21024,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "558f170092514123eb000dde",
               "name": "Lalo Schifrin",
               "profile_path": "/zYz8R5xJGdO4Rq2FrcagMoG1UxD.jpg",
               "id": 9217,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "558f170ec3a3685d45000741",
               "name": "Gene Polito",
               "profile_path": null,
               "id": 24312,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.274612,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27292,
      "vote_count": 30,
      "budget": 0,
      "overview": "A Chicago mob enforcer is sent to Kansas City to settle a debt with a cattle rancher who not only grinds his enemies into sausage, but sells women as sex slaves.",
      "similar": [
         156022,
         36349,
         400,
         2142,
         3134,
         479,
         26390,
         37645,
         9654,
         101,
         949,
         8810,
         769,
         4771,
         245891,
         281957,
         10017,
         25473,
         261023,
         298312
      ],
      "original_title": "Prime Cut",
      "runtime": 88,
      "poster_path": "/7hnfWn8NxZHzYnorGEaWVDbsQH6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Cinema Center Films",
         "id": 3070,
         "origin_country": ""
      }],
      "release_date": "1972-06-28",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Lee Marvin and Gene Hackman, Together they're murder in...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Ritchie"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Robert Dillon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069121/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3MjI1Njc3N15BMl5BanBnXkFtZTcwNTIzMjkyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lee Marvin, Gene Hackman, Sissy Spacek | See full cast and crew »"],
      "reviews": [
         "I cannot understand why this film has been so totally ignored by everyone - fans, critics, the French, you name it. For starters, it has an opening shot that is at least equal & in many ways superior to the opening of Touch of Evil. It alone is worth the price of the video & it will take several viewings to realize what you're watching: i.e. not a pastiche of an industrial film, but rather a key element in the plot. The problem is, much is lost in the stupid reformatting for video. & so much else about this work is so phenomenal: the cornfed milkdrinking killers, the country fair, the chase scene in the endless sea of wheat, the farm machine (a combine, I believe) that gobbles up the big black caddie & above all...Gene Hackman as \"Mary Ann\" who \"eats guts\" as Lee Marvin so succinctly puts it. The livestock show is quite a number, too. This was the peak of the last gasp of the golden age of film: 1972. They don't get better than this. This movie deserves to be totally restored & rereleased on DVD. Meanwhile, the VHS is better than nothing. Go For It!!!",
         "In the Fifties, in \"Violent Saturday,\" he made a little name as the killer who kept using a nose spray while terrorizing Sylvia Sidney and a bank\u0085 When Don Siegel made the second version of Hemingway's \"The Killers,\" he was the cool, hard gunman who knew he was being paid to do the job and would definitely do it, come hell or high water\u0085 His \"Prime Cut,\" is a study in professionalism\u0085 Before that came \"Point Blank,\" in which again he was the unstoppable force\u0085 But watch him in \"Prime Cut.\" Notice the care with which he handles the tools of his trade, the cavalry rifle which takes to pieces and is lovingly kept in a neat executive-style case\u0085 He is a \"hit man,\" a torpedo who can be hired by the new breed of businessman-gangster\u0085 Pressured into a job against his will, he is sent to Kansas City to enforce his employer's demands for payment from another gangster-type\u0085 From then on, a trail of murder, malice and killing makes the screen run red\u0085 If the baddies all come to sticky ends \u0096 so does at least one innocent person, whom Marvin involves \u0096 as in the case of the truck-driver whose vehicle he hijacks\u0085 \"Prime Cut\" is a tremendously exciting film, if one disregards its moral values\u0085 At the end Marvin, the paid killer who keeps the weapons of his trade in velvet-lined cases, has destroyed all the other villains\u0085 yet walks off into the sunset without a hint of retribution\u0085",
         "\"Prime Cut\" is a film which, despite the fact I ended up enjoying it, was completely unlike I expected it to be. I rented it thinking it would be another brutal Lee Marvin gangster flick along the lines of the masterpiece \"Point Blank\". Instead, its a quirky and bizarre little pseudo-existentialist flick that would only come from a major studio in the 1970s. The film is far from perfect (theres times when its just a bit too offbeat), but overall its a very satisfying little film. Its low key and subtle, and I have a feeling it'll improve upon repeat viewings. The plot is very lurid (a mob enforcer goes to Kansas to deal with a cattle rancher who grinds his enemies into sausages and sells drugged-up sex slaves), but the film itself isn't too sleazy. What makes this film worth watching, even more than the unique nature of the script, is the phenomenal acting. Lee Marvin is always a charismatic and compulsively watchable screen presence. I'd go so far as to say hes the greatest screen \"tough guy\" of them all. Here, hes nothing less than mesmerizing. Gene Hackman proves once again hes very good when playing larger-than-life villains. He wouldn't get such a meaty bad guy role until \"Unforgiven\" twenty years later. Sissy Spacek does what she can with a likable if underwritten role. She never looked cuter in a film than she does here. Plus, cult film buffs will get a kick out of seeing Gregory Walcott, fondly remembered as the hero in the schlock classic \"Plan 9 From Outer Space\". The direction by Michael Ritchie keeps everything moving at a quick pace, and manages to make many bizarre scenes quite tense and exciting. \"Prime Cut\" isn't a masterpiece, but its an overlooked and interesting film thats worth watching for fans of 70s movies. (7/10)",
         "Director Michael Ritchie tore the innards out of the beauty contest culture with \"Smile,\" competitive sports with \"Downhill Racer\" and politics with \"The Candidate.\" Here he does the same service for the Great American Crime Film. Robert Dillon's script is an extended Irish joke, a la John Huston (\"The Treasure of Sierra Madre,\" \"Beat the Devil,\" \"The List of Adrian Messenger\"). A plausible surface does not mean a realistic film. Michael Ritchie takes iconic actors like Lee Marvin and Gene Hackman, who only have to be visible to make an effect. He puts in lots of destruction of property, and neo-Nazi blond bad boys falling by the score. There's shotguns and submachine guns and carnivorous farm equipment and 18-wheel trucks and all sorts of unlikely weapons. And the usual movie dichotomy of country good, city bad is stood on its head, with agriculture fairs and cornfields and sunflower fields as dangerous to life and limb as you could hope for (paging Alfred Hitchcock!). There are complaints in some reviews here that the film is vulgar. It is, and it knows it is, and is not simple-minded about it at all. There are complaints that it is violent. It is, and the violence is deliberately exaggerated to remind you at all times that you are watching a movie. There are complaints that we never learn enough about the characters' previous lives. The film knows it, and systematically gives you just less than enough information. The idea is for you to use your imagination afterwards, rather than have the film hold you by the scruff of the neck and rub your nose in stuff that really doesn't matter except to tie things up with a bow. What matters is not who the characters are, because they aren't. There are few real people here, and none of them are important to the story. It's in what the characters do, and what gets done back at them, and how does this reflect other movies, and the culture that produces movies like this in the first place? When you watch a hit-man with a heart of gold, a bad guy named Mary Ann who traffics in narcotics and prostitution, and learn more about the stockyards than you probably want to know, it's not because the filmmakers are stupid or incompetent. It's because they're deliberately trying to skew everything you see a little to one side and play around with your expectations. Some people don't like the sensation of being thrown off balance. But if you think you might like it, by all means give this picture a try. It's funny.",
         "Here we have Gene Hackman as the head of the Kansas City mafia. Leaving the city behind, Hackman makes his money on pork and prostitution. We quickly find out that Hackman is indebted to the Chicago mob for 500 large. They send one of their hoods down there to collect, but Hackman literally turns him into hotdog meat and mails the \"franks\" back to Chicago. Ready to play hardball, the Chicago mob retort by sending Lee Marvin down there to take out the trash, saving a young Sissy Spacek along the way. The ruckus that ensues is worth the price of the DVD alone, or at least a rental.",
         "Two legendary Hollywood hard men, Lee Marvin and Gene Hackman, go head-to-head in this interesting thriller from director Michael Ritchie. Hackmann can act, Marvin just plays his stock character, but it's actually the latter to exudes more charisma, although the script is on his side: this is very much a Lee Marvin vehicle, structured not unlike 'Point Blank'. But that film had a distinctive, alienating air and ultimately showed clearly that its hero was no different, no better, to those he was pursuing. In 'Prime Cut', however, the villains of piece are (more typically, and more disappointingly) shown to be so depraved that Marvin is justified in sub-machining them down. Moreover, the sub-plot that explains this, their involvement in the trafficking of women to the sex trade, is presented in such a way as to seem sexist in itself. In other ways too the film appears dated: the editing is stuck somewhere between naturalistic and slick (not quite feeling like either), and the undeniably effective soundtrack is also horrid. What's more interesting is the setting: the story takes place in rural Missouri, but this is not America the beautiful. Instead, its the land of agribusiness and as such portrayed with an element of truth: although Ritchie does appear caught between emphasising its differences from the city, and its similarities. 'Point Blank' was a film ahead of its time in terms of style and tone. 'Prime Cut' is more like a typical thriller from the early 1970s. But either way, they don't make men like Marvin any more.",
         "So what if 'Dog Day', made a decade later, repeats the threshing machine chase. It only underscores the success of the original, in which the 'teeth' of the threshing machine seem almost human. Watching them grind up the limo makes you feel almost sorry for the car. There are other scenes and themes I doubt that you will ever see in another movie: the packing house expose of what that meat you eat really goes through as it goes from the moo-cow to the sausage, for one. At least we don't see the guy actually made into the sausage the brother keeps eating!! Hackman plays his evil best as an all-American who 'gives the public what they want' from meat to dope to virgins raised in an orphanage quite unlike the one in 'Cider House Rules'. Sissy Spacek does a good job in her first onscreen role, but come on!!! No one could be so stupid as to be unaware that they are wearing a completely transparent gown!! A few other holes in the film exist, but it is certainly a unique experience.",
         "It helps if you are a big Lee Marvin fan to enjoy this movie - but even if you're not especially, there's still enough in here to raise it above run-of-the-mill. The cinematography is first-rate; lots of use of natural light and dingy locations of the city contrasted with the golden Kansas sunshine. Both Marvin and Gene Hackman are terrific and each exude good screen presence as gangsters at odds with each other, culminating in the shoot-out in the sunflower field and cattle house. The film is slightly let down by the sentimental and unnecessary last scene at the orphanage, which feels grafted on, although the very final shot of the children running into the countryside hints at some kind of hope for the future (post Vietnam), not least between Nick Devlin (Marvin) and his new girl Sissy Spacek. Worth watching",
         "I sought out this gem of a film after being impressed by \"Point Blank\". Lee Marvin exudes the kind of toughness that most modern day actors can't equal. Only Eastwood comes close. This is a raw, gritty and entertaining revenge/mob picture. Gene Hackman plays the heavy, but who is heavier than Lee Marvin? You just don't want to mess with him. I think this is one of Sissy Spacek's first appearances. Look at most modern \"action\" movies. There is a cookie-cutter formula. They try to be all things to all people. I call it the \"Bruckheimer Effect\" You have to force the \"hip\" humor for those with attention-span problems. You have to include a romantic interest/sex-sysmbol for the girlfriends and the drooling twelve-year-olds. You have to tie it all in with large explosions and car chases. Are you as bored as I am of these films? Watch \"Prime Cut\" and you won't see the extra grisle and fat of a modern hollywood action film . You will see a U.S.D.A. Choice kick ass movie.",
         "The best thing about Prime Cut is the chance to see both Lee Marvin and Gene Hackman. Marvin is the understated bad-ass we've seen before and Gene Hackman is the greasy bad guy we've seen before. If you like these two in familiar roles that don't require them to stretch their acting abilities, Prime Cut is for you. There are some good action sequences (especially the scene in the wheat field), but it's the two stars that make this one worthwhile. The plot certainly isn't the attraction. In fact, the plot is the weakest part of the movie. Why? Because there is no plot. Instead, Prime Cut is a series of action sequences strung together with a bare minimum of story. When the movie ended, I had more questions than when it began. What's the history between Marvin and Hackman? What is the relationship between Marvin and Hackman's wife? Does anyone in the movie have a backstory? Are the Kansas City area police completely oblivious to everything going on around them? Was that just some random fat guy on the combine trying to kill Marvin? Do people in Kansas City really wear overalls with no shirt or shoes? It's these burning questions that I wanted answers to."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Cinema Center Films"],
      "summaries": [
         "A Chicago mob enforcer is sent to Kansas City to settle a debt with a cattle rancher who not only grinds his enemies into sausage, but sells women as sex slaves.",
         "When mob associates turn up dead at the hands of a ruthless businessman, an enforcer is sent down to Kansas to investigate the incidents. What he finds is a man who is turning a seemingly idyllic town into a seething underbelly of corruption: drugs, bootlegging, and female sexual slavery. The very man responsible for the murders is someone who won't stand down and pay a long standing debt that turned those looking for it, dead. The last unfortunate person to do so was ground into sausage, a nasty business run by that man who specializes in cattle. What occurs is a gang war between the men who now dominate this farm locale with an iron fist, and the men trying to put closure on an escalating situation."
      ],
      "budget": 0
   },
   "movielensId": 34583,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-06-28",
      "dvdReleaseDate": "2005-06-14",
      "directors": ["Michael Ritchie"],
      "runtime": 88,
      "movieId": 34583,
      "title": "Prime Cut",
      "mpaa": "R",
      "actors": [
         "Lee Marvin",
         "Gene Hackman",
         "Angel Tompkins",
         "Gregory Walcott",
         "Sissy Spacek",
         "Janit Baldwin",
         "William Morey",
         "Clint Ellison",
         "Howard Platt",
         "Les Lannom",
         "Eddie Egan",
         "Therese Reinsch",
         "Hugh Gillin",
         "Gladys Watson",
         "Jerry Tracey",
         "Judy Williams"
      ],
      "imdbMovieId": "0069121",
      "originalTitle": "Prime Cut",
      "genres": [
         "Action",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["ZObOxHxxG9A"],
      "plotSummary": "A Chicago mob enforcer is sent to Kansas City to settle a debt with a cattle rancher who not only grinds his enemies into sausage, but sells women as sex slaves.",
      "tmdbMovieId": 27292,
      "avgRating": 3.34,
      "releaseYear": "1972",
      "numRatings": 75,
      "posterPath": "/oBTAFS5UBfMTno9n5n5pJ6rhhQp.jpg"
   }
}