{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "adolescence",
            "id": 704
         },
         {
            "name": "lion",
            "id": 2043
         },
         {
            "name": "south africa",
            "id": 3644
         },
         {
            "name": "bullying",
            "id": 6733
         },
         {
            "name": "kids and family",
            "id": 9963
         },
         {
            "name": "rescue",
            "id": 10084
         },
         {
            "name": "bully",
            "id": 10624
         },
         {
            "name": "young boy",
            "id": 11336
         },
         {
            "name": "cheetah",
            "id": 11337
         },
         {
            "name": "wild animal",
            "id": 11338
         }
      ],
      "imdb_id": "tt0361715",
      "video": false,
      "title": "Duma",
      "recommendations": [
         38502,
         74982,
         48508,
         239367,
         25656,
         38509,
         356156,
         48375,
         229173,
         62127,
         16321,
         16355,
         18451,
         21370,
         109048,
         234284,
         18074,
         17962,
         12454,
         40688
      ],
      "backdrop_path": "/79lmfotVqntIVamh4Yor2DRoL34.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Xan",
               "gender": 0,
               "credit_id": "52fe46899251416c7507b66f",
               "name": "Alex Michaeletos",
               "profile_path": null,
               "id": 111176,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Peter",
               "gender": 2,
               "credit_id": "52fe46899251416c7507b673",
               "name": "Campbell Scott",
               "profile_path": "/LpYIN2jh58sHaUFM2r3G4G0iE6.jpg",
               "id": 55152,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Thandi",
               "gender": 1,
               "credit_id": "52fe46899251416c7507b677",
               "name": "Mary Makhatho",
               "profile_path": null,
               "id": 111177,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lucille",
               "gender": 0,
               "credit_id": "52fe46899251416c7507b67b",
               "name": "Nthabiseng Kenoshi",
               "profile_path": null,
               "id": 111178,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Kristin",
               "gender": 1,
               "credit_id": "52fe46899251416c7507b67f",
               "name": "Hope Davis",
               "profile_path": "/m1RBUwfxms0o4PAOaHYaGT0DpAj.jpg",
               "id": 15250,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Aunt Gwen",
               "gender": 1,
               "credit_id": "52fe46899251416c7507b683",
               "name": "Jennifer Steyn",
               "profile_path": "/qFwxa6FTMmRayqwOv459UejbMFH.jpg",
               "id": 111179,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Coach Nagy",
               "gender": 2,
               "credit_id": "52fe46899251416c7507b687",
               "name": "Nicky Rebello",
               "profile_path": "/vKEYwE7krXxkSvLWuwWCb6p0eOE.jpg",
               "id": 111180,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Michael",
               "gender": 0,
               "credit_id": "55e57f0c925141379a001ec1",
               "name": "Javad Ramezani",
               "profile_path": null,
               "id": 1503256,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Ripkuna",
               "gender": 2,
               "credit_id": "577680d39251414919003f5a",
               "name": "Eamonn Walker",
               "profile_path": "/mfB9S91rT1ZbqZloEn5i5jYTKoC.jpg",
               "id": 19299,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46899251416c7507b68d",
               "name": "Carroll Ballard",
               "profile_path": "/h4y9QocZWrBSlYd9ZavcJBRAHd5.jpg",
               "id": 68212,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46899251416c7507b693",
               "name": "Doug Claybourne",
               "profile_path": null,
               "id": 2986,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46899251416c7507b699",
               "name": "George Acogny",
               "profile_path": null,
               "id": 111181,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe46899251416c7507b69f",
               "name": "John Debney",
               "profile_path": "/hTrlvZlDXQk49nfc2BM9sjKfJv.jpg",
               "id": 4500,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "53e21498c3a368484700070a",
               "name": "Carol Cawthra",
               "profile_path": null,
               "id": 1350294,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53e214c1c3a368484d00073d",
               "name": "Carol Cawthra Hopcraft",
               "profile_path": null,
               "id": 1350295,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53e214e0c3a368486000064a",
               "name": "Xan Hopcraft",
               "profile_path": null,
               "id": 1350297,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53e214efc3a368485c000702",
               "name": "Carol Flint",
               "profile_path": null,
               "id": 1219528,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "53e214fdc3a368485000070b",
               "name": "Karen Janszen",
               "profile_path": null,
               "id": 56909,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53e21515c3a368484d000747",
               "name": "Mark St. Germain",
               "profile_path": null,
               "id": 161881,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.708608,
      "production_countries": [{
         "iso_3166_1": "ZA",
         "name": "South Africa"
      }],
      "id": 15907,
      "vote_count": 54,
      "budget": 12000000,
      "overview": "An orphaned cheetah becomes the best friend and pet of a young boy living in South Africa.",
      "similar": [
         8587,
         862,
         8247,
         13310,
         630,
         258230,
         41402,
         13205,
         27769,
         11076,
         14211,
         17,
         70821,
         13339,
         1256,
         192623,
         292044,
         331359,
         21766,
         244123
      ],
      "original_title": "Duma",
      "runtime": 100,
      "poster_path": "/51DifIBx53qRHNFgYuQJg03EFeL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Pandora Pictures",
            "id": 5329,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gaylord Films",
            "id": 5367,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "John Wells Productions",
            "id": 1512,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2005-04-22",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Some friendships are wilder than others",
      "adult": false,
      "homepage": "http://dumamovie.warnerbros.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Carroll Ballard"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Carol Cawthra Hopcraft",
         "Xan Hopcraft"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0361715/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzMTg3NzQ1NV5BMl5BanBnXkFtZTYwNzg2NDc2._V1_SX214_AL_.jpg",
      "actors": ["Stars: Alex Michaeletos, Campbell Scott, Hope Davis | See full cast and crew »"],
      "reviews": [
         "I have no idea why this movie got such a small-scale cinema release. It certainly can't have anything to do with the quality of the film. I was surprised by Duma, because it's an extremely well-directed film which treats its audience with far more respect and intelligence than a lot of so-called \"family\" fare available. Also, as opposed to many films with animal protagonists, Duma doesn't treat them as objects of half-witted hokey slapstick fun, but instead makes the entire friendship between human and animal seem extremely touching and authentic. In a way there is something almost Miyazaki -esque about this movie, in that it draws you into the narrative not with half-baked nudge nudge wink wink references which only adults will understand, but through its intelligence and excellent sense of drama alone; not to mention the great performances by Eamonn Walker and Alexander Michaeletos - two names to look out for in the future if their performances here are anything to go by. At any rate, Duma is one of the few cases where the possibly over-used moniker \"A film for all ages\" definitely applies. Recommended if you can find it.",
         "This was such a lovely film for everyone, and it seems to be ending its New York run this Sunday, October 16th after just 17 days. Why? Not only did it receive excellent reviews, the showing I attended last Saturday afternoon in the counter-cultural East Village was packed! As a much needed quality family film, \"Duma\" should have been given a wide release and much more promotion. I rarely go to the movies, and I was waiting and hoping for its release for months. A wonderful family film with affection, learning, adventure, mystery, and respect between the boy Xan and his cheetah, Xan's father and mother, and Xan's friend Rip. It also has a Prodigal Son theme. The cinematography is exquisite, with the golden cat with the golden eyes and the golden African desert and savanna that seem to stretch on for eternity. A beautiful, humorous, gentle, poignant, and touching film about love, kindness, and mercy. A genuinely loving family. The courage to grow up. Are these values too truthful for Hollywood, or they too real for the general public?",
         "This movie is so good, I wonder why it is in such limited release? At least in Wales, it only plays for two showings each weekend. Anyway--- I like animal movies, generally. Even those that stray into a bit of the fantasy, such as 'Bingo', and 'Two Brothers', can be enjoyable and charming. 'Duma' was delightful. I have not read about the making of the movie, but they did use real cheetahs. Some kittens, adolescents, and maybe adults, too. I found the representations of the human-cheetah relationship entirely believable. And even though this is a 'family' movie, and suitable for 12 year-olds, it was also solid enough to get an adult through it as well. The peril is plausible, the characters' motivations and behaviors seem reasonable. Overall, the movie worked well enough as a movie--- entertaining, dramatic, etc. But more, and the reason I gave it a 10 out of 10, is the movie also seemed to portray the charm, grace, and dignity of a truly great relationship a human can have with an animal. That, placed in the movie-world context of family drama and human enterprise, is a wonderful and magical thing.",
         "I feel fortunate that Warner Brothers has chosen to screen \"Duma\" here in the Chicago area. I only hope they decide to support a nationwide release because this is a movie that deserves to be seen. I found myself crying several times at the touching story, and also heard my own laughter echoed by others in the theater during the humorous moments. I found out about \"Duma\" while I was researching a book I'm currently reading. It's called \"The Spotted Sphinx\" and is by Joy Adamson - the same woman who wrote \"Born Free\". During the filming of the movie based on the book \"Born Free\", Joy was given a young female cheetah and was asked if she could rehabilitate it back into the wild. \"The Spotted Sphinx\" and its follow-up, \"Pippa's Challenge\" are about that rehabilitation process. \"Duma\" is about a similar situation, except it is about a young boy and how he also finds himself while helping his pet cheetah find \"home\" again. The boy who portrays \"Xan\" is excellent in the role and you can really feel the love he has for his animal. The cinematography is beautiful, and I was very pleased with how true-to-life they were with how cheetahs interact with people. Cheetahs can be tamed (for the most part) and are very affectionate - something that was shown in the film. I went to a matinée showing, fully expecting to be one of only a few in the theater, but was pleasantly surprised to find it almost full. There were more adults than children, so that just shows that the limited press \"Duma\" received was enough to make others want to see this film while they had the chance. I'm an adult, and have no children, but love films that show the beauty of nature and positive interactions with animals. This would be a great film to bring kids to, particularly boys since Xan had such an amazing coming of age adventure. By the way, the music is excellent too. I really hope they end up releasing this on DVD.",
         "\"Duma\" comes along to show us it is possible to create a work of art that combines compassion, intelligence, creativity, and insight. I'm a bit hesitant to even mind some of the comments made by a few people about this film. It is NOT about the people of the country, or a particular point of view. It is supposed to be about a boy and his closest relationship to another living thing on this planet. It is an adventure that doesn't rely on cheap special effects and far fetched ideas that no one but a movie executive find any connection to. It is not about throwing a gimmick in front of our faces and failing to deliver. \"Duma\" just opens a window to a world that is slowly dying in front of us. After seeing the film, I couldn't stop thinking about the marvelous nature of the cheetah, as a creature, a friend, another member of this world's wonders. As the film unfolds, we witness other marvels along the way, as our young protagonist finds ways to solve several quests in the story. There were a few instances where I had to catch my breath for the sheer magic displayed on the screen: the vistas, the expressions, the lyrical beauty which was composed by the various parts. It was a universal experience that can reach and touch both adults and children. The best part is that we went back to the primal essence of cinema, the ability to conjure or transports us to the magic that exists in our own world. \"Duma\" stands for the soul in us, a part of our world that keeps us going and refuses to let go. An artist, like Mr. Ballard can create this type of entertainment, the kind that allows us to reflect on what is important, leads us to think and to care about where we're going, and what the rewards and consequences might be. This is an important film that, in typical fashion, is being neglected by the moguls of entertainment. Catch it in the big screen to get its full impact, relish it, and pass the word around. Here is a film that earns the title of a classic right away.",
         "Duma - A story about an orphaned Cheetah and a boy who rediscovers his life after an unfortunate tragedy - A journey that ends with a new beginning. I often watch films made in America and by American directors that depict African scenes in their movies, and they can never truly portray the African way of life. Carroll Ballard is one of the first to successfully portray this properly - well, almost :-) He still used the word \"Gas\" instead of the word \"Petrol\". Us South Africans never say gas. He also changed the geography of the journey quite dramatically, and at times Xan jumped miraculously 500 km from the East of Botswana to the west of South Africa, and suddenly 5 min later, he jumped 500 km north to the Central North West of Botswana (The Okavango Delta). But please don't think I am bad mouthing the movie. Everyone is allowed the use of poetic license, and the way that Carroll Ballard did this showcased some of the most beautiful places in Southern Africa, and the world, including Augrabies Falls in South Africa, Sowa Pan and Kubu Island (Part of the largest salt pans in the world, the Magadigadi Pans), the Okavango Delta and many more... The story is blissfully simple, allowing young children to enjoy this film without asking questions, as well as allowing adults to marvel at the scenes being shown to them. The photography as far as the filming of the cheetahs goes as well as the African wilderness, was magnificent, as well as the sound effects...they were not artificial, unlike many of the other films made today, which use completely unnatural sound effects for the animals. A must see for anyone who appreciates a good, heartwarming story, the African wilderness and good, honest, down to earth film making 9/10",
         "\"Nature breaks through the eyes of the cat.\" Irish proverb With the emergence of digitized everything, photography of the actual thing is now the amazement. Splendid is everything visualized in Duma, the story of a young South African boy, Xan (Alex Michaeletos) who brings up an orphaned cheetah, Duma, to the day when his father (Campbell Scott) decides it is perilously close to the time when Duma couldn't survive in the wild. And so, about the time they are to return Duma to his world, Xan becomes a sort of orphan himself because dad dies and leaves Xan and his mother with a big ranch to tend. As predictable as the right of passage story that ensues with Xan taking Duma back, there is a freshness of simplicity and beauty, joy and sorrow that overwhelms the clichés and makes you eager to go back to animal stories of early film, like Old Yeller, where the pets are as human than their masters and make real the abstract idea of Nature. An unusual care for lens and animal is palpable from director Carroll Ballard and cinematographer Werner Meritz, unforgettable even. The four cheetahs used for Duma are as often lensed close up as they are in long shots, beautifully stretching their sixty-mile \u0096an-hour legs. With the consistency director Carroll Ballard showed in the acclaimed Fly Away Home, he weaves the theme of abandonment and reconciliation into every major scene: Even the enigmatic intruder Rip (Eamon Walker) has exiled himself from his tribe and is now returning home, cruising the river with Xan like Huck and Jim. That eventually animals and humans must take up their responsibilities is also present almost from the first frame. Nothing new here, just a good old-fashioned pet tale, which never is boring for me, a perpetual boy with an English major's tendency to see poetry in a landscape or a cheetah's eye. \"Nature never did betray the heart that loved her.\" Wordsworth",
         "Our family saw Duma yesterday and we loved it so much, I had to place our vote today! Congratulations to Carroll Ballard, Warner Brothers and everyone else responsible for creating such a beautifully filmed movie with an equally as wonderful story! Duma is a must see for children; it sure beats most everything else out today in terms of story quality! The cinematography was incredible and all scenes involving animals were wonderfully done. I hope that big studios bring us more movies of this caliber for family entertainment. I for one, and hopefully not the only one, am tired of special effects carrying a movie as well as heroes and villains that are way too out of the ordinary.",
         "This film was a rare pleasure to behold, much like the joy I experienced in September 1993 at the Toronto International Film Festival screening of \"SIRGA: L'infant Lion\" (yet to be released on DVD in North America although released in Germany a few years ago). There are deeper messages here and these are truly welcome, unlike so much of the swill that passes for family entertainment these days. As much as I enjoyed \"Two Brothers\" (Jean-Jacques Annaud) recently, I do prefer this film by a director whose last film I enjoyed at the Toronto Festival some 8+ years ago - \"Fly Away Home\". The journey taken by the 12 year old boy reminds me somewhat of the journey taken by a slightly younger lad and his sister in the also-compelling early 70s Nicholas Roeg film \"Walkabout\" which I also highly recommend if you like nature-type films (or should I say \"au natural\" type films ... ha ha). I rate this one 9 out of 10. Anyway make sure you get to see this once it comes to your part of the world either theatrically or, likelier on DVD.",
         "Being used to today's explosion-filled, fast-paced movies being churned out on a weekly basis for the sake of selling tickets, Duma is what I'd like to say a slap in the face for all of us who get excited over the mediocrity that has brought out \"The Interpreter,\" \"Stealth,\" and what else is playing now...? A movie that I would definitely recommend for an entire family to watch together, there's nothing in here that would make you want to cover your kids' eyes or ears up at anytime. Instead you'd want for them, and for yourself, to sit up and pay attention to this smooth, smart movie. Don't wait for any explosions. There is a story being told in this movie, and its being told with a fresh touch of poetry which I haven't seen in a long time. I gave this movie an 8/10 because of one reason: Although the movie is set in Africa, its really hard to tell until halfway through the movie. In fact, the place looked whiter than Little Rock, Arkansas! But it got an 8/10 because of the story, the storytelling, and the smooth pace at which the movie flows."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Gaylord Films",
         "John Wells Productions",
         "Pandora Pictures"
      ],
      "summaries": [
         "During a nightly Porsche ride with his doting rascal Xan, white South African farmer Peter finds and adopts an orphaned cheetah cub, dubbed Duma (just Swahili for cheetah). It becomes the boy's inseparable playmate, even taking it to bed. Peter made clear from the start that the cheetah should be returned to the wild before its full adulthood. But the father is stricken down with a disease just before the cheetah could be returned. Xan's mother sells the farm and moves in with a city aunt. The cheetah escapes, but finds Xan at school, where the new boy is bullied. He decides to run away to the mountains with Duma. On the way they face countless perils, which courage, Xan's intelligence and Duma's instinct overcome.",
         "An orphaned cheetah becomes the best friend and pet of a young boy living in South Africa."
      ],
      "budget": 12000000
   },
   "movielensId": 35015,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-04-22",
      "dvdReleaseDate": "2006-04-16",
      "directors": ["Carroll Ballard"],
      "runtime": 100,
      "movieId": 35015,
      "title": "Duma",
      "mpaa": "PG",
      "actors": [
         "Alex Michaeletos",
         "Campbell Scott",
         "Mary Makhatho",
         "Nthabiseng Kenoshi",
         "Hope Davis",
         "Jennifer Steyn",
         "Nicky Rebello",
         "Javad Ramezani",
         "Eamonn Walker"
      ],
      "imdbMovieId": "0361715",
      "originalTitle": "Duma",
      "genres": [
         "Adventure",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["bwebjc4mfYk"],
      "plotSummary": "An orphaned cheetah becomes the best friend and pet of a young boy living in South Africa.",
      "tmdbMovieId": 15907,
      "avgRating": 3.55517,
      "releaseYear": "2005",
      "numRatings": 145,
      "posterPath": "/51DifIBx53qRHNFgYuQJg03EFeL.jpg"
   }
}