{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "germany",
            "id": 74
         },
         {
            "name": "adultery",
            "id": 596
         },
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "hysteria",
            "id": 5083
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "marriage crisis",
            "id": 5809
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "domestic abuse",
            "id": 10303
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "domestic violence",
            "id": 11925
         },
         {
            "name": "motorcycle",
            "id": 14735
         },
         {
            "name": "extramarital affair",
            "id": 34094
         },
         {
            "name": "mental illness",
            "id": 41329
         },
         {
            "name": "doppelgänger",
            "id": 161891
         },
         {
            "name": "video nasty",
            "id": 189921
         },
         {
            "name": "breakdown",
            "id": 191815
         },
         {
            "name": "affair",
            "id": 229299
         }
      ],
      "imdb_id": "tt0082933",
      "video": false,
      "title": "Possession",
      "recommendations": [
         31767,
         31417,
         28942,
         11481,
         19236,
         41428,
         72277,
         931,
         22171,
         36095,
         18912,
         16372,
         11906,
         13041,
         11879,
         6404,
         27425,
         1483,
         11655,
         29161
      ],
      "backdrop_path": "/8hrk035AWgJPJZXLbOxuIgfBOWg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Anna / Helen",
               "gender": 1,
               "credit_id": "52fe441bc3a368484e00fd73",
               "name": "Isabelle Adjani",
               "profile_path": "/oeFrxb7LxYaeLLmI3Zydfi1ewWn.jpg",
               "id": 6553,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe441bc3a368484e00fd77",
               "name": "Sam Neill",
               "profile_path": "/1ZHExb2rz6210NutoUhQcqQpwnl.jpg",
               "id": 4783,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Margit Gluckmeister",
               "gender": 1,
               "credit_id": "52fe441bc3a368484e00fd7b",
               "name": "Margit Carstensen",
               "profile_path": "/mk4jOERPMKgDPiAsbGJhrii1QLu.jpg",
               "id": 20017,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Heinrich",
               "gender": 2,
               "credit_id": "52fe441bc3a368484e00fd7f",
               "name": "Heinz Bennent",
               "profile_path": "/sQN1Vto7cmxjvdmMB3eD4p45LAn.jpg",
               "id": 10263,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Heinrich's Mutter",
               "gender": 0,
               "credit_id": "52fe441bc3a368484e00fd95",
               "name": "Johanna Hofer",
               "profile_path": null,
               "id": 94324,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Detektiv",
               "gender": 0,
               "credit_id": "52fe441bc3a368484e00fd99",
               "name": "Carl Duering",
               "profile_path": "/myca5caWA6rizVWuXdUT6UcbnhI.jpg",
               "id": 2272,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Zimmermann",
               "gender": 2,
               "credit_id": "52fe441bc3a368484e00fd9d",
               "name": "Shaun Lawton",
               "profile_path": "/lcJ8qM51ClAR2UzXU1mkZGfnn3o.jpg",
               "id": 987260,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Bob",
               "gender": 0,
               "credit_id": "52fe441bc3a368484e00fda1",
               "name": "Michael Hogben",
               "profile_path": null,
               "id": 1063549,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Mann mit rosa Socken",
               "gender": 0,
               "credit_id": "52fe441bc3a368484e00fda5",
               "name": "Maximilian Rüthlein",
               "profile_path": null,
               "id": 24141,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Sara, woman with club foot",
               "gender": 1,
               "credit_id": "52fe441bc3a368484e00fda9",
               "name": "Leslie Malton",
               "profile_path": "/62qPBQ0yQdDZn0UzuwBl2dqFsWM.jpg",
               "id": 68368,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe441bc3a368484e00fd91",
               "name": "Andrzej Żuławski",
               "profile_path": "/vlcYVE0EQzbLhsvhwgCQ3MRfSf2.jpg",
               "id": 32082,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "58a619e5925141346b000302",
               "name": "Frederic Tuten",
               "profile_path": null,
               "id": 1063580,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "58a61a079251413466000317",
               "name": "Andrzej Żuławski",
               "profile_path": "/vlcYVE0EQzbLhsvhwgCQ3MRfSf2.jpg",
               "id": 32082,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58a61a39c3a368168c000362",
               "name": "Andrzej Żuławski",
               "profile_path": "/vlcYVE0EQzbLhsvhwgCQ3MRfSf2.jpg",
               "id": 32082,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "584393f49251416ae8004d2b",
               "name": "Marie-Laure Reyre",
               "profile_path": null,
               "id": 23727,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58439402c3a3683e16004cda",
               "name": "Andrzej Korzynski",
               "profile_path": null,
               "id": 2802,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5843940dc3a3684664004f00",
               "name": "Bruno Nuytten",
               "profile_path": null,
               "id": 34603,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5843941c9251416a80004f33",
               "name": "Marie-Sophie Dubus",
               "profile_path": null,
               "id": 66272,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5843942cc3a3684664004f18",
               "name": "Suzanne Lang-Willar",
               "profile_path": null,
               "id": 1536668,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58439438c3a3684813004d24",
               "name": "Holger Gross",
               "profile_path": null,
               "id": 22135,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 11.489941,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 21484,
      "vote_count": 205,
      "budget": 0,
      "overview": "A young woman left her family for an unspecified reason. The husband determines to find out the truth and starts following his wife. At first, he suspects that a man is involved. But gradually, he finds out more and more strange behaviors and bizarre incidents that indicate something more than a possessed love affair.",
      "similar": [
         8090,
         15762,
         1586,
         1949,
         77949,
         75780,
         807,
         276488,
         25376,
         9769,
         357096,
         638,
         11423,
         9424,
         4638,
         193893,
         10781,
         4232,
         4771,
         769
      ],
      "original_title": "Possession",
      "runtime": 123,
      "poster_path": "/36dqEcj90gwnYIif9BqfuHXafyZ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/weCaiLyIQXuN7T5SH7zQEjQgUFs.png",
            "name": "Gaumont",
            "id": 9,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Oliane Productions",
            "id": 1060,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Marianne Productions",
            "id": 1497,
            "origin_country": ""
         }
      ],
      "release_date": "1981-05-27",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "Murder. Evil. Infidelity. Madness.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrzej Zulawski"],
      "runtime": 124,
      "synopsis": null,
      "writers": [
         "Andrzej Zulawski",
         "Andrzej Zulawski"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082933/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5Mzg2NTY5OF5BMl5BanBnXkFtZTgwMzMwODM4MTE@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Isabelle Adjani, Sam Neill, Margit Carstensen | See full cast and crew »"],
      "reviews": [
         "Yeah, Possession. The First time I saw this film I was catatonic by the end. My 3 friends and I talked about it so much we got 4 new friends to watch it with us again. We continued discussing & marveling over it and watched it yet again on the third night (ten people this time). Why? Because this isn't really a horror film. Yeah, there's a \"monster\", but only in America would this get relegated to the \"Horror\" genre. Because here, we usually make films to fit in a box, follow a formula or entertain, not as a catharsis for the director. Wake up my friends; not everything in life fits in tidy packages or makes rational sense. Several years ago there was an amazing fan site to this man's work (which doesn't seem to exist anymore) that went into infinite detail about his films and personal life. Suffice to say, there's much more going on here than you think. During 1970's and 80's Poland, all films were approved by the Polish film commission and Zulawski's second film \"Diabel\" (1975) was banned. Made in Polish, \"Diabel\" was essentially cut off from it's only possible audience. He took a trip to France, ended up making a film and then returned to his homeland. He worked on yet another film for two years which the authorities did not allow him to finish. Since then he has basically lived and worked successfully in France. \"Possession\" is the first film he made immediately following the 2nd incident in Poland. I read an interview where he talked about how his personal identity was in crisis at the time due to his divorce and being (for all intents and purposes) exiled from his homeland. \"Possession\" is better described as 3 films in 1. The first part is indeed a drama centering around a couple who's marriage is falling apart. As their discord escalates, it becomes a horror film with some scenes taking place only in the psyche of the wife. The last part is an action film, driving the frenzied pace even higher through chase sequences. There are many lines of dialog (especially in exchanges between Heinz and Sam Neill) that were written as critique of his treatment by the government of Poland. In many ways this film is an examination of the internal landscape of Zulawski at that moment; divorced from his wife and exiled by his beloved homeland. It's astoundingly dramatized because he was probably on the verge of a nervous breakdown, and these characters/actors are screamingly portraying every pent-up emotion he wasn't allowed to say about Poland to his fellow countrymen. I love this film. I love every gut wrenching, hysterical, chaotic minute of it. Long live Zulawski.",
         "Acting, colour, camera movement and story thrown into hyperactivity\u0085What do you get? Well, the headache inducing, enthralling Possession. Beautiful, erotic and extremely disturbing, Andrjez Zulawski's film (admired by the Italian Master of the Macabre himself, Dario Argento) is an extreme assault upon the senses. Mark (played excellently and deliberately over-the-top by Sam Neil) returns home from secret government work to his wife in Berlin, cue many shots of the Berlin wall representing the couple's marital breakdown. However, Mark's wife, Anna (a truly unforgettable, no holds barred and hypnotic performance from the lovely Isabelle Adjani) is behaving inexcusably strangely. Mark finds out that she is having an affair with Heinrick (another crazy performance from Heinz Bennet) and confronts him only to find that the lover has not seen Anna for some time. This is the part of the rollercoaster ride before your cart plummets into some real thought-provoking, unsettling and scary surrealism. Possession is definitely the film that requires many subsequent viewings. Excellent performances that frequently go way OTT, dreamily fluid camerawork and migraine inducing metaphorical horror, this is a true beast of the imagination. Love it or hate it, it is a true original masterpiece that is definitely not for all tastes. If films were placed in boxes and divided by flavours, like crisps, POSSESSION would sit in a box entirely by its self, awaiting only those who can take it. Go into it with an open mind like you've never gone into a film with one before. It can seriously mentally damage you if you try and figure it all out on that initial viewing, so beware; if there is truly anything to work out. The now infamous miscarriage in the subway scene is confusing, painful and sickening to watch and nothing like it can be found elsewhere. This is a hell of a film, if you're prepared for it! `This for me exceeds anything thrown up by The Exorcist for sheer impact on the nervous system.' David Thompson - Sight and Sound",
         "Imagine Bergman's 'Scenes From a Marriage' filmed by Dario Argento using Kubrick's 'Shining' steadicam. I can't pretend to have actually UNDERSTOOD this intellectually rigorous horror film, but I do know that it is arguably the most beautiful film of the 1980s, that ugliest of cinematic decades. The chief source of this beauty is Zulawski's camerawork, unsettling, spacious, constantly mobile, it achieves the kind of elaborate shots you normally expect with cumbersome, expensive equipment with the nimbleness of a handheld camera. Static scenes in repetitive milieux are subjected to awesomely complex movements, as the camera encircles, tracks, reveals, blocks, opens up space, creating a narrative that never stands still, offering us different, usually startling viewpoints within the one scene. What is most remarkable is its transformation of scale - the film is set in Cold-War Berlin, a famously constricted city; the plot takes place mostly in inhumanly modern apartments or on streets, and yet the sense of size, scale, space is as monumental as a Fordian Western. This is apt for characters who are simultaneously confined and alienated by their environment. Even scenes of flamboyant repulsiveness, the puling monster mounting Isabella Adjani, Mark's lavatorial dispatch of Heinrich, have a clarity of composition that is simply breathtaking. Unlike most horror films, which open with images of normality against which to measure the transgression of terror, 'Possession' hurls us into its relentless unpleasantness in medias res. Zulawski opens at full speed and never lets up. Mark in his car looks out at a city he hasn't seen for some time as if it is an alien land, full of troubling images, including an iron cross. Anna rushes to meet him. We assume they are husband and wife, reuniting, but their talk if full of exasperated dislocation. Mark has apparently come home too early. They have a son; after making love, their post-coital talk is full of Antonionian misunderstanding, uncertainty, alienation, cruelty. These scenes create the mood of the whole film. 'Possession' is shot in English with a French lead by a Polish director. The dialogue has a stilted quality, like a translation from some lost original; this sense of not-quite-rightness extends to the acting, and the scenes themselves, which seem too mannered, too abrupt, too stylised to seem natural. This sense of the drama being at one remove from some original 'reality' is perfect for a film about alienation - people alienated from themselves, each other, their marriage, their home, even their identity. The horror that constitutes the film obviously has its roots in the female hysteria (one scene in a subway, remembered by Anna, has her miscarry, as she pours out blood and milk, the essence of her femaleness spilling from her; the toilet scene between Heinrich and Mark has a gynaecological terror similar to Argento's 'Suspiria') and male bestiality that cannot be hidden by affluent modernity, but this, on its most basic level, is a harrowing portrait of a failed marriage, horribly truthful to anyone who has even rejoiced in that institution. All the while we are constantly reminded of the contemporary political reality - Mark's espionage (or is he an assassin?) activities; the wired Berlin wall with its faceless surveillance guards (a divided city, a divided marriage, literally divided people, the whore and the madonna). The film has a lot of talk about faith, chance, God, good and evil, but its true power is recognisably more mundane, yet more unaccountably wrenching than that. One should not overlook the comic sense that flickers through the film, the exaggeration of scenes by prolonging them (the restaurant scene), and the Franju-like waltz-of-death music.",
         "This film doesn't do anything in halves, it doesn't abide by the mock humility of an understated/minimalist film that says \"I am important but I'm not gonna show it to you\". I generally love overstated/baroque movies as much as I like overactors (Kinski, Bette Davies, Nic Cage) but Possession goes beyond Gothic, it flaunts itself in violent anarchy even when it knows it's not being important. It's a movie in a constant state of violent flux, a chaotic maelstrom of emotion threatening to rip apart at the seams by force of its own negativity, an excess of emotion and abundance of expression. I don't know what Zulawski is trying to say through the film about his own divorce from wife and country and political system, like Eraserhead it's something so personal that it pierces through bottoms of the soul to come out at the other end and speak for things that touch all of us. Sam Neill and Isabelle Adjani see their marriage come crashing down and the film is not merely the death and burial but the wake before and the mourning after. I don't like how Zulawski uses Isabelle Adjani to play different characters very calculated to be different sides of the same person, but then again I don't like movies that do that, it's like a very easy way to a quick symbolism (Ashes of Time, another film I saw recently, does that too). And I don't like who the monster turns out to be, for the same reason, and also because the monster, bloody and deformed, is a better parable of all the bile and hatred and oppressed furious anger felt the character who nurses it to life. The symbolism is too clear almost. But the rest of the film you watch in stupefied silence. Possession is like a woman in the grip of hysterics running around an apartment tossing and breaking things and cutting herself up with a meat knife, arms flailing like an armature of a tentacled beast ready to tear itself out from a human body. What Zulawski does here is perfectly illustrated in one scene: the couple have one of their terrible rows in the apartment, the woman storms out, music cue plays then stops, and we get the impression the scene has played out, we expect the cut. But then Zulawski has the camera track behind the man as he chases the woman down the stairs of their apartment and out in the street, pulling at each other and yelling in the middle of an empty intersection, then a truck carrying beatup cars comes rolling by, cars falling crashing down from it. Like the wail of a banshee, Possession is demented and frightful. It's a movie that doesn't happen in the same place as other movies. Sometimes it gets hard for me for example to differentiate the look and feel of one noir from the other, one NYC crime flick from the other. Like Don't Look Now with its Venetian labyrinths, this has a sense of place and a malevolent presence in that place. It happens in that part of the city where other movies don't know how to go, the streets are different, the buildings and apartments look curiously different, and when an apartment catches on fire, there's a strange old woman down in the street corner yelling things about God (\"giving the light clear, getting it back dirty\") and cackling maniacally as though an end to the world is very close at hand. Both Sam Neil and Isabelle Adjani give performances of a lifetime. Neil is going through the motions though, except for his 'going mad in a hotel room' scene in the beginning, his madness is external, pantomimed. Isabelle Adjani lives it though, feels and breathes it. She gives perhaps the most outstanding female performance I have ever seen. Her scene in the subway station, all spasmodic intensity and wordless cries, affected me physically like no other, at once monstrous and immensely sad. This movie is a nervous breakdown and an agnostic lament against an absent indifferent God captured on celluloid. The tagline for the American release reads \"She made a monster her secret lover\", but this is not that type of film. This is like few films ever made, before or after, and is done with the ferocity of someone going mad in four walls, now perhaps clawing at the walls with blood and bile and staring at his designs as though there might be pattern and order there.",
         "Possession(1981) shows the viewer a relationship deep in dementia and repressed emotions. Mark and Anna stay together until the Death do us part moment. The family of Anna and Mark is probably the most disfunctional family ever portrayed on scree. The marriage of Anna and Mark is unstable to the point of total meltdown. The marriage is driven by harsh love, secretcy, and oppressed feelings of desire. Isabelle Adjani gives a fantastic performance in the duel role of Anna and Helen. Anna and Helen are the polar opposites in their manners and personalities. One thing they have in common is their current life is shrouded in mystery. Helen in my opinion is Mark's fantasy of Anna as someone who is normal and stable. I find it interesting that Anna & Helen never meet or are seen together during the entire length of Possession(1981). The East Germany locations are part of what makes Possession(1981) a special piece of film. The marriage of Anna and Mark is symbolic of the wall that divided Germany for many years. In Possession(1981), East Germany is a Kafkaesque place of fear, oppression, paranoia, and repression. With the bright lit lighting and colors East Germany gains the appearence of something futuristic. Gives East Germany a cold and indifferent feeling that inhibits every resident. 1981 was a year which gave us two extrodanory performances from actresses Isabelle Adjani and Zoe Tamerlis. Both put forth an emotional complex and disturbing performance in Possession(1981) and Ms. 45(1981). These two features show women with seas of emotions trapped within them until their frightening descent into madness. Both films seem to have been influenced by Repulsion(1964). Ms. 45 and Possession were two of the most underrated films of 1981. Possession(1981) is steeped in complex and confound religious symbolics. The landscape of the motion picture is a place that has lost touch with its own spiritualty. The film needs to be watched more than three times in order to get a close clear understanding of the symbolic meanings. The main characters in the film(except Heinrich) no longer have any faith in religion. The final scene seems to symbolize the apocalyptic end of the world that is an element of Christianity. The best way to see or try to understand Possession(1981) is in its full 127 minute version. The 81 minute version is one of the worst editing jobs ever done to an import film for American release. For example the opening and closing scenes were totally botched in the film's American release in 1981. Thus the movie was misintrpeted by many film goers and critics. Thankfully, Possession has been restored on Video in its uncut form. The cinematography is one of the key aspects in Possession(1981). It moves among the characters of the film with sinister steps. Bruno Nuytten uses some excellent techniques to describe to events of the film. The DP and Director work together to create an intense and terrific type of genre film making. The role of DP was Bruno Nuytten's early step towards becoming a film director. Possession(1981) is a mixture of a few different genres in cinema. The genre that the film belongs to in large parts is the horror genre. Inspired story by both director, Andrzej Zulawski and writer, Frederic Tuten. There is a wonderful plot twist near the end that is one of Possession's best moments. Its the kind of film I would expect from someone like David Cronenberg. For her brave and courageous performance in Possession(1981), Isabelle Adjani won a Best Actress award at Cannes. She has been playing brave and difficult roles since The Story of Adele H(1975). She would play a similar character like this in One Deadly Summer(1986). Possession(1981) is a personal favorite of Dario Argento. Done by Andrzej Zulawski because of his frustrations to see an earlier film in Poland by him censored by that country's government. An early film appearence by Sam Neil that may just be his top performance as an actor. The creature is a top of the line creation by Special Effects artist, Carlo Rambaldi. Shares some similarities with David Cronenberg's The Brood(1979), and Mario Bava's Shock(1977). A daring motion picture that should be watched by mature and open minded people. Possession(1981) blew my emotions away with its tense opening scene to its spine tingling and chaotic final moment.",
         "I'm not very good at plot synopsis, and I very rarely write reviews, but this film could quite possibly be a distant cousin to David Lynchs 'Eraserhead', in that it involves a marriage gone wrong, a (perhaps) mutant baby, infidelity, and so much more that is felt emotionally rather than explained and read into. It contains the most OTT, eccentric, and brilliant performances I've ever seen, and you can't say that about many films, where the performances are unique and different. There's serious acting, hammy acting, B movie acting, serious/Oscar winning acting, comical acting, silent film acting, but never any acting like you have seen in this film. And I guess you could include David Lynch acting, as thats pretty unique too. And of course method acting. Its like watching a theatrical play in cinematic form on acid. A lot of acid. I showed this to my friend who has the darkest possible taste in films I've ever known, owns over a thousand dvds, and even he was blown away by the sheer chaos, resonant imagery, beautifully swift camera work and photography, and of course, the performances. Most notably Isabella Adjani who manages to be sexy and scary as hell at the same time. Her performance in this is monumental, especially the often noted 'underground menstruation' scene which could induce some viewers to a panic attack. I certainly nearly had one when I watched the film for the first time. When a character has a breakdown in this film (both of the leads) its a REAL breakdown. And boy, do you ever feel it. Its realistic yet surreal. God knows how the director managed to coax these types of performances out of his actors. He must of drugged them or hypnotized them or something. He certainly didn't just yell 'action'. The way the scenes are cut together is highly unusual and unconventional but it makes absolute perfect sense. I don't know how, it just does. I'm unfamiliar with the directors other work but if its even half as good as this I'll order everything I can get of his. Recommended to any open minded individual who likes films that draw attention to themselves with an utter sense of uniqueness.",
         "The very reason why this film was lambasted by so many people is because it requires the full use of imagination on the part of the viewer. Those who like films to be linear or over-explained (almost 90% of all films and almost 100% of all Hollywood films) will call this film confusing, baffling, hysterical, etc. However, very few directors are able to use cinematic space as Zulawski does in this film. This doesn't appeal to your rational part, it's supposed to connect with you on spiritual or deeply emotional level, it's supposed to appeal to something in you that can't be rationalized or explained verbally. Possession is a piece of pure cinema, no less.",
         "Surely other Zulawski movies like \"La femme publique\" and \"L'important c'est d'aimer\" have dark, disturbing moments, too, but \"Possession\" must be the most terrifying of them all. It all begins perfectly normal, like something that could happen every day, anywhere in your neighborhood: Anna (Adjani) leaves Mark (Sam Neill), she confesses she found a new lover already a year ago, and then the breaking up of their marriage naturally affects their little son, too. \"I'm the maker of my own evil\", Anna says once, and the evil she creates is visualized literally as a slimy demon, whereas Mark \"creates\" a school teacher looking exactly like Anna (and also played by Adjani), a woman so pure and innocent they go to bed together without having sex, and of course the idealized woman immediately takes care of his son ... and the dish washing ;-). The torment and hysteria of destroyed love is perfectly set in a Berlin before reunification, with the wall appearing countless times in the frame: an obvious symbol that divides what used to belong together, just like the characters in the movie. The \"possessed\" Adjani delivers an unforgettable performance, but if you are going to watch this, be prepared for more blood and guts than in \"The Exorcist\".",
         "\"Possession\" is a weird horror film by Polish art house director Andrzej Zulawski.Isabelle Adjani and Sam Neill(\"Event Horizon\",\"Omen 3\")star as a couple who's marriage is on the rocks.Adjani claims to have a lover-she has a surreal affair with an octopus creature.First of all this movie is great,so every horror fan should check it out.Obviously some people don't get it-maybe they were expecting some cheesy horror bloodbath,who knows?Of course there's some exceptional gore including where Adjani slices into her own neck with an electric carving knife and a scene where she has a miscarriage on the metro which is quite disgusting(and possibly due to this scene the film was classified as a video nasty),but the atmosphere is really creepy and weird.The acting is awesome-especially an incredible performance by Isabelle Adjani.Watch this film with an open mind and an open heart,and I guarantee you will love \"Possession\".",
         "I think that Possession is one of the most effective horror films ever made. I've read mixed reactions to Possession. I think that this is because the writer/director intentionally introduces dozens of narrative ambiguities. There are many unanswered questions, and the viewer is placed in a position where she/he must become a creative participant by answering these questions for themselves. Audiences are by and large uncomfortable with this type of thing, but luckily I've seen a lot of experimental/unusual cinema, so I'm acclimated to it. Isabelle Adjani is glorious in a dual role (which is a reversal of the Bunuel mindgame from 'That Obscure Object of Desire'--Instead of two actresses playing a single character, there is a single actress playing two characters.) Adjani and Sam Neill's enacting of a horribly troubled marriage is spectacular. Heinz Bennet's distasteful character would give anyone the creeps. When Adjani is seen in the company of a terrible Lovecraftian monster, it's almost a relief after the awful domestic situations depicted earlier in the film. (I also appreciate how the monster is very tastefully seen only in fleeting segments.) Everyone is right--Find the Japanese cut of this film. It has Japanese subtitles, but it is much more comprehensible with 40 more minutes of footage."
      ],
      "genres": [
         "Drama",
         "Horror"
      ],
      "productionCompanies": [
         "Gaumont",
         "Oliane Productions",
         "Marianne Productions"
      ],
      "summaries": [
         "During a secretive business trip away, Mark learns that his wife Anna is growing restless in what he believed was their happy marriage. Upon his return home, he learns from her that she wants a divorce. They both go through a series of different emotions related to their situation, Mark's which is generally obsessive about learning why Anna, who he still loves, wants the divorce, and Anna's which is generally increasingly histrionic in getting away from Mark. Caught in the middle is their infant son Bob, who Mark uses as a gage to Anna's mental state. Anna states that her want for the divorce is not because of another man, but Mark finds out that Anna has a lover named Heinrich. In the meantime, Mark also meets Bob's teacher Helen, who looks exactly like Anna, but is her polar opposite in temperament. Starting a relationship with Helen lessens his obsession with Anna. But as Mark and Anna's encounters together reach more emotional and violent levels, Mark, with help of a private investigative firm, learns that Anna's love life is not all that it appears. Anna's true obsession has a somewhat gruesome process and nothing will stop her from reaching her end goal.",
         "A young woman left her family for an unspecified reason. The husband determines to find out the truth and starts following his wife. At first, he suspects that a man is involved. But gradually, he finds out more and more strange behaviors and bizarre incidents that indicate something more than a possessed love affair."
      ],
      "budget": 0
   },
   "movielensId": 3621,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch"
      ],
      "releaseDate": "1981-05-27",
      "dvdReleaseDate": "2000-05-09",
      "directors": ["Andrzej Żuławski"],
      "runtime": 123,
      "movieId": 3621,
      "title": "Possession",
      "mpaa": "R",
      "actors": [
         "Isabelle Adjani",
         "Sam Neill",
         "Margit Carstensen",
         "Heinz Bennent",
         "Johanna Hofer",
         "Carl Duering",
         "Shaun Lawton",
         "Michael Hogben",
         "Maximilian Rüthlein",
         "Leslie Malton"
      ],
      "imdbMovieId": "0082933",
      "originalTitle": "Possession",
      "genres": [
         "Drama",
         "Horror",
         "Mystery"
      ],
      "youtubeTrailerIds": ["40R0ccBfYpM"],
      "plotSummary": "A young woman left her family for an unspecified reason. The husband determines to find out the truth and starts following his wife. At first, he suspects that a man is involved. But gradually, he finds out more and more strange behaviors and bizarre incidents that indicate something more than a possessed love affair.",
      "tmdbMovieId": 21484,
      "avgRating": 3.62589,
      "releaseYear": "1981",
      "numRatings": 282,
      "posterPath": "/36dqEcj90gwnYIif9BqfuHXafyZ.jpg"
   }
}