{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "poker",
            "id": 383
         },
         {
            "name": "gambling",
            "id": 395
         },
         {
            "name": "underground world",
            "id": 1001
         },
         {
            "name": "sense of guilt",
            "id": 1335
         },
         {
            "name": "jazz",
            "id": 1416
         },
         {
            "name": "drug dealer",
            "id": 2231
         },
         {
            "name": "rehabilitation",
            "id": 2367
         },
         {
            "name": "junkie",
            "id": 2375
         },
         {
            "name": "wheelchair",
            "id": 2564
         },
         {
            "name": "suspicion of murder",
            "id": 2619
         },
         {
            "name": "cold turkey",
            "id": 2694
         },
         {
            "name": "ex-lover",
            "id": 2695
         },
         {
            "name": "drums",
            "id": 2696
         },
         {
            "name": "insanity",
            "id": 6255
         }
      ],
      "imdb_id": "tt0048347",
      "video": false,
      "title": "The Man with the Golden Arm",
      "recommendations": [
         14638,
         26243,
         44190,
         27725,
         22112,
         17221,
         24807,
         3767,
         14580,
         560,
         16227,
         28023,
         14554,
         25504,
         25430,
         28007,
         3766,
         28297,
         14551,
         70447
      ],
      "backdrop_path": "/dFBlrudZcmVqsEYGHdCZc56O683.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Frankie Machine",
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014359",
               "name": "Frank Sinatra",
               "profile_path": "/vn9qWseEb2LspaS0LBDntH0L4Qw.jpg",
               "id": 4347,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Molly",
               "gender": 1,
               "credit_id": "52fe424fc3a36847f801435d",
               "name": "Kim Novak",
               "profile_path": "/uTxpa6y6nKo2nfpOP4zsR6abLdi.jpg",
               "id": 5729,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Zosch Machine",
               "gender": 1,
               "credit_id": "52fe424fc3a36847f8014361",
               "name": "Eleanor Parker",
               "profile_path": "/pmauDYeIjoaGtZCy1PdY7lwXZ96.jpg",
               "id": 7331,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sparrow",
               "gender": 0,
               "credit_id": "52fe424fc3a36847f8014365",
               "name": "Arnold Stang",
               "profile_path": "/ex3ZhUACFHnKSuiiSSmjbzZXCZ0.jpg",
               "id": 7332,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Louie",
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014369",
               "name": "Darren McGavin",
               "profile_path": "/t9wMwRZjnZZhFAwrE6OVI0NRqAf.jpg",
               "id": 7333,
               "order": 4
            },
            {
               "cast_id": 26,
               "character": "Schwiefka",
               "gender": 2,
               "credit_id": "52fe424fc3a36847f80143d3",
               "name": "Robert Strauss",
               "profile_path": "/4fqnmvafx9qmn3R45iwKpAtei2k.jpg",
               "id": 7347,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014355",
               "name": "Otto Preminger",
               "profile_path": "/t9eetEzRgKAanGRDCSEF9h3KyTW.jpg",
               "id": 834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f801436f",
               "name": "Otto Preminger",
               "profile_path": "/t9eetEzRgKAanGRDCSEF9h3KyTW.jpg",
               "id": 834,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014375",
               "name": "Nelson Algren",
               "profile_path": "/54CAxTYoXzwq3gaYghmywqtGqvx.jpg",
               "id": 7334,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f801437b",
               "name": "Walter Newman",
               "profile_path": null,
               "id": 7335,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014381",
               "name": "Lewis Meltzer",
               "profile_path": null,
               "id": 7336,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014387",
               "name": "Ben Hecht",
               "profile_path": "/is5faYjaFObagG3b8xgwocMkUcX.jpg",
               "id": 4341,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f801438d",
               "name": "Elmer Bernstein",
               "profile_path": "/3H3AqKesJnkwJzWFJY9hyFwci5m.jpg",
               "id": 7182,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014393",
               "name": "Sam Leavitt",
               "profile_path": null,
               "id": 870,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014399",
               "name": "Louis R. Loeffler",
               "profile_path": null,
               "id": 871,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f801439f",
               "name": "Joseph C. Wright",
               "profile_path": null,
               "id": 7337,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f80143a5",
               "name": "Darrell Silvera",
               "profile_path": null,
               "id": 7338,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f80143ab",
               "name": "Mary Ann Nyberg",
               "profile_path": null,
               "id": 7339,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f80143b1",
               "name": "Jack McEdward",
               "profile_path": null,
               "id": 7340,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f80143b7",
               "name": "Jack Solomon",
               "profile_path": null,
               "id": 878,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f80143bd",
               "name": "Leon Birnbaum",
               "profile_path": null,
               "id": 7341,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f80143c3",
               "name": "Martha Crawford",
               "profile_path": null,
               "id": 7344,
               "department": "Actors",
               "job": "Stunt Double"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f80143c9",
               "name": "Helen Thurston",
               "profile_path": null,
               "id": 7345,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f80143cf",
               "name": "Albert Myers",
               "profile_path": null,
               "id": 7346,
               "department": "Camera",
               "job": "Camera Operator"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.172514,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 541,
      "vote_count": 62,
      "budget": 0,
      "overview": "Frankie is a heroin addict and sits in prison. He wants a different life but the rehabilitation isn’t as easy as he had thought. Director Otto Preminger films one of the first social studies of an addict in this 1955 film.",
      "similar": [
         2034,
         873,
         1429,
         627,
         525,
         164457,
         429200,
         638,
         9464,
         64689,
         10220,
         11595,
         318,
         507,
         309242,
         476,
         886,
         16269,
         11429,
         13804
      ],
      "original_title": "The Man with the Golden Arm",
      "runtime": 119,
      "poster_path": "/9zGvnIlHCL8CuZxqHMLGHmxA4DY.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Carlyle Production",
         "id": 298,
         "origin_country": ""
      }],
      "release_date": "1955-12-14",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Otto Preminger"],
      "runtime": 119,
      "synopsis": "In the late 1940s, Frankie Majcinek (Frank Sinatra), who is known as Frankie Machine, returns to Chicago's South Side, which is mostly inhabited by Polish Americans, after serving a six-month sentence at a federal narcotics hospital. The denizens of Antek's Tug `n' Maul Tavern, Frankie's favorite bar, are pleased to see Frankie, especially his best friend, \"lost dog finder\" Sparrow (Arnold Stang). Although Frankie's former drug supplier, \"Nifty\" Louie Fomorowski (Darren McGavin), offers Frankie a free \"fix, Frankie refuses and vows to Sparrow that he has kicked narcotics for good and intends to become a drummer for a big-name band. Frankie proudly shows off the drums he was given at the hospital, and after sending Sparrow to find him some new clothes, goes to the rooming house where he lives with his wheelchair-bound wife Zosch (Eleanor Parker). The neurotic Zosch, determined to keep Frankie with her by whatever means necessary, has manipulated him for three years by playing on his guilt over causing the accident that injured her while he was driving drunk. Zosch is dubious about his plans to become a musician and urges him to return to dealing poker for Zero Schwiefka (Robert Strauss). Frankie's consistent method of dealing has earned him a city-wide reputation as \"the man with the golden arm,\" but Frankie is determined to improve his life so that he is not tempted to return to drugs. Frankie calls Harry Lane (Will Wright), a musical agent referred to him by his doctor at the narcotics hospital, and makes an appointment to see him. After Sparrow returns with a \"borrowed\" suit for Frankie to wear, they stop at Antek's for a drink and there run into Schwiefka. Frankie announces his intention to quit dealing, and the angry Schwiefka notifies \"Cousin\" Kvorka (Harold 'Tommy' Hart), a local beat policeman, that Frankie and Sparrow shoplifted a suit. Kvorka takes the pair to police captain \"Record Head\" Bednar (Emile Meyer), who wearily ignores Frankie's protests that he has a job interview and insists that he be locked up. Schwiefka then offers to bail out Frankie and Sparrow if Frankie returns to deal for him, and Frankie is forced to accept. Disturbed by a jailed junkie's tormented plea for a fix, Frankie returns home, where Zosch is pleased that he is going back to dealing cards. That night, Louie's taunts about Frankie's shaking hand unnerve the dealer and he leaves to visit the Safari Club, a nearby strip bar where Frankie's former sweetheart, Molly Novotny (Kim Novak), works as a b-girl. Although Molly and Frankie are still in love, Frankie's guilt over causing Zosch's paralysis have kept them apart. Frankie tries to tell Molly that she should leave her current boyfriend, the chiseling, alcoholic Drunky John (John Conte), but Molly states that she needs someone to stave off her deep-seated loneliness. Soon after, Frankie has an interview with Lane, who promises to call him with an audition for a band, but warns him that if he backslides even once, Lane will no longer sponsor him. Despite Frankie's happiness, Zosch nags at him that he is being unrealistic in striving for a better life. A week passes without word from Lane, and Frankie sinks into depression, until one afternoon, Frankie runs into Louie and, succumbing to temptation, accompanies Louie to his apartment for a fix and Frankie is hooked again. Later, after yet another quarrel with Zosch, Frankie storms down to Antek's. There he meets Molly, who encourages him to call Lane, telling him that Lane probably lost his phone number. Molly proves to be correct, and Lane arranges for Frankie to audition for Shorty Rogers' band on the coming Monday. Frankie then pleads with Molly to let him practice playing his drums in her room, as the spiteful Zosch has forbidden him to do so at their place. Although she is reluctant to encourage Frankie's hopes of building a future for the two of them, Molly agrees. After bragging that he has quit Schwiefka and joined the musicians' union, Frankie promises Molly that he is going to kick drugs again, and that after he has made some money and can send Zosch to a clinic, they will be together. Meanwhile, Schwiefka and Louie search for Frankie, as they have used Frankie's reputation to lure two big-time gamblers, Markette (George E. Stone) and Williams (George Mathews), to play in Schwiefka's poker game. After Zosch urges Frankie to deal the big game and tears up his musicians' union card, Frankie seeks refuge at Antek's, where Louie offers him some of the profits if he will deal for Markette and Williams. Desperately needing the money, Frankie agrees, and again gives in when Louie tempts him with another fix. Frankie then goes to the Safari Club, where a disappointed Molly berates him for getting high. When Frankie gets in a fight with John, Molly hurriedly leaves the neighborhood without telling Frankie where she is going. Later, Frankie deals the game for Markette and Williams, and with his skill easily wins. After dealing all night, an exhausted Frankie insists on leaving, but when he arrives home, he is suddenly overwhelmed by the need for a fix and rushes back to Schwiefka's. Louie refuses to give Frankie any drugs unless he resumes dealing, because Markette and Williams have begun to win. The game continues, and soon it is early Monday morning. Louie promises Frankie that if he cheats and wins, he will give him a fix, but Frankie, weary from his long hours of dealing, becomes careless, and Williams spots his card-palming and beats him. After Louie then refuses to give Frankie any drugs, Frankie knocks him out and searches his apartment, to no avail. Frankie then goes to his audition but cannot play competently due to his withdrawal symptoms. Meanwhile, Louie regains consciousness and goes to the rooming house to exact his revenge upon Frankie. Instead, Louie accidentally enters the room as Zosch is walking and deduces that she has been pretending to be paralyzed. When Louie threatens to reveal her secret, the hysterical Zosch pushes him down the stairwell to his death. Frankie, not knowing of Louie's death but fearing that he is after him, runs away and finds Molly, whom he begs for help. Molly then learns from John that Frankie is Bednar's main suspect. Molly then agrees to help Frankie quit drugs cold turkey, so that he can go to the police sober and withstand questioning to prove his innocence. After an agonizing few days, during which Frankie suffers great torment, he is free of his craving. John sees Frankie in Molly's apartment, however, and alerts Bednar. Frankie leaves before Bednar arrives, and Molly takes the police captain to Zosch's, where Frankie is telling her that he is going away with Molly. Just as a terrified Zosch gets up from her wheelchair to chase after Frankie, Bednar and Molly arrive, and they all realize that Zosch must have killed Louie. Before Bednar can arrest her, Zosch runs out to the fire escape and falls to street below. Frankie rushes to the street, where Zosch lays dying, and holds her as she tells him she loves him. After Zosch dies, Frankie and Molly slowly walk off together, leaving their old life behind.",
      "writers": [
         "Walter Newman",
         "Lewis Meltzer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048347/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxNTgwODkzN15BMl5BanBnXkFtZTcwMzg5ODM1Mw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Frank Sinatra, Kim Novak, Eleanor Parker | See full cast and crew »"],
      "reviews": [
         "We have moved far beyond this tentative foray into a forbidden area-drug addiction-for the 1950s. As such, the film may seem dated. The Man with the Golden Arm served its function is peeling back a layer of the underside of society, an eye-opener to a Southern country boy in 1955 when I first viewed this film in the theater. After some serious consideration about being too young, I was allowed to go. It was powerful and affecting then and still maintains some sharp, painful moments of the soul stripped naked. As a movie depicting the loneliness at the core of being, it succeeds. Filled with angst, Frank Sinatra, in his best role, creates a vulnerability that makes him sympathetic to the viewer. He conveys his helplessness and ineffectualness in a beautifully restrained performance. As a voice of common sense in the dead-end urban jungle, Kim Novak as Molly is quite good. She is compassionate and yet stands on solid ground. The interaction between Sinatra and Novak is really good. Darren McGavin plays a slimy character and does it very well. Eleanor Parker is superbly irritating and painfully insecure in her role of the pathetic Zosch, the crippled wife of Sinatra. Arnold Stang is another unlikely survivor of the street. Regarded as pitiful and despicable, his character Sparrow provides tart comedic moments. The music is almost the star of this film-brooding, frenetic, moody, poignant. Elmer Bernstein's score perfectly accentuates the tensions of Frankie Machine's spiritual weakness and physical need for heroin. Molly's theme is bittersweet and captures aurally what the film depicts visually. I know of no other soundtrack that effectively complements the tension and defeat within a man as effectively as does this one.",
         "(Mild Spoilers) Frankie Machine had been dealt a bad hand in life. A card dealer at an illegal gambling den in his Chicago neighborhood he was busted when the joint was raided by the cops and given six months in jail. While behind bars Frankie was treated for his heroin addiction at the prisons hospital and learned how to play the drums as part of his rehabilitation program. Now out of prison and back in his old neighborhood Frankie is trying to put his life back together by getting a union card in the Musicians Union and then a job as a drummer in a band and put his old life behind him but instead it catches up with Frankie in no time at all in \"The Man with the Golden Arm\". Otto Preminger's ground-breaking 1955 film about heroin addiction with Frank Sinatra giving the performance of his life as the drug addicted card sharp Frankie Machine, the Man with the Golden Arm. Frankie tries to getaway from the life that he lead but has this monkey or, better yet, gorilla on his back that just won't let him. Soild performances by the entire supporting cast starting with Frankie's friend Sparrow, Arnold Stang. Sparrows attempt to get Frankie back on his feet by shoplifting a suit of clothes for him ends up putting him and Frankie in the slammer, and almost back to prison, until his former boss at the gambling den Schwiefka bailed him out. There's Frankie's psychically as well as emotionally crippled wife Zosch, Eleanor Parker, who sees that her hold on Frankie is slipping and is slowly driven to madness murder and suicide. There's Frankie's drug dealer Louie, with Darren McGavin in one of his first acting roles, who's hold on Frankie is only good as long as he stays addicted and Louie goes out of his way to make sure that he does. There's the owner of the gambling joint that Frankie works at as it's top card dealer Schwiefka, Robert Strauss, who like Louie goes out of his way to get Frankie back to work for him even though if he's arrested again Frankie's hopes for a new and better life will go down the drain. And then there's Frankie's next-door neighbor and friend Molly, Kim Novak,who goes to almost impossible lengths to get him over his addiction by locking him up in her apartment. It's there that he goes \"Cold Turkey\" and almost ends up dying trying to kick the habit in one of the most harrowing sequence ever put on film. A no holds barred movie with explosive performances by everyone involved makes \"The Man with the Golden Arm\" one of the great classics of realism in motion pictures coming out of the 1950's.",
         "The Man With a Golden Arm was one of a trio of great films around that same time that dealt with drug addiction. The other two were Monkey On My Back and A Hatful of Rain. But I think of the three this one is the best. Maybe if Otto Preminger had shot the thing in the real Chicago instead of those obvious studio sets the film might have been better yet. Who knows, maybe Preminger couldn't get enough money to pay for the location. It's the only flaw I find in the film. Frank Sinatra is a heroin addicted card dealer who was busted for covering for his boss Robert Strauss when the game was raided. He took the cure while in jail and wants a new life as a jazz drummer. But a whole lot of people are conspiring against him. First Bob Strauss who wants him back dealing, especially because a couple of heavyweight gamblers are in town. He uses a few underhanded methods to get Sinatra's services back. Secondly Darren McGavin is the local dope dealer who wants Sinatra good and hooked as a customer again. And finally Eleanor Parker his clinging wife who's working a con game to beat all, just to keep him around. Frank Sinatra got a nomination for Best Actor for this film, but lost to Ernest Borgnine in Marty. Sinatra might have won for this one if he hadn't won for From Here to Eternity in the Supporting Actor category a few years back and that Marty was such an acclaimed film in that year. His scenes going through withdrawal locked up in Kim Novak's apartment will leave you shaken. Eleanor Parker does not get enough credit for her role. She's really something as the crazy scheming wife who wants Sinatra tied to her no matter what the cost. If she had not been nominated that same year for Interrupted Melody, she might have been nominated for this. 1955 marked the high point of her career. Darren McGavin got his first real notice as the very serpentine drug peddler. His performance is guaranteed to make your flesh crawl. Elmer Bernstein contributed a great jazz score to accentuate the general dinginess of the bleak Chicago neighborhood the characters live in. Not a place you'd want to bring up your family.",
         "Frank Sinatra did so many excellent things in the world of entertainment that it's hard to single one out as the best. If I had to name the best thing he ever did, though, it would be his performance as Frankie Machine, the heroin- addicted musician and poker dealer who is saved, just barely, by the love of a good woman (played by an exceptionally babelicious Kim Novak). The \"cold-turkey\" scenes between Sinatra and Novak are terrifying and heartbreaking. The movie is very nearly perfect, in fact, from Saul Bass's title graphics to the ground-breaking jazz score by Elmer Bernstein. It might not be the sort of thing anyone thinks of in regard to the 1950s, but it's a must-see nevertheless.",
         "I've always enjoyed Frank Sinatra's music, and just recently I wrote a term paper about his life story. I've been fascinated by the life and legend of Ol' Blue Eyes. However, I've never seen any of his movies. So I wanted to see if his acting was as great as his singing. Well...it was! I was blown away by his performance in this movie! He really does a tremendous job as recovering heroin addict Frankie Machine, who's trying to put his life back together and audition as a drummer for a local band. Otto Preminger's direction is great as well. I haven't seen any of his other movies. I read his biography on the IMDB. He seems like one of those directors who was sorely misunderstood, and people had conflicted thoughts about him. Seems like the kind of person who appeals most to cult enthusiasts. I haven't seen enough of his films to know for sure if he's really brilliant, but now I'm curious. I want to see more of his films, because judging by his attempt with \"The Man with the Golden Arm\" this guy has talent. I also loved the music for this movie. The score definitely contains the kind of music that I'll remember if I ever happen to hear it again. That's when you know you have a great score. The supporting performances are fine as well, including Darren McGavin as the local drug pusher, Eleanor Parker as Frankie's wheelchair-bound wife and Kim Novak as his lover. It's interesting to see how filmmakers handled the subject of drug abuse, as opposed to modern attempts in films like \"Trainspotting\" and \"Requiem for a Dream.\" Back in 1955, just mentioning the word \"drugs\" caused controversy, and if you watch the film they kept the subject on a very discreet level. There's only one scene where Frankie is actually getting heroin injected into his arm, and they showed a close-up of the reaction of his face rather than showing the needle graphically poking into his veins. But it delivered its message without making it feel watered-down. In a powerful drama like this, with powerful performances and direction like this, you don't need graphic portrayals of drug abuse to keep the audience intrigued. \"The Man with the Golden Arm\" is a dramatic gem that all film buffs should check out. It really is an amazing piece of work! My score: 8 (out of 10)",
         "Sinatra is thoroughly convincing as the addict in this grim horror story of what life is like for someone who has lost his soul to drugs. This is film noir made even more noir by the drab sets and lighting. We go through the terrifying experience of a man who is trying to escape from the monster he has placed on his own back. Elmer Bernstein's score is a mixture of jazz and symphony that makes the addict's frightful journey even more believable to the audience. This film opened the topic of drug addiction the way LOST WEEKEND broached the subject of alcoholism. At least people could talk about these addictions a little more freely.",
         "A solid drama to begin with, \"The Man With the Golden Arm\" is particularly worthwhile for Frank Sinatra's performance as Frankie Machine. The movie was well-conceived, and it would probably have been worth seeing with any decent lead, but Sinatra makes it even better. The story is interesting and at times compelling, as Frankie struggles against himself and his circumstances. The story is told from the viewpoint of its era, yet the basic elements are timeless enough that the story still holds up very well. The details of Frankie's situation are less important than the general themes of him battling his own desires while also contending against \"friends\" who simply want to use him for their own purposes. Sinatra was good at this kind of role, as a character with his own inner demons who must also face hostile surroundings. He channels his nervous energy into expressions and gestures that convey well what is going on inside him. The actor Sinatra deserves to be remembered for roles like this one and his roles in \"The Manchurian Candidate\" and \"From Here to Eternity\", rather than for the insubstantial 'Rat Pack' features. The supporting cast have simpler roles, but they do their jobs satisfactorily. The story moves at a good pace, and it is complemented by an Elmer Bernstein score which, though sometimes jarring, is appropriate. The combination works well as a whole.",
         "I loved that this movie takes place on an imaginary block of an imaginary city. You could say the streets represents a state of mind just like the title of Chinatown did two decades later. Here degeneracy and addiction are the norm. This place sucks you in and wont let go. It's here that Sinatra must face his demons when he returns home after getting clean at a rehab clinic. The film ends up being just as much about moving on from the past as it does about drug addiction. Sinatra's junky is a bit amorphous, we never really learn whether he grew up here or what led him to his addictions. However, the story is strong and told with a nice brisk pace. There are some real memorable moments (the Gambling sequence, Frankie coming off smack, etc). Preminger's direction is great, some subtle camera work adds a lot to a number of scenes. Elmer Berstein's score and Saul Bass' titles perfectly set the mood. Overall, an endearing film you should check out.",
         "This is easily one of the best movies of the 1950s. Otto Preminger directed only four or five really good movies and this is one of them. Frank Sinatra gives his best performance and the music score by Elmer Bernstein is dynamite. From the opening titles (by Saul Bass) to the hysteria of drug addict Frank going cold turkey, this is a riveting movie! With Kim Novak (giving a very good performance), Eleanor Parker (giving a very bad performance) as well as Darren McGavin as the reptilian pusher and Arnold Stang as Frank's grifter pal. Beware of bad prints: this movie is in the public domain so some copies are pretty rough.",
         "Otto Preminger's \"The Man with the Golden Arm\" is a reference to heroin addiction - something that must have been rather risky to film back in 1955, fifty years ago (the censors today STILL have a problem with drug content in films!). The lead role was originally offered to Marlon Brando, then snatched by Frank Sinatra before Brando could respond. Sinatra convincingly portrays a pro card dealer and ex-heroin addict who returns home to the city only to find himself battling the demons of temptation. Preminger is one of my favorite directors (his \"Anatomy of a Murder\" starring James Stewart is a brilliant and revolutionary courtroom drama). Preminger pretty much helped change the face of cinema back in the '50s - \"Anatomy of a Murder\" was extremely controversial when it came out due to both its plot and content (references to rape, women's \"panties,\" seduction, etc.) and \"The Man with the Golden Arm\" deals with a topic that is equally volatile. However, Preminger pulls it off without becoming exploitative. This is like a forerunner to \"The Panic in Needle Park\" (1971) and bears more than a few similarities in terms of general motifs to the classic Billy Wilder movie \"Lost Weekend,\" starring Ray Milland. These three films in particular are probably the best movies about alcoholism predating the 1980s and still remain relevant today."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Otto Preminger Films",
         "Carlyle Productions"
      ],
      "summaries": [
         "Frankie Machine is a skilled card dealer and one-time heroin addict. When he returns home from jail, he struggles to find a new livelihood and to avoid slipping back into addiction.",
         "Frankie Machine is no sooner back in his old neighborhood after a 6 month stint in prison and rehab than his old drug dealer, Louie is after him to restart his old drug habit. Frankie will have nothing to with him, proudly declaring that he is drug free and has no intention of letting that monkey get on his back ever again. Before going to prison he was a card dealer but learned to play the drums and now has hopes of becoming a professional musician. It's going to be a struggle however. His wife Zosch, clinging and wheelchair-bound and his old gambling boss, Schwiefka, stress him to the point that he soon falls back into his old drug habit. The girl he really loves, Molly, stands by him through thick and thin but when Louie is killed, the police believe Frankie is the man responsible and go after him.",
         "Strung-out junkie deals with daily demoralizing drug addiction while crippled wife and card sharks continue to pull him down."
      ],
      "budget": 0
   },
   "movielensId": 3678,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1955-12-14",
      "dvdReleaseDate": "2008-05-13",
      "directors": ["Otto Preminger"],
      "runtime": 119,
      "movieId": 3678,
      "title": "The Man with the Golden Arm",
      "mpaa": "",
      "actors": [
         "Frank Sinatra",
         "Kim Novak",
         "Eleanor Parker",
         "Arnold Stang",
         "Darren McGavin",
         "Robert Strauss"
      ],
      "imdbMovieId": "0048347",
      "originalTitle": "The Man with the Golden Arm",
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "UelBmskBuXk",
         "vUUbNdnwgaE"
      ],
      "plotSummary": "Frankie is a heroin addict and sits in prison. He wants a different life but the rehabilitation isn’t as easy as he had thought. Director Otto Preminger films one of the first social studies of an addict in this 1955 film.",
      "tmdbMovieId": 541,
      "avgRating": 3.66525,
      "releaseYear": "1955",
      "numRatings": 469,
      "posterPath": "/9zGvnIlHCL8CuZxqHMLGHmxA4DY.jpg"
   }
}