{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "istanbul",
            "id": 1847
         },
         {
            "name": "sword",
            "id": 1938
         },
         {
            "name": "lie",
            "id": 2251
         },
         {
            "name": "magic",
            "id": 2343
         },
         {
            "name": "baroness",
            "id": 5878
         },
         {
            "name": "harem",
            "id": 9194
         },
         {
            "name": "wizard",
            "id": 177912
         },
         {
            "name": "invisibility",
            "id": 189115
         }
      ],
      "imdb_id": "tt0036191",
      "video": false,
      "title": "Münchhausen",
      "recommendations": [
         49164,
         386100,
         207249,
         49580,
         9629,
         72200,
         63290,
         3479,
         706,
         43687,
         12553,
         60189,
         5636,
         9627,
         11204,
         26196,
         68553,
         3520,
         45817
      ],
      "backdrop_path": "/v2ZYp9FcUENoetPCXOHebnBQqox.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Baron Münchhausen",
               "gender": 2,
               "credit_id": "52fe446b9251416c750340fd",
               "name": "Hans Albers",
               "profile_path": "/pblBTtgHt9jf0DzsxTKwKn1LTnI.jpg",
               "id": 2899,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Der Mondmann",
               "gender": 2,
               "credit_id": "52fe446b9251416c75034101",
               "name": "Wilhelm Bendow",
               "profile_path": "/4UaAehhRvnM3ZWCCfHOChRBqPvc.jpg",
               "id": 28061,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Graf Cagliostro",
               "gender": 2,
               "credit_id": "52fe446b9251416c75034105",
               "name": "Ferdinand Marian",
               "profile_path": "/4RAyB6dNMJejlSGThn1Dl25fkeF.jpg",
               "id": 33078,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Baronin Münchhausen",
               "gender": 0,
               "credit_id": "52fe446b9251416c75034109",
               "name": "Käthe Haack",
               "profile_path": "/865gdkv8XSEhICuv8tLS4L2SCLe.jpg",
               "id": 29143,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Freiherr von Hartenfeld",
               "gender": 2,
               "credit_id": "535bf38e0e0a264fe5001c01",
               "name": "Hans Brausewetter",
               "profile_path": "/uIkoWaHqGG1vHPTqyG111630AWy.jpg",
               "id": 591493,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Sophie von Riedesel, die Verlobte von Hartenfeld",
               "gender": 1,
               "credit_id": "535bf3b40e0a264fde001c0a",
               "name": "Marina von Ditmar",
               "profile_path": "/upsKbcrB5SyiyMifnFkkymrq08q.jpg",
               "id": 1313961,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Zarin Katharina II",
               "gender": 1,
               "credit_id": "535bf3d90e0a264feb001aea",
               "name": "Brigitte Horney",
               "profile_path": "/3AN6YAQd509CSDHylMXMRB9gMGD.jpg",
               "id": 58235,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Prinz Anton Ulrich",
               "gender": 2,
               "credit_id": "535bf3f40e0a264fe1001b79",
               "name": "Hubert von Meyerinck",
               "profile_path": "/ePpgrRe1wWLhBenceXtv90kxFTM.jpg",
               "id": 5798,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Sultan Abd ul Hamid",
               "gender": 0,
               "credit_id": "535bf4030e0a264fde001c17",
               "name": "Leo Slezak",
               "profile_path": "/xwZ21ncsrbYKSsgY50JNLCeyhEg.jpg",
               "id": 28074,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Casanova",
               "gender": 2,
               "credit_id": "535bf4150e0a264fe8001bca",
               "name": "Gustav Waldau",
               "profile_path": null,
               "id": 49238,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Prinzessin Isabella d’Este",
               "gender": 0,
               "credit_id": "535bf42a0e0a264fd8001b4c",
               "name": "Ilse Werner",
               "profile_path": null,
               "id": 65675,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Vater Münchhausen",
               "gender": 2,
               "credit_id": "535bf43d0e0a264feb001af1",
               "name": "Eduard von Winterstein",
               "profile_path": null,
               "id": 2904,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Kapellmeister Graun",
               "gender": 2,
               "credit_id": "535bf4510e0a264fe8001bce",
               "name": "Hans Junkermann",
               "profile_path": null,
               "id": 47305,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Jussuf Pascha",
               "gender": 2,
               "credit_id": "535bf46f0e0a264fd5001c2a",
               "name": "Victor Janson",
               "profile_path": null,
               "id": 14123,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Doge",
               "gender": 0,
               "credit_id": "535bf4940e0a264fe8001bd6",
               "name": "Franz Schafheitlin",
               "profile_path": "/gFAWF9LnnA5e21iwHyTrTdiaoH5.jpg",
               "id": 38265,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe446b9251416c750340c9",
               "name": "Josef von Báky",
               "profile_path": null,
               "id": 70070,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe446b9251416c750340cf",
               "name": "Gottfried August Bürger",
               "profile_path": null,
               "id": 70071,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe446b9251416c750340d5",
               "name": "Erich Kästner",
               "profile_path": "/oZYh8v83h2ZFI0msSmxVpeAT7kZ.jpg",
               "id": 11920,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe446b9251416c750340db",
               "name": "Eberhard Schmidt",
               "profile_path": null,
               "id": 70072,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446b9251416c750340e1",
               "name": "Georg Haentzschel",
               "profile_path": null,
               "id": 70073,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446b9251416c750340e7",
               "name": "Konstantin Irmen-Tschet",
               "profile_path": null,
               "id": 12365,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe446b9251416c750340ed",
               "name": "Werner Krien",
               "profile_path": null,
               "id": 40987,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe446b9251416c750340f3",
               "name": "Milo Harbich",
               "profile_path": null,
               "id": 70074,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe446b9251416c750340f9",
               "name": "Walter Wischniewsky",
               "profile_path": null,
               "id": 46339,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59d7c5bd925141251f014f2a",
               "name": "Werner Klein",
               "profile_path": null,
               "id": 1901239,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59d7c5c5925141251f014f3b",
               "name": "Manon Hahn",
               "profile_path": null,
               "id": 40991,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "59d7c5cd925141251401513a",
               "name": "Emil Hasler",
               "profile_path": null,
               "id": 12319,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "59d7c5d5c3a3686200014dcc",
               "name": "Otto Guelstorff",
               "profile_path": null,
               "id": 1442404,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.546584,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 11627,
      "vote_count": 19,
      "budget": 0,
      "overview": "Münchhausen is a 1943 fantasy comedy film directed by Josef von Báky, a prominent director who remained in Germany under the Nazi regime. Despite being made in Nazi Germany, this film is noted for the way in which it was able to avoid the politics of the time. Science fiction author David Wingrove has commented that this work “sidesteps immediate political issues whilst conjuring up marvellous visual images of an ageless pastoral Germany.”The story follows the life of Baron Hieronymus von Münchhausen who was granted immortality by a sorcerer some 200 years previously. Here he recounts to a group of friends tales of his travels through Russia, his encounter with a man who could run more than 200 miles per hour, and a ring he was given which would make him invisible. His story culminates in his recounting a trip to the Moon where he meets bodyless plant people.",
      "similar": [
         9610,
         68735,
         57158,
         37430,
         10882,
         68737,
         49051,
         10140,
         12445,
         27022,
         259316,
         120,
         121,
         674,
         767,
         808,
         809,
         284052,
         122917,
         68728
      ],
      "original_title": "Münchhausen",
      "runtime": 134,
      "poster_path": "/j630Vnk59xWs72uTrlnfJsxMyNS.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Universum Film (UFA)",
         "id": 12372,
         "origin_country": ""
      }],
      "release_date": "1943-03-05",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Josef von Báky"],
      "runtime": 110,
      "synopsis": "A 1940's descendant (Hans Albers) of an eccentric German Baron recounts some of his ancestor's enhanced, exaggerated, and grandly unrealistic stories as he searches the world for the secret of eternal life. This feature is in pastel colors and is a bit grainy. It is spoken German, but is available subtitled.",
      "writers": [],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0036191/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0MDg4ODM4M15BMl5BanBnXkFtZTYwNjg4NjE5._V1._CR21,57,272,399_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Hans Albers, Wilhelm Bendow, Brigitte Horney | See full cast and crew »"],
      "reviews": [
         "Someone should do a book on the making of this one. It might represent the best blindsiding of the Nazi regime by artists who had scores to settle. I'm always amazed and grateful it made it past the censor. First, the writer, Erich Kastner, was blacklisted, a Jew, and had his books burned by the Nazis. But they were SO desperate for a good writer they got him on board for this. You sense they wanted world distribution....even down to the product placement shot of a Munchausen children's book Albers is holding before the flashback. Hans Albers, the Brad Pitt of his day, was forced to give up his Jewish girlfriend, Hansi Berg, and work for the Nazis. He sent her money in London all through WWII. She made it out in '38 escaping with her Dad. Dad (Eugen Berg) was not as lucky. He got caught and sent to the camps. He died there in '44. Kastner's script pokes fun of ALL authority, and embraces life itself, and urges the viewer to wake up and take it all in before it's too late; the Baron turns down power to enjoy life, and always has time for a good meal or a hot date. The photography is excellent, the KINO restoration the one to get..Carnival in Venice is wonderful to see and you find bits of humor and wit and set decoration that survived to the 80's version..but there is a haunting, melancholy air to this version, even when everyone is enjoying themselves...the writer knows too quickly everything can just GO and you're best to enjoy what you can while you can. I sometimes see a sad, long look in Hans Albers eyes...is he wondering if he would ever see his gal again? Does he KNOW where her Dad is? What does he THINK of the Nazis?? As it was, Kastner lived to 1974, the richest of the lot, when Disney made his two most famous books (Parent Trap, Emil and the Detectives) into movies. He is the only cast member who's name is associated with a Lindsay Lohan movie. Hansi came back to Hans and they lived together until Albers' death in 1960. She died in 1975.",
         "A much more interesting variation on the Münchhausen theme than Terry Gilliam would offer more than four decades later. It is filmed in colour and - despite being produced during WWII - no expense had been spared on the lavish sets and costumes. But this is not what this film is all about. As in Gilliam's film, this Münchhausen is a magical character, but it is not the magic you find in a modern animated Walt Disney spectacle, it is a magic with a dark side, a magic that can threaten and seduce and corrupt. Münchhausen himself comes across as an ambiguous character, charismatic and heroic, but by no means cuddly and lovable. As a result this is more a fairy tale for adults than one for children, and the full original version with nude harem girls, sexual innuendo, etc. wouldn't have passed the American censors of its day and probably still get an R rating today.",
         "The fabulous exploits of Baron MÜNCHHAUSEN include several wars, numerous plots and beautiful women without number. At the height of World War Two, as the tide was beginning to turn against the Third Reich, Hitler's Minister of Propaganda, Joseph Goebbels commissioned this lavish motion picture as a commemoration of the 25th anniversary of Ufa, the government-run German film association. More importantly, it was also to be a rival of the great fantasy films which had come from the Allied nations, such as THE WIZARD OF OZ (1939) and THE THIEF OF BAGDAD (1940). In that it succeeds brilliantly and needs no comparison to any other film. The film is a great, lighthearted romp as it follows the adventures of the Baron from Prussia to St. Petersburg, Constantinople, Venice and even the Moon. It is fascinating to see the high quality which the Germans were still able to lavish on the picture, even as their Empire was beginning to crumble around them. The production values are of a very high order and the Technicolor photography is sumptuous to the eye. Remarkably, there is no National Socialist propaganda in the film and the War is never mentioned. In the title role, Hans Albers gives a surprisingly sensitive performance for such a robust production. He takes the legendary character and gives the viewer a portrait of a dashing, reflective, amorous, compassionate, resourceful man. Whether riding on a cannonball, ingratiating himself with the Ottoman Sultan, or examining the fantastic flora of the lunar planet, Albers always makes Münchhausen totally believable. All the acting is of a high order, but especially worthy of mention are Ferdinand Marian as the mysterious Count Cagliostro, Brigitte Horney as a flirtatious Catherine the Great, and Gustav Waldau as an aging Casanova. It should be mentioned that this is not a movie for children. Given its European origins it should come as no surprise that MÜNCHHAUSEN is a good deal more libidinous than the standard Hollywood fare of the time. ************************** There was a real Baron Karl Friedrich Hieronymus von Münchhausen (1720-1797), a German adventurer and teller of tall tales, but he had nothing to do with the book of fictional exploits which borrowed his name, written by Rudolf Erich Raspe (1737-1794), upon which this film was based.",
         "I never even knew a version of Munchausen's tale was made before Terry Gilliam's 1989 movie; I stumbled across this version on TCM tonight and was bowled over. The sets and costumes are very detailed and elaborate, this must have been a very expensive movie in its time. Hans Albers is wonderful as the ageless Baron, wandering through the wacky adventures in this film without taking it seriously for one moment. In some respects the acting is ahead of its time, as the actors almost seem to be making fun of themselves, for example when the princess earnestly utters the line \"fate bestows us luck, but the interest is very high.\" The goofy special effects only add to the fun, for instance when the cannonball-riding Baron crash-lands in the Sultan's palace and greets him with a hearty \"Salaam!\", or when the balloon drifts all the way up to the moon, which is populated by people who can remove their heads at will. I find it astonishing that there are so many sexual references in this movie, the one-liners fly pretty fast in the sultan's palace, especially the scenes between the Baron and the eunuch, who speaks in a comically high-pitched squeak, like a mouse. I know it's stupid, but there are two parts where I laughed the most: when the Baron takes a gun in each hand to shoot in two different directions and his eyes act independently of each other; the camera holds on his expression just long enough for it to be a hilarious sight gag. The other time I laughed was when the Baron used his sword to humiliate the princess's brother in Venice. This is a very good movie that deserves a lot of praise. I think it has more depth than Gilliam's version and the acting is top notch.",
         "***SPOILERS*** ***SPOILERS*** This lavish production in Agfacolor, ordered by Goebbles himself, was made to mark the 25th anniversary of the German UFA-Studio. The film begins with a gala 18th century ball at the Bodenwerder castle by the jovial Baron Muenchhausen and his wife. There is a sudden lovers' quarrel between two of the guests. The young girl flees and jumps into her car. We have been viewing a costume party, and the period is very definitely the present. The baron and his much older wife attempt to reconcile the pair. He tells them of the adventures of his \"ancestor\", the fabulous Baron Muenchhausen, and the film goes into flashback, this time to the real 18th century. Muenchhausen and his servant Christian visit the baron's father, who is puzzled over Christian's invention of a rifle which can see and shoot a distance of 200 kilometers. After the visit the pair decides to go to Braunschweig at the invitation of the Prince of Brunswick to whom the Empress Catherine the Great has offered a command of a Russian regiment. The prince asks for Muenchhausen's help in convincing his lovely mistress Louise la Tour to make the trip, and when this is accomplished the group sets off for Russia. The dealings at the Russian courts are devious. The magician Cagliostro tries to enlist Muenchhausen in a plot against the empress, but without success. At a carnival the baron meets a young girl named Kaetchen who is later revealed to be the Catherine in disguise. Muenchhausen becomes Catherine's new lover, kindling the jealousy of the former favorite, Prince Potemkin, who challenges the baron to a duel, injuring him slightly. Muenchhausen goes to the sinister loking house of \"Doctor\" Cagliostro to have his wound treated, and while there warns Cagliostro that he is about to be arrested. Although the magician knows this, he rewards the baron with the secret of eternal youth, and also gives him a ring that will amke him invisible for one hour. As the secret police breaks into the house, Cagliostro escapes using magic to amke him invisible. Catherine soon tires of Muenchhausen and sends him to Turkey in command of a regiment. He is inadvertently shot on a cannonball to Constantinople where he becomes a prisoner of the sultan. After a period of imprisonment he is reunited with his servant, Christian. The baron is offered his freedom if he will convert to Moslem religion. He explains to the sultan that this would be impossible because he would have to drink water instead of wine, but the sultan tells him he does not really abstain - and gives a sample of his private stock of Tokay. Muenchhausen insists that the Tokay he drank at the palace of the Empress Maria Theresa in Vienna was twice as good. This leads to a bet in which the baron promises to provide the sultan with a bottle from Vienna in an hour. If he wins the bet he will have his freedom. Thanks to a wonderful runner, the bottle is produced, leading to a second wager. If the wine is indeed better than the sultan's, Muenchhausen will be rewarded with the beautiful Princess Isabella d'Este, a prisoner in the harem. Muenchhausen wins this bet too, but the Sultan reneges on his promise, attempting to pass off the aging Louisa la Tour as Isabella. Using the magic ring, the baron invades the harem, abducts the real princess, and sets sail for Venice. He learns that the girl's family had planned to marry her to an old man. She had fled the city but was abducted by pirates who sold her to the sultan. Her sudden return is no joy to the family, and her wicked brother Francesco has her kidnapped a second time and locked up in a convent. Muenchhausen fights a duel with Francesco that results in the latter's clothes being cut to ribbons. Muenchhausen and Christian, with the d'Este family in pursuit, escape Venice in a balloon conveniently anchored in the Grand Canal. Their vehicle takes them to the moon. There, in a surrealist landscape, Christian ages and dies, because one day is equal to a year on earth - but Muenchhausen is, of course, immortal. His gloom is dispelled by the presence of the wife of the Man in the Moon. She can be in two places at the same time by separating her head from her body. But even her charms soon pale, and the baron returns to Germany. The scene now shifts back to the present (presumably the 1930s) where Muenchhausen tell the startled young couple that he and his distinguished \"ancestor\" are one and the same. Thoroughly frightend, they flee the castle. The baroness, having observed that her husband is attracted to the girl, tells him to follow his new love. Instead, he renounces the gift of eternal youth to grow old with her. This film has been a favorite of mine since my childhood. Therefore, I can highly recommend it. In my opinion, this version is much better than the 1988 offering by Terry Gillian.",
         "I first watched this in the early 1990s on Italian TV; back then, I didn't even know it existed and, in all probability, the version I watched was trimmed - since the full-blown restoration wasn't carried out until 2004! Anyway, I remember the film with affection and I thoroughly enjoyed rewatching it on DVD (even if this version is still several minutes shy of its 134-minute original length!). For being made right in the middle of WWII, this is an obscenely expensive - circa $35 million in today's currency - spectacle (given pretty much carte blanche, the producers went overschedule and overbudget) commissioned by the Nazis - but scripted, ironically, by a Jew - on the occasion of the 25th anniversary of Germany's foremost film unit, UFA, it was also seen as a direct response to such foreign-made extravaganzas as Hollywood's THE WIZARD OF OZ (1939) and Britain's THE THIEF OF BAGDAD (1940)! The character of the tale-spinning Baron Munchausen originated in a book by 18th century author Gottfried August Burger which, along the years, has inspired 4 feature-film adaptations (as well as a Silent short by pioneering wizard Georges Melies and an animated short that was thankfully included on the Kino DVD and which will be discussed separately). Despite the stature accorded the 1988 Terry Gilliam version THE ADVENTURES OF BARON MUNCHAUSEN (which I watched only once several years ago and recall being a somewhat hit-or-miss affair), the 1943 film emerges as perhaps the most satisfying cinematic rendition overall. The film is book-ended by scenes with a contemporary i.e. 1940s setting, in which the Baron (played as a dashing yet cunning womanizer rather than the Quixotic fool envisioned by Terry Gilliam) recounts some of his adventures - in the third person - to a naïve young couple (the female member of which had fallen under his spell at a fancy-dress ball). The rest is an episodic fantasia in which Munchausen - usually driven by the promise of a romance and accompanied by his faithful sidekick - journeys from one country to the other (meeting along the way historical historical figures like Czarina Catherine The Great, Giacomo Casanova and the magician Cagliostro, who endows him with both immortality and the power of invisibility, as well as purely invented characters such as the self-proclaimed \"world's fastest runner\") until he ends up on the moon itself. Quality varies but the end result, as a whole, is a delight and a veritable feast for the eyes (thanks, in no small measure to the highly pleasing Agfacolor, the splendid production design and the charmingly primitive special effects). Still, one thing that bothered me about the DVD was the fact that the subtitles barely allowed one time to read them (in all fairness, this had a lot to do with the virtually uninterrupted flurry of the film's dialogue itself - hence, something other than a thin white font should have been adopted)! The extras were more extensive than I had anticipated and up to Kino's standards for a \"Special Edition\" release - the best, however, was the 17-minute interview with the head of the German archival company that handled the current restoration, which goes into some detail about this as well as the production of the film itself. DIE ABENTEUER DES BARON MUNCHHAUSEN - EINE WINTERREISE (Hans Held, 1944) **1/2 {6/10}: A pleasant animated short from Germany about the popular title character, made in color but containing no dialogue; it came hot on the heels of the 1943 epic film version - though the latter, apparently, left no recognizable impression on it (as the Baron here looked and acted nothing like the part as played by Hans Albers, nor was the plot 'lifted' from some particular sketch in the episodic film). In fact, the short presents only a couple of incidents (presumably taken from the book which inspired the film version in the first place, and several others made before and after it): one in which the Baron's horse ends up dangling in the air from the façade of a building (seen in the front-cover illustration of the book from which Albers reads during the modern sequences in the film, though the episode itself is not re-enacted) and then when the two of them are chased by a hungry wolf in the snow, with the latter proceeding to swallow the horse in one gulp and replaces it in leading the Baron's sled!",
         "Might contain SPOILERS Although ordered by Goebbels, the propaganda minister, this movie is not only not a propaganda film, it is actually exactly the absolute opposite, thanks to Erich Kästner. There are two lovely scenes: When the Baron is the Turkish palace, someone, can't remember who, says that all humans are equal. We all know, but remember the time and place when this movie was filmed. Some facts before the 2nd scene, 4 years before the German army invaded Poland and now (1943) it is still war. Münchhausen says something like: We shouldn't invade Poland, our country is big enough. (I still can't imagine how this got in the movie) These two subversive scenes make this film so humane and special.",
         "When I look at how many people have rated this film, and I think of all the movie lovers out there who have never seen, or even heard of this delightful gem; It saddens me. I truly believe that it is among the greatest achievements in the history of film. The unique pastel colour is magnificent, and the film is filled with hilarious and daring moments. Especially when you consider that Münchhausen is a Nazi era 1943 German film; It really is hard to believe that this is true. Acclaimed director Terry Gilliam of Monty Python and 12 Monkey's fame, obviously tried to draw more attention to this striking wonder when he made his own version of this tale 'The Adventures Of Baron Munchausen' in 1988. If it wasn't for Mr.Gilliam, I probably would have never bothered to even watch this film. So I owe him many thanks as Münchhausen has easily become one of my all time favorite films. The pace, humour, and sheer originality of this fantasy make it one of the easiest subtitled films to watch in existence, period. It ranks up there with the greatest pre-1950's films such as The Treasure Of The Sierra Madre, and Chaplin's brilliant City Lights. If you love movies, if you love classic cinema, if you love original fantasy films, if you love humorous films; Seek out 1943's Münchhausen whatever you do. It will not disappoint. This film is certainly not for children. However, in terms of flat out fantasy entertainment, I would say that this nearly 70 year old antique blows away Peter Jackson's Lord Of The Rings films any day, and easily. Enough said. 9/10",
         "If this clever, intelligent and visually stunning 1943 German version of the Baron Munchausen story was made elsewhere, and not under Nazi rule, it would surely rank as one of the great classic fantasy films. Films made in Germany during World War II received almost no worldwide distribution. Up until now, the only way to view MUNCHAUSEN was through faded video bootlegs. Kino Video, with the assistance of the F.W Murnau Foundation (who helped preserve Fritz Lang's METROPOLIS) has released a handsomely restored version of this colorful, dreamlike fantasy treat. MUNCHAUSEN begins with a great visual gag regarding an elaborate 18th century costume ball attended by the charming but constantly fibbing Baron Munchausen (Hans Albers, whom film fans will recognize as the strong-man who steals Marlene Dietrich away in THE BLUE ANGEL) Munchausen tells of his wild adventures. One moment he rides a cannonball to a sultan's grand palace, at others he takes a trip to the moon, does battle with flying barking clothing, and encounters a man-hungry Catherine The Great. MUNCHAUSEN was filmed in Agfacolor, a bright and stunning color process developed in Germany. You will see the storybook-like colors that make this film so enjoyable. MUNCHAUSEN also has some really wild moments for a film made in 1943. In one scene, topless slave girls are auctioned off. In other scenes, Russians are depicted as weasely gluttons slobbering over vats of caviar. As MUNCHAUSEN neared completion, the Germans suffered a crippling blow at Stalingrad. Any jab at the victorious Russians would have been welcomed by German audiences. MUNCHAUSEN was the film that heralded the 25th anniversary of UFA, Germany's grandest film studio. During the bombing raids on Berlin, UFA studios and its vast achieve were severely damaged. It is true miracle that MUNCHAUSEN survived as well as it did",
         "I found the film to be very enjoyable. I was impressed with the use of color. The film used Agfacolor film, which if memory serves me correctly was based on pastels, not at all like Technicolor. The film is very rich and vibrant in its cinematography and color, this is very much appreciated when one sees the work that went into the Moon set. Hans Albers plays an arrogant but lovable rogue who takes many, many years to learn the lesson of what is truly important in a mans life. I am in agreement with one reviewer in that this film is not at all for children and should be screened carefully, this is a European film and the Hayes Act didn't exist in Germany."
      ],
      "genres": [
         "Comedy",
         "Adventure",
         "Fantasy"
      ],
      "productionCompanies": ["Universum Film (UFA)"],
      "summaries": ["This lavish, impudent, adult fairy tale takes the viewer from 18th-century Braunschweig to St. Petersburg, Constantinople, Venice, and then to the moon using ingenious special effects, stunning location shooting."],
      "budget": 0
   },
   "movielensId": 38004,
   "movielens": {
      "languages": [
         "Français",
         "Deutsch"
      ],
      "releaseDate": "1943-03-05",
      "dvdReleaseDate": "2004-07-20",
      "directors": ["Josef von Báky"],
      "runtime": 134,
      "movieId": 38004,
      "title": "Münchhausen",
      "mpaa": null,
      "actors": [
         "Hans Albers",
         "Wilhelm Bendow",
         "Ferdinand Marian",
         "Käthe Haack",
         "Hans Brausewetter",
         "Marina von Ditmar",
         "Brigitte Horney",
         "Hubert von Meyerinck",
         "Leo Slezak",
         "Gustav Waldau",
         "Ilse Werner",
         "Eduard von Winterstein",
         "Hans Junkermann",
         "Victor Janson",
         "Franz Schafheitlin"
      ],
      "imdbMovieId": "0036191",
      "originalTitle": "Münchhausen",
      "genres": [
         "Fantasy",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Münchhausen is a 1943 fantasy comedy film directed by Josef von Báky, a prominent director who remained in Germany under the Nazi regime. Despite being made in Nazi Germany, this film is noted for the way in which it was able to avoid the politics of the time. Science fiction author David Wingrove has commented that this work “sidesteps immediate political issues whilst conjuring up marvellous visual images of an ageless pastoral Germany.”The story follows the life of Baron Hieronymus von Münchhausen who was granted immortality by a sorcerer some 200 years previously. Here he recounts to a group of friends tales of his travels through Russia, his encounter with a man who could run more than 200 miles per hour, and a ring he was given which would make him invisible. His story culminates in his recounting a trip to the Moon where he meets bodyless plant people.",
      "tmdbMovieId": 11627,
      "avgRating": 3.08333,
      "releaseYear": "1943",
      "numRatings": 12,
      "posterPath": "/j630Vnk59xWs72uTrlnfJsxMyNS.jpg"
   }
}