{
   "tmdb": {
      "original_language": "xx",
      "keywords": [
         {
            "name": "capitalism",
            "id": 592
         },
         {
            "name": "inventor",
            "id": 1436
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "stop motion",
            "id": 10121
         },
         {
            "name": "short",
            "id": 214549
         },
         {
            "name": "bliss",
            "id": 227790
         }
      ],
      "imdb_id": "tt0188913",
      "video": false,
      "title": "More",
      "recommendations": [
         53215,
         36129,
         49273,
         147553,
         16624,
         105303,
         48277,
         129863,
         53214,
         53219,
         129303,
         148511,
         39005,
         53222,
         5804,
         126193,
         49275,
         52803,
         53216,
         94570
      ],
      "backdrop_path": "/8c6695wNSeNgpFiwkf8qddeSrs1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45cc9251416c9103eca3",
               "name": "Mark Osborne",
               "profile_path": "/uX4TukmZ2bqo164mtE1TEKnQSu1.jpg",
               "id": 57741,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45cc9251416c9103eca9",
               "name": "Steve Kalafer",
               "profile_path": null,
               "id": 213574,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45cc9251416c9103ecaf",
               "name": "Mark Osborne",
               "profile_path": "/uX4TukmZ2bqo164mtE1TEKnQSu1.jpg",
               "id": 57741,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45cc9251416c9103ecb5",
               "name": "New Order",
               "profile_path": "/kXcjXqs9W5DbYykyTnOa6VCan3y.jpg",
               "id": 213575,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe45cc9251416c9103ecbb",
               "name": "Mark Osborne",
               "profile_path": "/uX4TukmZ2bqo164mtE1TEKnQSu1.jpg",
               "id": 57741,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45cc9251416c9103ecc1",
               "name": "Mark Osborne",
               "profile_path": "/uX4TukmZ2bqo164mtE1TEKnQSu1.jpg",
               "id": 57741,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.515585,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36107,
      "vote_count": 56,
      "budget": 0,
      "overview": "A factory worker in a dark, gray world assembles devices that promise happiness. In his spare time he tinkers to create something better, and finally succeeds in perfecting his invention, which allows people to see life through rose-colored glasses, but he has to pay a price for his success.",
      "similar": [
         19,
         3933,
         7512,
         533,
         21385,
         7450,
         326359,
         16306,
         473072,
         2134,
         475759,
         20722,
         9389,
         461955,
         5698,
         13246,
         32085,
         31135,
         194079,
         145316
      ],
      "original_title": "More",
      "runtime": 6,
      "poster_path": "/80xEK4xzauYwJfja8Cqb6Skgt5W.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Large Format Cinema",
            "id": 79532,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bad Clams Productions",
            "id": 79533,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Flemington Pictures",
            "id": 79534,
            "origin_country": ""
         }
      ],
      "release_date": "1998-01-01",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "Get Happy",
      "adult": false,
      "homepage": "http://happyproduct.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Osborne"],
      "runtime": 6,
      "synopsis": null,
      "writers": ["Mark Osborne"],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0188913/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxMzY2ODgxN15BMl5BanBnXkFtZTcwMzAxMDQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": [],
      "reviews": [
         "This is an absolutely astonishing short work concerning the meaning of life and what can not be manufactured in a synthetic factory. It presents a proletarian (in fantastic clay-mation) day in and day out, as he works in a factory assembly line building impersonal products to keep society happy. His dream is to one day create a new life affirming 'lense machine', for he is also an inventor with ingenuity. In his struggles, he continues having glimpses of children playing around a merry-go-round and they are in vibrant color, while laughing and in joy. His dream is achieved, and then he becomes an over zealous capitalist who is sitting all alone in his skyscraper office, after directing the harsh void of the assembly line that manufactures his new product. In the fleeting time that this short film runs, one gathers that it is something stupendous and magnificent and the true satisfaction of creativity is not how many products one sells but the \"fire that burns within\"... the song by the band 'NEW ORDER' is also melancholy which adds to the ambiance and is a joy to listen to. Strongly recommended! Look for it on Sci-Fi channel's \"Exposure\" or on PBS \"High Intensity TV\".",
         "Many short films are very entertaining, but More is exactly that. It is without a doubt one of the few short films that I seek out repeatedly and try to comprehend on all of it's vast levels. It tells the simple story of a disillusioned factory laborer in a factory whose dreams of a happy childhood haunt him. After finally finding a way to relive his happiness artificially and gain wealth in turn, he finds himself empty and alone. The theme has been played before, but never with such fitting music. (New Order's \"Elegia\") The monochromatic and dismal world view of the film enhances the experience. The film is very thought provoking and well timed. Each scene is done with precise intent. Each frame is visually appealing. It is thoroughly a emotional film. Perhaps this is our version of Bliss?",
         "Everyone wants, expects, and demands more and more each day. We think we will get happier and richer by asking, giving and getting more. Are we though? Where is this taking us? This short film is very thought provoking. One can interpret it in multiple levels: political, religious, social etc. Politically there is subtle undermine of how it is almost impossible to rebel against the system. The workers of a factory in this film representing the workers of a capitalistic country who are like ants working their lives off in being productive and efficient to satisfy the demand of their consumptive society. These 'aunts' being controlled and pressured by others above them get worn out, ending up neglecting the meaning of life. Consequently, life seems dark, just like the colors of the film. The religious implication is the sacrifice of the one for the benefit of the whole. In Christianity, Jesus Christ gave up his life to salvage humanity from the darkness of sin. In this short film, the main character gives up himself to salvage humanity from darkness. He opens 'the door' of his abdomen as if it was the gateway to his soul, taking out and giving to humanity the most precious part of his existence; his colorful soul. That is what it takes to make a change in our society. As about the social implications, they are multiple. One of which is the monotonous routine the average blue-collar worker has in a developed capitalistic country. Waking up in the morning, going to work, doing repetitious work, getting pressured by the boss, going back home to sleep and repeat the same the next day and feel like nobody among the millions others. In addition, regardless of the social status of each person, every adult is assigned with certain responsibilities and is expected to behave in a certain manner. Adults are not carefree and cannot act freely upon their feelings. Therefore, dreaming becomes a rescue zone. One is truly free in dreams, thus happy. The main character dreams about his childhood, the time he was carefree and happy. Becoming so nostalgic of the colorful times of his past, he turns into a restless and rebellious person, yearning to bring change into his dark world. He is determined to bring color and happiness back to life, regardless of the cost. The cost of dreams is a notion highlighted by the director. Everyone has dreams. The demanding society we live in however, does not give us a lot of space to act upon them for free. Those who act upon them, have to sacrifice their lives in one way or another, whether that is the psychological, personal, financial, or even the physical aspect of their lives. How many get sick physically or psychologically from stress running after their dreams? How many drown in debt investing in their dreams? How many spend less and less time with their loved ones ending up losing them to get closer to their dreams? No one can make a dream come true without paying a price for it. The main character ends up giving up his entire existence, body and soul, to bring this change in his world. His body represented as a piece of coal, and his spirit represented by the brightness of the red color coal which brought brightness, color, and happiness back to the world. It is interesting to note how the memories of his carefree, naive, and happy childhood has the same color as the pieces of the coal representing his soul. The bottom line is that the main character succeeded in bringing change. Color and happiness was brought back to the world. However, the price was more than he expected. It cost him his life. Was it worth it? Probably it was for him. He finally sensed the almost forgotten feeling of happiness outside his dreams. He once again saw color in life - a notion pertained only to childhood before his sacrifice. Not only did he make himself happy, but he also endowed everyone else with happiness. He saved humanity from darkness. The question is what will happen after him? Will the rest of the individuals get inspired by him and follow his steps or are they going to follow the flock already organized for them for a dark, monotonous, meaningless ride on the road of life. It is a personal decision whether one will live to work or work to live. Which of the two one will get more of, is up to the individual!",
         "Mark Osborne is a truly gifted man. More does not break new ground in the visual field of cel and claymation, but does that matter? A film can only be truly enjoyed if you like its story. More succeeds immensely. After a first viewing, you'll be confused. \"Uh, the goggles?...The glowing stuff?...The kids?\" Let me tell you something: You MUST see More several times before you understand its meaning. And what a meaning it is. There is an obvious fact that so much work and toil went into this six-minute short; the simple-modeled clay drone's emotions are perfectly modeled and presented; you feel his pain, frustration, and sadness. Two versions of the film exist: The original, with a soundtrack by New Order, and a recent music video with the song \"Hellbent\" by Kenna. Despite most people saying they prefer the original, I don't think I can pick one over the other. The New Order music does a wonderful job of making you feel how bleak and dull the world is, while Hellbent contrasts with the main character's emotions. You owe it to yourself to spare six minutes and watch this at ifilm.com. You simply cannot call yourself a viewer of art until you have seen this messiah of animated shorts.",
         "A visually breathtaking short that depends entirely on music and visuals to tell a powerful story. It is a beautiful film that illustrates the power of the short. The combination of different medias gives the film a mesmerizing look. See it.",
         "I pride myself on judging every film on it's own, trying not to let others sway my opinion, so when I stumbled across \"More\" with it's accolades on a web site I was skeptical. But WOW. It's just one of those moments you can't quite figure out *why* you thoroughly enjoy something but you do. Obviously the shots are beautiful and the music heart rending, but you get the feeling much more is under the surface.It's clear that Mark Osborne, like the protagonist of the film, poured his soul into this project dedicating it to his wife and daughter. If you haven't watched it yet, get with it! It's SIX freakin' minutes!",
         "Wow. Who would have thought the entire meaning of life could be summed up in 6 minutes. The greatest of this film is its greatest irony, considering it questions the worth of success based on material wealth. The piece fits its soundtrack (Elegia by New Order) excellent as well. It's a shame this short lost out in the 1998 Oscars, I'd like to think that the voters had a chance to see it before deciding (although they probably didn't.) A definite 10.",
         "One of the most beautiful and poignant animated shorts I've ever seen, if not the most. Unfortunately, I got to see it only once and didn't get a chance to fully take it in, and there was definitely a lot there to take in. Some beautiful animation and a beautiful story about what happiness really is. Full of symbolism and a look at a future which may not be far off. Shows that happiness doesn't come in a box or any other sort of artificial means. Something which most of the world doesn't and probably never will get.",
         "George Santayana, call your answering service. This is a perfect example of what he was talking about with history repeating, if on a smaller, more localized, scale. Watch this carefully and you'll see what I'm talking about. This lost to Bunny for Animated Short, which I'm certain Bunny won because it is a more visually stunning cartoon. Given that both have a lot going for them in terms of intent, plot, ideas and eloquence, I suspect More could have won if Bunny hadn't been visually incredible. Personally, I wish there had been a tie between them. There is certainly nothing for either of these magnificent shorts to be sorry about and both deserve praise and a wider audience. More is solid in all respects-animation, backgrounds, story, music and so on. In most years, probably a winner of record. Given how precious little recent short animation is in print at the moment (very little), an audience for More is preferable to any award, in any case. Too bad that there isn't perceived to be much of a market for things like Bunny and More. It may not be huge, but a market does exist. If you can see More, by all means, do so. Most Highly Recommended.",
         "That's the first word that came to mind after I watched this film. It is a sad, yet also touching study into the worth of happiness, and the repetition and dead-endness of working class jobs. This film was done using stop-action claymation and is probably one of the best (if not the best) one made. It was nominated for a 1998 Academy Award for Best Short Animated Film. Some screenings are available on the net, so if you ever come across it, check it out!"
      ],
      "genres": [
         "Sci-Fi",
         "Short",
         "Animation"
      ],
      "productionCompanies": [
         "Bad Clams Productions",
         "Flemington Pictures",
         "Large Format Cinema Association (LFCA)"
      ],
      "summaries": [
         "A factory worker in a dark, gray world assembles devices that promise happiness. In his spare time he tinkers to create something better, and finally succeeds in perfecting his invention, which allows people to see life through rose-colored glasses. But he has to pay a price for his success.",
         "A worker in a factory learns a lesson about life. When is enough?"
      ],
      "budget": 0
   },
   "movielensId": 4454,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1998-01-01",
      "dvdReleaseDate": "1999-09-01",
      "directors": ["Mark Osborne"],
      "runtime": 6,
      "movieId": 4454,
      "title": "More",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0188913",
      "originalTitle": "More",
      "genres": [
         "Animation",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "A9MHwIN_07E",
         "cCeeTfsm8bk"
      ],
      "plotSummary": "A factory worker in a dark, gray world assembles devices that promise happiness. In his spare time he tinkers to create something better, and finally succeeds in perfecting his invention, which allows people to see life through rose-colored glasses, but he has to pay a price for his success.",
      "tmdbMovieId": 36107,
      "avgRating": 3.83271,
      "releaseYear": "1998",
      "numRatings": 266,
      "posterPath": "/80xEK4xzauYwJfja8Cqb6Skgt5W.jpg"
   }
}