{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "age difference",
            "id": 965
         },
         {
            "name": "photographer",
            "id": 1003
         },
         {
            "name": "ice",
            "id": 1445
         },
         {
            "name": "shower",
            "id": 1879
         },
         {
            "name": "menace",
            "id": 2250
         },
         {
            "name": "lie",
            "id": 2251
         },
         {
            "name": "pedophilia",
            "id": 2337
         },
         {
            "name": "manipulation",
            "id": 2887
         },
         {
            "name": "bedroom",
            "id": 3303
         },
         {
            "name": "sadism",
            "id": 4426
         },
         {
            "name": "electric shock",
            "id": 5157
         },
         {
            "name": "coffee shop",
            "id": 5483
         },
         {
            "name": "castration",
            "id": 5502
         },
         {
            "name": "insanity",
            "id": 6255
         },
         {
            "name": "vigilante",
            "id": 7002
         },
         {
            "name": "sociopath",
            "id": 9740
         },
         {
            "name": "deception",
            "id": 9758
         },
         {
            "name": "neighbor",
            "id": 10226
         },
         {
            "name": "teenage girl",
            "id": 10809
         },
         {
            "name": "crying",
            "id": 12544
         },
         {
            "name": "torture",
            "id": 13006
         },
         {
            "name": "sadist",
            "id": 13125
         },
         {
            "name": "pedophile",
            "id": 14576
         },
         {
            "name": "cruelty",
            "id": 14624
         },
         {
            "name": "older man younger woman relationship",
            "id": 14669
         },
         {
            "name": "one day",
            "id": 15068
         },
         {
            "name": "justice",
            "id": 15108
         },
         {
            "name": "drinking",
            "id": 15111
         },
         {
            "name": "rooftop",
            "id": 15219
         },
         {
            "name": "held captive",
            "id": 15365
         },
         {
            "name": "mental illness",
            "id": 41329
         },
         {
            "name": "threat",
            "id": 156661
         },
         {
            "name": "sexual torture",
            "id": 159595
         },
         {
            "name": "screaming",
            "id": 167942
         },
         {
            "name": "electrical torture",
            "id": 175522
         },
         {
            "name": "childhood sexual abuse",
            "id": 184988
         },
         {
            "name": "photo studio",
            "id": 211669
         },
         {
            "name": "verbal abuse",
            "id": 212404
         }
      ],
      "imdb_id": "tt0424136",
      "video": false,
      "title": "Hard Candy",
      "recommendations": [
         12149,
         9270,
         48572,
         45132,
         9035,
         1073,
         2832,
         9667,
         3432,
         2291,
         10894,
         2637,
         9392,
         13310,
         10226,
         13008,
         11601,
         2252,
         8224,
         8270
      ],
      "backdrop_path": "/gmloukaVpA9dyOVAXAQqpmjFxDA.jpg",
      "revenue": 7022209,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Jeff Kohlver",
               "gender": 2,
               "credit_id": "52fe4363c3a36847f805078d",
               "name": "Patrick Wilson",
               "profile_path": "/djhTpbOvrfdDsWZFFintj2Uv47a.jpg",
               "id": 17178,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Hayley Stark",
               "gender": 1,
               "credit_id": "52fe4363c3a36847f8050791",
               "name": "Ellen Page",
               "profile_path": "/paexwBfmlVyzva7q4XgcBdqowmL.jpg",
               "id": 27578,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Judy Tokuda",
               "gender": 1,
               "credit_id": "52fe4363c3a36847f8050795",
               "name": "Sandra Oh",
               "profile_path": "/ojy6psDO5f0O7N2RBxCVUImGrpD.jpg",
               "id": 25540,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Janelle Rogers",
               "gender": 1,
               "credit_id": "52fe4363c3a36847f8050799",
               "name": "Odessa Rae",
               "profile_path": "/hxq3GHG3RGc2nbGancIgDwUOq4b.jpg",
               "id": 27579,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Nighthawks Clerk",
               "gender": 0,
               "credit_id": "52fe4363c3a36847f805079d",
               "name": "G.J. Echternkamp",
               "profile_path": "/tIkzpE1pWI5lbeNc8eOHrzvsyyM.jpg",
               "id": 27580,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4363c3a36847f8050759",
               "name": "David Slade",
               "profile_path": "/yAJGgmJlKdBzIKk9ovRpeWXDblf.jpg",
               "id": 27571,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4363c3a36847f805075f",
               "name": "Michael Caldwell",
               "profile_path": null,
               "id": 27573,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4363c3a36847f8050765",
               "name": "David Higgins",
               "profile_path": null,
               "id": 27574,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4363c3a36847f805076b",
               "name": "Richard Hutton",
               "profile_path": null,
               "id": 27575,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4363c3a36847f8050771",
               "name": "Jo Willems",
               "profile_path": null,
               "id": 27576,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4363c3a36847f8050777",
               "name": "Harry Escott",
               "profile_path": null,
               "id": 20459,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4363c3a36847f805077d",
               "name": "Molly Nyman",
               "profile_path": null,
               "id": 20460,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4363c3a36847f8050783",
               "name": "Art Jones",
               "profile_path": null,
               "id": 27577,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4363c3a36847f8050789",
               "name": "Valerie McCaffrey",
               "profile_path": "/vMzhdxb51k866CXRCmj1wF74oON.jpg",
               "id": 859,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4363c3a36847f80507a3",
               "name": "Brian Nelson",
               "profile_path": null,
               "id": 27572,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4363c3a36847f80507a9",
               "name": "Jody Allen",
               "profile_path": null,
               "id": 1265219,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4363c3a36847f80507b5",
               "name": "Rosanne Korenberg",
               "profile_path": null,
               "id": 53074,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4363c3a36847f80507bb",
               "name": "Jeremy Reed",
               "profile_path": null,
               "id": 60430,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe4363c3a36847f80507c1",
               "name": "Felicity Nove",
               "profile_path": null,
               "id": 962061,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "58ea7c7c925141351f03d267",
               "name": "Paul G. Allen",
               "profile_path": "/ul9sVe8fbhhWS5hYouFHeMYPXMV.jpg",
               "id": 533023,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 22.322813,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2652,
      "vote_count": 1006,
      "budget": 950000,
      "overview": "A mature 14-year old girl meets a charming 32-year old photographer on the Internet. Suspecting that he is a pedophile, she goes to his home in an attempt to expose him.",
      "similar": [
         2253,
         44214,
         567,
         82693,
         381288,
         359940,
         417678,
         9453,
         527,
         345911,
         44945,
         74997,
         357096,
         11423,
         73861,
         12143,
         9264,
         64,
         5336,
         9268
      ],
      "original_title": "Hard Candy",
      "runtime": 103,
      "poster_path": "/1xInhmQVOOVS7xFT5DthpIwUTDI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Vulcan Productions Inc.",
         "id": 12355,
         "origin_country": ""
      }],
      "release_date": "2005-01-14",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Strangers shouldn't talk to little girls.",
      "adult": false,
      "homepage": "http://hardcandymovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["David Slade"],
      "runtime": 104,
      "synopsis": "The movie opens with a chat window between Lensman319 and Thonggirrrrl14. It is obvious that they have been chatting and they make a plan to meet at a local coffee shop that day at 11am. At the coffee shop (called Nighthawks after the famous painting by Ed Hopper) we meet Thonggirrrrl14, Haley Stark (Ellen Page) who is eating a piece of chocolate cake. Jeff Kohlver (Patrick Wilson) walks up to her. She turns and sheepishly smiles and asks, Jeff? She has chocolate on her lips and tells him it is amazing and he has to try it. He wipes the chocolate off her lips and sucks on his thumb. She tells him that he does not seem like the kind of guy that needs to meet girls on the internet (since he is clearly good looking). He says that he prefers it that way because he gets to meet the person first and that as a photographer, he has found that faces lie. She asks if her face lies. He studies her faces and says she is longing, wanting, needing . . . more chocolate. She laughs and a rapport is established between the two. She turns back to the counter and orders more chocolate and coffee and he pays for it. He also buys her a Nighthawks T-shirt. She models the shirt for him. When she is in the bathroom, she quickly opens the door to reveal herself in only her top and we see the Jeff is visibly agitated. He keeps saying that she is only a little girl and that he has to wait 4 years before he could be with her. They sit and talk in there for a while as the camera pans over a poster of a missing girl (Donna) on the message board behind them. He has an live concert MP3 of a band that she loves at his apartment and she invites herself over to listen to it even though they both decide that it is crazy to do so. As they are talking, he points to a huge book in her bag that she covers up and says is a medical textbook from her dad who teaches at a University. They drive in his car to his home. It seems to be some distance from town and they show the windy roads he takes to get there. Jeff lives in a clean well decorated apartment. There are pictures of scantily clad young models on his wall. Haley takes an immediate interest in these pictures and asks how many of these girls he has slept with. One in particular, Janelle, has the date 3/19 on it and Jeff gets antsy when Haley takes it off the wall. He grabs it from her and puts it back. He gets her a drink while she is listening to the MP3 and she says she doesn't drink anything she hasn't mixed herself. She goes into the kitchen and mixes screwdrivers. When Jeff is slow in drinking, she insists that he keep pace with her. She asks to be photographed and plays music loudly and jumps on the couch. He is getting dizzy and weak and finally collapses. When Jeff wakes up he is tied to a wheelchair and Haley has completely changed. The innocent shy girl we met in the beginning was just an act. She has come with a purpose. We learn that she drugged him and that she specifically chose this day to meet him because his neighbors were out and no one would hear him screaming. He accuses her of stalking him. She says that he has been stalking her. Haley has been chatting with him under many screen names on line with different ages and he was only interested in the ones that were under 18. Jeff claims to have had a connection with her. She accuses him of researching topics that she says she is interested in and reveals that she hates the band that she came over to listen to. She accuses Jeff of being a pedophile and says she is going to search his house for clues. He denies it saying he didn't do anything and that she invited herself and was the one being forward. She says that he is the adult and should know better. Haley searches the house and doesn't find anything. She thinks this is suspicious because men usually have some sort of porn around and he doesn't even have that. He does have records on his computer that pictures were downloaded but the pictures are not there. She suspects that this is where the kiddy porn is. In the search, she finds a gun in a box under his bed. She takes out the gun and throws in on the bed She finally finds a safe hidden in the middle of the room in a sort of coffee table with an inset that is filled with stones. Under the stones is the safe. She figures out the code of the safe as the 3/19 on the picture of Janelle whom Jeff is still madly in love with. His screen name also had 319. Her reaction to what she finds in the safe leads us to believe that is where Jeff has been hiding his kiddy porn, but of course, we never see it. There is also a picture of a girl in front of the Nighthawks. Haley throws the picture at Jeff and asks him why she gets to keep her clothes on. He says that he met her once at the cafe but that he never took her back to the house. He denies being a pedophile. The picture is of Donna, the missing girl from the poster in Nighthawks. It is now clear that Jeff had something to do with Donna's disappearance. He tells her to call the cops, that he will confess. She says that what she has in mind is worse but assures him that she does not want to kill him. She leave the room for some reason and he wheels himself to the bedroom and gets the gun. When he wheels back into the kitchen, she is waiting for him with saran wrap. She wraps his face until he passes out. When he comes to again, he is strapped to a wheely table with his pants off and a bag of ice on his genitals. Haley is wearing a green surgeon's smock. She announces that she will castrate him, goes into his studio and sets up his camera so he can watch it. He begs and cries for his balls but she says it is the only way. She begins to try to make a deal with him but then changes her mind. When she begins the surgery, we can hear the cutting noises and see blurrily the screen as the surgery takes place. When she is done, she holds up his balls and contemplates what to do with them. She jokes about seeing how far they will bounce. She finished by putting them down the garbage disposal. She then says she is done with him and she will take a shower and then call a cab and leave. He is furious now and struggles to get free. He manages to do so and immediately feels for his balls. They are still there! She didn't perform the surgery! He checks the video recorder and sees in the VCR a tape of castrations. He runs for the phone and almost dials 911 put instead gets the scalpel and goes into the bathroom for Haley. We can hear the shower running but when he pulls back the curtain, she isn't there. She is behind him with a taser. She zaps him and he falls into tub unconscious again. She then begins to clean the apartment of her fingerprints. In the most comic scene in the movie, Jeff is pathetically crawling in the hallway with the scalpel as Haley moves around him cleaning. She walks by him and zaps him with the taser again until he falls unconscious again. Then we see him tied up in a contraption with a noose around his neck and standing on a chair. She lets him know that she has called Janelle and that she is coming and will see the evidence that he is a pedophile. He freaks out at this. She offers him redemption in the form of a clean reputation. If he would hang himself, she would get rid of the evidence and no one would know that he was a pedophile and Janelle will think he killed himself because of his unrequited love for her. If not, she will see it and then what would she think of him? A neighbor visits at this time and there is a moment that we think Haley will be found out, but she isn't. She tells the neighbor that she is his niece. The neighbor asked her what she was doing on the roof because she saw her there earlier while she was in her garden. The girl slips up when she says that she was on the roof to check a leak. The neighbor informs her that she knows that it hasnt rained and with that the girls just runs in the house. He lunges at her and manages to free himself. She runs around the building, gets the rope and goes to the roof. He grabs a knife and finally finds Haley on the roof. She has his gun. She offers him the same deal again. A noose is set up on the roof. If he will hang himself, no one will know about the little girls. Jeff confesses that he watched and took photos of Donna but that he didn't kill her. He says he will give Haley the name of the person if she would spare him. Haley says she already knows the name and the funny thing is that Aaron said that it was Jeff who did the killing right before he hung himself. Jeff understands now that Haley has set this all up from the beginning. She puts the noose on his head and says, \"I promise to get rid of the evidence. No one will know.\" Meanwhile Janelle has arrived and is downstairs ringing the doorbell. Jeff jumps. Haley looks over the ledge and says, \"Or not\"",
      "writers": ["Brian Nelson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0424136/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0MzgzNTI3N15BMl5BanBnXkFtZTcwNDk3MDIzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Patrick Wilson, Ellen Page, Sandra Oh | See full cast and crew »"],
      "reviews": [
         "I was lucky enough to be in one of the first test audiences for this film in Los Angeles. Knowing nothing about the film except that it's being described as suspense/horror, and stars Patrick Wilson and a 14 year old girl, I went in expecting another bad to mediocre slash film. I couldn't have been more wrong! Hard Candy is an intense psychological drama, with incredible performances by both Ellen Page and Patrick Wilson. The two actors are practically the only two people with lines in the film, aside from some brief appearances by Sandra Oh and Jennifer Holmes. Thusfar I have only seen Wilson in The Alamo and Phantom of the Opera, but I was blown away with how he handled this performance. The slow, suspenseful film is set mainly in the Los Angeles home of photographer Jeff, a 32 year old man whom Hayley, a mature 14 year old girl who met him online, suspects to be a pedophile. The pacing was steady, and phenomenal - after a brief exposition we get into the real suspense about 20 minutes into the film, and it doesn't let up from there. The cinematography and camera work went excellently with the film. Rather than being extremely gory, the adult themes of the film lead to a more psychological creepiness. There are also questions that remain unanswered until the end of the film, when everything is wrapped up nicely - leaving you puzzled to the true identities and motives of the characters throughout most of the duration. Horror films are not my cup of tea, but psychological drama is. An early fall release date has been rumored, and I can only hope this movie doesn't get lost in the shuffle between summer blockbusters and Oscar season. I also hope Lion's Gate markets this film for what it is, and doesn't try to aim for fans of slash, or a teen crowd.",
         "This is a film about a girl of 14 years old and a 32 years old guy. It is a movie about Hayley (more than excellent Ellen Page) and Jeff, about pedophilia and about how a pedophile must feel. Or maybe it is only a history of vengeance. You won't know until the end of the film. It sure is a difficult subject for a movie, but the script is excellently profiled in the psychological horror and does not turn to be obscene or anything than can visually or verbally hurt the sensibility of anyone. It is more like disturbing to hear a teenage girl speak how she does, and it is fascinating how your feelings will go from one character to the other during the movie until you realize that no matter what the end is, everyone is guilty of something and it is not to us, humans, to decide what bad actions can be justified by other bad actions. Try on it, and be open-minded. Sorry about any orthographic mistake, I'm not used to English writing.",
         "I saw this at a late night screening at the Palm Springs International Film Festival and of the 35 films I saw there I would rank this #4. for about the first 10 minutes I didn't know if I was going to like it or where it was going to go but man once this roller-coaster starts moving it's a psychological thriller. Great stylized look to this film too. The acting and story is intense and you can't avert your eyes from the screen even though there are times where you think you might have to. I like movies that have the feel of a stage play and the emotional volleyball between the two principal actors is amazing. A little far-fetched but so what. This is a good movie. I give it a 8.5 out of a possible 10 and would recommend this film.",
         "This tasteless and smug \"psychological thriller\" has been the subject of many rave reviews by critics who have little knowledge of what film actually is. Hard Candy thinks its daring and contemporary with its slick MTV visuals, but it resembles an advert more than a film in its self-conscious stylised mis en scene. But Hard Candy doesn't want to be shallow. It wants to be intellectual. And what do you get? A \"heroine\" who is as morally reprehensible as her victim. A heroine who spouts references and smart talk beyond her years. This just doesn't wash. Hayley, if we can call her that, is not really a character; she is a just a mouthpiece for Brian Nelson's pretentious dialogue. Her self-satisfied talk is annoying and unconvincing and is part of the reason why Hard Candy is such an astonishing failure of a film \u0096 a fact supported by its dismal Box Office performance. Hayley is simply not a sympathetic character and neither is Jeff, and the film's penchant for ambiguity further clouds any sense of background and motive that might justify what is happening in this trashy, faux art-house film. The film also has no sense of irony and subtlety: Nelson could have made points about the hypocrisy of Hayley and the role-reversals she undertakes but that would have disrupted the smug dialogue. Hard Candy is also one of the most implausible films committed to celluloid. I am not convinced why Hayley did what she did; how far she planned everything to the last detail and what her motives were. The film barely explains why she did what she did, save the stilted dialogue at the end which further reinforces the film's desperation to be ambiguous. Even the brief appearance by Sandra Oh as the inquisitive neighbour is an embarrassment. Why didn't she ask about the blood on Hayley's forehead? The script is to busy being smart to gloss over such inconsistencies. The acting is also very annoying, especially Ellen Page, who was a bit one-dimensional in her role. Avoid this nasty, amoral little film.",
         "\"Hard Candy\" is about a teenage girl named Hayley (Ellen Page) who likes to surf the web and explore internet dating like most normal teenagers. The film opens up with an instant message chat between Hayley and a much older guy named Jeff (Patrick Wilson). Jeff and Hayley plan to meet up later that day, where their meeting turns into an unexpected series of events. A very intense psychological drama ensues\u0085 I just got back from an advanced screening of \"Hard Candy\" at the Philadelphia Film Festival. And let me be the first to say, this movie was remarkable. The idea behind this film is so powerful and disturbing at the same time. This movie focuses on two people, Hayley who is a 14 year old girl and a 30 something pedophile named Jeff. A movie's subject matter is something that is a serious issue in the world and I think this movie takes the idea of it to a new and unique level. During this film, I couldn't take my eyes off the screen. You watch with amazement as this little teenage girl who seems so innocent really controls the entire situation. She is smart and has planned everything and anything and the film flows together so nicely. Even though Hayley isn't an overly likable character, I was cheering her on throughout the whole film. She was such an intelligent and wicked character who seemed to be just sickened by pedophiles. Another thing which was very interesting about this film was that it actually relied more on the facial expressions and dialog then on actual images. There is one part in the film which is extremely disturbing and is something I never seen in a film before. The scene involves Hayley doing an operation to say it in an inexplicit way. During that scene, we never see what's happening but it was spine tingling just seeing the emotions and listening to the dialog of the characters. A powerful scene which was so intense and disturbing I may never forget it. Lastly, I liked how even though the film was a very powerful drama, the script had some light humor in it as well. The line about Roman Polanski was a classic as well as the whole \"I'm an honor roll student\" line. The film is so serious at times, it was nice to get a chuckle here and there to allow audiences to take a breather from being pinned to their seats with suspense. Like I previously stated there are only two real characters in this movie those being Hayley and Jeff. Ellen Page does an incredible job and delivers a mind-blowing performance. Her character is both demented and likable. Patrick Wilson was great as well. He gave a very interesting and powerful performance as a pedophile who didn't want to admit he had a problem. His emotions during this film were incredible and extremely realistic. \"Hard Candy\" was directed by first time filmmaker David Slade. I feel this is a breathtaking and powerful first film about an uneasy subject matter that so few talk about. His unique craft of capturing not only the characters emotions and anger but also the unique camera angles is remarkable. Also the unique scenes of darkness and colors were brilliant. I like the fact that the director didn't make the characters out to be fictional characters but someone who we can meet on a daily basis. The screenplay was written by Brian Nelson who is also a first time screenwriter for a feature film. I normally don't review how I feel about the screenplay but this one was so unique and daring that I feel I have to. The way the script develops the characters is amazing and how the film actually has a real ending instead of one of those cop-out choose your own ending films that so many people are using nowadays. What the film does is leaves everything at the end open to discussion. Why did Hayley do what she did? Who is Hayley really and so forth. It's an incredible screenplay that Mr. Nelson should be extremely proud of. Bottom Line: \"Hard Candy\" was such an amazing film with powerful, intense scenes and great acting. The script is extremely fresh and takes the idea of a pedophile film to a new level. This film allows its audience to think and also be shocked by what's going on during the film. It's not a movie for those who like light-hearted films or films that are completely resolved in the end. Hard Candy is really one of those mind f*ck films that when you leave the theater you just want to talk about what just happened. It's a remarkable film that will stay with me for many weeks to come. MovieManMenzel's final rating for \"Hard Candy\" is a 9/10. A powerful yet disturbing film that touches on a subject matter that is constantly being ignored in our world but be warned this film is definitely not for the weak hearted crowd.",
         "Pardon me if that sounded emo, but this movie killed me a little bit on the inside. I ached every time I thought about it over the next couple of weeks. I was really excited to see Hard Candy at first. I thought it looked neat. I liked the cover, and the synopsis on the back intrigued me. So, like a fool, I rented it. Oh my God. What happened to character development? They made the effort with Jeff. They had him tell one story about his past. One. It wasn't much, but it was enough that I grew to like him, just a little bit. Unfortunately, it shouldn't have been Jeff that I was growing to like, and, possibly, love. It should have been Hayley. Here's this little psychotic girl who's running around drugging pedophiles so she can kill them and saying, \"I am every little girl you've ever touched!\" over and over again. She was a total pain in the ass. I wanted her to die. I wanted Jeff to break free, kill her, and then go get some therapy to help him quit having sex with children. That shouldn't have been the case. I should have been on Hayley's side, which I would have been if she'd actually had a past that allowed me to empathize with her motives. I sat through the whole movie because I truly believed that somewhere in the film a real plot would emerge, or some characters would start to develop, or someone would cut out Hayley's tongue so she would finally shut up. I loathed this movie. I have to leave for school now, but trust me, if I had time, I could go into so much more detail. This movie sucked.",
         "This was about the most uncomfortable, disturbing film I have seen in a long time. It has just been released in France (September, 2006). The acting was is places very good, even excellent, but making a 14-year-old into a brilliant revenge killer for a pedophile does not send an acceptable message. In fact, any male who sits through the castration scene could not possibly emerge with any empathy whatsoever for the girl! There is extreme moral confusion here, and the pedophile is actually a more sympathetic character than the girl. Even so, the movie lets her \"win\", and one can easily imagine a series of sequels in which she forces any number of evil men to do themselves in. Apparently, as with many other films, the idea of personal, extra-legal revenge still has appeal for some people, even though it represents reversion to a method a addressing evil which has caused untold suffering throughout human history. I maintain that the film is immoral as well as revolting. I advise my friends not even to think of seeing it. I don't think I have ever felt so strongly against a film in my life (I'm 64 years old).",
         "I saw Hard Candy at the Angelika, in Tribeca New York and never have I been so shocked, surprised and utterly impressed with an acting performance. The storyline, though somewhat confusing was overpowered by the Oscar-winning performance given by Ellen Page, 14-year old Hayley. Though it could have wrapped up a little sooner (it was a bit longer than expected) I would highly recommend this to anyone who has buddies they talk to online, or anyone that generally enjoys suspenseful films. Not to be outdone by the young star, Patrick Wilson gave an excellent performance. The whole movie was a twisted roller coaster of not knowing who to believe. Whether young Hayley was telling the truth, or was she in fact just completely insane, you won't find out until the end, but either way, it was a knockout performance by both stars and a highly recommended film!",
         "Read any of the myriad of one star reviews on this film to see how I feel about it. What's puzzling to me is how many people can honestly like something that is so bad? And its not the whole sex abuser versus torture thing. I don't care about the debate of whether she was right or wrong--that only justifies the filmmakers attempt to make it \"controversial.\" Its the fact that the dialog is awful, and clichéd. That pretty quickly a 14-year old girl disappears and instead becomes the screenwriter's narration, which is didactic and preachy, and a tad bit condescending. A 14-year old girl could never haul around the dead weight of an adult male, or female for that matter. The kick in the head he gives her would have left her dazed for much longer than what happens. When he rammed his chair against her pinning her against the wall, repeatedly, it would have incapacitated her pretty severely. Of course, the consequence of that would have been her passing out while he dies from saran wrap asphyxiation. And all her rope tying and again, moving what has to be at least a 175lbs all over the place like its nothing is something most adult men couldn't do, much less a 14-year old girl. It goes on and on. She talks him into committing suicide? What? And he buys into it? This movie is awful for many reasons, but the main one is that is simply stupid. And worse, its predictable. We know in advance that every escape attempt he makes will be thwarted. Why? Well, because its too early in the film for him to escape. So why even draft that, Mr. Screenwriter of Crap? We know when he picks up the gun that he won't kill her. Because your pretension is unfortunately not only sloppy in its failure to cover galaxy sized holes, its also predictable. And predictable is boring. And to the IMDb reviewers, can you please quit writing that the acting is good even if you hate the plot. The acting is not good. At all. This thing stinks to high heaven. The color scheme came from one of those home design television shows you see on the tube. Oh, and another little annoyance--anyone notice how the bar he picks her up in has the exact same walls as his home? I checked in the trivia, and it is because apparently it was filmed in the same place. Wow, nice job of hiding that. \"not.\" Anyone who recommends this movie is not your friend and should not be trusted for any opinions on movies as they are morons. Which unfortunately appears to be a really big chunk of the IMDb reviewers.",
         "HARD CANDY is one of those films that took enormous courage on the part of the writer (Brian Nelson), director (David Slade), and producers - let alone the actors - to bring a tale of pedophilia to the mainstream audience. Made for a small budget (yet the production values are so very artistic that it feels like an expensive film), HARD CANDY is essentially a duet for two actors: the actors Ellen Page and Patrick Wilson deliver performances that become indelibly burned on the mind of the viewer. 32-year old photographer Jeff has been chatting online with 14-year old Haley for three weeks using standard chat room seduction lines. They meet, talk, seem to get along well - until Haley invites herself to Jeff's home, much against Jeff's better judgment. Once home the beautiful space in which Jeff lives (the set decor is splendid, using sensitive colors in a cinematic way), the walls adorned with photographs of young models, seems a fitting space for a fine photographer. But soon the twist of the story explodes and Haley lets Jeff know that she is there to punish him for his pedophilia and for some specific events in his history. She drugs him, and when he awakens Jeff is the captive, forced to undergo the intensive questioning and innuendos from Haley, including being set up for castration. The tension mounts to a peak as the two characters uncover aspects of each other; the final resolution of the long encounter comes as a stunning surprise. The quality of the film is so fine that no judgments are made: is Jeff truly a criminal pedophile?, is Haley insane?, can this reversal of roles happen? The script is so beautifully written that it remains intelligent and straight, forcing the viewer to become involved in the quest for truth. Ellen Page delivers a brilliant performance as Haley and Patrick Wilson steps out of his usual milk toast roles to create a man driven by strange needs who gradually comes to a point of self acceptance in one of the more powerful scenes of film this viewer has seen. The audience for this examination of pedophilia may be small and therein lies the pity. This is a film that deals with a tough subject so very well that the viewer gains an understanding into dysfunctional characteristics while being caught up in a suspenseful thriller of a story. This is independent film making at its best."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Vulcan Productions",
         "Launchpad Productions"
      ],
      "summaries": [
         "After three weeks of chatting with the thirty-two year old photographer Jeff Kohlver over the Internet, fourteen year old Hayley Stark meets him in the Nighthawks coffee shop. Hayley flirts with him in spite of the age difference and proposes to go to his house. Once there, she prepares a screwdriver for them and Jeff passes out. When he awakes, he is tied up to a chair, and Hayley accuses him of pedophilia. Jeff denies the accusation, and Hayley begins to torture him in a cat and mouse game.",
         "For three weeks, 14-year-old Hayley Stark has been chatting on-line with 'Lensmaster319', a 32-year old fashion photographer, named Jeff. The two agree to meet at a coffee shop called Nighthawks. They hit it off, despite the massive age difference. Hayley appears to flirt with Jeff, and Jeff generally restrains himself, even admitting that he must wait 4-years until he can be with her. But his reservations are apparently not enough to decline when Hayley all but invites herself over to his house. Once at the house, manipulation becomes the name of the game, and the pedophile seems to be on the non-traditional side of it.",
         "A teenage girl raids a man's home, suspecting he is a pedophile, in order to expose him."
      ],
      "budget": 950000
   },
   "movielensId": 44974,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-01-14",
      "dvdReleaseDate": "2006-09-19",
      "directors": ["David Slade"],
      "runtime": 103,
      "movieId": 44974,
      "title": "Hard Candy",
      "mpaa": "R",
      "actors": [
         "Patrick Wilson",
         "Ellen Page",
         "Sandra Oh",
         "Odessa Rae",
         "G.J. Echternkamp"
      ],
      "imdbMovieId": "0424136",
      "originalTitle": "Hard Candy",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["a-C2H4ipxz0"],
      "plotSummary": "A mature 14-year old girl meets a charming 32-year old photographer on the Internet. Suspecting that he is a pedophile, she goes to his home in an attempt to expose him.",
      "tmdbMovieId": 2652,
      "avgRating": 3.61368,
      "releaseYear": "2005",
      "numRatings": 2727,
      "posterPath": "/1xInhmQVOOVS7xFT5DthpIwUTDI.jpg"
   }
}