{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "dwarf",
            "id": 604
         },
         {
            "name": "treasure",
            "id": 1454
         },
         {
            "name": "mythology",
            "id": 2035
         },
         {
            "name": "folk hero",
            "id": 4615
         },
         {
            "name": "iceland",
            "id": 5746
         },
         {
            "name": "rhine",
            "id": 6652
         },
         {
            "name": "betrayal",
            "id": 10085
         },
         {
            "name": "knight",
            "id": 10466
         },
         {
            "name": "dragon",
            "id": 12554
         },
         {
            "name": "wedding",
            "id": 13027
         },
         {
            "name": "based on myths or folklore",
            "id": 185343
         },
         {
            "name": "ring",
            "id": 189093
         },
         {
            "name": "burgundy",
            "id": 204241
         }
      ],
      "imdb_id": "tt0015175",
      "video": false,
      "title": "Die Nibelungen: Siegfried",
      "recommendations": [
         42512,
         148050,
         129971,
         227289,
         5998,
         150843,
         125150,
         144674,
         129394,
         28249,
         217411,
         141906,
         1405,
         101482,
         82474,
         5991,
         10728,
         112698,
         34796,
         78507
      ],
      "backdrop_path": "/cylOPTppYighfnGL6Wy8cal1Gq9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Siegfried",
               "gender": 0,
               "credit_id": "52fe44829251416c9101328f",
               "name": "Paul Richter",
               "profile_path": "/rnVy6E6rGF2M9S9HhddBs3Razlt.jpg",
               "id": 47170,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Koenig Gunther",
               "gender": 2,
               "credit_id": "52fe44829251416c91013293",
               "name": "Theodor Loos",
               "profile_path": "/4SzKa941BC7XMll7rWTWaNAySGZ.jpg",
               "id": 79,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Kriemhild",
               "gender": 1,
               "credit_id": "52fe44829251416c91013297",
               "name": "Margarete Schön",
               "profile_path": null,
               "id": 550724,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ute",
               "gender": 0,
               "credit_id": "52fe44829251416c9101329b",
               "name": "Gertrud Arnold",
               "profile_path": null,
               "id": 550725,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Etzel",
               "gender": 2,
               "credit_id": "52fe44829251416c9101329f",
               "name": "Rudolf Klein-Rogge",
               "profile_path": "/fbP75fGfXFQlkf3Q5oHbJ4wjG1g.jpg",
               "id": 77,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Brunhilde",
               "gender": 0,
               "credit_id": "52fe44829251416c910132a3",
               "name": "Hanna Ralph",
               "profile_path": "/uo23akAS38r1rACSC93kJfrF71b.jpg",
               "id": 1093537,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Hagen",
               "gender": 2,
               "credit_id": "52fe44829251416c910132a7",
               "name": "Hans Adalbert Schlettow",
               "profile_path": "/gm1xFqB3FaGdHZMcAHXv4l2auk1.jpg",
               "id": 47172,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Person from Alzey",
               "gender": 2,
               "credit_id": "5aaebb1ec3a36846c3028285",
               "name": "Bernhard Goetzke",
               "profile_path": null,
               "id": 29141,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Mime the blacksmith / Alberich the Nibelung",
               "gender": 0,
               "credit_id": "5aaebb3392514116ba029091",
               "name": "Georg John",
               "profile_path": null,
               "id": 29129,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44829251416c9101328b",
               "name": "Fritz Lang",
               "profile_path": "/fQAlhdBDnUYXzkezvyzjLB72pvw.jpg",
               "id": 68,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44829251416c910132ad",
               "name": "Thea von Harbou",
               "profile_path": "/gSEePHfHWLHuyMoiSlGqj7d3Iw8.jpg",
               "id": 157,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44829251416c910132b3",
               "name": "Carl Hoffmann",
               "profile_path": null,
               "id": 28982,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44829251416c910132b9",
               "name": "Günther Rittau",
               "profile_path": null,
               "id": 71,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5aaebb4792514116bd027800",
               "name": "Fritz Lang",
               "profile_path": "/fQAlhdBDnUYXzkezvyzjLB72pvw.jpg",
               "id": 68,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5aaebb5ac3a3682f34015bc0",
               "name": "Gottfried Huppertz",
               "profile_path": null,
               "id": 69,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5aaebb65c3a36846bd0285d5",
               "name": "Richard Wagner",
               "profile_path": "/ftdajgiZwrOjWMPVUhrBCgLpOEl.jpg",
               "id": 71473,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5aaebb760e0a265e1f016a46",
               "name": "Walter Ruttmann",
               "profile_path": "/K4neS3mNe1rd2RxbFNRRAhXGtd.jpg",
               "id": 2798,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5aaebb80c3a36846c902c1fd",
               "name": "Otto Hunte",
               "profile_path": null,
               "id": 13887,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5aaebb8a0e0a265ddb01624f",
               "name": "Karl Vollbrecht",
               "profile_path": null,
               "id": 12320,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5aaebb94c3a3682f34015c09",
               "name": "Erich Kettelhut",
               "profile_path": null,
               "id": 12369,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5aaebb9ec3a36846b702f733",
               "name": "Karl Vollbrecht",
               "profile_path": null,
               "id": 12320,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5aaebba9925141762d014034",
               "name": "Paul Gerd Guderian",
               "profile_path": null,
               "id": 1550859,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5aaebbb20e0a266588016d45",
               "name": "Aenne Willkomm",
               "profile_path": null,
               "id": 20536,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5aaebbc00e0a26783302bd84",
               "name": "Otto Genath",
               "profile_path": null,
               "id": 1550860,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5aaebbda0e0a265e58015801",
               "name": "Edgar G. Ulmer",
               "profile_path": "/PU5rCuIxOPcffvceRU4K2Y9smj.jpg",
               "id": 5030,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 2,
               "credit_id": "5aafa63a92514116ae037e1e",
               "name": "Erich Pommer",
               "profile_path": "/oClAs4W1TRc2jtYCU4CdtXlEhPZ.jpg",
               "id": 67,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 2.45308,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 31506,
      "vote_count": 29,
      "budget": 0,
      "overview": "Siegfried, son of King Sigmund, hears of the beautiful sister of Gunter, King of Worms, Kriemhild. On his way to Worms, he kills a dragon and finds a treasure, the Hort. He helps Gunther to win Brunhild, by using a mask that makes him invisible. But because Brunhild is cursing Kriemhild, she tells her what really happened. Now Brunhild wants Siegfried's head.",
      "similar": [
         5608,
         3933,
         10882,
         57158,
         49051,
         18823,
         120,
         122917,
         10353,
         57165,
         9326,
         36819,
         72207,
         10323,
         11527,
         38319,
         300803,
         146381,
         16999,
         1362
      ],
      "original_title": "Die Nibelungen: Siegfried",
      "runtime": 140,
      "poster_path": "/hyq7gPo3LjMs0hap1xvzrH5gxeA.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Universum Film (UFA)",
            "id": 12372,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Decla-Bioscop AG",
            "id": 6762,
            "origin_country": ""
         }
      ],
      "release_date": "1924-02-24",
      "vote_average": 7.8,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Die Nibelungen Collection",
         "id": 158038,
         "poster_path": "/yvjR1JVRds61vmrZfWKjUmFSZrE.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Fritz Lang"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Fritz Lang",
         "Thea von Harbou"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0015175/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzNTU2NjU2Ml5BMl5BanBnXkFtZTgwMTE2MTA5MTE@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Richter, Margarete Schön, Theodor Loos | See full cast and crew »"],
      "reviews": [
         "I'll say this up front: this film can move very slowly at points. Also, I saw it in a theater with live piano accompaniment, and it's likely to be much less impressive on a smaller screen. I doubt the video print is very good, since I am familiar with other tapes that that company has distributed. Despite its slow points, when Lang and crew create the numerous set pieces, watch out: you're in for some of the greatest scenes of filmdom. I'd also like to point out that, as someone who is quite familiar with the original poem, I'll tell you that source material often moves a lot slower than this film does. As a technical marvel, I don't think some of the stuff here was surpassed until very recently, except maybe in King Kong. It's even more amazing to behold than Metropolis, Lang's next and much more famous film. All of the effects might seem dated now, but anyone who appreciates early cinema will easily fall in love. The film opens with Siegfried's infamous battle against the dragon. A bit of trivia: this scene is not in The Nibelungenlied. It is briefly mentioned in the first lay by Hagen as having happened a while ago. However, this is the one scene from this movie which is widely remembered, and for good reason. The dragon is amazingly created, nearly on the level of the dinosaurs from The Lost World and King Kong. Unlike them, though, it is a puppet and not stop motion. As far as puppetry goes, it surpasses most of the muppets of Return of the Jedi by leaps and bounds. Unfortunately, as lifelike as they made it, the dragon is not at all that fierce. It almost looks like a friendly dog (it even wags its tail as Siegfried valiantly rushes at it, sword aloft). When it is supposed to be roaring at Siegfried, the audience was giggling; it looked more like it was yelping. As a result, the depiction of Siegfried begins to come off as satirical (probably not intended, but it makes things more interesting). There is a major strain of Niebelungenlied scholarship which sees Siegfried not as the hero, but as the aggressor. The second major set piece involves the battle with Alberich, the Nibelung, an episode that occurs a bit later in the poem, from whom he wins the cloak of invisibility, a horde of treasure, and Balmung, his famous sword. The mythological characters in this episode are awesome to behold in their costuming (and simply in the casting, which is perfect throughout; the creatues in the film's first scene, in which Siegfried is forging his sword, are great, too), especially the dwarves who balance the pot full of treasure on their backs. The best scene in the film occurs in the next chapter, the dream of Kriemhild, which is animation done in sand. Other great scenes in the film include the crossing of the lake of fire, the battle between Brunhild and Gunther (with an invisible Siegfried helping him), the wooing of Brunhild, the quarrel between the queens, and the hunt. As far as I remember, only the war with Denmark is left out, which happens in the poem before they go to Iceland for Brunhild. It's not missed. Special attention must be given to the miraculous casting. Paul Richter plays Siegfried as the hero to beat all heroes. With his blonde, flowing hair, he marches across the world blindly performing great deeds and talking to birds (the look on Richter's face when he starts to hear birds talk is priceless). He's too naive to see the trouble he causes as he dishes out treasure to the poor (a wonderful touch; Lang doesn't even draw attention to how this angers the Burgundians in their dialogue, but only in their expressions). As many scholars have proposed, Siegfried's actions all suggest that Worms is in iminent danger of being usurped by him. Margarethe Schoen may not have been the best choice for Kriemhild. The actress is so manly that I assumed that an actor was playing her. She is supposed to be the most beautiful woman in the world. The actress does emote quite well, however. Now, Hannah Ralph, who plays Brunhild, exudes a manliness that her part requires. She's supposed to be a warrior maiden. Ralph does a great job conveying Brunhild's cunning, bitterness, and cruelty. Theodor Loos, who plays King Gunther, is absolutely perfect. I couldn't have imagined him better. His face exhibits both his moral predicament and his supreme inadequacy that the poem spells out so clearly. Hans Adalbert Schlettow plays Hagen. His costume may be a bit overwrought (a huge, gnarly beard, a furry eye patch, and an enormous helmet with eagle wings reaching a foot and a half upwards), but the actor's perfect for the role, although he might be too old. His age makes me wonder how he's going to fight like a demon in Kriemhild's Wrath, the second part of the film, which I'll see tomorrow. I'm very eager to see how Lang and Thea von Harbou, his wife ans screenwriter, will make the remaining half of the epic interesting on film. It's nothing but battles. Volker and Gunther's brothers are also well cast, although they'll probably be more important in the second half, that is, if the poem is followed as closely as it is here. 8/10.",
         "When I saw this wonderfully exciting adventure film, it got me thinking, \"Why can't people make films like this anymore?\". Partly why the film makers don't make films like this anymore is that they are so occupied in having the best special effects around and don't give a hoot about the characters, story or detail (Jurassic Park, Lost World, Independence Day, Armageddon are only a small part). I would love to go and see a film that have real characters from these make-believe worlds. There are so many movies today that have Americans in a make-believe world, acting and talking like Americans, this makes me sick all over. This movie has real characters we care about in a believable world. This is partly why I love silent films so much. It is the acting and not the dialog that the viewer gets to know the character through. This film has all the elements that makes up for a good adventure film. Very good story, exciting action, wonderful sets, beautiful photography, chillingly wonderful villains and some of the best special effects I've seen (for the time's standard). I especially love the trick photography to make Siegfried invisible and casting a shadow even though he is. I'm looking forward to watching Kriemhild's Revenge. If you haven't seen this movie and love adventure movies, see it. It is so exciting and magical that you'll remember it always when you see a bad adventure movie, something that is normal today.",
         "Upon completing his epic crime film \"Dr Mabuse\", Fritz Lang embarked on a quest to bring Germanic legend Das Niebelungenlied to the screen. So colossal was the undertaking that it required two films, of which \"Siegfried\" is the first. Young heroic Siegfried kills a dragon and bathes in its blood, gaining immortality (save for a fatal weak spot). His quests make him into a powerful figure and allow him to court the beautiful princess Kriemhield. But her weakling brother only approves the lovers' union if Siegfried agrees to help him deceive the beautiful Valkyrie Brunhield into falling in love with him. When she eventually discovers this treachery, the humiliated amazon vows sets forth a cycle of revenge that will create tragedy on an epic scale. There's no way to avoid comparisons: \"Die Niebelungen\" is the Lord of the Rings of its day, and easily one of the most staggering epics in the history of movies. The scale, extras and the pioneering dragon-slaying scene all make for enduring cinema. Fritz Lang's alluring visuals push it even further: his awesome depiction of the rigid codes of honor that are the undoing of his characters imbues the film with a mood and atmosphere whose influences are incalculable. \"Die Niebelungen\" can also be read as one chooses, tribute to German heroism or to the trappings and tragedy of \"honor\". Hitler for one was so impressed with the film that he used an alternate edit of the film as propaganda, playing to Wagner's Niebelungen opera (which Lang actually loathed!). To be fair, though the original score can not hope to reach the mythical heights of Wagner's opera, it is still a considerable achievement. Though he would revisit the crime genre with the slick \"Spies\" and practically invent modern science-fiction with \"Metropolis\", none of Lang's silent films would reach this level of excellence. \"Siegfried\" of course can only fairly be judged when seen right before the second half of the saga: \"Kriemhield's Revenge\", in which formality makes way for chaos and petty jealousy and revenge turn to violence on a biblical scale. Anyone with even a passing interest in the silent era or film as a whole should avidly seek this out. Kino on Video have a very decent double DVD edition. I wholeheartedly recommend it. Edit (October 2010): As I add these words, Eureka have released a stellar BluRay of this saga which is just mind-blowing (reviewed by dvdbeaver, for the curious). If you've never seen this film yet, lucky you. Go straight to HD!",
         "I saw this on the big screen with live organ accompaniment (from the original film score) last night and I'm glad I did. Most people don't know Fritz Lang for anything before *Metropolis*, but this is a film which, to my mind, matches the best of what he has done. It's incredible to see what they were able to do with the wild set design. The score was suitably intense at moments. And the story was a pretty touching one about the fall of Siegfried. The scenes I was amazed by in particular are: the dragon-slaying sequence (which, at first, elicited laughs because of the obvious artificiality of the creature but then got sounds of pity as he lay slain with blood shooting from his torso); Kriemhild's dream sequence, which has to be the earliest example of animation I've seen (the animation and accompanying music are pretty dark and disturbed--they gave me the creeps); and the approach to Brunhilde (with an incredible sea of fire). What I've come away with is even more of an appreciation for what filmmakers were capable of in the silent period. It seems clear after a film like *Siegfried* that silent film was not an infant technology waiting for sound but was an artform of its own. All in all, I'd say this is a must-see. It's clearly not just preparation for the \"great\" films of Lang to come (like *Metropolis* and *M*), but is on par with any of the best of his stuff. This and *Dr. Mabuse, the Gambler*, both Lang films which are rarely screened, should be caught if at all possible.",
         "This lavish and memorable adaptation of the first part of the Nibelungen saga is worthwhile for a number of strengths. While Fritz Lang and Thea von Harbou seem to have rather freely adapted the original material, they succeeded beyond doubt in bringing the main characters to life and in creating a distinctive and interesting atmosphere for the story. The cast, likewise, do a good job in portraying their characters. The visual effects are uneven, and a couple of times they do not work all that well, but at other times they work wonderfully. This first part of Lang's epic primarily covers the \"Siegfried\" part of the saga. Siegfried is the kind of near-perfect hero who can become rather dull in a hurry if the actor and director overdo it, but here Paul Richter works well in the role, and Lang effectively brings out the sometimes tangled connections between Siegfried and the other characters. These relationships are really the most interesting aspect of this part of the story, and Lang does well in keeping them the main focus for most of the time. Gunther, Hagen, Kriemhild, and Brunhild each have an interesting connection with Siegfried, and by giving the other characters a well-developed personality, the movie also enhances Siegfried's own identity. The story moves rather slowly much of the time, in order better to develop the atmosphere and characters. This actually enhances the action and adventure sequences, giving them (and the movie as a whole) more substance. The picture works very well and, aside from a very small number of its visual effects, has held up well over the years.",
         "Canto 1: How Siegfried Slayed the Dragon: Siegfried (Paul Richter), the son of King Siegmund, forges a sharp sword and hears stories from the locals about Princess Kriemhild (Margarete Schön). He decides to go to Worms to win Kriemhild. Along his journey, he kills a dragon and baths in its blood to become invincible. Canto 2: How Bolker, the Bard, Sang of Siegfried in Front of Kriemhild and How Siegfried Came in Worms: Siegfried fights and defeats the dwarf King of the Realm of the Nibelungen Alberich (Georg John) that was wearing his wonder cap that makes the user unseen or in whatever form he wishes. Alberich asks Siegfried to spare his life and in return he gives the Treasure of the Nibelungen and the Balmung sword. Siegfried makes twelve kings as his vassals, and when he asks the hand of Kriemhild to her weak brother King of Burgundy Gunther (Theodor Loos), he advises that he would accept is Siegfried helps him to win the strong Queen of Iceland Brunhild (Hanna Ralph). Canto 3: How Siegfried Won Brunhild for Gunther: Siegfried wears the invisible helmet and helps Gunther to win Brunhild in the proofs of throwing stones and spear and jumping. Canto 4: How Brunhild Enters Worms and How the King Celebrate Their Wedding: Brunhild tells Gunther that she is her captive but not his bride. Gunther asks Siegfried to help him again in his wedding night, and Siegfried takes his form and accidentally brings Brunhild's armlet with him. Canto 5: How After Half a Year, Siegfried's Gift to His Bride, The Nibelungen Treasure, Arrives in Worms and How the Two Queens Quarrel With Each Other: When Kriemhild finds Brunhild's armlet, Siegfried tells her how her brother won the queen. While going to the mass, Kriemhild and Brunhild quarrel and the offended Kriemhild discloses the truth to her brother's wife. Canto 6: How Gunther Betrayed Siegfried: Brunhild lies to Gunther and tells him that she lost her virginity with Siegfried. Gunther organizes boar hunting in the Odenwald Forest and asks Hagen Tronje (Hans Adalbert Schlettow) to slain Siegfried. Hagen lures Kriemhild and she tells the vulnerable part of Siegfried's body where the lime leaf has fallen. Brunhild fasts, Gunther betrays Siegfried, and Hagen impales him with a spear. Canto 7: How Kriemhild Swears Revenge to Hagen Tronje: Brumhild tells Gunther that she lied and he killed his only loyal friend. Then she dies of starvation. Kriemhild swears revenge to Hagen. The magnificent poetic saga of Siegfried is told through seven cantos, in one of the most beautiful fantasies ever. The story has drama, adventure, romance, betrayal and stunning special effects for a 1924 movie, when cinema was very incipient and technology primitive. However, the solid screenplay with a perfect development of the characters, the excellent performances of the cast and the awesome direction of Fritz Lang produced an epic ahead of time. It is inevitable the comparison of this masterpiece with \"The Lord of the Rings\", both unforgettable fantasies. My vote is ten. Title (Brazil): \"Os Nibelungos � Parte 1: A Morte de Siegfried\" (\"The Nibelungen: The Death of Siegfried\")",
         "essential viewing (and listening)...the newly-restored Munich Film Archives dvd of this film is simply wonderful. the G. Huppertz score is a marvel (lovingly restored by Erich Heller making use of the widow's piano score). Kurosawa's tribute to this classic can be seen in his handling of the \"siege of the third fire tower\" in RAN)...and, of course, Kriemhild's vindictive widow was the model for the Wicked Witch in SNOW WHITE... a landmark of international cinema: not to be missed.",
         "I am not especially an aficionado of silent films though I have long loved Lang's 'Metropolis'. Being an opera lover, especially Wagner, it is to my shame that it has taken me decade to get around to watching Lang's masterpiece 'Siegfried'. Even more than Richard Wagner's 4 Ring operas in 'Der Ring des Nibelungen' Lang's films tie in many of the ancient Nordic and Teutonic legends that contributed to Wagner's monumental creation. Brunhild is a powerful Icelandic Queen, Siegfried the son of King Siegmund, all this quite different from the operas in that Siegmund was not a king in those. Also, Hagen, the evil deus ex machina is portrayed here as a Wotan like figure, with patched eye and horned helmet. Otherwise, the basic story is the same but more believable as drama than Wagner's highly fantastic story line. This film is going to last a lifetime with me. And it is especially wonderful that the great musical score by Gottfried Huppertz has been included in the DVD release on Kino films. Its a haunting score and very much its own character. It doesn't try to imitate Wagnerianism but there are what Wagner called leitmotivs to represent the various characters and mood. Even if you aren't a Wagner fan this film by Fritz Lang displays so many amazing innovations for 1924 that it puts the computerized f/x of our day quite in the shade in terms of novelty and human artistry. I can't recommend 'Siegfried' highly enough. Haunting and beautiful, even in black and white. The Kino picture is quite clear and the acting superb.",
         "This film depicts the epic story of the rise and fall of the great German hero, Siegfried. It follows the classic pattern of the young hero who overcomes one challenge after another, only to be defeated in the end through his own weakness. Siegfried's early adventure, where he fights and slays the dragon, is masterfully filmed, with a special-effects monster that is amazingly sophisticated for its era. Further tests of his valour and cunning are required before he can marry the Burgundian princess, Kriemhilde; chief among these are assisting his future brother-in-law, Gunther, the King of Burgundy, to win the hand of the Amazon queen, Brunhild. Aided by a cloak of invisibility, Siegfried fixes the contests between Gunther and Brunhild to defeat the imperious queen and delivers her unwillingly to Gunther. This service ultimately leads to his downfall, however, as he eventually confides in Kriemhilde his duplicity and she betrays his secret to the outraged Brunhild, who then seeks his death. Despite being made in the midst of the Expressionist era of filmmaking in Germany, this movie is largely naturalistic in its sets and acting. The Burgundian court, as befits its artificial and ceremonious atmosphere, is depicted through angular and stiff sets and costumes, somewhat reminiscent of the expressionist style, but there are not the disturbing distortions seen in such classic films as \"The Cabinet of Dr. Caligari\".",
         "It has to be said that, technically, the first part of Fritz Lang's epic fantasy adventure is an absolutely stunning piece of cinema, especially given the time in which it was made. However, over eight decades on, the film hasn't aged all that well...but that's a criticism that doesn't bear much weight. The film is almost two and a half hours long, and this running time becomes even more astounding when you consider that there's another equally long segment to follow! Die Nibelungen is adapted from Nordic legend and works from a screenplay written by the genius Fritz Lang and his wife at the time, Thea von Harbou; who also worked with Lang on his most famous works; M and Metropolis. The plot follows the heroic Siegfried, who travels to Worms after hearing of the beautiful sister of the King, Kriemhild. However, in order to marry the beautiful Kriemhild, Siegfreud must first win a bride for her brother. The main reason why the film works is because, much like Metropolis; it's so astounding to look at. Lang gives the film a real sense of wonder by way of fantasy elements such as dwarfs and magic powers, and it's amazing that such a piece of cinema could have been made in 1924. The standout of the 143 minute running time is the section that sees our valiant hero slaying a dragon. The effects here are better than those that can be seen in some modern films today, and the fact that the director had the audacity to show a man fighting a dragon deserves respect. On a personal level, this film didn't do a great deal for me; but fans of classic art cinema won't be disappointed."
      ],
      "genres": [
         "Fantasy",
         "Drama",
         "Adventure"
      ],
      "productionCompanies": [
         "Decla-Bioscop AG",
         "Universum Film (UFA)"
      ],
      "summaries": [
         "Siegfried, son of King Sigmund, hears of the beautiful sister of Gunter, King of Worms, Kriemhild. On his way to Worms, he kills a dragon and finds a treasure, the Hort. He helps Gunther to win Krimhild, a mask that makes him invisible proves to be very useful. But because Brunhild is cursing Kriemhild, she tells her what really happened. Now Brunhild wants Siegfried's head. Is Gunther going to do her that favor?",
         "The magnificent poetic saga of Siegfried is told through seven cantos: Canto 1: How Siegfried Slayed the Dragon: Siegfried, the son of King Siegmund, forges a sharp sword and hears stories from the locals about Princess Kriemhild. He decides to go to Worms to win Kriemhild. Along his journey, he kills a dragon and baths in its blood to become invincible. Canto 2: How Bolker, the Bard, Sang of Siegfried in Front of Kriemhild and How Siegfried Came in Worms: Siegfried fights and defeats the dwarf King of the Realm of the Nibelungen Alberich that was wearing his wonder cap that makes the user unseen or in whatever form he wishes. Alberich asks Siegfried to spare his life and in return he gives the Treasure of the Nibelungen and the Balmung sword. Siegfried makes twelve kings as his vassals, and when he asks the hand of Kriemhild to her weak brother King of Burgundy Gunther, he advises that he would accept is Siegfried helps him to win the strong Queen of Iceland Brunhild. Canto 3: How Siegfried Won Brunhild for Gunther: Siegfried wears the invisible helmet and helps Gunther to win Brunhild in the proofs of throwing stones and spear and jumping. Canto 4: How Brunhild Enters Worms and How the King Celebrate Their Wedding: Brunhild tells Gunther that she is her captive but not his bride. Gunther asks Siegfried to help him again in his wedding night, and Siegfried takes his form and accidentally brings Brunhild's armlet with him. Canto 5: How After Half a Year, Siegfried's Gift to His Bride, The Nibelungen Treasure, Arrives in Worms and How the Two Queens Quarrel With Each Other: When Kriemhild finds Brunhild's armlet, Siegfried tells her how her brother won the queen. While going to the mass, Kriemhild and Brunhild quarrel and the offended Kriemhild discloses the truth to her brother's wife. Canto 6: How Gunther Betrayed Siegfried: Brunhild lies to Gunther and tells him that she lost her virginity with Siegfried. Gunther organizes boar hunting in the Odenwald Forest and asks Hagen Tronje to slain Siegfried. Hagen lures Kriemhild and she tells the vulnerable part of Siegfried's body where the lime leaf has fallen. Brunhild fasts, Gunther betrays Siegfried, and Hagen impales him with a spear. Canto 7: How Kriemhild Swears Revenge to Hagen Tronje: Brumhild tells Gunther that she lied and he killed his only loyal friend. Then she dies of starvation. Kriemhild swears revenge to Hagen.",
         "The womenfolk cause no end of trouble for their beaux in this Fritz Lang masterpiece adapted from the Nibelungenlied. Magic swords, enchanted snoods, and powerful amulets abound at a time when the world is populated by dragons, dwarves, and Teutonic heroes. Siegfried is one tough customer, but he better watch out . . . hell hath no fury like a woman scorned."
      ],
      "budget": 0
   },
   "movielensId": 45192,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1924-02-13",
      "dvdReleaseDate": "2002-11-19",
      "directors": ["Fritz Lang"],
      "runtime": 140,
      "movieId": 45192,
      "title": "Die Nibelungen: Siegfried",
      "mpaa": "",
      "actors": [
         "Paul Richter",
         "Theodor Loos",
         "Margarete Schön",
         "Gertrud Arnold",
         "Rudolf Klein-Rogge",
         "Hanna Ralph",
         "Hans Adalbert Schlettow"
      ],
      "imdbMovieId": "0015175",
      "originalTitle": "Die Nibelungen: Siegfried",
      "genres": [
         "Adventure",
         "Drama",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["3i09NJ1AwiM"],
      "plotSummary": "Siegfried, son of King Sigmund, hears of the beautiful sister of Gunter, King of Worms, Kriemhild. On his way to Worms, he kills a dragon and finds a treasure, the Hort. He helps Gunther to win Brunhild, by using a mask that makes him invisible. But because Brunhild is cursing Kriemhild, she tells her what really happened. Now Brunhild wants Siegfried's head.",
      "tmdbMovieId": 31506,
      "avgRating": 3.87209,
      "releaseYear": "1924",
      "numRatings": 43,
      "posterPath": "/e860uFCvNlsHMYzKqXv8arApQ3L.jpg"
   }
}