{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "hero",
            "id": 1701
         },
         {
            "name": "rivalry",
            "id": 9823
         },
         {
            "name": "rescue",
            "id": 10084
         },
         {
            "name": "good vs evil",
            "id": 10842
         },
         {
            "name": "crime",
            "id": 14536
         },
         {
            "name": "youth",
            "id": 14751
         },
         {
            "name": "danger",
            "id": 15017
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "escapade",
            "id": 187710
         },
         {
            "name": "save the day",
            "id": 193544
         },
         {
            "name": "young heroes",
            "id": 193545
         },
         {
            "name": "teachers and students",
            "id": 193547
         },
         {
            "name": "teaching the ways of the world",
            "id": 193548
         },
         {
            "name": "eccentric family",
            "id": 193549
         },
         {
            "name": "vigilantism",
            "id": 193551
         },
         {
            "name": "heroic mission",
            "id": 193552
         },
         {
            "name": "power relations",
            "id": 193554
         },
         {
            "name": "laxative",
            "id": 215404
         }
      ],
      "imdb_id": "tt0103596",
      "video": false,
      "title": "3 Ninjas",
      "recommendations": [
         18885,
         40508,
         32302,
         10680,
         20726,
         13962,
         11164,
         23470,
         17745,
         9622,
         21845,
         22590,
         24795,
         10414,
         41582,
         9607,
         12139,
         1497,
         2436,
         33657
      ],
      "backdrop_path": "/yZjbReSRgTGf5IZPmwpecPgm1Z1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Grandpa Mori Tanaka",
               "gender": 2,
               "credit_id": "52fe46c49251416c75082d89",
               "name": "Victor Wong",
               "profile_path": "/70vAqnH2QFhLOenNQCVcaG1JhN3.jpg",
               "id": 11395,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Samuel 'Rocky' Douglas Jr.",
               "gender": 2,
               "credit_id": "52fe46c49251416c75082d8d",
               "name": "Michael Treanor",
               "profile_path": "/9iNHOUbmn5j2MwIMLeL6vfxBy4z.jpg",
               "id": 80280,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jeffrey 'Colt' Douglas",
               "gender": 2,
               "credit_id": "52fe46c49251416c75082d91",
               "name": "Max Elliott Slade",
               "profile_path": "/g06RM2IWsiw6rvKA6SNsceFsHu5.jpg",
               "id": 8187,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Michael 'Tum Tum' Douglas",
               "gender": 2,
               "credit_id": "52fe46c49251416c75082d95",
               "name": "Chad Power",
               "profile_path": "/jgbnWwPHUWGEf6OmxukAFiboxmL.jpg",
               "id": 80281,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Hugo Snyder",
               "gender": 2,
               "credit_id": "52fe46c49251416c75082d99",
               "name": "Rand Kingsley",
               "profile_path": null,
               "id": 80282,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Samuel Douglas Sr., FBI",
               "gender": 2,
               "credit_id": "52fe46c49251416c75082d9d",
               "name": "Alan McRae",
               "profile_path": null,
               "id": 80283,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Jessica Douglas",
               "gender": 1,
               "credit_id": "52fe46c49251416c75082da1",
               "name": "Margarita Franco",
               "profile_path": null,
               "id": 80284,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Emily",
               "gender": 0,
               "credit_id": "52fe46c49251416c75082da5",
               "name": "Kate Sargeant",
               "profile_path": "/khkI6bGnCYWfE3c3M6nknwjLNJc.jpg",
               "id": 80285,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Brown",
               "gender": 2,
               "credit_id": "52fe46c49251416c75082dbb",
               "name": "Joel Swetow",
               "profile_path": "/grAzwmiFh08MRfzutbsiQZfoCFZ.jpg",
               "id": 156136,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Rushmore",
               "gender": 2,
               "credit_id": "52fe46c49251416c75082dbf",
               "name": "Professor Toru Tanaka",
               "profile_path": null,
               "id": 13006,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Marcus",
               "gender": 2,
               "credit_id": "52fe46c49251416c75082dc3",
               "name": "Race Nelson",
               "profile_path": null,
               "id": 157951,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Hammer",
               "gender": 0,
               "credit_id": "52fe46c49251416c75082dc7",
               "name": "D.J. Harder",
               "profile_path": null,
               "id": 1200456,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Bully",
               "gender": 0,
               "credit_id": "52fe46c49251416c75082dcb",
               "name": "Baha Jackson",
               "profile_path": null,
               "id": 951568,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Bully",
               "gender": 2,
               "credit_id": "52fe46c49251416c75082dcf",
               "name": "Scott Caudill",
               "profile_path": null,
               "id": 168938,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Babysitter",
               "gender": 1,
               "credit_id": "52fe46c49251416c75082dd3",
               "name": "Fritzi Burr",
               "profile_path": null,
               "id": 153640,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Store Owner",
               "gender": 0,
               "credit_id": "52fe46c49251416c75082dd7",
               "name": "Tasen Chou",
               "profile_path": null,
               "id": 1200457,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "FBI Agent Kurl",
               "gender": 2,
               "credit_id": "52fe46c49251416c75082ddb",
               "name": "Clifton Powell",
               "profile_path": "/hBw76xJtCwKS2v5rZtzDBqvKLN6.jpg",
               "id": 58924,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Arab FBI Agent",
               "gender": 2,
               "credit_id": "52fe46c49251416c75082ddf",
               "name": "Al Septien",
               "profile_path": null,
               "id": 72446,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "Fester",
               "gender": 0,
               "credit_id": "52fe46c49251416c75082de3",
               "name": "Patrick Labyorteaux",
               "profile_path": "/bpT1Xkowt0YpsntbytgddnWDT9Q.jpg",
               "id": 114876,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46c49251416c75082dab",
               "name": "Jon Turteltaub",
               "profile_path": "/borF48XTUkOCKE3ryh3BFxe4Unr.jpg",
               "id": 12962,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c49251416c75082db1",
               "name": "Edward Emanuel",
               "profile_path": null,
               "id": 139849,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c49251416c75082db7",
               "name": "Kenny Kim",
               "profile_path": null,
               "id": 139850,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 9.961748,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16314,
      "vote_count": 134,
      "budget": 0,
      "overview": "Each year, three brothers Samuel, Jeffrey and Michael Douglas visits their Japanese grandfather, Mori Shintaro whom the boys affectionately refer to as Grandpa, for the summer. Mori is a highly skilled in the fields of Martial arts and Ninjutsu, and for years he has trained the boys in his techniques. After an organized crime ring proves to be too much for the FBI, it's time for the 3 brother NINJAS! To use their martial arts skills, they team up to battle the crime ring and outwit some very persistent kidnappers!",
      "similar": [
         32302,
         18885,
         40508,
         5176,
         68718,
         36647,
         272,
         862,
         93456,
         605,
         177572,
         9986,
         1562,
         4982,
         44943,
         49017,
         73,
         88,
         363676,
         16577
      ],
      "original_title": "3 Ninjas",
      "runtime": 84,
      "poster_path": "/lvfgYcK0dpgwCuRX4mTqc1Yg3yF.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1992-08-07",
      "vote_average": 5.5,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "3 Ninjas Collection",
         "id": 71458,
         "poster_path": "/cApZ5GwwzMsA991J6uAOb52Js0s.jpg"
      },
      "tagline": "Crosses Teenage Mutant Ninja Turtles and Home Alone!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jon Turteltaub"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Edward Emanuel",
         "Kenny Kim"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0103596/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjk4ODU3ODM0Nl5BMl5BanBnXkFtZTcwMzk2Mjg3NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Victor Wong, Michael Treanor, Max Elliott Slade | See full cast and crew »"],
      "reviews": [
         "OK so i am getting annoyed by all these people bashing this movie....it was made for kids so obviously adults aren't going to love it...DUH!....i mean i watched this movie at least twice a month as a kid and now even though I'm 15 i'll still watch it if its on TV or if i feel like renting it....its a great way to remember what it was lyk being a a little kid....it gets kids imagination working i mean i would spend hours acting out scenes after i saw this movie...and this movie sparked such an interest in martial arts in me that i started taking lessons and now am a brown belt.....its just a fun movie the writer didn't intend it to be a classic but it is anyway to kids and grownups who are kids at heart....think b4 u speak....and don't take everything so seriously....I LOVE COLT!!!!!",
         "I love this movie! Those three guys are not only great at martial arts but funny and charming actors as well. All the kids loved it when it came out and still quote lines from this 'classic.' Yes, there are borrowed ideas (Teenage Mutant Ninja Turtles to Home Alone...) but who doesn't? And stunt doubles for the Grandfather, but who do you think he is, Jackie Chan? Victor Wong makes a sincere grandfather/mentor. Hey, the adult reviewers may not have enjoyed or even understood this movie, but the 'kids' that I know, did. As for the Ninjas themselves, they acted naturally and credibly. A perfect family movie.",
         "Somebody posted complaining about how three kids cannot beat up 30 or 40 bad men. Well if you were a kid, you'd adore this film. I first saw this film when I was I believe five years old. I grew up watching the movies along with the rest of the series: 3 NINJAS KICK BACK and 3 NINJAS KNUCKLE UP. I'm not trying to sound cheesy or anything. I rather watch the series than watching Teenage Ninja Turtles. I think every generation of young kids would have liked 3 Ninjas if they are really interest in Martial Arts. Sure, the film will probably fade away from our interests as we grow up. But in my own opinion and my experiences, I think 3 Ninjas was one of the excellent film of early 1990s that young viewers would enjoy. Now I'm a teenager and I laugh at the thoughts of how obessed I was with 3 Ninjas but that doesn't mean I shouldn't destroy it existence.",
         "Three children (Colt, Rocky, and Tum Tum) who are instructed in the art of ninjitsu by their grandfather, Ninja Master Mori (Victor Wong). Another of Mori's former pupils grew up to be notorious underworld figure Hugo Snyder (Rand Kingsley), who is attempting to get the boys' FBI agent dad off his back orders the young ninjas kidnapped. The kid ninjas turn the tables on their inept kidnappers, but get in bigger trouble when a group of ninjas keeps them prisoner in the hold of a ship. Action packed, but not overly violent, 3 Ninjas is a lot of fun for kids and funny too.",
         "A great many people claim that Citizen Kane is one of the greatest films, and whilst there is some truth to the fact that Orson's masterpiece was, in terms of style, innovative - 3 Ninjas is truly a superior film on every level. 3 Ninjas combines Chaucerian comedic metaphors, injects some Wordworthian bathos, mixes in some satire worthy of Swift, and comes out with a film so incredible that this reviewer cannot describe it with a sufficient number of superlatives! A dramatic stripping away of racial and social mores in the modern day United States, 3 Ninjas is extraordinary in its realistic treatment of a multi-ethnic family - because, after all, every Japanese person knows karate! I'm amazed that so many of the actors involved in this fine production have not gone on to star in any other films, and was surprised to note that the film was absent from the Academy Awards shortlist. Perhaps a remake can be arranged if we all join hands, find a Japanese friend to teach us the mystical ways of the East, and pray that that chap from Happy Days is still alive.",
         "Victor Wong, Michael Treanor, Max Elliot Slade, and Chad Power star in this great family action film. Victor Wong stars as the grandfather who teaches his three grandchildren the art of being a ninja. Soon they're kidnapped by an old acquaintance of Grandpa's. This movie is also very funny and no doubt everyone in the family will laugh out loud. I recommend this film to anyone that likes action films mixed with humor.",
         "This is the best of the ''3 Ninjas'' movies, and this is the one which I always watched in my childhood.(the other 2 sequences never took very much my attention,specially because the actors who played Rocky and Tum Tum were not the same). I always remember how cool I found the ninja thing, the characters(specially Colt) and also the mask and the 'ninja names' that Samuel(Rocky),Jeffrey(Colt) and Michael(Tum Tum) received from their grandfather.Of course there are impossible things, like an adult ninja losing a fight or being weaker than the kids, but this is a entertaining movie spite all of 'non real'facts. Victor Wong(who I always confuse with Pat Morita)is great being the Grandpa Mori Tanaka as well.",
         "This movie is lame for good reasons,1 It`s not Funny 2,not enough action 3,the kids are annoying 4,kids usually don`t do a good job at action films.I think even Mike and his robot friends will suffer when they watch this film.I usually like low budget movies but this movie is just to lame.",
         "This, without a doubt, is the KING of \"back-in-the-day\" fun stuff. Its \"The Goonies\" for the 90's, and, well...sure kicks butt compared to \"Home Alone.\" Did you cheer when he rolled down his own stairs in a sled? Not exactly. Of course who wouldn't cheer for three kids taking down a six-foot, two hundred-plus pounder henchman (who's really posing as a light-up dummy)? Even though slightly unintelligent...plot remains solid with sharp humor and on-your-feet fight scenes. Yet, its not exactly Bruce Lee...but did you ever see Bruce Lee kick butt at age 13? See the movie. It's definitely some high-kickin' fun.",
         "Warning: spoilers! The first of its kind. A unique tale of three brothers who spend a summer learning the art of Ninjuitsu from the grandfather out in the deep, peaceful woods. There they meet their grandfather's nemesis, Snyder. He is introduced a few scenes earlier as an illegal arms-dealer who knows a few techniques himself. Well, like all summers, the brothers' comes to an end. They are back in the big city going to school. Like all trio of brothers, the eldest has a girl-friend, which gives the younger two ammo to pick on him with--\"Rocky loves Emily! Rocky loves Emily!\" Well, school yard fights and pre-teen humor combine to form the middle of the film. And, as all martial art films have, this film shares a climatic ending when nemesis Snyder has associate hire 3 goons (coincidence that they are going after 3 brothers?) who have a very Bill & Ted-ish vocabulary. As you can imagine, they get in over their heads taking the trio on...in their own house--big mistake! When the goons fail their mission, Snyder sends in his own men to do the job properly--including a 250lbs-or more Bruno. They drag the 3 boys aboard a harbored frigate...and thats then the martial arts mayhem begins. --Personal note: How much did they have to pay Patrick Labyorteaux (Bud from JAG) to be in this? There's also a scene, the boys rummage up their house to defeat the 3 goons--how do they explain the damage to mom and dad...I have an alibi, but I'd like to see the bonus scene where they explain that! I love (despise-love) the climatic sword fight between \"grampa\" and Snyder...Ninjas are trained to swing in circles--see also: books on Aikido and Ninjuitsu. Actors swung in direct-straight lines, very hard to choreograph properly...just a personal thing."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Family",
         "Sport"
      ],
      "productionCompanies": [
         "Global Film Enterprises",
         "Global Venture Hollywood",
         "Touchstone Pictures"
      ],
      "summaries": [
         "Each year, three brothers, Samuel, Jeffrey and Michael Douglas visit their grandfather, Mori Tanaka, for the summer. Mori is highly skilled in ninjutsu, and for years he has trained the boys in his techniques. After an organized crime ring proves to be too much for the F.B.I., it's time for the three ninja brothers! Using their martial artistry, they team up to battle the crime ring and outwit some very persistent kidnappers!",
         "Meet Samuel, Jeffrey and Michael Douglas! Their grandfather, Mori Tanaka, is highly skilled in ninjutsu. For years he's been training these boys in this technique. He even gave them names: Rocky because he's \"solid and cool as granite rock\"; Colt, because he's \"fast and free, a spirit of a young wild horse\"; and Tum Tum because ambition begins and ends with his tummy\". But one day, an old \"friend\" of Grandpa's, Hugo Snyder, is heard from again. He's being hassled by the F.B.I., and the boys' father happens to be an F.B.I. officer. So Snyder figures if he kidnaps the father's kids, it will ease the tension, none of his own men are suitable for the task, so he hires three dim and incredibly incompetent surfers to do the deed. The boys treat them to a night of ninja moves and hilarious gags ala 'Home Alone'. But the boys soon get captured by Snyder, and what is more, they become doubtful of their grandfather, until he bursts into action and fights Snyder.",
         "Three young brothers, who have been trained in ninja techniques from an early age, learn that they possess powers which evil crooks would like to control. When a kidnap is attempted, they must defend themselves using all their skills."
      ],
      "budget": 6500000
   },
   "movielensId": 4748,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "Italiano"
      ],
      "releaseDate": "1992-08-07",
      "dvdReleaseDate": "2003-06-03",
      "directors": ["Jon Turteltaub"],
      "runtime": 84,
      "movieId": 4748,
      "title": "3 Ninjas",
      "mpaa": "PG",
      "actors": [
         "Victor Wong",
         "Michael Treanor",
         "Max Elliott Slade",
         "Chad Power",
         "Rand Kingsley",
         "Alan McRae",
         "Margarita Franco",
         "Kate Sargeant",
         "Joel Swetow",
         "Professor Tanaka",
         "Race Nelson",
         "D.J. Harder",
         "Baha Jackson",
         "Scott Caudill",
         "Fritzi Burr",
         "Tasen Chou",
         "Clifton Powell",
         "Al Septien",
         "Patrick Labyorteaux"
      ],
      "imdbMovieId": "0103596",
      "originalTitle": "3 Ninjas",
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["jF_9prQFtik"],
      "plotSummary": "Each year, three brothers Samuel, Jeffrey and Michael Douglas visits their Japanese grandfather, Mori Shintaro whom the boys affectionately refer to as Grandpa, for the summer. Mori is a highly skilled in the fields of Martial arts and Ninjutsu, and for years he has trained the boys in his techniques. After an organized crime ring proves to be too much for the FBI, it's time for the 3 brother NINJAS! To use their martial arts skills, they team up to battle the crime ring and outwit some very persistent kidnappers!",
      "tmdbMovieId": 16314,
      "avgRating": 2.33072,
      "releaseYear": "1992",
      "numRatings": 1146,
      "posterPath": "/lvfgYcK0dpgwCuRX4mTqc1Yg3yF.jpg"
   }
}