{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ocean",
            "id": 270
         },
         {
            "name": "shipwreck",
            "id": 2580
         },
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "ship",
            "id": 3799
         },
         {
            "name": "ghost ship",
            "id": 4078
         },
         {
            "name": "survivor",
            "id": 5385
         },
         {
            "name": "possession",
            "id": 9712
         },
         {
            "name": "rescue",
            "id": 10084
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "demon",
            "id": 15001
         },
         {
            "name": "blood shower",
            "id": 204177
         },
         {
            "name": "canuxploitation",
            "id": 206850
         }
      ],
      "imdb_id": "tt0080603",
      "video": false,
      "title": "Death Ship",
      "recommendations": [
         30931,
         90092,
         128145,
         36089,
         45186,
         40145,
         27114,
         8690,
         164377,
         41516,
         70583,
         39311,
         52196,
         29425,
         8691,
         27272,
         83413,
         39868,
         29402,
         55080
      ],
      "backdrop_path": "/8tJ03QntJveKncgCFAypbVK41lL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Captain Ashland",
               "gender": 2,
               "credit_id": "52fe449a9251416c910166bf",
               "name": "George Kennedy",
               "profile_path": "/vNYRh8f0QuA2eK8ahKftOBxtDN7.jpg",
               "id": 12950,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Trevor Marshall",
               "gender": 2,
               "credit_id": "52fe449a9251416c910166c3",
               "name": "Richard Crenna",
               "profile_path": "/nWtMvMnLqGjlIGWNXjshgxsHDih.jpg",
               "id": 16554,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe449a9251416c910166c7",
               "name": "Nick Mancuso",
               "profile_path": "/pDVzlviKTtCwXfVplG3tiTX9PyS.jpg",
               "id": 49877,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Margaret Marshall",
               "gender": 0,
               "credit_id": "52fe449a9251416c910166cb",
               "name": "Sally Ann Howes",
               "profile_path": "/t38RPvMbV3agtvD6zMdNJYtLQ2T.jpg",
               "id": 70307,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sylvia",
               "gender": 1,
               "credit_id": "52fe449a9251416c910166cf",
               "name": "Kate Reid",
               "profile_path": "/55CPSQJHHlGcIJAhszViJD5PkkF.jpg",
               "id": 39709,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Lori",
               "gender": 0,
               "credit_id": "52fe449a9251416c910166d3",
               "name": "Victoria Burgoyne",
               "profile_path": null,
               "id": 110448,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Robin Marshall",
               "gender": 0,
               "credit_id": "52fe449a9251416c910166d7",
               "name": "Jennifer McKinney",
               "profile_path": null,
               "id": 110449,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ben Marshall",
               "gender": 0,
               "credit_id": "52fe449a9251416c910166db",
               "name": "Danny Higham",
               "profile_path": null,
               "id": 110450,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Jackie",
               "gender": 2,
               "credit_id": "52fe449a9251416c910166df",
               "name": "Saul Rubinek",
               "profile_path": "/1gsXmCmJIegqK0U8dwLz005UM0.jpg",
               "id": 3712,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Parsons",
               "gender": 0,
               "credit_id": "52fe449a9251416c910166e3",
               "name": "Murray Cruchley",
               "profile_path": null,
               "id": 44165,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Seaman No. 1",
               "gender": 0,
               "credit_id": "55db7aa1c3a36865cb000031",
               "name": "Doug Smith",
               "profile_path": "/uD8ekqTC7O04dgnZ7IoLq0Vf5Mn.jpg",
               "id": 1252641,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Seaman No. 2",
               "gender": 2,
               "credit_id": "55db7aaec3a36865ba000019",
               "name": "Anthony Sherwood",
               "profile_path": "/nalssci2NG2PZJIMPu4ra7fahR.jpg",
               "id": 62126,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe449a9251416c910166e9",
               "name": "Alvin Rakoff",
               "profile_path": null,
               "id": 105984,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55db7ad7c3a36865b8000036",
               "name": "John Robins",
               "profile_path": null,
               "id": 1218756,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "55db7b0bc3a36865b800003d",
               "name": "Jack Hill ",
               "profile_path": "/yTwURbDoPgVsbpByaz01mFrrbVu.jpg",
               "id": 31310,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "55db7b1d92514162ce00003b",
               "name": "David P. Lewis",
               "profile_path": null,
               "id": 6351,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "55db7b2e925141660700000e",
               "name": "Derek Gibson",
               "profile_path": null,
               "id": 2720,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55db7b5092514162d4000046",
               "name": "Harold Greenberg",
               "profile_path": null,
               "id": 66710,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55db7b5dc3a36865b600002c",
               "name": "Larry Nesis",
               "profile_path": null,
               "id": 1396891,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "55db7b6bc3a36865cb000049",
               "name": "Ivor Slaney",
               "profile_path": null,
               "id": 47800,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55db7b75c3a3686a90000010",
               "name": "René Verzier",
               "profile_path": null,
               "id": 31181,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55db7bc1c3a36865b8000053",
               "name": "Mike Campbell",
               "profile_path": null,
               "id": 1500152,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55db7bd092514162d1000053",
               "name": "Chris Burke",
               "profile_path": null,
               "id": 120500,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "55db7bdcc3a36865bd000051",
               "name": "Michel Proulx",
               "profile_path": null,
               "id": 1192793,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.471857,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 31703,
      "vote_count": 37,
      "budget": 0,
      "overview": "Survivors of a tragic shipping collision are rescued by a mysterious black ship which appears out of the fog. Little do they realise that the ship is actually a Nazi torture ship which has sailed the seas for years, luring unsuspecting sailors aboard and killing them off one by one.",
      "similar": [
         948,
         26466,
         9552,
         91586,
         205775,
         588,
         10585,
         3600,
         635,
         3131,
         109414,
         109424,
         12662,
         6404,
         9059,
         1826,
         14282,
         13570,
         26688,
         173
      ],
      "original_title": "Death Ship",
      "runtime": 91,
      "poster_path": "/oQzIrYU7G7SfPPC1439IIY5ld3t.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Astral Bellevue Pathé",
            "id": 10313,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bloodstar Productions",
            "id": 19122,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Lamitas",
            "id": 3441,
            "origin_country": ""
         }
      ],
      "release_date": "1980-03-07",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Those who survive the ghost ship are better off dead!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Alvin Rakoff"],
      "runtime": 91,
      "synopsis": "A mysterious black freighter steams at night, apparently deserted. Detecting a cruise ship close by, the ship alters course as ghostly voices shout in German, \"Battle Stations! Enemy in sight!\" The controls and wheel move my themselves. Aboard the cruise ship, the prickly Captain Ashland (George Kennedy) is making his final voyage, attended by his replacement, Captain Trevor Marshall (Richard Crenna), who has brought along his family. Outside, the freighter heads right for them, blasting its horn, and despite Ashland's best efforts, collides with the cruise ship, sinking it. The next morning, a handful of survivors, including Marshall, his wife Margaret (Sally Ann Howes), their children Robin and Ben, a young officer named Nick (Nick Mancuso), his love interest Lori (Victoria Burgoyne), the ship's stand up comic Jackie (Saul Rubinek), and a passenger, Mrs. Morgan (Kate Reid), are adrift on a large piece of wreckage. Ashland surfaces nearby, and is brought aboard barely conscious. Later, the survivors come upon the black freighter, unaware it is the ship which attacked them. Finding a boarding ladder slung from the stern, they climb aboard, but not before the ladder plunges into the sea as the officers try to climb it with the injured Ashland. When all are finally aboard, Jackie tries to rally the survivors with humor, but a cable seizes him by the ankle, and he is lifted and swung outboard by one of the ship's cranes, which lowers the thrashing comic into the water before cutting him loose, to be swept astern and lost. Shocked, the survivors explore the corridors of the empty, echoing vessel, finding only cobwebs and 1930s memorabilia. Hatches open and close by themselves and lights go on and off while a swinging block knocks out Nick, who is exploring above deck. Meanwhile, a delirious Ashland hears a disembodied voice speaking to him in German, telling him: \"This ship has been waiting for you...It is your new ship....Your chance has come!\" The others finally set up in a dusty bunk room, and break up to retrieve supplies and the injured Captain. Finding a record player and a movie projector that play by themselves, the survivors come to believe the ship is somehow alive. While watching the projected film (1936's \"Everything Is Rhythm\"), and eating a piece of hard candy from one of the ship's cupboards, Mrs. Morgan becomes grotesquely deformed and stumbles back to the bunk room, where a German-speaking Ashland strangles her. Now awake, and apparently under the evil ship's influence, Ashland dons a German naval officer's uniform and announces he is the captain. Marshall and Nick make a horrific discovery: the ship was once a Nazi prison ship (known as a 'Hell Ship'), and the ghosts of its victims and crew are still aboard... apparently determined to kill them. They both decide to escape, but are thwarted when the ship's two lifeboats lower into the sea by themselves and drift away. Despairing, the survivors try to get some rest but are further taunted by Ashland, who now prowls the ship's passages. Lori goes into shock when her shower water turns to blood, and she is tossed overboard by Ashland. Marshall and Nick are attacked by the piercing whine of the ship's electronics as the projector now shows films of Adolf Hitler. Nick lunges at Ashland, but instead plunges into a net holding skeletal remains, and Ashland drowns him. Marshall manages to stab a gloating Ashland, apparently killing him and stopping the ship. Searching below, Marshall finds a life raft in a freezer full of the frozen bodies of downed airmen and sailors, but as the children are jumping overboard, Margaret is captured by a resurrected Ashland and is trapped in a chain locker. Marshall is knocked out by Ashland, but awakens in time to find Margaret, who has escaped from the locker. Captain Ashland attempts to shoot the escaping Marshall family with a German rifle, but the gun jams and he tosses it away. Meanwhile, the ship detects another cruise liner and begins to give chase, ignoring Ashland, who wants it to run down the Marshalls' raft instead. Trying to re-take control of the ship, Ashland storms into the engine room, but is pushed into the steering gear and crushed. His agonized screams echo through the ship, joining those of its earlier victims. Above, the Marshalls rejoice as the freighter turns and steams away. After drifting for some time, they are spotted by a search helicopter and rescued. In final shot, the 'Death Ship' is shown afterwards steaming along at full speed. The ghostly voices once again announcing \"Enemy in sight!\" in German. It heads for another passenger ship, and the sounds of the collision are accompanied by the triumphant blasting of its horn....",
      "writers": [
         "John Robins",
         "Jack Hill"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080603/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyMTY3MzYxMl5BMl5BanBnXkFtZTcwNzI5NTE0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: George Kennedy, Richard Crenna, Nick Mancuso | See full cast and crew »"],
      "reviews": [
         "I first began my relationship with \"Death Ship\" when I were a lad growing up in the Heart of England - we had a little video library in our village that had quite a nice selection of horrors and I was always fascinated by the garish, ghoulish box art... Oh, and there were few as ghoulish as the spooky cover of \"Death Ship\", which I vividly remember recreating with pencil sketches in my schoolbooks. We rented it and I have VERY vague recollections of it not being very good but I never got round to see it as an adult. When the video certification act came to pass in 1984, \"Death Ship\" (rated X) was removed from the shelves, never to be released again in the UK. Which brings us to the present day - after all these years, I finally score a copy by chance, excitedly bring it home and, with a set belief in my mind that it's going to be a huge disappointment and a rubbish movie, I line up the alcoholic anathestic and push the tape into the cringing VCR... To my surprise, \"Death Ship\" turns out to be a winner! In fact, I'd file it quite high up in my \"Lost Gems\" folder - quite why this one has been resigned to the Dustbin of History and the Golden Turkey awards is beyond me. I was greatly impressed! The plot is reasonably simple but inarguably bizarre. In the opening scenes, a luxury cruise ship packed with holidaymakers collides with some kind of ghastly black vessel in the middle of the ocean. The cruiser sinks, killing almost everyone on board. There are only about eight survivors who sit floating in a lifeboat, waiting for someone to come and rescue them... Unfortunately the only sign of life for miles is this horrific looking black ship that's just lingering ominously in the ocean. The cruiser's curmudgeonly Captain (George Kennedy) is becoming increasingly ill, having nearly drowned, so the group of survivors decide that they will have to board the evil looking vessel in order to get food, drink and shelter. It doesn't take long to find that the ship is completely deserted and, although no one can rationalise how or why, it seems to be running itself! Worse still, we start to see through a series of unusual events (ie: people being hit over the head with flying objects, doors locking folks in spooky old rooms) that the ship appears to want its new passengers offboard as soon as possible. It's all quite \"Twilight Zone\" to begin with but as the film moves along, it gets increasingly horrific and frenzied, hurtling towards a (quite literally) crushing climax. The film is shot mostly onboard the ship and it's a wonderfully unpleasant set. From the moment they first board and get covered with oil and grease, you can virtually smell the rust on the ancient machinery and, as it develops, the stench of putrefaction. Oh, and THE SMELL OF FEAR (oh c'mon, it's a George Kennedy movie, I had to make at least one \"Naked Gun\" joke!)... Seriously though, it's clearly low budget, but I really enjoyed the rough and raw directorial style - the darkness and the frequent use of shaky, hand-held camera angles and really lend it an air of madness and menace. I felt the energy of the direction coupled with such genuinely ugly and sinister set pieces combined to create a very unique atmosphere that is, from start to finish, thoroughly unpleasant. There are certain scenes, mostly in the chaotic second half, which just make your skin crawl - the murder scenes aren't particularly *gory* as such, but they're shot in such a feverish manner as to prove really quite unsettling indeed. When the real identity of the ship is finally revealed and we discover what befell of the 'crew', it's an almighty suckerpunch and, again, the use of maniacal camera-work and some utterly disgusting sets just add to the overall effect. As I said before, I can't understand why \"Death Ship\" gets such a bad rap. As a haunted house movie, it's one of the better ones I've seen - on top of the rabid direction and deathlike atmosphere, we even have some real quality actors in this one (Kennedy is particularly menacing as the cruiser Captain whom the death ship begins to drive slowly mad) *AND* a cracking script to boot. The storyline moves at just the right pace (the first half builds up creepily and then the second one is a breakneck descent into the inferno) and it's unusual enough to make \"Death Ship\" an extremely memorable horror movie. I'd give this one an easy 8 out of 10 on the Horror-O-Meter. If you can find a copy, it's well worth seeing!",
         "Atrocious acting,nonsensical script,very low production values:all these elements can be found in Alvin Rakoff's \"Death Ship\".So why am I not going to trash this little movie?It's simple,I really like this film for those very reasons.It is everything low-budget horror movie should be,yet still manages to tell its story and generate a considerable amount of unease and dread.A cruise ship is destroyed by another ship(the Death Ship),killing most of the crew.The few survivors of the crash,who include the captain(George Kennedy from \"Creepshow 2\" or \"Just Before Dawn\"),a family of four and some others,decide that it would be a good idea to board the same ship that crashed their cruise ship.The death ship then starts killing its new victims.Despite so many bad comments \"Death Ship\" is still watchable.It has some really creepy scenes and memorable moments.Yes,the film doesn't make very much sense,but that's not what director Alvin Rakoff intended.Instead he puts together nightmarish sequences surrounded by an eerie sounds.You have to be a real horror fan to fully appreciate \"Death Ship\".Check this one out,it's pretty good.Highly recommended.",
         "This low-budget horror film, produced as one of the last gasps of the late 70s UK/Canada co-production treaty, is a ramshackle affair in places, particularly the early shipwreck scene, cobbled together with stock footage from earlier films (such as \"The Last Voyage\"). Nevertheless, the premise of a Nazi torture ship endlessly roaming the oceans in search of fresh victims is a genuinely original one, and it's well-handled by director Rakoff. The ship itself looks appropriately forbidding and the various mishaps that befall the luckless survivors are nasty and inventive. You never quite know when the film is going to deliver a nasty shock moment, or just an unnerving frisson - such as the projector that goes on playing footage of Hitler rallies even after it has been destroyed. Wisely, the film doesn't attempt to explain why the ship has never been detected previously, how it is powered or what became of the crew ; it works on the level of a nightmare and becomes increasingly surreal the more heroes Crenna and Mancuso delve into the ship's horrors. The ending is well-conceived and extremely gruesome. Effective music score too. Nobody seems to rate this film too highly yet I find it chilly, unsettling and considerably more powerful than many better-known horror movies.",
         "This is one of those movies I saw as a kid, was terrified by and have been trying to find ever since. I finally obtained a copy and watched it again for the first time in twenty years. Until that moment though, I had sought out various opinions of the movie on the internet, the place where everyone has an opinion on everything, and I must say, the majority of comments I recieved were less than encouraging, however my mission would not be swayed. Now, here I am having seen this obscure little flick again and I must say, it wasnt as bad as all that. I think the sense of atmosphere and eeriness, while quite tacky, were effective and charming. One scene that stood out in my mind since that fateful night I watched it as a child, is where Mrs. Morgan eats that poisoned lollie, turns into some creature, is killed and tossed overboard. Ah joyous memories",
         "This movie has a lot of 80's slasher cheese to it--I will freely admit that--but overall I think it is a pretty good movie. It is good enough to be added to any horror fans video library. The idea behind the movie is interesting. The whole haunted Nazi ship thing was really creepy (especially with the spooky ship used to make the flick). The cast did a pretty good job. The only thing that bothered me was the way that the initial ship collision was shown--no one bothered to explain how the 8 survivors got off their doomed ship or why a group spread out all over their ship would manage to get together on the lifeboat (and oddly they all seemed to know each other before the crash)! Maybe I shouldn't be so picky though. It isn't like I haven't seen cheesier horror flicks than this one in my life. Watch \"Death Ship\" only if you are a die hard B-movie horror fan! It is worth a view.",
         "Ok, we've already stated the fact that I LOVE b-movies. A lot of them are cheesy, badly acted, and have horrible plots. But that's what I love about them. And surely this film has all those right elements for a b-movie. But what this film does better than those other films, is that I manages to maintain atmospheric. Some of the scenes in this film were absolutely frightening! It kept me spellbound and wondering what was going to happen next. Even though, it was blatantly obvious and predictable. It still kept me guessing at certain parts. I give it a 9. Watch it if you are a die-hard horror fan or b-movie fan. Oh yeah, George Kennedy actually gave an award winning, creepy performance as the captain who wanted to take over the Nazi Freighter.",
         "Creepy and exciting movie about some shipwrecked lead to remains of a deserted ghost ship that's been missing for more than 40 years , since WWII, it is packed with good actors and slick direction . The film concerns about a passenger luxury liner is crashed by a strange freighter . The castaways enter into the rare German ship and after encounter themselves trapped and they figure out that things are not as they should. A frightening vessel lost from the 40s at a remote region nowadays is floating drift.The mysterious Nazi vessel is lost at sea for more than 50 years.But one time aboard the cavernous, eerie ship, the group encounter that the decaying Oceaner freighter is anything but deserted. Boarding the ship results to be a big mistake since the tragedy that overtook the lives of crew and captain lingers and starts to affect the present passengers. When a series of bizarre occurrences happen and the crew becomes caught in a web of ghastly deeds ,they soon learn is inhabited by haunting previous crew. The picture contains scary suspense, thrills, terror,tension, chills and is quite entertaining. Deserted ship is portrayed as a complete riddle with weird events,screams and grisly horrifying happenings. The movie paid attention to building up a terrifying atmosphere instead of violent and stabbing killing spree.The action takes completely place into a rusty ship wreck .The argument isn't original but it's being gradually revealed with nutty enchantment , such as ¨The shinning(Kubrick)¨ style and it attracts viewer's attention. The picture is starred by fine actors, doing some correct performances, as Richard Crenna, George Kennedy, Sally Ann Howes and nice secondary role for Saul Rubinek .If you're enthusiastic of the mystery tales and B films, so you'll encounter this picture to be agreeable. If your interest lies on a more cerebral terror movie,then I highly recommend you skip this one.This eerie movie is rightly directed by Alvin Rakoff during the 8os, he is a craftsman Canadian director as cinema as television . The film is recommended for all horror lovers which will find many nice eerie shots though not very logical but still their appetite for gruesome scenes will be satisfied. Other adaptation about 'ghost ships' are the following : For television titled ¨The triangle(2001)¨by Lewis Teague with Luke Perry, Dan Cortese , Olivia Dábo and Polly Shannon, the high budgeted by Joel Silver titled ¨ The Ghost ship (2002) ¨ by Steven Beck with Julianne Margules, Ron Eldard and Gabriel Byrne and for Sci-Fi channel titled ¨The ghost voyage¨ with Antonio Sabato and Gary-Hiroyaki Tagawa.",
         "When I was a little kid, driving by this local videostore on my bike, I always stopped to take a quick peek at this amazingly cool video-cover displayed in front of the store window (just look up the poster art here on IMDb). Around that same time I saw on television just a few little fragments of a French-dubbed horror movie taking place on a ship. The name George Kennedy both on the cover and on the credits linked the two facts together. By the time I was old enough to go rent it, the copy had mysteriously disappeared from the videostore. I've been on the look-out for this film ever since. Thanx to Dario_the_2nd (fellow horror-boarder) the wait finally came to an end. And to say it right away: I honestly don't understand the low rating this film has here on IMDb. Sure it's not a perfect movie; the story is pretty thin and the acting isn't really memorable or something (though not bad at all either). What this movie lacks in the plot-department, at makes up more than enough in eerie atmosphere and creepiness. When a luxury cruise ship sinks, a few survivors adrift find their way onto a huge, dirty and abandoned ship, apparently floating dead in the water. But not quite as dead as they expected, they'll soon find out. The pace of the movie is rather slow, but the ship itself is frightening and menacing. With numerous shots of its self-functioning engine, countless pipes, valves and other iron-work, the vessel establishes itself as a threatening presence, or even more so: a real character, throughout the entire movie. It's no secret at all that this ship is haunted and the reason why is quite shocking. Two scenes that stayed with me from when I was a kid, were that-one-lady-in-the-projection-room-turning-ugly and especially the blood-shower scene. The latter one really is a foul scene. Of course, you've seen that before, but this is one of the better efforts. However, this still remains a very un-stylized B-movie. No fancy cinematography, no well-balanced lighting and a lot of hand-held camera shots. But all this adds to the effect of realism. And at not one point I found myself giggling at the sort of clumsiness of the mise-en-scène (which I actually expected to do so, before going into this movie). As much as the editing is rudimentary, their are some fine textbook examples of cross-cutting to be found. A technique seldomly used anymore. At least not in mainstream films. The rather minimalistic but effective musical score helped to set the right tone from the opening credits on. I could conclude that this flick might perhaps not be enjoyed by the general horror-fan nowadays, but if you're interested in the weird and bizarre, then this one is worth hunting down. Good luck with it.",
         "This film, \"Death Ship\", while it was a made for TV movie, is actually pretty scary. Considering it has been awhile since I saw it last (then I recently rented it). George Kennedy is the main character, and is rather creepy in this movie. It is definitely worth viewing. The set of an abandoned Nazi ship conjures up the torture chambers and murder which occurred there. There are also some strange sound effects, the voices he hears remind one of what the gas chambers must have sounded like. The ship itself is a nightmare, and the acting is plausible. If you have seen the recent \"Ghost Ship\", with Gabriel Byrne and Ron Eldard, rent this film, It is a lot more frightening with a better story to it. 7/10.",
         "DEATH SHIP turned out to be my Halloween 2004 movie without even intending to have it be the feature of the night. One of the most notorious \"bombs\" of the 1980's, DEATH SHIP actually turned out to be one of the most interesting movies I've seen in a while for a couple of reasons. George Kennedy stars as the captain of an excursion liner who is facing retirement with less than a dignified attitude, who's boat is rammed by an old Nazi freighter that apparently acted as a sort of floating death camp, complete with a medical atrocities ward. For reasons never clearly explained the ship has become \"haunted\" or possessed by the Nazis who manned it [who's demise is also never explained] and continues roaming the seven seas looking for souls to torment by ramming pleasure yachts and lurking around until the survivors scrabble on board for refuge. We do indeed get a new batch of survivors to be tormented, and the bulk of the film has this apparently none too bright handful of humanity slowly figuring out that the DEATH SHIP is not just some old boat floating around, but not until after an old lady is mutated by some sort of leftover germ warfare experiment, Kennedy is possessed by the DEATH SHIP and goes insane, one guy gets thrown down into the flooded hold and onto a pile of rotted human remains [the film's finest \"ewww\" moment], and the hot panted chick decides it would be a good idea to TAKE A SHOWER on the DEATH SHIP, to disgustingly amusing results. To a certain extent this is a masterpiece of trash 1980's horror and another one of those \"you can't make 'em like this anymore\" movies you sort of watch with a quiet awe, wondering to what depths it will sink next to elicit a howl or two. To be sure it is a somewhat uneventful movie, with not really much happening once you get down to it, and only two or three graphic deaths depicted on screen. The meat of the film lies in the territory of previous \"Ghost Ship\" type films [there is a great deal of resemblance to Amando deOssorio's GHOST SHIP OF THE BLIND DEAD especially], with endless panning shots of the rusted hulk, dimly lit interiors and surprisingly well maintained engine room -- coupled with appropriately gloomy mood music -- that convey without a doubt to audiences that something is creeping in the dark, though we never see any zomboid Nazis. And on that note this film has a curiously indefinable moral position: The movie goes out of it's way to show us the dusty echoes of Nazi horrors, but beyond showing them to us never has anything to say about them or the people who committed and suffered these atrocities. I liked how the film has the boat dunk oil onto the white uniforms of Kennedy and two of his officers as they clamber on board, giving their clothes a sickening gray hue that said to me \"It just turned them into Nazi sailors.\" We also get a somewhat disturbing shot of Kennedy all mucked up with his hair slicked across his forehead Hitler-style, but what does that really have to say about who his character is? Is he an escaped war criminal? We are shown movie reels of Nazi rallies and concentration camps that supposedly drive one character to throw himself off a high ledge, but what of it? The answer is that this may have been one of the last of the great Nazi Exploitation Films, with the distinction being that it was a predominantly American production. By not necessarily staking a moralistic claim on what it shows us, the film exists as a sort of quasi mood piece, instowing revulsion, dread, and above all curiosity in the viewer as they try to make sense of what they are seeing & hearing, which is what those Nazi horror flicks like ACHTUNG! THE DESERT TIGERS and THE BEAST IN THE HEAT were all about. Here we get a supernatural angle where the Nazis are all gone, with only the legacy of horror left to bear witness upon how evil they were -- The pain and anguish they created still haunt the DEATH SHIP, but who or what is behind the DEATH SHIP's actions, and how are we supposed to feel about it? By not providing an answer the film succeeds where it's ultra-lowbrow production values may not. I like how the victims of the DEATH SHIP's horrors all describe what is happening verbally while it takes place in case the disjointed editing intended to keep the budget down leaves anyone behind. I appreciated the unpredictability of the script, and also liked how the movie ends, with the DEATH SHIP apparently just continuing on it's miserable way to the next victim, and making this just a snapshot in a couple of days from the life of a never ending nightmare now happening to whomever gets in it's way. Definitely worth seeking out, though the film is out of print and not likely to be revived anytime soon. I give it ** out of **** for being so utterly unpredictable and single-minded; A howler to be sure, if you're in the right frame of mind."
      ],
      "genres": [
         "Adventure",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Astral Bellevue Pathé",
         "Bloodstar Productions",
         "Lamitas"
      ],
      "summaries": [
         "Survivors of a tragic shipping collision are rescued by a mysterious black ship which appears out of the fog. Little do they realise that the ship is actually a Nazi torture ship which has sailed the seas for years, luring unsuspecting sailors aboard and killing them off one by one.",
         "Dopo un rovinoso naufragio, un gruppo di disperati trova rifugio su di una nave abbandonata. Il mistero avvolge l'imbarcazione, deserta ed angosciante. Purtroppo, la fortuna non assiste i malcapitati, che trovano la morte uno ad uno, drammaticamente."
      ],
      "budget": 4500000
   },
   "movielensId": 4839,
   "movielens": {
      "languages": [
         "Deutsch",
         "English"
      ],
      "releaseDate": "1980-03-07",
      "dvdReleaseDate": null,
      "directors": ["Alvin Rakoff"],
      "runtime": 91,
      "movieId": 4839,
      "title": "Death Ship",
      "mpaa": "R",
      "actors": [
         "George Kennedy",
         "Richard Crenna",
         "Nick Mancuso",
         "Sally Ann Howes",
         "Kate Reid",
         "Victoria Burgoyne",
         "Jennifer McKinney",
         "Danny Higham",
         "Saul Rubinek",
         "Murray Cruchley",
         "Doug Smith",
         "Anthony Sherwood"
      ],
      "imdbMovieId": "0080603",
      "originalTitle": "Death Ship",
      "genres": [
         "Adventure",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["5jpJjTRcko8"],
      "plotSummary": "Survivors of a tragic shipping collision are rescued by a mysterious black ship which appears out of the fog. Little do they realise that the ship is actually a Nazi torture ship which has sailed the seas for years, luring unsuspecting sailors aboard and killing them off one by one.",
      "tmdbMovieId": 31703,
      "avgRating": 2,
      "releaseYear": "1980",
      "numRatings": 77,
      "posterPath": "/oQzIrYU7G7SfPPC1439IIY5ld3t.jpg"
   }
}