{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "alcohol",
            "id": 567
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "infidelity",
            "id": 1326
         },
         {
            "name": "nightclub",
            "id": 2334
         },
         {
            "name": "cinematographer",
            "id": 4606
         },
         {
            "name": "satire",
            "id": 8201
         },
         {
            "name": "liar",
            "id": 9468
         },
         {
            "name": "sociopath",
            "id": 9740
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "theft",
            "id": 14604
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "audition",
            "id": 33928
         },
         {
            "name": "narcissism",
            "id": 157291
         },
         {
            "name": "neurotic",
            "id": 175357
         },
         {
            "name": "actress",
            "id": 207583
         }
      ],
      "imdb_id": "tt0436262",
      "video": false,
      "title": "Ellie Parker",
      "recommendations": [
         14167,
         45174,
         154219,
         76661,
         90324,
         61487,
         23990,
         40002,
         24078,
         20478,
         46280,
         244009,
         82432,
         42383,
         293743,
         48862,
         41185,
         15402
      ],
      "backdrop_path": "/q00TpACZFvKwP1pMf2tREDnnyUV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ellie Parker",
               "gender": 1,
               "credit_id": "52fe46da9251416c75085a33",
               "name": "Naomi Watts",
               "profile_path": "/8W02WOJI1pEGh2iqQsgITR5tV0P.jpg",
               "id": 3489,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Chris",
               "gender": 2,
               "credit_id": "52fe46da9251416c75085a49",
               "name": "Scott Coffey",
               "profile_path": "/kRA20iJ4hBeHSUlYduRTXEhQyku.jpg",
               "id": 9306,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Casting Chick",
               "gender": 0,
               "credit_id": "52fe46da9251416c75085a4d",
               "name": "Jennifer Syme",
               "profile_path": "/mw6mY2jakgzO6obZIwk7bBWL6mo.jpg",
               "id": 9308,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Justin",
               "gender": 2,
               "credit_id": "52fe46da9251416c75085a51",
               "name": "Mark Pellegrino",
               "profile_path": "/meXeaopncCQEw7saya4z0MhkUK2.jpg",
               "id": 1236,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Rick Saul",
               "gender": 0,
               "credit_id": "52fe46da9251416c75085a55",
               "name": "Greg Freitas",
               "profile_path": null,
               "id": 113858,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Leslie Towne",
               "gender": 0,
               "credit_id": "52fe46da9251416c75085a59",
               "name": "Gaye Pope",
               "profile_path": null,
               "id": 9396,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Smash Jackson",
               "gender": 0,
               "credit_id": "52fe46da9251416c75085a5d",
               "name": "Blair Mastbaum",
               "profile_path": null,
               "id": 113859,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Sam",
               "gender": 0,
               "credit_id": "52fe46da9251416c75085a61",
               "name": "Rebecca Rigg",
               "profile_path": "/ash2ZyHj7BX5mVad47PfwCbZ0xI.jpg",
               "id": 80278,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Dennis Swartzbaum",
               "gender": 2,
               "credit_id": "58c33263c3a36837e7000a0f",
               "name": "Chevy Chase",
               "profile_path": "/svjpyYtPwtjvRxX9IZnOmOkhDOt.jpg",
               "id": 54812,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46da9251416c75085a39",
               "name": "Scott Coffey",
               "profile_path": "/kRA20iJ4hBeHSUlYduRTXEhQyku.jpg",
               "id": 9306,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46da9251416c75085a3f",
               "name": "Scott Coffey",
               "profile_path": "/kRA20iJ4hBeHSUlYduRTXEhQyku.jpg",
               "id": 9306,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46da9251416c75085a45",
               "name": "Scott Coffey",
               "profile_path": "/kRA20iJ4hBeHSUlYduRTXEhQyku.jpg",
               "id": 9306,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.404012,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16548,
      "vote_count": 24,
      "budget": 0,
      "overview": "Ellie Parker, an aspiring actress from Australia, lives a hectic Hollywood lifestyle, perpetually trying to land the role that will elevate her career. Living with her lothario musician boyfriend, Justin, Ellie is far from happy, finding support primarily from her friend Sam. But when Ellie meets Chris after a minor traffic accident, she sees new potential for both romance and her life in general.",
      "similar": [
         627,
         2149,
         157851,
         16980,
         86838,
         12271,
         10090,
         4995,
         813,
         8363,
         634,
         979,
         4247,
         9352,
         193893,
         80752,
         28468,
         106646,
         109414,
         122081
      ],
      "original_title": "Ellie Parker",
      "runtime": 95,
      "poster_path": "/92buxvsbRxAVz1TjqsfSqZC8iN2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Strand Releasing",
         "id": 3923,
         "origin_country": ""
      }],
      "release_date": "2005-01-21",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "The talent is real. And so are the tears... Sometimes.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Scott Coffey"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Scott Coffey"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0436262/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE1Nzc5NDAwNV5BMl5BanBnXkFtZTcwMTg4MTkzMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Naomi Watts, Jennifer Syme, Greg Freitas | See full cast and crew »"],
      "reviews": [
         "\"Ellie Parker\" is the sort of movie that you wish you could have made in college. It's funny, somewhat different, and has a beautiful leading lady, that of which goes by the name of Naomi Watts in this case. It also has an incredibly low budget. As a matter of fact, it looks as though it could have been a college student's project. An hour and a half showcasing Naomi Watt's fantastic amount of talent as Ellie Parker: A struggling actress jumping from audition to audition with the hope of landing a part in anything she can get. Her loser boyfriend is no help, neither is her agent, and as the days go by, she loses more and more hope. Whether she's cruising down Sunset Strip to her next audition, or yelling into her cellular flying down the 101, there is a part of us throughout the entire movie that wants to know what is going to happen to Ellie next. She's lovable. She's talented. She's been through more than we (the audience) can begin to understand. But most importantly, she's determined. If you adore Watts as much as this reviewer does and you want to see her in something realistic (as close as it gets), check out \"Ellie Parker\". You won't get to see her like this in \"King Kong.\" That's for sure.",
         "If you are a fan of Naomi Watts, as I have been since seeing her for the first time in Mulholland Drive, you will not want to miss Ellie Parker - a veritable tour de force for the actor, who gives us not a caricature but rather a sympathetic, flesh-and-blood, 3-dimensional human being whose plight pertains not only to the acting world but to anybody who has ever felt rejected, misunderstood and/or unappreciated by the world at large. This makes its audience much wider than merely the 'Hollywood community' without ever becoming preachy about it, which I especially liked. Some of the scenes feel completely improvised, which I also enjoyed, and her audition scene near the beginning is more than worth the price of admission alone.",
         "I saw this at Sundance and I certainly didn't see anyone walking out during that screening. Sundance movie goers are notoriously supportive of films at the festival and I have a hard time believing there were people walking out. I thought Scott Coffee wrote a very original and true to life story of Hollywood. There have been many movies about Hollywood life but this one is real and true to the bone. Every actor who sees this will see themselves in this and say \"Why didn't I write this?\". The answer is, Scott thought of it and we didn't. Way to go Scott. Naomi Watts is wonderful as always. Many layers to this. Maybe people outside Hollywood wont get this movie. Their loss.",
         "I've always suspected that some movies make Sundance mainly because a famous Hollywood personality is involved. If said star chooses to make a low-budget non-commercial film, it warrants a free pass to the big dance based on risk-taking and \"independent spirit.\" So it is with Ellie Parker, a movie produced by and starring Naomi Watts (and directed by actor Scott Coffey) about the travails of a young actress searching for her identity in L.A.'s shallow and artificial cultural wasteland. It is clear that it was made for industry insiders, who saw in it a painful mirror to their world. The rest of us enjoyed a few funny moments in a movie that had no apparent beginning, middle or end, no discernible plot, plenty of conflict but no resolution. I'm sure there was a point in all that depressing futility. To make it worse, it was shot on a Sony HD cam, so the quality was maybe a tad better than my home movies. Ellie Parker would be useful if one were trying to thin the herd of aspiring actresses. Maybe they should show it in high schools, kind of like Reefer Madness 50 years ago. By the way, Chevy Chase has a small and rather cryptic role as an agent. (The audience wasn't sure if he was trying to be serious or comedic.) I love Chevy Chase, but unlike his old SNL partner Dan Akroyd, he should stick to comedies. He gives a really dreadful performance. But he was refreshingly funny at the Sundance Q&A.",
         "I'd looked forward to this one, as most attempts at satirizing Hollywood life in the last two decades, both from studios and indies, have ranged from mediocre to unmitigated disasters. This one offered Naomi Watts in a starring role, and I've adored her since \"Mulholland Drive\", both as a terrific, versatile actress and as an unqualified beauty (they all seem to come from Australia and the U.K. these days, don't they?). Well, Ms. Watts does shine in the title role, and she's in every scene, but somehow the film still falls flat. I'm not a big fan of film-making on digital video -- it always comes across to me like I'm watching someone's home movies, an experience I should be paid for, not that I should have to pay for -- but I understand why it's done in certain cases. In this case, it was a mistake. Writer-director Coffey appears to be going for verite-style realism (I'm assuming he's not so arrogant as to place himself in the uber-pretentious Dogme 95 school), but he doesn't seem to realize that in order for any film to work, the result shouldn't come across as a home movie or, in this case, a student film. Too much time is spent on Ellie in her car, doing all the things that Angelenos do in their cars because they're just too busy to do them elsewhere (applying makeup, changing clothes, practicing their lines, and the universal asshole-identifier, talking on their cellphones) and too self-absorbed to care how it affects their driving or those around them. This works as satire for one scene -- the next four times it occurs it feels just like being stuck in a car behind one of these narcissists, and it's not an enjoyable feeling. There's a related scene about halfway through that's amusingly ironic, but not worth the endurance test. Just as with the interior car shots, much of the satire is overripe, pushing the irritation factor of nearly every character to its limits, testing the thresholds of both humorous exaggeration and simple tolerance. No satire should leave you wanting to burn the characters and their milieu to the ground (apart from \"Day of the Locust\", in which Hollywood does in fact burn, deservedly, but in context). (As an aside, and for a chuckle, this may be the first time Keanu Reeves isn't the most annoying element of a movie he's in. But then, he appears only as a member of his band Dogstar, playing in a club, and he has no lines.) The other key problem is often endemic to film satire: it moves at a snail's pace. Unless you're the rare individual who's both an struggling thespian in Hollywood AND a caring, thoughtful individual, you will probably find yourself yawning a lot more frequently than laughing during this 95 minutes. For all its drawbacks, though, this is a showcase for Naomi Watts to show how versatile she is, with the verisimilitude of her having to switch between characters, accents, moods, etc. The overall comment, that she doesn't really seem to be herself very often and has no idea who that self really is within the realm of all her \"performing,\" is funny and worth exploring, but Coffey (or someone else) needs a vehicle that's more engaging, clearer about its objectives, and at least somewhat watchable.",
         "Scott Coffey's Life of A Lower-Rung Hollywood Nitwit, Ellie Parker, is interesting only as a showcase for the shape-shifter charms of Naomi Watts, a performing chameleon with an endless repertoire of faces (sultry, girlish, devious, ravishing, vacant). The film might actually be more worthwhile, and would certainly be more bearable, with the sound off, sparing us the interminable feather-headed nattering of its deliberately shallow, narcissistic characters, and allowing us to concentrate more fully on the thespic acrobatics of Watts, who, through the character of struggling, stubborn, wayward Ellie Parker, is afforded a chance to show off her near-freakish ability at sudden metamorphosis, going from harried phone-talking California twit to foul-mouthed gum-chomping Jersey girl and back, working the shift, the brakes like a race-car driver navigating the twists and turns of Watkins Glen. It's a show-off performance but Watts is not a show-off, she occupies the character of Ellie Parker fully, never tipping her hand. Her commitment to the role is commendable, her willingness to place herself in absurd situations, to unmask herself a little (some of Ellie's struggles are no doubt culled from Watts' own biography), but it's all in service of material that's not worthy of her, that cheapens her accomplishment, diminishes her. It's a thin gruel of a movie, lacking in insight, full of scenes that don't go anywhere, shot like a film student making an audition reel.",
         "As someone that spent 18 years in the city of Angels, I have met many Ellie Parkers. I adored this little gem, albeit low budget movie, with some of best acting one could feast their eyes on. The scene with Ellie in the car in a complete hyped up, Star Bucks frenzy, smeared with lipstick, banging her head to Blondie and madly shouting out \" I wanna suck Vinnie's ####'!!!\" in her New Jersey accent, had me rolling on the floor. For those that know nothing of the dashed dreams of Many desperate Hollywood starlets, and the pure sleaze these women encounter as they try to fulfill their dreams, forget it, you just won't 'get it'. LA is a town, of big talking wannabes and 'Ellie Parker' really led you into that world with it's fake facade and empty promises. Naomi Watts just shines as Ellie Parker. She totally engulfs the screen with her magical expressions of pain, joy, angst, fear, confusion and loneliness. I felt very empty after the final scene, just as Ellie did. The City of Angels changes you, makes you selfish, egotistical, and almost insane. Ellie knew her pursuit of acting had caused her to become a shell of a person, and as a viewer I really felt her pain. So it was shot with a cheap camera, big deal. The messages where there, contrary to what many other reviewers said, you just had to be sensitive enough to pick them up. This film really transported me back to LA, and made me shudder, thanks 'Eliie parker' for reminding me why I left!",
         "\"Ellie Parker\" feels like an extended episode of \"Unscripted\" through the funny lens of Albert Brooks. It does show the strains of being expanded from a short, for bits that feel like a \"Saturday Night Live\" routine, and for typical targets for actors -- acting class, slacker boyfriends, friends competing for the same lousy roles in cheesy WB and Fox TV pilots, pretentious indie directors (and I assume it was intentional that the guy looked like Jim Jarmusch), scheming casting agents, and phony producers. But it still manages to very amusingly have some original takes on Hollywood. The funniest angle is that no one does know who they are any more, whether from class, day jobs, rapid-fire auditions, therapy, one-night stands of flexible sexuality and recreational self-medication drugs, so that they always feel like they are acting in the movie of their lives. And everyone seems to want to be someone else anyway, such as a night out to see Keanu Reeves wannabe rock star in his band Dogstar. Key to the success of the movie is the amazingly versatile chameleon Naomi Watts. While I presume the short started in 2001 before her break-out in \"Mulholland Drive\" as a bit of envy revenge when her good friend Nicole Kidman was already getting big roles, it now seems like nostalgia because she's so beautiful here it's hard to think of her being dumped or cheated on and so talented as she morphs from tragic Southern belle to channeling Debbie Harry as a New York doll to looking astoundingly like the naive young Hayley Mills and a self-referential take on Marilyn Monroe that it's hard to believe Leslie Bibb would get a role over her. She has terrific best friend chemistry with fellow Aussie Rebecca Rigg (who I did not recognize at all from \"Farscape\"), making me realize how few films showcase Watts with female bonding relationships. While the in-Hollywood jokes get a bit much and the basic arc is predictable, there are a lot of chuckles. Chevy Chase is very funny in a grown-up cameo as her agent. I know this may come as a shock to actors, but job hunting is just as merciless in other fields so we civilians can relate to Ellie Parker's travails. It is very sweet that the closing credits include director/actor Scott Coffey's tribute to the strong women who inspired him, particularly his mother.",
         "The hunt for a good job can be tiring, time consuming, and occasionally degrading, which is why Ellie Parker, an actress who wants to make it big in Tinseltown, is a beacon who reflects the hopes and dreams of every person who has the needs to Do Something. When we first see her, she is bright, hopeful, aggressive, albeit a little desperate in her attempts to nab that role, going from audition to audition to audition and nary a successful call-back in sight. Her life seems to be hovering on top of a tightrope where the only way is ahead even when the stakes get higher and her predicaments get worse at every turn. That is, until one after another, things come unraveled: therapy seems to be leading her no place fast, acting class brings her down, her boyfriend cheats on her with her own casting agent, she loses a part to a younger actress who has a Name instead of a name, and she crashes into a cinematographer who after they finally sleep together decides to give her an unwelcome, demoralizing surprise. Her decision to leave the industry comes not as a shock but as a predictability that is numbing because once a person's spirit has been broken, it's a sign that maybe this is not what they should be doing even though they may have the talent to do so. That is, considering she really wants to leave the industry. The use of digital media gives ELLIE PARKER a documentary-like feel -- Naomi Watts's performance is too real to be acting, and her Ellie is a woman caught under a grey cloud of bad luck who comes across as fiercely talented, at times mannered, but eager to please to get a part. As a woman she has enormous competition from other women and the one scene where she loses a part to a Name starlet is a harsh punch to the gut. Even more so, when her friend Sam (Rebecca Rigg) gets her own job on a cop show and tells her, on top of that, if it wouldn't kill her to take the trash out as she preens and poses in a policewoman's outfit. It's a devastating blow, and Scott Coffey's camera is unflinching in capturing Ellie's agony. It's a small film, produced by Watts herself and made by friends Pellegrino and Coffey, meant to be seen by an audience who doesn't want to see a grand film filled with practiced performances. There is an ad-lib quality to the movie, down to small scenes where Ellie and her boyfriend (Mark Pellegrino) make love in the bathtub -- it seems real, with no slow takes trying to heighten the moment. Occasionally it lapses into self-conscious cleverness, as when Ellie eats on an ice cream cone only to vomit it out, or when she has that last hopeful audition to \"producers\" who are stoned out of their minds, but I can see the point -- authenticity. It's probably a tad too long to allow its 90 minute time-frame, and would have worked better as a 60 - 75 minute film, but that is okay: it's still a stark movie that opts to draw a portrait of a failed career and a woman facing this hard reality.",
         "It is not often that I finish a movie with a strong feeling like this one. In this society, so full of images, that we aspire to, a movie like this is sanity. I wish it was more viewable : I am no big fan of shaking camera, I realize. But other than that, Naomi Watts nails it, really. She nails to show us the sordide journey of another-girl-who-wanna-be-famous. And that's thanks to a very realistic scenario. I loooooooooooooove any movie who rips the illusion of acting especially in the multimillions industry. However, what is paradoxical is that Naomi Watts is NOT another-girl-who-wanna-be-famous. She's one who succeeded at it! I wonder what was her motives to play the life of the real LA wannabees, who really cry in despair alone in their little apartment waiting for someone to call them to finally do their job! I invite those who loved this movie to see Somewhere by Coppola."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [],
      "summaries": [
         "Slice of life look at a young woman trying to make it as an actress in Hollywood. Ellie Parker, from Australia, works hard: she's gifted with accents, hustles to auditions, changes clothes and makeup as she drives across L.A., goes to acting classes and therapy, maintains a friendship with another Aussie searching for the same roles, meets a cinematographer when he bangs into her car at a stop sign, and faces a failing relationship with her slacker thinks-he's-a-musician boyfriend. All this brings on an identity crisis - who am I, and should I keep trying to be an actress? Ellie's balancing act and her inquiry into self carry the story.",
         "A hilarious comic portrait of a young woman's struggle for integrity, happiness and a Hollywood acting career."
      ],
      "budget": 0
   },
   "movielensId": 48584,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-01-21",
      "dvdReleaseDate": "2006-04-11",
      "directors": ["Scott Coffey"],
      "runtime": 95,
      "movieId": 48584,
      "title": "Ellie Parker",
      "mpaa": "R",
      "actors": [
         "Naomi Watts",
         "Scott Coffey",
         "Jennifer Syme",
         "Mark Pellegrino",
         "Greg Freitas",
         "Gaye Pope",
         "Blair Mastbaum",
         "Rebecca Rigg",
         "Chevy Chase"
      ],
      "imdbMovieId": "0436262",
      "originalTitle": "Ellie Parker",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["d57fNnvjGPI"],
      "plotSummary": "An aspiring actress from Australia, Ellie Parker (Naomi Watts), lives a hectic Hollywood lifestyle, perpetually trying to land the role that will elevate her career. Living with her lothario musician boyfriend, Justin (Mark Pelligrino), Ellie is far from happy, finding support primarily from her friend Sam (Rebecca Rigg). When Ellie meets Chris (Scott Coffey) after a minor traffic accident, she sees new potential for both romance and her life in general.",
      "tmdbMovieId": 16548,
      "avgRating": 2.92222,
      "releaseYear": "2005",
      "numRatings": 45,
      "posterPath": "/92buxvsbRxAVz1TjqsfSqZC8iN2.jpg"
   }
}