{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "procession",
            "id": 2310
         },
         {
            "name": "psychoanalysis",
            "id": 2833
         },
         {
            "name": "research",
            "id": 3664
         },
         {
            "name": "mad scientist",
            "id": 10125
         },
         {
            "name": "animation",
            "id": 10336
         },
         {
            "name": "dream girl",
            "id": 11223
         },
         {
            "name": "parallel world",
            "id": 33465
         },
         {
            "name": "dream world",
            "id": 186789
         },
         {
            "name": "anime",
            "id": 210024
         }
      ],
      "imdb_id": "tt0851578",
      "video": false,
      "title": "Paprika",
      "recommendations": [
         10494,
         33320,
         13398,
         149,
         14069,
         9323,
         28874,
         13754,
         12140,
         11621,
         81,
         38142,
         12477,
         4689,
         37797,
         10515,
         42994,
         12429,
         128,
         15916
      ],
      "backdrop_path": "/5hWaV1JrT0GLA8Yfnh8DYwQC72X.jpg",
      "revenue": 944915,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Paprika / Atsuko",
               "gender": 1,
               "credit_id": "52fe43eac3a36847f8078103",
               "name": "Megumi Hayashibara",
               "profile_path": "/aYeXdOAsEh2xItISYDefJfvcdA.jpg",
               "id": 40325,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Tokita Kohsaku",
               "gender": 0,
               "credit_id": "52fe43eac3a36847f8078107",
               "name": "Tōru Furuya",
               "profile_path": "/9fuENGDDd6C30IudobBV8uh2XaK.jpg",
               "id": 40327,
               "order": 1
            },
            {
               "cast_id": 30,
               "character": "Osanai Morio",
               "gender": 2,
               "credit_id": "55df5852c3a36813c2000060",
               "name": "Kouichi Yamadera",
               "profile_path": "/m5su8OKD2rZn9XWJfh8aPC403Nz.jpg",
               "id": 20664,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Shima Tora-taroh",
               "gender": 0,
               "credit_id": "52fe43eac3a36847f807810f",
               "name": "Katsunosuke Hori",
               "profile_path": "/e6B1DN8CVSZuAJoHTKbpeOxuiKD.jpg",
               "id": 40329,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Inui Sei-jiroh",
               "gender": 2,
               "credit_id": "52fe43eac3a36847f8078113",
               "name": "Toru Emori",
               "profile_path": null,
               "id": 40330,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Himuro Kei",
               "gender": 0,
               "credit_id": "52fe43eac3a36847f8078117",
               "name": "Daisuke Sakaguchi",
               "profile_path": "/bvx8D4L8ng5ti6Cy03OP5kqjqlH.jpg",
               "id": 40331,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Tsumura Yasushi",
               "gender": 0,
               "credit_id": "52fe43eac3a36847f807811b",
               "name": "Mitsuo Iwata",
               "profile_path": "/uiCp6G7TR3kHtxQQNNLiVEiXadU.jpg",
               "id": 1678,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Kakimoto Nobue",
               "gender": 0,
               "credit_id": "52fe43eac3a36847f807811f",
               "name": "Rikako Aikawa",
               "profile_path": "/hIsefysCPsBTg7og5GbywpeMmqW.jpg",
               "id": 40332,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Jin-nai",
               "gender": 2,
               "credit_id": "52fe43eac3a36847f8078123",
               "name": "Satoshi Kon",
               "profile_path": "/ivdAAPkwZLTIjaJgSw7VNeHCAmt.jpg",
               "id": 40333,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Kuga",
               "gender": 0,
               "credit_id": "52fe43eac3a36847f8078127",
               "name": "Yasutaka Tsutsui",
               "profile_path": null,
               "id": 40334,
               "order": 10
            },
            {
               "cast_id": 29,
               "character": "Kogawa Toshimi",
               "gender": 2,
               "credit_id": "52fe43eac3a36847f807817f",
               "name": "Akio Ohtsuka",
               "profile_path": "/33uwf6AtjtqckGH6kUfr8GGDqJu.jpg",
               "id": 40451,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43eac3a36847f807812d",
               "name": "Seishi Minakami",
               "profile_path": null,
               "id": 40335,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eac3a36847f8078133",
               "name": "Satoshi Kon",
               "profile_path": "/ivdAAPkwZLTIjaJgSw7VNeHCAmt.jpg",
               "id": 40333,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43eac3a36847f8078139",
               "name": "Masashi Ando",
               "profile_path": null,
               "id": 40336,
               "department": "Visual Effects",
               "job": "Animation Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43eac3a36847f807813f",
               "name": "Nobutaka Ike",
               "profile_path": null,
               "id": 40337,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe43eac3a36847f8078145",
               "name": "Michiya Katou",
               "profile_path": null,
               "id": 40338,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43eac3a36847f807814b",
               "name": "Masafumi Mima",
               "profile_path": null,
               "id": 40340,
               "department": "Sound",
               "job": "Sound Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eac3a36847f8078151",
               "name": "Takeshi Seyama",
               "profile_path": null,
               "id": 1697,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43eac3a36847f8078157",
               "name": "Satoki Toyota",
               "profile_path": null,
               "id": 40341,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43eac3a36847f807815d",
               "name": "Jungo Maruta",
               "profile_path": null,
               "id": 40342,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43eac3a36847f8078163",
               "name": "Masao Takiyama",
               "profile_path": null,
               "id": 40343,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eac3a36847f807816f",
               "name": "Satoshi Kon",
               "profile_path": "/ivdAAPkwZLTIjaJgSw7VNeHCAmt.jpg",
               "id": 40333,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43eac3a36847f8078175",
               "name": "Yasutaka Tsutsui",
               "profile_path": null,
               "id": 40334,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "57fff826c3a3681fba00061b",
               "name": "Satoshi Hashimoto",
               "profile_path": null,
               "id": 40344,
               "department": "Visual Effects",
               "job": "Color Designer"
            },
            {
               "gender": 0,
               "credit_id": "59e793949251416010000a7b",
               "name": "Susumu Hirasawa",
               "profile_path": null,
               "id": 40339,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.979327,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 4977,
      "vote_count": 559,
      "budget": 0,
      "overview": "When a machine that allows therapists to enter their patient's dreams is stolen, all hell breaks loose. Only a young female therapist can stop it: Paprika.",
      "similar": [
         10494,
         150540,
         351460,
         14836,
         8392,
         12092,
         129,
         51739,
         11360,
         378064,
         81,
         14003,
         110420,
         13754,
         8852,
         39108,
         9081,
         428288,
         28609,
         113082
      ],
      "original_title": "パプリカ",
      "runtime": 90,
      "poster_path": "/dJI2FSs3qfEPW82cWYfIaV8cVmN.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/voYCwlBHJQANtjvm5MNIkCF1dDH.png",
            "name": "Sony Pictures Classics",
            "id": 58,
            "origin_country": "US"
         },
         {
            "logo_path": "/72thYMKJUagID5KUi4QuXZBFwE2.png",
            "name": "Madhouse",
            "id": 4288,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Paprika Film Partners",
            "id": 12050,
            "origin_country": ""
         }
      ],
      "release_date": "2006-10-01",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "This is your brain on anime",
      "adult": false,
      "homepage": "http://www.sonyclassics.com/paprika/",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Satoshi Kon"],
      "runtime": 90,
      "synopsis": "In this Japanese anime epic, humanity's last bastion of privacy has finally been infiltrated by technology, the world of our dreams. The story centers on a new invention called the DC-Mini. With this revolutionary device, psychiatrists are now able to enter a patient's dreams in a therapeutic setting. But when an unknown assailant steals all of the devices, using them to enter peoples minds enacting mind control, chaos ensues as dreams begin to bleed into reality, and the thin line between the conscious and the unconscious begins to blur. Enter a young female researcher named Chiba, who takes it upon herself to delve into the newly anarchic dream world in order to set things straight. In this surreal realm her name is Paprika, and she's out to save the world. Bursting with fantastic imagery and breathtakingly innovative animation.",
      "writers": [
         "Yasutaka Tsutsui",
         "Seishi Minakami"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0851578/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzNzc1MTQzOV5BMl5BanBnXkFtZTcwMzU1NDQ0MQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Megumi Hayashibara, Tôru Emori, Katsunosuke Hori | See full cast and crew »"],
      "reviews": [
         "Paprika isn't for the faint-hearted. Don't expect a story for children. The story opens with a cop who's plagued by a recurring nightmare, so he seeks psychological help. If you've ever seen and enjoyed Alfred Hitchcock's Spellbound, it'll help you understanding what's going on in the film. The cop forms a relationship with Paprika, a dream character who becomes his guide in helping him understand what happened in his past that makes him feel such shame in the present. Paprika assumes many forms in the everchanging dreamscape to relate to the other characters. This seems all good at the beginning, but the device that enables dream analysis is stolen. This creates an even bigger problem than just nightmares; what happens when people can't control their dreams and has them hijacked by evil? Paprika isn't the easiest movie to sum up. On one level, it's like watching dreamy, fantastical animation, but there's also a deeper psychological question being asked: What is a dream exactly and to what extent does it affect your consciousness and waking life? How much fantasy is good for a person whether it be in dreams or spending time on the Internet? If you bury guilt and desire into your subconscious, how will it manifest in your dreams? Paprika is definitely a visual spectacle. I don't recommend waiting to see it on video. I had the honor of catching it on the big screen, which I believe is necessary to capture the depth of the imagery. Parts of it really seemed like dreams I've had (times when I've tried to walk, but couldn't get anywhere and the harder I tried, the worse it got). I put Paprika up there with Pan's Labyrinth. A lot of people will be turned off from it by the subtitles and another set of people will be lost by the mythology in it. If you don't have problems with these kinds of things, you will probably have a delightful viewing experience. It takes a person with an analytical mind to put the plot together. If you follow the recurring images, the mythology will make sense. A lot happens on the screen. I didn't have a problem understanding what was going on and I enjoyed putting the puzzle together. I don't think most moviegoers are like that these days, so I can see them getting bored or annoyed because they can't figure out what's going on. If you prefer the Disney genre of animation, avoid Paprika, it will just frustrate you. If you're crave more than a simple plot, Paprika will satisfy that hunger. The soundtrack is quite good too. It's a refreshing break from Elton John power ballads.",
         "A couple weeks ago I was listening to the soundtrack from a movie called Paprika by Hirasawa Susumu. The music fascinated me, it was magnificent. I was strongly compelled to watch the movie. The story is based around a lovely lady named Paprika, she has mastered the ability to sail into others dreams and help them with their problems.... an internal dream analysis/counselor. I found Paprika the movie is as fascinating as the soundtrack . Needless to say the dream sequences are exquisitely and vividly portrayed. The pace is manic at times and dreams and reality often converge to confuse the characters and especially the viewer. It all comes together however, in what can only be described as the best closing battle sequence I have ever seen...... period!!! Paprika shines. Now...I never do, with movies what I did with Parika. Firstly the moment the movie finished, I got another cup of coffee and started it up again. Secondly I wrote this review And now I'm off to watch it again. Like anime or not, Paprika is NOT to be missed. Suggestion, if your not used to subs.... get the dubbed version......this is a fast paced movie and will require some attention. 10/10",
         "I saw this two days ago at the New York Film Festival. The plot: What happens when we acquire technology that allows us to migrate the boundary between dreams & reality, and what happens when that boundary blurs? The Animation: Stunning; Madhouse always does good work and Kon's movies always produce some fun reality bending sequences. The Music: Susumu Hirasawa who did the Paranoia Agent soundtrack came up with the score here too. The opening song is a particularly infectious number. It makes you smiley. It's like the opening song from Paranoia Agent on steroids. I really could not get the grin off my face till the beginning sequence ended. The Cast: The voice cast is headed by Megumi Hayashibara, probably the most prolific and well known female seiyuu ever, with roles such as Rei Ayanami (Evangelion), Lina Inverse (Slayers), and Faye Valentine (Cowboy Bebop) to her credit. Akio Ohtsuka and Koichi Yamadera, Batou & Togusa of Ghost in the Shell fame, both play major roles as well. All do a fabulous job as usual, but Hayashibara really shines in her Paprika role. This film has great animation, music & actors, but the plot is really just a thin veneer for the lucid dreaming sequences that permeate so much of Satoshi Kon's work. I still recommend seeing it because it's a really light fun film, but I don't think it adds up to being more than the sum of some really great parts. I think this one needs to be enjoyed in pieces rather than as a whole.",
         "I have only seen this movie a few hours ago and am still stunned by simply how incredible it was. Who ever thought anime could be so fantastical? While the plot, at times confusing and going on the border of being a stereotypical anime, is terrific and i couldn't ask for it to be any better. Many reviewers condemned this film because of the randomness and lack of explanation for some parts, but i believe that Satoshi Kon did this on purpose. Kon simply made this movie like a dream; it is colorful, incredible, random, and offers scarce explanations. The film wants you to think about what the meaning of these \"dreams\" are, instead of telling you what the meaning is, much like what you would have to do with a real dream. The best part of this film is that it can appeal to the non-anime fanatic crowd. I have seen all a few animes (only hayao miazaki films) so i wouldn't be called a true fan, and am not much into the science-fiction animes and what not that many people seem to love, yet i could not help but fall in love with Paprika. Please, Please, PLEASE see this movie. Its too incredible to go under-appreciated by the world. Perhaps the best film of 2007, maybe one of the best from the past few years, if you see this movie you will NOT regret it.",
         "I had gone into Paprika not knowing much of what to expect, save for the fact that it was an anime with quite a buzz. An hour and a half later, this is one of the best films I've seen in 2007. The plot, as best as I can describe it, concerns a group of scientists developing a device which allows one to interject your subconscious into and record another person's dreams. However, a thief is using the technology to terrorize and control others. As the scientists try to find their stolen property, reality begins to take on a different meaning... Satoshi Kon is filmmaker I've never heard of before, but what he has created is truly visionary. Paprika continually amazes with imagery which transcends conscious understanding and coherence for what can only make sense on a subliminal level. Examples include a marching band of inanimate objects, dolls and animals, a giant aquatic leviathan with a man's face and humanoid toys that act as vessels for their dreamers bodies. But what makes the film necessary viewing is not the visuals alone, it's the core of the story and varied themes that it poses. The subject matter deals with issues both contemporary and probable. The actual identities of ourselves are wrapped in an enigma. How science has its positive and negative aspects. That the advantages of the internet is better communication but also dehumanization. I'm sure others will find other symbolism and subtext. Wheather you're familiar with Japanese animation or not, Paprika will expose any newcomer to something foreign and deeply personal as well.",
         "I'm not an expert in anime, nor have I seen a lot of this genre, but I utterly admire the immense creativity of people like Hayao Miyazaki (\"Princess Mononoke\", \"Spirited Away\"). Satoshi Kon's \"Paprika\" is a great example of anime at its finest. The movie is a sea of original ideas and a visual blast. Apparently, the plot is about the theft of a machine that allows scientists to enter and record people's dreams, and how a detective and a young therapist called Paprika join forces to get it back. But there is so much going on and so many smart innuendos (remember: this is Rated R anime, not \"Ratatouille\" - even though I think the R rating is just too much in this case) that \"Paprika\" becomes one of the most original adult animations in recent memory - superior to Richard Linklater's \"Waking Life\" and even \"A Scanner Darkly\", I dare to say. I won't give away anything because I don't want to spoil a single scene, but I'd say that I see it as a movie about the power of movies over our life/dreams, and about the love people like me have for the Seventh Art. I don't know if that was Kon's original idea and honestly I don't care - it's not every day that you find a movie that amuses and says something to you in such an unpretentious way. Whatever was Kon's original idea, I think that he got what he wanted: a movie that both entertains and makes you think. Simply fascinating. 10/10.",
         "Adapted from a science fiction novel by Yatsutaka Tsutsui, Paprika is probably my favourite film from this year's Animation Nation. The closing film (technically, since it's the last film to be screened tomorrow), it is one heck of a thrill ride, and will definitely engage an audience at different levels. In contrast to the dark doom and gloom hanging over Paris 2054 in Renaissance, Paprika at first glance is surprisingly light hearted and colourful, though it has its fare share of gloom and probably has darker themes which unfold as the story progresses. It's central plot revolves around a futuristic method of psychotherapy with the aid of a newly created invention known as the \"DC Mini\", which is a device that probes into the annals of your brainwaves, and allows the doctor to analyze and diagnose problems which surface in your subconscious. Until the device is stolen that is, and it's up to our key project team members to try and contain the situation, prevent the device from falling into the wrong hands and get abused, and in essence, investigate the loss, with the help of fellow patient detective Kogawa Toshimi. In some ways, the movie's storyline resembles a bit like the Matrix movies (which of course, borrows from Japanese anime), in having the hero the champion of both worlds - the real one, and inside the artificially created one. surviving in both with the adoption of different personas. Here, our heroine is Dr Chiba Atsuko, who in her alter ego as Paprika, is able to traverse through the dreamworld with great ease. There are plenty of stuff happening in almost every scene, and some might deem it a little \"noisy\" with so much to see, but so little time on screen. However, never for a moment does it feel very cluttered, and I am still pleasantly pleased at how so much story can be compacted into a nifty 90 minutes, without compromising on quality. Despite the dark themes in the movie, there are a number of light hearted moments which seem to punctuate the movie at the right places, no doubt most coming from the characters of Tokita the DC Mini creator, and Detective Kogawa in his (in)ability and slow enlightenment to the entire scheme of things, nevermind a dark subplot solely focused on his character alone. At another level, it explores much about our dreams, and how within them, we can be who we want to be, but yet all comes to naught once we wake up from it. What if we're given the ability to merge both the real world and the dream world. Then what would become of life as we know? Will it be utter chaos when dreams and desire start to run amok? Full of vibrant colours and energy, Paprika is just about everything that you would expect from an excellent piece of animation. A story that makes your brain work at figuring out what's happening on screen, yet doesn't allow such mysteries presented to stifle your concentration on what's going on next. A hauntingly mesmerizing soundtrack. Beautiful art pieces from background sets to character design so detailed. And with so much on screen at any one time, it definitely seeks a second viewing to truly appreciate and take in everything. Director Satoshi Kon has made a fan out of me with this movie, and I think, if time and money permits, I'll be hunting down some of the earlier works, if this is any indication whether I'll enjoy them to bits. Paprika will be shown tomorrow during the Animation Nation festival's closing, but I hear that tickets are already sold out (I bought mine on the first day when the tickets were out on sale). I do think there should be a general release, so keep your fingers crossed!",
         "I saw Paprika on the Fantastic film Festival of Amsterdam and i was amazed. Being a movie buff since the age of 14 and running to 30. Once in a while i get blown away by a new production. Always been a fan of manga this production from anime master Satoshi Kon is his latest entry is the magic world of drawing. Taking all the space and freedom this genre offers you will be sucked in to a world of fantasy en wonders. Kinda like when you first saw Charlie and the chocolate factory as a kid. The characters are totally lovable en the drawings are of the most beautiful i have ever seen in theater. The story is complex so, if you want to know what all the fuzz is about read another review en check the film. it's my new love: Paprika 9 a.o.10",
         "Sometimes a movie can leave you feelings so mixed that you have to wait for a day or two before you realize whether it was actually a masterpiece or only decent entertainment. In my opinion, this amine is pretty close to being a masterpiece. The pitch was not easy to handle, though : a group of scientists (who are protagonists, which is rare in japanime which tends to focus on youngsters or weirdos) has almost completed the design of a brand-new high-tech device called the \"DC Mini\", which has the ability to display the subject's dreams on a screen. Once recorded, it can be used by specialized psychiatrists for therapeutic use. But one of these happens to get stolen by some tortured megalomaniac mind who uses it to penetrate other people's dreams and destroy their consciousness to death. The fellow scientists will try to discover who is doing that, while getting assistance from a mysterious imaginary girl called Paprika, who is unrivaled at finding the cure to mental illness by penetrating inside dreams and guide the subject to healing. Curiously enough, though not particularly violent, this anime reminded me of Akira : as a matter of fact, the dream-related part of the movie which uses many distortion effects and frantic music (excellent score from Susumu Hirasawa, by the way). One who knows a little bit of Japanese culture can also distinguish critical viewpoints towards nowadays's Japanese society as well, which is faithful to Yasutaka Tsutsui's novel. It really made me want to learn more about Satoshi Kon's other movies such as \"Perfect Blue\" or \"Tokyo Godfathers\". I guess that's a good odd... Perhaps not the best-suited for children who perhaps won't understand a rather complex script, but a heck of a show for the other !",
         "Just back from the New York Film Festival Screening of Satoshi Kon's Paprika. Kon's new film is not the dark mind warps of Perfect Blue or Paranoia Agent, this is closer to blending of real and unreal of Millennium Actress and Tokyo Godfathers light and airy touches. Its got its darkness but its mostly a light thriller. (I'm not going to go into a discussion of specifics concerning the plot, since I was told things by reviews I read prior to seeing the film which, while they didn't reveal a great deal, spoiled just enough to take the wonder off some of the story and images) The plot concerns a device called a DC Mini which allows people to enter other peoples dreams. It also allows your dreams to be recorded for play back. Three of the revolutionary devices are stolen before they could be encoded with a software that will prevent total access to anyone at anytime, which means that anyone with the devices can not only enter anyone's dreams at anytime, but also enter there mind and put them into a dream of their choosing. Unfortunately the head of the project suddenly begins spouting nonsense (the result of being dropped in the dream of a mental patient) and before anyone can stop him he leaps from a high window. The race is on, with our heroes getting the help of a mysterious girl named Paprika, who seems to be able to move with in dreams in ways that are completely unnatural. I liked this movie. It takes a while to get going but once it does its really good (it has a gangbusters last third). Kon blends the real and the dream in ways that can only be done through animation (see his earlier films for how good he is at it). Its wonderfully done, so much so that you can never be sure whats real and whats not, as one character says late in the film, \"is this real or is it a dream?\" In the end you can not tell, especially as the worlds begin to overlap. I know for some, myself included, the plot line may seem a bit of been there and done that (ie Dreamscape) but Kon's visual sense pushes the film from a run of the mill retread into something worth going out and seeing.(As I said I'm not going to go into some of the wild things that Kon has cooked up for his dream world since somethings should remain a surprise.) For those looking for some of the darkness of Kon's Perfect Blue or Paranoia Agent, its not really here, actually the movie is frequently very funny. Certainly some of the dream imagery can be frightening and disturbing in a not normal (dream)) sort of way, but other than one moment where a villain shows how he can control anything in the dream world, there isn't anything thats mind twistingly scary. (Though that one moment is sure to send shivers up and down most peoples backs) This is just a good little fantastical thriller. At this point I have to make a confession. This movie reduced to tears a couple of times. There are a couple of moments when this movie is like a shot of pure joy. The title sequence with its J-Pop ear worm of a song had the tears rolling down my face. Later when Paprika dives into a dream and rides a cloud the marriage of music and image, however fleeting had me blissed out. Best of all the films exploration of who we are underneath it all will make everyone grin from ear to ear. See this movie. Its a good little thriller. Its not the best thing that director Satoshi Kon has done, but its a good time in the movies (which it celebrates)."
      ],
      "genres": [
         "Animation",
         "Mystery",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Madhouse",
         "Sony Pictures Entertainment (Japan)"
      ],
      "summaries": [
         "Three scientists at the Foundation for Psychiatric Research fail to secure a device they've invented, the D.C. Mini, which allows people to record and watch their dreams. A thief uses the device to enter people's minds, when awake, and distract them with their own dreams and those of others. Chaos ensues. The trio - Chiba, Tokita, and Shima - assisted by a police inspector and by a sprite named Paprika must try to identify the thief as they ward off the thief's attacks on their own psyches. Dreams, reality, and the movies merge, while characters question the limits of science and the wisdom of Big Brother.",
         "When a machine that allows therapists to enter their patients' dreams is stolen, all hell breaks loose. Only a young female therapist can stop it: Paprika."
      ],
      "budget": 0
   },
   "movielensId": 52885,
   "movielens": {
      "languages": [
         "English",
         "日本語"
      ],
      "releaseDate": "2006-10-01",
      "dvdReleaseDate": "2007-11-27",
      "directors": ["Satoshi Kon"],
      "runtime": 90,
      "movieId": 52885,
      "title": "Paprika",
      "mpaa": "R",
      "actors": [
         "Megumi Hayashibara",
         "Tōru Furuya",
         "Kouichi Yamadera",
         "Katsunosuke Hori",
         "Toru Emori",
         "Daisuke Sakaguchi",
         "Mitsuo Iwata",
         "Rikako Aikawa",
         "Satoshi Kon",
         "Yasutaka Tsutsui",
         "Akio Ohtsuka"
      ],
      "imdbMovieId": "0851578",
      "originalTitle": "パプリカ",
      "genres": [
         "Animation",
         "Drama",
         "Mystery",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["jJzEW_eE1G0"],
      "plotSummary": "When a machine that allows therapists to enter their patient's dreams is stolen, all hell breaks loose. Only a young female therapist can stop it: Paprika.",
      "tmdbMovieId": 4977,
      "avgRating": 3.88334,
      "releaseYear": "2006",
      "numRatings": 2383,
      "posterPath": "/dJI2FSs3qfEPW82cWYfIaV8cVmN.jpg"
   }
}