{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nurse",
            "id": 428
         },
         {
            "name": "canada",
            "id": 1329
         },
         {
            "name": "professor",
            "id": 1992
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "forgiveness",
            "id": 3446
         },
         {
            "name": "alzheimer",
            "id": 5903
         },
         {
            "name": "marriage",
            "id": 6038
         },
         {
            "name": "past",
            "id": 6162
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "nursing home",
            "id": 155208
         },
         {
            "name": "elderly",
            "id": 172971
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0491747",
      "video": false,
      "title": "Away from Her",
      "recommendations": [
         8272,
         1999,
         3037,
         18602,
         1444,
         59266,
         72711,
         5259,
         436,
         14278,
         54793,
         11490,
         868,
         35992,
         31032,
         10511,
         22447,
         67,
         52230,
         46228
      ],
      "backdrop_path": "/17Z7O6bPkNQBG5flHOQcKezErrY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Fiona",
               "gender": 1,
               "credit_id": "52fe4321c3a36847f803caff",
               "name": "Julie Christie",
               "profile_path": "/8ExaneRh7VHcm2rATpau89Qwzjm.jpg",
               "id": 1666,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Aubrey",
               "gender": 2,
               "credit_id": "52fe4321c3a36847f803cb03",
               "name": "Michael Murphy",
               "profile_path": "/ebbKhFgIHugUywSL5udMFNfRxvQ.jpg",
               "id": 4776,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Grant",
               "gender": 2,
               "credit_id": "52fe4321c3a36847f803cb07",
               "name": "Gordon Pinsent",
               "profile_path": "/iSrrwNhbFo4CLG24eSGKABBwIaU.jpg",
               "id": 13950,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Marian",
               "gender": 1,
               "credit_id": "52fe4321c3a36847f803cb0b",
               "name": "Olympia Dukakis",
               "profile_path": "/8kYmUwC0SfnJKt39M5Xrr8Q0oIf.jpg",
               "id": 3019,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Kristy",
               "gender": 1,
               "credit_id": "52fe4321c3a36847f803cb0f",
               "name": "Kristen Thomson",
               "profile_path": "/xSFm0hxG4xhS2RvCA7eNKIGIWRh.jpg",
               "id": 19956,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Madeleine",
               "gender": 1,
               "credit_id": "52fe4321c3a36847f803cb13",
               "name": "Wendy Crewson",
               "profile_path": "/e20JNF2oF7B0uGcoepL8j3uY0iE.jpg",
               "id": 19957,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Dr. Fischer",
               "gender": 1,
               "credit_id": "52fe4321c3a36847f803cb17",
               "name": "Alberta Watson",
               "profile_path": "/iy3Qgqap1U1GRqNzjoX2mFwdqD3.jpg",
               "id": 19958,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "William Hart",
               "gender": 0,
               "credit_id": "52fe4322c3a36847f803cb1b",
               "name": "Thomas Hauff",
               "profile_path": null,
               "id": 19959,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Veronica",
               "gender": 0,
               "credit_id": "52fe4322c3a36847f803cb1f",
               "name": "Deanna Dezmari",
               "profile_path": null,
               "id": 19960,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Monica",
               "gender": 1,
               "credit_id": "52fe4322c3a36847f803cb23",
               "name": "Nina Dobrev",
               "profile_path": "/7Oc4jOZHWNYozxBxKdQr0NxoGjS.jpg",
               "id": 19961,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Betty",
               "gender": 1,
               "credit_id": "52fe4322c3a36847f803cb27",
               "name": "Grace Lynn Kung",
               "profile_path": "/6QAC8oUiXk8sJNoqVPjBjBmw3vC.jpg",
               "id": 5939,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Singing Nurse",
               "gender": 1,
               "credit_id": "52fe4322c3a36847f803cb2b",
               "name": "Melanie Merkosky",
               "profile_path": "/afdtZKsjLlIN80hhg3NnXgfBthb.jpg",
               "id": 19962,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Liam",
               "gender": 2,
               "credit_id": "56e5ccc19251413406000b45",
               "name": "Andrew Moodie",
               "profile_path": "/mvMIQ1WyB6q5Qf3fj1cGO1izxh2.jpg",
               "id": 166522,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4321c3a36847f803cabf",
               "name": "Sarah Polley",
               "profile_path": "/asFwK6hCFYHtHVJoOwMBSMTETtg.jpg",
               "id": 98,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4321c3a36847f803cac5",
               "name": "Sarah Polley",
               "profile_path": "/asFwK6hCFYHtHVJoOwMBSMTETtg.jpg",
               "id": 98,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4321c3a36847f803cacb",
               "name": "Alice Munro",
               "profile_path": null,
               "id": 19947,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4321c3a36847f803cad1",
               "name": "Daniel Iron",
               "profile_path": null,
               "id": 19948,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4321c3a36847f803cad7",
               "name": "Simone Urdl",
               "profile_path": null,
               "id": 19949,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4321c3a36847f803cadd",
               "name": "Jennifer Weiss",
               "profile_path": null,
               "id": 19950,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4321c3a36847f803cae3",
               "name": "Jonathan Goldsmith",
               "profile_path": null,
               "id": 19951,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4321c3a36847f803cae9",
               "name": "Luc Montpellier",
               "profile_path": "/hEEbBCzUe837j1rjOOCC8z1GRRs.jpg",
               "id": 19952,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4321c3a36847f803caef",
               "name": "David Wharnsby",
               "profile_path": null,
               "id": 19953,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4321c3a36847f803caf5",
               "name": "Benno Tutter",
               "profile_path": null,
               "id": 19954,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "52fe4321c3a36847f803cafb",
               "name": "Debra Hanson",
               "profile_path": null,
               "id": 19955,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4322c3a36847f803cb31",
               "name": "John Buchan",
               "profile_path": null,
               "id": 933333,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.423959,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 1919,
      "vote_count": 68,
      "budget": 0,
      "overview": "A man coping with the institutionalization of his wife because of Alzheimer's disease faces an epiphany when she transfers her affections to another man, a wheel chair-bound mute who also is a patient at the nursing home.",
      "similar": [
         858,
         8272,
         141,
         634,
         587,
         46705,
         112160,
         242224,
         5123,
         11421,
         43923,
         437557,
         9583,
         7350,
         27586,
         1360,
         2255,
         2771,
         2698,
         2621
      ],
      "original_title": "Away from Her",
      "runtime": 110,
      "poster_path": "/61qZqrSNKfw1t03BJ3sktlK630K.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2006-09-11",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Sarah Polley"],
      "runtime": 110,
      "synopsis": "Grant (Pinsent) and Fiona (Christie) are a retired married couple living in rural Brant County, Ontario. Fiona begins to lose her memory, and it becomes apparent she suffers from Alzheimer's disease. Throughout the film, Grant's reflections on his marriage are woven with his reflections on his own infidelities, and influence his eventual decisions regarding Fiona's happiness. When she feels she is becoming a risk to herself, Fiona decides to check into a nursing home, where one of the rules is that a patient can not have any visitors for the first 30 days, in order to \"adjust\". Wary of this policy, Grant agrees anyway, at the insistence of his wife whom he loves. During the drive to the facility, Fiona acknowledges Grant's past infidelity while he was a university professor. Despite the awkward situation, the couple makes love one last time before separating. When the 30 day period ends, Grant goes to visit his wife again, only to find she has forgotten him, and turned her affections to Aubrey (Murphy), a mute man in a wheelchair who has become her \"coping partner\" in the facility. While seeing his wife grow closer to Aubrey, Grant becomes an unhappy voyeur when visiting his wife at the nursing home. As time goes by and Fiona still does not remember him, Grant even wonders whether Fiona's dementia is an act meant to punish him for his past indiscretions. After some time, Aubrey's wife removes him from the home due to financial difficulties. This causes Fiona to sink into a deep depression, with her physical wellbeing also appearing to deteriorate. Grant is touched by this, and visits Aubreys wife Marian (Dukakis) in an effort to allow Fiona to see Aubrey again. He would rather see his wife happy with another man than miserable and alone. Marian initially refuses, but the meeting leads to a tentative relationship between her and Grant. As time passes, Grant continues to visit both Fiona and Marian. He eventually moves out of his home and succeeds in taking Aubrey back to visit his wife. But in his \"moment alone\" before he brings Aubrey into Fiona's room, Fiona temporarily remembers him and the love she has for him. The film closes on their embrace.",
      "writers": [
         "Sarah Polley",
         "Alice Munro"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0491747/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjExMzgyOTUyNF5BMl5BanBnXkFtZTcwNTUzMDg0MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Julie Christie, Michael Murphy, Gordon Pinsent | See full cast and crew »"],
      "reviews": [
         "I remember the last time I saw my mother. I sat on the end of her bed, strumming guitar, and singing a song she used to sing to us as children. I hoped she might remember it. She would probably not, however, recognise her son. Or even speak. She had Alzheimer's. After self-righteous 'disease of the week' movies such as Iris, it is maybe hard to imagine a riveting, nuanced love story of depth and imagination, one centred on loss of memory, but Away From Her succeeds in spades. Fiona (Julie Christie) has been married to Grant for 44 years. They have reached a stage of lifetime love based on deep knowledge of each other and acceptance of past misdemeanours. Then Fiona's memory starts to fail. As her Alzheimer's begins to need 24hr care, she checks in to Meadowlake residential centre. There she not only forgets who her husband is, but develops an affection for another patient \u0096 an affection that holds all the tenderness she used to share with her (now onlooking) husband. Says Producer Simone Urdl, \"The role of Alzheimer's in the film is a metaphor for how memory plays out in a long term relationship: what we chose to remember, what we choose to forget.\" And our ability to recall things, as Oscar Wilde pointed out, is highly selective. Secure in the knowledge that he has given his wife many years of happiness, Grant glosses over his unfaithfulness in their younger days. But Fiona's early memories stay longer, and come back to haunt him. To bring his wife joy now, he is driven to encourage her towards that which gives him most pain. Away From Her takes us from frozen, luminescent mise-en-scene of the couple's secure existence in snow-drenched, rural Canada, to the hand-held cameras and uncertainty that hits in Meadowlake. Excerpts from Auden's Letters From Iceland are sprinkled into the script like shards of crystalline beauty. Julie Christie, for whom the lead role was written, exudes dynamic good looks and the vibrancy of a young woman, bathed in such warmth and passion of years. When she asks Grant to make love to her before leaving, there is an urgency and scintillating sexiness about her. Away From Her sparkles as we watch Grant walk his emotional tight-rope. The movie is made with such surety that it comes as a shock to realise the director is a first time filmmaker in her twenties. Sarah Polley evokes Bergman, as she too touches \"wordless secrets only the cinema can discover.\" This talented young woman is highly selective in her acting roles and now, behind the camera, impresses with her insight and intelligence. My last conversation with my mother, before she was institutionalised, or I even realised what was happening, was a long distance phone call. After chatting happily for five minutes, she said, quite chirpily and very politely, \"What's your name again?\" Memory is not always a two-way process. Nor objective. But, like this film, it can be mesmerising, heart-wrenching, and a remarkably intimate vision.",
         "Julie Christie's combination of talent, beauty and brains has enthralled me over four decades. Nearly a decade ago, her Oscar nominated performance in \"Afterglow\" established that she was not a spent force while playing a gracefully aging wife of a handyman in the US. One thought that would be her best turn at geriatric impersonations. Less than a decade later, Christie comes up with an even better performance of a woman coping with Alzheimer's disease in a debut directorial effort \"Away from Her\" of Canadian actress Sarah Polley. I saw the film today at the ongoing International Film Festival of Kerala, India, where Ms Christie, serving on the jury for the competition section, introduced her film thus: \"It is immaterial whether you are rich or poor--we cannot predict what can happen to us. Enjoy the film with this thought.\" Ms Christie probably put in her best effort because the young director considers Ms Christie to be her \"adoptive\" mother, having worked together on three significant movie projects in five years. The film's subject brings memories of two similar films: Pierre Granier-Deferre' film \"Le Chat\" that won a Silver Bear at the Berlin Film Festival for both Jean Gabin and Simone Signoret in 1971 and Paul Mazursky's \"Harry and Tonto\" which won an Oscar for the lead actor Art Carney in 1974. This performance of Julie Christie ranks alongside those winners. Today geriatric care is a growing problem. This film is a sensitive look at parting of married couples when one of them needs institutional care. Ms Polley's choice of the actor Gordon Pinsent is an intelligent one as the film relies on his narration and Mr Pinsent's deep voice provides the right measure of gravitas. Olympia Dukakis is another fine actor playing a lady who has \"quit quitting\". So is Michael Murphy doing a lengthy role without saying a word. The strengths of the film are the subject, the direction, the performances and the seamless editing by the director's spouse. It is not a film that will attract young audiences who are insensitive. Yet the film has a evocative scene where a young teenager with several parts of her body pierced by rings is totally amazed by the devotion of the aging husband for his wife. So in a way the film reaches out to different age groups. Though it talks about sex, it can be safe family viewing material. Chances are that most viewers will love the film if they are interested in films that are different from \"the American films that get shown in multiplexes\" to quote a character in the film. More importantly this film advertises the problem of Alzheimer's disease eloquently and artistically. It prepares you for future shocks.",
         "When it comes to \"Away from Her,\" the overused, abused adjective cannot be avoided: it is a great film. Sarah Polley's film grips, holds, moves, thrills; you will think and talk about it, remember the story and the characters indefinitely - which could well serve as a dictionary definition of \"great film.\" All this from a 27-year-old first-time director! You will see advertising and hear talk about \"the one with Julie Christie having Alzheimer's,\" but that describes \"Away from Her\" no better than saying \"Hamlet\" is about a man who cannot make up his mind. Yes, Fiona, Christie's character, is in the beginning stages of Alzheimer's, but the actress - as beautiful as ever and in her greatest role here - creates a complex, full figure, with good moments and bad ones, with intelligence, warmth, carrying regrets and hurts with grace. The outstanding Canadian actor Gordon Pinsent is Grant, Fiona's loving husband for long, rich decades, albeit with their share of problems. As the story unfolds, Grant and Fiona face the obvious, the inevitable, but for the audience, there is nothing obvious or inevitable about the way things happen. Polley's writing is Stoppardian in its complexity and brilliance - there is nothing predigested and Hollywoodish here, only life and people as infinitely complex as the human brain. Even as it deteriorates, the brain - and the film about this tragic process - retains its surprises and wonders, and to the very last scene of \"Away from Her,\" you cannot sit back and assume you know what will happen. You don't; the film's unpredictability is one of its great assets. Add to Polley's script (based on Alice Munro's \"The Bear Came Over the Mountain\") and direction, to Christie's and Pinsent's magnificent individual and ensemble acting, a cast to treasure. Olympia Dukakis and Michael Murphy play a couple whose lives unexpectedly intertwine with Grant and Fiona's. Kristen Thomson steals whole scenes from the principals as the head nurse at the institution where Fiona is placed; warm, supportive, nurturing and altogether wonderful, the nurse has one quick exchange in which she shows another side and another attitude - and this slight \"glitch\" makes the character even more real and sympathetic. \"Away from Her\" is not a tragedy, it's a drama, which moves and uplifts. It includes charming and funny moments, but even the humor has depth. In one scene, as she is watching TV news from Iraq, Alzheimer's patient Fiona exclaims: \"How could they forget Vietnam?!\"",
         "The fact that Fiona - the \"her\" from the title - is played by Julie Christie makes the painful journey crystal clear. Julie Christie is a wonder. She manages for us,without sentimentality but with an intelligence that makes the point of the story profoundly human, to get close to the illness with sadness yes but without fear. Alzheimer's disease is like a dark tunnel that the afflicted enter without wanting to, without being able to avoid it. I've wondered what was like to be aware of it, I mean, to know that sooner rather than later you will forget everything and everyone. Sarah Polley, the director, works a little miracle here giving us Julie Christie to answer that question. I felt enormously close to Fiona's husband - a wonderful performance by Gordon Pinsent - and came out of the experience uplifted rather than depressed.",
         "This is a story about Alzheimer's Disease (AD), its effect on those who suffer from it, and, principally, the difficulties that it poses for relatives who see their loved one decay mentally before death. Julie Christie plays Fiona, a woman whose dementia progresses rather rapidly. Her husband, Grant, is dejected with their predicament as Fiona is moved to a specialized facility and within it between wards dealing with patients with differing levels of impairment. The depiction of dementia through the character of Fiona and other patients around her is good but not excellent. From my, avowedly limited and not professional, experience with AD-afflicted close and distant relatives, numerous visits to a number of nursing homes -- from the fancy to the abject -- and long hours roaming the often depressing corridors of the wards observing the behavior of old folks whose minds had gone potty, I believe I picked inaccuracies in the behavior of Fiona and her fellow seniors that threw me off. It is not uncommon at the early stages of AD to think that the person may be pretending. Grant thinks that way too at first. I had to agree with him. I had trouble accepting an AD sufferer at the advanced stage of not recognizing a loved one of more than forty years still displaying a keen short-term memory capacity. Could it be that Fiona what exacting some kind of revenge on Grant past dalliances? The depiction of nursing homes and the commentary about AD is accurate. Sarah Polley has clearly spent time visiting such places. From what I understand, she had to deal with her own mother's dementia for about five years. She has first hand experience. The only thing missing in the film, is the sometimes lackadaisical attention by bored staff you see in real life. But, who knows, Canadian senior care may be a lot better. The story has an important additional element in the form of Marian, played superbly by Olivia Dukakis, whose husband has advanced AD. She illustrates the wrenching decisions that families face. Send the demented relative to an expensive nursing home and go broke doing so or keep the patient at home and live progressively more hellish days. That aspect of the disease jives perfectly with the shared experience of Grant and Marian as they deal with spouses that become unable to reciprocate the love they are given. The patients at the nursing home are actors. Despite their best efforts, I found the depictions short of perfect. It is really difficult to ape exactly the tentative and struggling moves of a frail body or the glazed eyes of a lost soul who no longer can comprehend the world. The aforementioned criticisms should be considered minor. Sarah Polley's first venture as a director shows she has what it takes. That is helped by a very good adaptation to the screen of Alice Munro's short story. Overall the casting is excellent. Funded by the Ontario province at a cost short of C$5M and shot in that province. Don't miss it.",
         "A couple washes up after dinner. He washes while she dries. They savour the memory of the delicious dinner they just shared. They are smiling and in love after forty-four years together. In a moment of silence, he casually hands her the frying pan he has just cleaned. She dries it with her towel, walks to the freezer and puts it inside. She exits the room as if nothing out of the ordinary has just happened. All he can do is watch, if his intentions are to be sensitive. This is the context in which we are introduced to Grant and Fiona (Gordon Pinsett and Julie Christie) in the first feature film adapted and directed by Canadian actress Sarah Polley, AWAY FROM HER. Polley brings unapologetic honesty and sympathy to the lives of these two characters. After a lifetime together, they will be torn apart by Alzheimer's. Neither can do anything to stop it. He can only watch her mind disappear while she tries to enjoy the undetermined lucid time she has left. It is Polley's delicate and respectful hand that guides the viewer to see past the surface of misplaced kitchen apparel and see the longing for tenderness that is had between as it lingers longer than fading memories. Memory comes in and out in AWAY FROM HER. With the image often filling with white and veering on blurry like a blinding snowstorm, Polley sets the tone from the start. Memory is a hazy concept. Alzheimer's is a cruel game that has Fiona having difficulty maintaining her short-term memory, like why she left the house or common words, while some of the most painful memories in her life seem like they will never be forgotten. Her story unfolds as she decides to admit herself to a retirement facility so that her husband needn't be responsible for her. This particular \"home\" enforces a policy where new residents are not allowed to have any contact with the loved ones they left behind for the first thirty days after they are admitted. When Grant is finally able to return to the residence, it isn't clear whether Fiona even recognizes him and worse yet, she has found comfort in the company of another man (Michael Murphy). As painful as this reality is, Polley cuts away to another time and place throughout this build, allowing us a glimpse into where Grant will end up as a result of all this change. As a result, the film feels interrupted. It is one of few mistakes made by this novice filmmaker but fortunately not one that makes the film any less painful. Polley directs three beautifully nuanced performances from her leads. As Grant, Pinsett is bewildered, stubborn and hopeful depending on the moment. Despite all of his frustration, he is constantly searching for understanding and resolve for the memories even he has difficulty letting go of. Olympia Dukakis joins the cast as Marian, the wife of Aubrey, the man Fiona befriends in the residence. She is a tough woman, brass because she has to be. For Grant, she represents what he could have become had it been decided that he would care for his wife himself. Her life is one that was surrendered to supporting her husband through his illness, forcing personal happiness to be removed as a possibility. Naturally, given the nature of the part, it is Christie that pulls the viewer deep into a mind that is falling away. In one scene, Grant brings her home for a day. She marvels at how it was kept so well after all this time. Though the home she is seeing was her own for over twenty years, she looks on it as if it belonged to someone else. The way her eyes take in the surroundings, an environment that she should know intimately, suggests a sense of attachment intrinsically linked with a saddened detachment. She should know this place, these things, and one some level she does. She does not understand why she should feel a sense of familiarity, just that it is so. It is as though memories flood back to her but they aren't her own. AWAY FROM HER is a fantastic first film from a talented Canadian actress with great promise as both a perceptive writer and skilled director. It is also a lesson in patience and learning to let go. Not for the viewer but for those on screen. Grant must always exercise restraint while allowing the love of his life to find solace in another man. After all, what matters most is that she be at peace. As big a task as this is, Fiona must do even more. She must accept that the life she knew is behind her and that the one ahead of her is new, necessary and one that might fade away from her as quickly as it happens to her.",
         "Sarah Polley is under 30 and \"Away From Her\" is a genius project for any age of filmmaker. Wow. Just amazed at the sensitivity of the direction and the spectacular performances. Julie Christie is so adept at convincing her audience, there wasn't a dry eye at our screening. Gordon Pinsent and Olymia Dukakis were equally as gripping in this quiet, realistic tale. If it doesn't get an Oscar for somebody - there is REALLY something wrong with the distribution and/or with AMPAS. come along everyone ! Give Sarah your votes.",
         "Sarah Polley, still well under thirty, has taken one of my favourite Alice Monroe's stories and created magic with the script, casting and production of a remarkable and memorable film. The effect is profound. You are watching actors at the peak of their craft, Julie Christie (playing Fiona Anderson), Gordon Pinsent (Grant Anderson) and Olympia Dukakis (Marian) and there is never a false move. But beware, this is a movie for grown-ups and is reminiscent in some ways of \"The Dead\". Do we ever really know someone even though we have lived and breathed their air for over forty years? The tragedy and sometimes humour of Alzheimer's Disease is portrayed beautifully. The occasional lucid moments offering hope, only to be followed, often quickly, by the bafflement of the dementia. But to focus solely on the still breathtakingly beautiful Julie and her brilliance in depicting a woman in the throes of the disease is to diminish the film as it is not only about that. It is about the secrets of the marriage, the incarceration of a loved one in a home, the despair and sometimes desperation of the spouse left operating in the outside 'real' world, the sometimes outrageous bondings of the inhabitants of the group home and the compromises reached by all. There is much symbolism in the movie (the snow was particularly meaningful) and many wonderful, almost unnoticeable 'sidebits' - Olympia trying to pass off a store bought cookie as home-made for one - that bring this movie to wonderful heights. The attention to detail is amazing. I've visited these homes and this was real, down to the eccentric and often comically expletive-laden talk from the elderly inhabitants. Polley shows remarkable restraint in just allowing one of these eccentricities to run through the film when it might have been tempting to lay it on a little more thickly. Though never sentimental and often humorous, the world through Grant's eyes is vividly portrayed and his anguish is palpable as he witnesses both the disintegration and re-invention of his beloved Fiona. A heart-breaking, powerful and moving story brought beautifully to the screen. Bravo to all concerned. Oscar worthy.",
         "I was very struck by this film. I felt the subject of Altzheimer's was handled in a dignified and loving manner that mercifully avoided sentimentality, as ultimately it was a film about people getting on with their lives - Marian and Grant moving in together, and Grant returning Aubrey to the place and the person, Fiona, that will together make him happiest whilst also giving Fiona the chance of a temporary period of recovery. Julie Christie was luminescent, with those wonderful eyes of hers increasingly speaking her joy and pain as words and memory failed her. It was also a real pleasure to see Olympia Dukakis characteristically achieving a great deal without needing to say very much at all. The focus of the film narrowed as it progressed, mimicking a characteristic of the disease. This film ensures that anyone seeing it will learn more about the disease that is at the centre of the film as well as watching some loving exchanges between different people as the story unfolds. I hope that this film garners at least some awards, as it is worthy of being rewarded for the very real pleasure of seeing acting up there on the screen - small movements, not grand gestures, or even the wonders of CGI, which can be wonderful. No, here is sound, profound ACTING - all the more welcome as it is something that can be overlaid with so much else in many other films.",
         "I saw this film at Sundance, and was literally blown away. Away From Her is an incredible achievement for any filmmaker, and for such a young director as Sarah Polley to have made this film is amazing. If there is a God, she, Julie Christie and Gordon Pinsent will all be nominated for Academy Awards. This film deals with a couple married for 45 years, and have never been away from each other. As Julie Christie's character realizes that she is losing her memory, she makes plans to enter a clinic, from which she knows she will not return from, and her husband does not want her to be \"away from her.\" In a few of the scenes in which her memory has reverted to the past, you find out that their marriage was not perfect, as she brings up events from the past that caused both of them pain. Bring tissues and ladies- make sure you've got waterproof mascara on."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Foundry Films",
         "Capri Releasing",
         "HanWay Films"
      ],
      "summaries": [
         "Grant and Fiona Anderson have been married for forty-four years. Their marriage has been a generally happy and loving one although not perfect due to some indiscretions when Grant was working as a college professor. Fiona has just been admitted to Meadowlake, a long term care facility near their country home in southwestern Ontario, because her recent lapses of memory have been diagnosed as a probable case of Alzheimer's disease. She and Grant made this decision together, although a still lucid Fiona seems to have made peace with the decision and her diagnosis more so than Grant. With respect to the facility, what Grant has the most difficulty with are what he sees as the sadness associated with the facility's second floor - where the more advanced cases are housed - but most specifically the facility's policy of no visitors within the first thirty days of admission to allow the patient to adjust more easily to their new life there. Based on what he sees when he is finally able to visit Fiona, Grant ultimately makes a request of Marian Barque, the wife of one of the other patients, a semi-comatose Aubrey Barque, with whom Fiona has struck a friendship and who is now at home permanently with Marian. The request is to see to both Fiona and his own happiness in this unfortunate situation.",
         "Fiona and Grant are an Ontario couple who have been married for over 40 years. Now, in the oncoming twilight of their years, they are forced to face the fact that Fiona's \"forgetfulness\" actually is Alzheimer's Disease. After Fiona wanders away and is found after being lost, they agree she must go into a nursing home. For the first time in the five decades their relationship has spanned, they are forced to undergo a long-time separation since the nursing home has a \"no-visitors\" policy for the first 30 days of a patient's stay, so they can adjust to their new surroundings. When Grant visits Fiona after the orientation period, he is devastated to find out that not only has she seemingly forgotten him, Fiona has transferred her affections to another man. The other man is Aubrey, a wheelchair bound mute patient at the nursing home. As the distance between husband and wife grows, Grant must draw upon his love for Fiona to perform an act of self-sacrifice in order to ensure her happiness.",
         "A man coping with the institutionalization of his wife because of Alzheimer's disease faces an epiphany when she transfers her affections to another man, Aubrey, a wheelchair-bound mute who also is a patient at the nursing home."
      ],
      "budget": 4000000
   },
   "movielensId": 52967,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-09-11",
      "dvdReleaseDate": "2007-09-11",
      "directors": ["Sarah Polley"],
      "runtime": 110,
      "movieId": 52967,
      "title": "Away from Her",
      "mpaa": "PG-13",
      "actors": [
         "Julie Christie",
         "Michael Murphy",
         "Gordon Pinsent",
         "Olympia Dukakis",
         "Kristen Thomson",
         "Wendy Crewson",
         "Alberta Watson",
         "Thomas Hauff",
         "Deanna Dezmari",
         "Nina Dobrev",
         "Grace Lynn Kung",
         "Melanie Merkosky",
         "Andrew Moodie"
      ],
      "imdbMovieId": "0491747",
      "originalTitle": "Away from Her",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A man coping with the institutionalization of his wife because of Alzheimer's disease faces an epiphany when she transfers her affections to another man, a wheel chair-bound mute who also is a patient at the nursing home.",
      "tmdbMovieId": 1919,
      "avgRating": 3.72973,
      "releaseYear": "2006",
      "numRatings": 555,
      "posterPath": "/61qZqrSNKfw1t03BJ3sktlK630K.jpg"
   }
}