{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "marriage proposal",
            "id": 1459
         },
         {
            "name": "daughter",
            "id": 5600
         }
      ],
      "imdb_id": "tt0098966",
      "video": false,
      "title": "Three Men and a Little Lady",
      "recommendations": [
         12154,
         6951,
         9409,
         11862,
         9304,
         11821,
         12121,
         8989,
         10407,
         12120,
         9356,
         10057,
         10780,
         10019,
         11846,
         11894,
         11982,
         11285,
         11824,
         9438
      ],
      "backdrop_path": "/vRPZTQxaNxoQhlj7SeYSAkxmy2M.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Peter Mitchell",
               "gender": 2,
               "credit_id": "52fe446b9251416c750341eb",
               "name": "Tom Selleck",
               "profile_path": "/jCnmP0qYpCwWdVlZM4j9VNugmTj.jpg",
               "id": 15112,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Michael Kellam",
               "gender": 2,
               "credit_id": "52fe446b9251416c750341ef",
               "name": "Steve Guttenberg",
               "profile_path": "/utLqKSEN9TX3EniBlX4BpytDunB.jpg",
               "id": 26472,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jack Holden",
               "gender": 2,
               "credit_id": "52fe446b9251416c750341f3",
               "name": "Ted Danson",
               "profile_path": "/wWm9eDLuPDw29R76KAjg6gIE9dS.jpg",
               "id": 12836,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sylvia Bennington",
               "gender": 1,
               "credit_id": "52fe446b9251416c750341f7",
               "name": "Nancy Travis",
               "profile_path": "/5galk3XJxxlIEmrnAQBuJsY1AaD.jpg",
               "id": 18331,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Mary",
               "gender": 0,
               "credit_id": "56bb75a592514131f3000065",
               "name": "Robin Weisman",
               "profile_path": "/UetxEiMN2HqfZe9yRzxxqswLhN.jpg",
               "id": 1225785,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Edward",
               "gender": 2,
               "credit_id": "56bb76d2c3a368471e0000b1",
               "name": "Christopher Cazenove",
               "profile_path": "/sck3PP8PepiasZ4gZ19PE5FBXQZ.jpg",
               "id": 67567,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Vera",
               "gender": 1,
               "credit_id": "56bb76e4c3a3684724000090",
               "name": "Sheila Hancock",
               "profile_path": "/ex0nkKMoIFq1nsVHZsNmSGWafkt.jpg",
               "id": 93839,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Miss Lomax",
               "gender": 1,
               "credit_id": "56bb76f692514131ea000095",
               "name": "Fiona Shaw",
               "profile_path": "/74b0OuN3xKs0dTMYBnbhDLwv8Oq.jpg",
               "id": 10981,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Vicar Hewitt",
               "gender": 2,
               "credit_id": "56bb770e92514131f00000a1",
               "name": "Jonathan Lynn",
               "profile_path": "/nvMGnGbGdXrRvGAjulNqhJWUB9c.jpg",
               "id": 21217,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Laurie",
               "gender": 1,
               "credit_id": "56bb7722c3a368472a0000a4",
               "name": "Sydney Walsh",
               "profile_path": "/vHYKW1QgoL0wGP6YktK7jZnq0t.jpg",
               "id": 156925,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Mrs. Walker",
               "gender": 0,
               "credit_id": "56bb7735c3a36847370000ce",
               "name": "Patricia Gaul",
               "profile_path": "/4yDh4wkWmdh7Fupa5xxMRKb4pDX.jpg",
               "id": 133581,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe446b9251416c750341fd",
               "name": "Emile Ardolino",
               "profile_path": "/h4LqsmRshajyuggfxR3wj7aNqyi.jpg",
               "id": 716,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe446b9251416c75034203",
               "name": "Coline Serreau",
               "profile_path": "/nvuVQdd2F9N2uDpzPGJqYOULNKn.jpg",
               "id": 35208,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe446b9251416c75034209",
               "name": "Charlie Peters",
               "profile_path": null,
               "id": 65401,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe446b9251416c7503420f",
               "name": "Robert W. Cort",
               "profile_path": null,
               "id": 18389,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446b9251416c75034215",
               "name": "Ted Field",
               "profile_path": "/qmB7sZcgRUq7mRFBSTlSsVXh7sH.jpg",
               "id": 9196,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446b9251416c7503421b",
               "name": "James Newton Howard",
               "profile_path": "/5UTEMYS7rydwe7ooOmj2dLRFuu2.jpg",
               "id": 1213,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446b9251416c75034221",
               "name": "Adam Greenberg",
               "profile_path": "/te3aqArBCPkza8DeJpDx0Rncen8.jpg",
               "id": 2723,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe446c9251416c75034227",
               "name": "Michael A. Stevenson",
               "profile_path": null,
               "id": 45862,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe446c9251416c7503422d",
               "name": "Jean-François Lepetit",
               "profile_path": null,
               "id": 7695,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 7.090331,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11630,
      "vote_count": 154,
      "budget": 0,
      "overview": "Sylvia's work increasingly takes her away from the three men who help bring up Mary, her daughter. When she decides to move to England and take Mary with her, the three men are heartbroken at losing the two most important females in their lives.",
      "similar": [
         634,
         253,
         646,
         657,
         667,
         668,
         699,
         708,
         10735,
         714,
         682,
         49519,
         146216,
         691,
         267935,
         954,
         707,
         170,
         22,
         658
      ],
      "original_title": "Three Men and a Little Lady",
      "runtime": 104,
      "poster_path": "/t5fPMmyOG5misI5IZe4Wn1YfxeH.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Interscope Communications",
            "id": 10201,
            "origin_country": ""
         }
      ],
      "release_date": "1990-11-21",
      "vote_average": 5.1,
      "belongs_to_collection": {
         "backdrop_path": "/fV5GFjIgNKfWKuT8WMj4F4Euat5.jpg",
         "name": "3 Men Collection",
         "id": 107688,
         "poster_path": "/4VcwlZQriG0qz0EY2jW9qmm0Hey.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Emile Ardolino"],
      "runtime": 104,
      "synopsis": "Peter (Tom Selleck), Michael (Steve Guttenberg) and Jack (Ted Danson) are now dedicated \"fathers\" to five year old Mary (Robin Weisman). Everything is going along fine until Mary's mother, Sylvia (Nancy Travis), begins thinking she needs more stability in her life and doesn't think any of her roomates are up to the task. Sylvia doesn't know that Peter has fallen in love with her but is hesitant to act since he feels his best friend, and Mary's biological father, Jack should step up and marry her so she accepts a marriage proposal from the director of her play, Edward (Christopher Cazenove). The wedding is to be in England and shortly we learn that Edward plans to move Sylvia and Mary there as well. Faced with the prospect of losing Mary from their lives Michael and Jack convince Peter to finally ask Sylvia to marry him instead of the unlikable, but willing, Edward and the three go to great lengths to break them up. In the end Sylvia realizes that Edward is a scoundrel and that she really likes Peter as well so we get the typical and expected happy ending with Sylvia leaving Edward at the alter to return to New York.",
      "writers": [
         "Coline Serreau",
         "Sara Parriott"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098966/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMzM1ODgxMF5BMl5BanBnXkFtZTcwOTg5ODMyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tom Selleck, Steve Guttenberg, Ted Danson | See full cast and crew »"],
      "reviews": [
         "I don't honestly understand why this film was panned so severely! It may not be a masterpiece as such but it certainly was worth the time of day. And for the people that are getting so serious about the England v. America thing: I'm English too and happen to find the stereotypes displayed in this film hilarious. It isn't meant as a direct offence, but merely light hearted fun. Also the \"3 men\" are fantastic again in their roles. Nancy Travis does a great job and has more chance in this film to show what she's got! Christopher Cazenove does a great job of being completely unlikeable and Fiona Shaw is AMAZING! A great film and to anyone who hasen't watched it already - please do! You won't regret it.",
         "After being only mildly entertained by the first movie, I was absolutely awestruck by this sequel. There are many hilarious scenes, a love story triangle, outstanding scenery of the English countryside, and outstanding acting by the big \"3 Men\". I would have to rate this one of my Top Ten movies of all time. This movie had no gaps or letdowns, and I could/can not stop watching it. I've easily seen it a dozen times or more, and just caught it again last week on Showtime. Let me cite some of the extraordinary scenes in this flick. The Rap song by the Big 3 (amazing!), the Big 3's kitchen scene regarding the discussion of possible suitors for Sylvia, the bachelor's swinging NYC party scene (Selleck's blonde was a major fox!) Fiona Shaw's pursuit of Tom Selleck in the Pileforth Academy, and the ending's madcap frenzy! What a movie!",
         "Why does this film have such a low rating?. OK i know most sequels never live up to the original but this film was different it was much better than 3 men and a little baby. Better storyline that kept you interested mainly the fact that half of the film is set in South England which gave the film a different angle and made it more interesting. Now on to the actors definitely Ted Danson was the best actor as Jack Holden closely followed by Tom Selleck as Peter Mitchell. I have seen this film since i was 3 years old when it first came out and it remains as a classic comedy alongside Uncle Buck, Planes, Trains and Automobiles etc its classed alongside those kind of films i think and overall it gets a 7/10",
         "I don't know why this one was so trashed by the critics. It's not a masterpiece but hardly as bad as indicated by the drubbing it got. It has what I thought what the best movie scene of its year, where Tom Selleck is talking to the little girl about his departure. He talks to her so intelligently, just the way a smart person would talk to a smart child. After that, I was willing to forgive an awful lot (and admittedly, there's an awful lot to forgive",
         "\"Three Men & A Little Lady\" puts you in the right mood. It becomes a sort of \"addiction\" once you've seen it. It portrays the typical American lifestyle, with a touch of English humor. An unusual plot makes it hard for you to get bored. The film's great share of actors captivate the viewer, and the lovely soundtrack adds delight to the ears. And I must say I haven't seen Fiona Shaw any funnier :)",
         "It's even better than the first one. 3 Men and A Little Lady has been my favorite movie all throughout my childhood and it still is. Kids will for sure enjoy it and adults too, with humor that both parent and child can appreciate. Grab your family and sit down if you haven't seen this one. All I have to say is, ignore the critics, and to just 'try it, you'll like it.':)",
         "I haven't seen all of the first one but I thought the second one was great. It's filled with charm, innocence, drama, comedy, and romance and I thought it was a pretty nice mixture of them. 3 men and a little lady is about a little girl, Mary who is all grown up now and is still babysitted by three men. Once she discovers about going to England, it starts making her a little moved and isolated as well as her three most crucial companions but soon recalls her supernatural-ness to see her friends with closed eyes. I know that the first film seems a little like Baby Boom but both this and that were good films. I thought this one was cute and wasn't bad at all. Three men and a little lady is an emotionally uplifting movie that will raise your moral and spirited levels.",
         "I thought this was a fantastic sequel to a reasonably boring first film. There was very little to fault - the only possible thing to quibble about is the massive stereotyping used in the English sequences, but even then they controlled it in both hilarious and heartwarming ways! I thought the movie struck a great balance between addressing real emotional and social issues, while still offering some of the most brilliant comedy lines I've encountered in a movie. I thought the acting was spot on, the dialogue was great, and the story was fresh and unique. Definitely on my top 5 list of movie - this one has been watched over and over again!",
         "I really liked Three Men and a Baby and I really liked this film. To be honest, while there are those who will think it is better and those it is inferior, I actually put these two films equally. It could have been a tad shorter though, and there are one or two predictable parts, then again the first one did too. What I did like about Three Men and a Little Lady was its cuteness and charm. This is not the best movie I have ever seen, but it never tried to be, neither did it attempt to be better than the first. It was just an enjoyable movie, with one or two minor problems along the way. The scenery and cinematography was actually pretty lovely, and I liked the soundtrack too. The script was decent, the pacing was snappy, the story while predictable was entertaining and there were some funny sight gags and situations. The direction was neat, and the acting was fine. Robin Weisman is quite appealing as Mary, and Tom Selleck, Steve Guttenberg and Ted Danson were great together and individually. Also seeing Shiela Hancock is always a plus. Overall, cute and entertaining. 8/10 Bethany Cox",
         "This movie would have to be one of my all-time favourites. I watched it religiously as a child, and it had become a security blanket for me all the way through to adulthood. Whenever I am feeling down or out of place, this film always makes me feel good. The three men are all fantastic in their own way, and little Mary is just gorgeous. It has humour, romance and drama and it is just a really easy movie to watch. No matter how many times I see it, I still laugh at Ms Lomax and get teary at the happy ending. I also love the first film but this sequel far surpasses it. Highly recommended for people of all ages who just want to feel good. Oh, and I love the music in it."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Romance"
      ],
      "productionCompanies": [
         "Touchstone Pictures",
         "Interscope Communications",
         "Silver Screen Partners IV"
      ],
      "summaries": [
         "Sylvia's work increasingly takes her away from the three men who help bring up Mary, her daughter. When she decides to move to England and take Mary with her, the three men are heartbroken at losing the two most important females in their lives.",
         "Sylvia's work causes her to move to England with her daughter, Mary. It's not just her work, though, it's also her new boyfriend and fiance. Peter, Michael and Jack don't like this new arrangement as they feel like Mary is just as much their daughter as she is Sylvia's. The three travel to England to stop the wedding, because her fiance doesn't like children and is planning on sending Mary to boarding school, and Peter has fallen in love with Sylvia."
      ],
      "budget": 0
   },
   "movielensId": 5309,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1990-11-21",
      "dvdReleaseDate": "2002-04-02",
      "directors": ["Emile Ardolino"],
      "runtime": 104,
      "movieId": 5309,
      "title": "Three Men and a Little Lady",
      "mpaa": "PG",
      "actors": [
         "Tom Selleck",
         "Steve Guttenberg",
         "Ted Danson",
         "Nancy Travis",
         "Robin Weisman",
         "Christopher Cazenove",
         "Sheila Hancock",
         "Fiona Shaw",
         "Jonathan Lynn",
         "Sydney Walsh",
         "Patricia Gaul"
      ],
      "imdbMovieId": "0098966",
      "originalTitle": "Three Men and a Little Lady",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [
         "tzwQWUYtiUE",
         "uoGz4fMiaGg"
      ],
      "plotSummary": "Sylvia's work increasingly takes her away from the three men who help bring up Mary, her daughter. When she decides to move to England and take Mary with her, the three men are heartbroken at losing the two most important females in their lives.",
      "tmdbMovieId": 11630,
      "avgRating": 2.38541,
      "releaseYear": "1990",
      "numRatings": 1597,
      "posterPath": "/t5fPMmyOG5misI5IZe4Wn1YfxeH.jpg"
   }
}