{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "incantation",
            "id": 4067
         },
         {
            "name": "treasure hunt",
            "id": 6956
         },
         {
            "name": "treasure map",
            "id": 11088
         },
         {
            "name": "miniseries",
            "id": 11162
         },
         {
            "name": "scientist",
            "id": 14760
         },
         {
            "name": "archaeologist",
            "id": 41586
         },
         {
            "name": "tv movie",
            "id": 156321
         }
      ],
      "imdb_id": "tt0455596",
      "video": false,
      "title": "The Librarian: Return to King Solomon's Mines",
      "recommendations": [
         14728,
         14207,
         34559,
         53838,
         42903,
         24617,
         54415,
         38202,
         122544,
         25012,
         326057,
         16999,
         14154,
         241040,
         19351,
         78049,
         31168,
         101180,
         16173,
         145051
      ],
      "backdrop_path": "/wTrzUBg9KYJolFtFFlYasUMfSFg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Flynn Carsen",
               "gender": 2,
               "credit_id": "52fe45d89251416c75064763",
               "name": "Noah Wyle",
               "profile_path": "/golhxKbDQUFZTlVKuDquN7r3CS2.jpg",
               "id": 13526,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Emily Davenport",
               "gender": 1,
               "credit_id": "52fe45d89251416c75064767",
               "name": "Gabrielle Anwar",
               "profile_path": "/khnEDczzSy6UcbnqZ6Sb4lWxnkE.jpg",
               "id": 5503,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Judson",
               "gender": 2,
               "credit_id": "52fe45d89251416c7506476b",
               "name": "Bob Newhart",
               "profile_path": "/dPF5ahXhd6x0SfJybEkrjJqNAEH.jpg",
               "id": 64930,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Charlene",
               "gender": 1,
               "credit_id": "52fe45d89251416c7506476f",
               "name": "Jane Curtin",
               "profile_path": "/lPiGlFpjsgb1uD3zPOkaEv4T3Es.jpg",
               "id": 58184,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Margie Carsen",
               "gender": 1,
               "credit_id": "52fe45d89251416c75064773",
               "name": "Olympia Dukakis",
               "profile_path": "/8kYmUwC0SfnJKt39M5Xrr8Q0oIf.jpg",
               "id": 3019,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Ahjmed",
               "gender": 2,
               "credit_id": "59df9eadc3a36861ec0a6883",
               "name": "Peter Butler",
               "profile_path": "/bt8rWadjxilIrRUsmWh0eT7IqgA.jpg",
               "id": 152244,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "General Samir",
               "gender": 2,
               "credit_id": "59df9f5292514124c50a7abe",
               "name": "Erick Avari",
               "profile_path": "/aO53uKgLUCID9rCI0SRAIEdsIex.jpg",
               "id": 18917,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Jomo",
               "gender": 2,
               "credit_id": "59df9f64c3a36861ec0a6958",
               "name": "Hakeem Kae-Kazim",
               "profile_path": "/i6Ok0YMEtjn4jd5zlPaZld55Ikl.jpg",
               "id": 2603,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Uncle Jerry",
               "gender": 2,
               "credit_id": "59df9f75c3a36861df0b2ac6",
               "name": "Robert Foxworth",
               "profile_path": "/yozb6itzUIsi0WxvoUkAo4dZfd8.jpg",
               "id": 2962,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Tommy Yellow Hawk",
               "gender": 2,
               "credit_id": "59df9f87c3a368622709efff",
               "name": "Zahn McClarnon",
               "profile_path": "/kYp2DBA4613pS2Z31lykzXOSeCc.jpg",
               "id": 42376,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Debra",
               "gender": 1,
               "credit_id": "59df9f9b92514124cd0a7fdd",
               "name": "Lisa Brenner",
               "profile_path": "/8H43mpc8Tq9VJYUIbpMA33ug6Yq.jpg",
               "id": 20811,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Debra's Husband",
               "gender": 2,
               "credit_id": "59df9fbfc3a368622709f02f",
               "name": "Jonathan Frakes",
               "profile_path": "/51Z5EbZxtVPm6GiN0Wc9CLP4z3s.jpg",
               "id": 2388,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45d89251416c75064753",
               "name": "Jonathan Frakes",
               "profile_path": "/51Z5EbZxtVPm6GiN0Wc9CLP4z3s.jpg",
               "id": 2388,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d89251416c75064759",
               "name": "Marco Schnabel",
               "profile_path": "/kYzNedWDUq1QXvHm7CIJUEDLYdd.jpg",
               "id": 71527,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d89251416c7506475f",
               "name": "David N. Titcher",
               "profile_path": null,
               "id": 64157,
               "department": "Writing",
               "job": "Characters"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 6.466644,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14208,
      "vote_count": 149,
      "budget": 0,
      "overview": "After retrieving the Crystal Skull in Utah, Flynn Carsen receives a map in the mail with the secret location of King Solomon's Mines. When the scroll is stolen, Judson explains the power of the Key of Solomon's book and assigns Flynn to retrieve the map. The map is useless without the legend piece to decipher it, which is located in Volubilis near the Roman ruins in Morocco. Flynn heads to Casablanca to the ruins where he is chased by a group of mercenaries leaded by General Samir. They too want to find the location of King Solomon's mines. Flynn teams-up with Professor Emily Davenport working in the dig and they escape from General Samir and his men. While traveling to Gedi, they save the local Jomo from death and the trio faces a dangerous journey through the wild Africa.",
      "similar": [
         89,
         217,
         85,
         87,
         1995,
         1996,
         2059,
         6637,
         9326,
         9838,
         10303,
         9710,
         256274,
         9016,
         17578,
         6646,
         389272,
         30117,
         222037,
         26612
      ],
      "original_title": "The Librarian: Return to King Solomon's Mines",
      "runtime": 92,
      "poster_path": "/fpedwecERf6PoaNml2Pa8dKncyZ.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "العربية",
            "iso_639_1": "ar"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [],
      "release_date": "2006-09-09",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": "/6H6uS5f4SMBaN0xHNhmQqUOShAX.jpg",
         "name": "The Librarian Collection",
         "id": 85890,
         "poster_path": "/w5sQ13yy83o1o323ksxz8RVxbqD.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Frakes"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Marco Schnabel",
         "David N. Titcher"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0455596/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxNzc4NzYyNF5BMl5BanBnXkFtZTcwNDYwMTc0MQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Noah Wyle, Gabrielle Anwar, Bob Newhart | See full cast and crew »"],
      "reviews": [
         "If you don't take it too seriously you'll really enjoy this. Noah Wyle returns as the Librarian Flynn. This time he sets out to find King Solomon's Mine together with the help of fellow \"nerd\" Emily Davenport (Gabrielle Anwar). I found a lot of similarities to Indiana Jones as well as The Mummy is this film. But it did not ruin the Librarian 2 for me at all. It's still different enough to stand alone. I think the character Flynn makes this movie. He is an interesting and well written character who really entertains. I also enjoyed the addition of Gabrielle Anwar, whose love/hate relationship with Flynn creates some nice laughs. Overall The Librarian 2 has enough action, adventure and twists to keep you interested. Basically if you liked the first one, you'll like this one.",
         "What fun! Noah Wyle strikes gold as the intrepid explorer/adventurer Flynn. I had been waiting for a sequel since the first one some years back. And I couldn't have been happier with the results. Aside from the brilliant production it is the writing that shines here. Well-thought out plot line with all the magic and silliness this kind of entertainment demands. Everything was in its place and geared up to thrill you. Having dispensed with the background of how Flynn becomes the iconic librarian, this second chapter hits the deck running from the get go, never stopping to catch its breath. The twists on Solomon's story were creative and exciting. The romance like a hundred other ones yet -- surprisingly fresh because of the chemistry between Noah Wyle and Gabrielle Antwar. Fire! Bob Newhart is just a giant in subtle comedy. His character is certainly mysterious and full of dead pan remarks. What fun!! Always nice to see Jane Curtain, and of course Olympis Dukakis. But in the supporting cast it was Mehboob Bawa and Robert Foxworth who stole the thunder. Can't tell you why. See it. Just see it! No heavy violence. No crude toilet humor. Just adventure and very likable performances. Mr. Wyle, you were producer, can we have more, please.",
         "While Carson has served a year a Librarian he still retains his delightfully nerdy quality. This made-for-TV movie is a film lover's spoof, not meant to be taken too seriously. The sequel holds up well thanks, in part, to the return of Jane Curtin, Bob Newhart and Olympia Dukakis, but Wyle is the heart of the film. His comic/dashing hero is in the same vein as Brandon Fraser in \"The Mummy.\" While a number of lines in \"The Mummy Returns\" came off as \"lame\" to me (an admittedly subjective judgment) I didn't really find any truly \"lame\" lines in this sequel and there were many really funny moments. I was afraid I might be disappointed, but my fears were groundless.",
         "Again people don't seem to realize that this movie is all about fun. Like the first part this is a parody on the adventure genre,especially Indiana Jones. It is not supposed to be a serious or thrilling movie. After reading some comments you would think that this movie has nothing to offer and really is rubbish. Wrong! The sequel to \"The Librarian\" is just as good and maybe even better. It is full of action,adventure,nice special effects (remember it is only a TV production) and a lot of comedy. And they even added a touch of drama. Time just flies when you are watching this movie. This movie never gets boring. And again Noah Wyle is great,who shows growth in character and is more confident than he was in the first part. I am glad that they are going to make a third movie. I can watch movies like this again and again. Keep them coming!",
         "Simply put, this move tracks the adventures of a man named Flynn Carsen to find the riches of King Solomon and protect their secrets. He meets Emily Davenport, a brilliant, beautiful woman, who is obsessed with the Queen of Sheeba, and the two go off together to find the \"Mines\" where the treasure, and a very dangerous book of spells, is hidden. OK, this movie is very cliché. If Harrison Ford was in it and the script, acting, and special effects were slightly better, it could be Indiana Jones. The acting is fairly bad and the plot jumps from place to place, never really certain who feels what and who does what. That said, it is one of those movies that is so bad, that it's good. Even though the acting is goofy, it is still funny, and despite the plot holes, it is still fun. It's the kind of movie to watch on a Tuesday night when there's nothing to do. And, it's a TV movie. It's not going to be theater worthy. Think of it as cute and a good family movie (except for maybe one scene). So watch this knowing that you won't be awed by it, only relatively amused.",
         "I loved it. I have watched four times now. I love the fact that they have grown the character of Flynn and taken away much of his bumbling. Flynn is showing growth. Noah is adorable and I feel did a wonderful job, better then the first. Noah was charming, funny, and his character was very real. I think Bob Newhart and Jane Curtain played their characters wonderfully. Kazeem also did a great job and was a wonderfully likable character. Olympia as Flynn's mother is a great choice and the chemistry between them was great to see. The special effects were also great. The background was beautiful and add a great dimension to the film. All in all I loved it and feel that it was better then the first, though I truly enjoyed both. I would love to see another sequel!",
         "This is a fairly good action adventure movie harking back to the days of Indiana Jones. The hero in this movie is Flynn Carson. And instead of a whip, he carries many books. Trying to find the key to unlock the treasures of King Solomans mines, Flynn meets Emily Davenport and with her help, Flynn tries to stop bad guys and ends up uncovering the secrets of his father's death. This movie moves along at a steady pace, and carries only a handful of fights and nearly half as many puzzles to solve. The first Librarian movie was full of action, suspense, and just enough character development to keep me happy. In this sequel, the suspense has been tuned down and the plot twist at the end wasn't so great. But, this movie was great and it was a fun way to spend a Sunday afternoon.",
         "This second outing in the popular ¨The Librarian franchise ¨(1ª Quest of the spear-2004- by Peter Winther and 3ª The curse of the Judas Chalice-2008- by Jonathan Frakes) concerns on Flynn Carsen(Noah Wyle), the roughest, toughest,silly, and botcher hero with 22 university degree . Flynn is assigned missions around the world and recover priceless objects guarded into Metropolitan library where are the Arthur's Excalibur blade, the skull of crystal, Saint Sheet of Turin, the magic flute, among others. Now he must to find the King Salomon's mines who ordered the building of the Temple by the 24 masons. He goes to Casablanca looking for a Salomon's key of map. There he encounters the tomb of Ptolomeo, the famous father of astronomy and geometry .Flynn accompanied by a beautiful archaeologist(Gabrielle Anwar) head to Kenia where allegedly is the Salomon's treasure. Our unpredictable heroes risk their lives and limb against a set of the nasties(Erick Avari) villains you've ever seen. Entertained TV movie plenty of action-packed,tongue in check, adventures, love story and extremely funny. This one has a little bit of everything : rip-roaring action, thriller,Sci-Fi,fantasy,derring do and an exciting score by Joseph LoDuca. Along with a sympathetic Noah Wyle appear the habitual secondaries, as a deadpan Bob Newhart, Jane Curtin and his likable mother well played by Olympia Dukakis. Besides cameo by Jonathan Frakes as passenger in the Magic Honeymoon bus. This enjoyable picture combines splendidly ¨Riger Haggard's mines of King Salomon¨ with ¨Spielberg's Raiders of the lost ark¨. Spectacular final scenes with excessive and mediocre use of computer generator special effects, adding a colorful cinematography by Walt Lloyd. For utter spirit-lifting bemusing you can't do better than this television movie. The picture is lavishly produced by Dean Devlin in partnership with Noah Wyle and TNT. Efficient direction by Jonathan Frakes, the notorious Star Trek's commandant Riker.He's an expert filmmaker in Sci-Fi genre and TV episodes : Star Trek, Roswell,Masters of science fiction, Twilight zone, among them.",
         "One year later we find out intrepid hero (Noah Wylie), an experienced Librarian and his bodyguard is no longer needed. In a nod to Indiana Jones, he brings back the Crystal Skull in the opening sequence before he sets out on his real adventure that brings him into contact with Gabrielle Anwar (\"Burn Notice\", who did manage to turn in such an impressive performance that the Academy of Science Fiction, Fantasy & Horror Films gave her a best supporting actress nomination. What is it with these English heroines? We have a new director and a new writer, but we still go back to England for the love interest. Well, this isn't Body Snatchers, so we won't be seeing her ta tas. I won't reveal the bad guy here because it would spoil it. Besides Indiana Jones, you see bits of The Mummy, and even Casablanca in the movie. It is popcorn fun for fans of those movies and Wylie does a great job.",
         "I have to be completely honest when I say that I never intended to watch this movie at all. My cable provider has TNT right next to Discovery Channel and I thought I was watching a movie about Liberia (I'm a bit of an Africa buff). That being said, I watched a good ten minutes of \"The Librarian\" before I realized it was not a Steve Erwinesqe safari program. That's how persuasive the sets were! My poor reading of TV Guide, and my waning remote control skills, turned out to be a blessing as I was engrossed for a full hour and a half in this wacky adventure story. I am not going to repeat here how awesome Newhart was (duh!), and how much growth we see in Wyle as an actor, but I do want to address head-on the whole Anwar Controversy. Some negative people on this site have hinted that Gabrielle was too skinny. Well have you ever thought that maybe she lost weight for this role on purpose?! Everyone is ready to lavish praise and Oscars on actresses like Hillary Swank who gained 15 pounds of muscle mass for \"Million Dollar Baby,\" or for Rene Zellweger who packed on some baby fat for \"Bridget Jones Diary\" but you all seem ready to pillory Gabrielle for trying her best?! Hasn't anyone here ever tried to LOOSE weight. It's not easy, I can assure you of that. Furthermore, in my studies I have read that the women of the Masia tribe are typically thin and angular, much like Miss Anwar in this film. Perhaps it was her commitment to true character acting (see her portrayal of Mariska in \"If Looks Could Kill - Teen Agent\" if you doubt me) that pushed Gabrielle to \"scale down\" her physique for this unique role. She's a very good actor and no one can take that away from her. I would not be at all surprised to see her next week on the red carpet, back to her normal weight in no time. I do have a bone to pick with this film though, and that bone is the directing. If a film were a skeleton, directing would be a large, important bone like the femur. The cast is the ribcage and the backbone (spine) is the plot. You can have a great plot and a great cast, but if your directing is bad, you've got no femur, and everything is just a little bit off. Simply put Jonathan Frakes drops the ball here. The producers should have stuck with Witner (I went back and saw the prequel). Anyway, it does not sink the film, just something producer Wyle might want to consider for the third episode in this very entertaining series of films. ****SPOILER**** I gave out a hearty chuckle when I finally realized they had completely copied the final scene of \"Casablanca.\" Brilliant! If you didn't catch it the first time, it's worth another viewing. ps - I noticed when I came here to post that the Canadian version of this film is 106 minutes. Could a Canadian fill us in on which 16 minutes of this movie was left on the cutting room floor? Thanks"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Fantasy"
      ],
      "productionCompanies": [
         "Turner Network Television (TNT)",
         "Electric Entertainment",
         "Blue Sky Films"
      ],
      "summaries": [
         "After retrieving the Crystal Skull in Utah, Flynn Carsen receives a map in the mail with the secret location of King Solomon's Mines. When the scroll is stolen, Judson explains the power of the Key of Solomon's book and assigns Flynn to retrieve the map. The map is useless without the legend piece to decipher it, which is located in Volubilis near the Roman ruins in Morocco. Flynn heads to Casablanca to the ruins where he is chased by a group of mercenaries leaded by General Samir. They too want to find the location of King Solomon's mines. Flynn teams-up with Professor Emily Davenport working in the dig and they escape from General Samir and his men. While traveling to Gedi, they save the local Jomo from death and the trio faces a dangerous journey through the wild Africa.",
         "Librarian-turned-adventurer Flynn Carsen endeavors to find King Solomon's mines."
      ],
      "budget": 0
   },
   "movielensId": 53138,
   "movielens": {
      "languages": [
         "Français",
         "العربية",
         "English"
      ],
      "releaseDate": "2006-10-09",
      "dvdReleaseDate": "2006-03-10",
      "directors": ["Jonathan Frakes"],
      "runtime": 92,
      "movieId": 53138,
      "title": "The Librarian: Return to King Solomon's Mines",
      "mpaa": "PG",
      "actors": [
         "Noah Wyle",
         "Gabrielle Anwar",
         "Bob Newhart",
         "Jane Curtin",
         "Olympia Dukakis",
         "Peter Butler",
         "Erick Avari",
         "Hakeem Kae-Kazim",
         "Robert Foxworth",
         "Zahn McClarnon",
         "Lisa Brenner",
         "Jonathan Frakes"
      ],
      "imdbMovieId": "0455596",
      "originalTitle": "The Librarian: Return to King Solomon's Mines",
      "genres": [
         "Fantasy",
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": [
         "YHsqslpgRSw",
         "ansvc2Muxr0"
      ],
      "plotSummary": "After retrieving the Crystal Skull in Utah, Flynn Carsen receives a map in the mail with the secret location of King Solomon's Mines. When the scroll is stolen, Judson explains the power of the Key of Solomon's book and assigns Flynn to retrieve the map. The map is useless without the legend piece to decipher it, which is located in Volubilis near the Roman ruins in Morocco. Flynn heads to Casablanca to the ruins where he is chased by a group of mercenaries leaded by General Samir. They too want to find the location of King Solomon's mines. Flynn teams-up with Professor Emily Davenport working in the dig and they escape from General Samir and his men. While traveling to Gedi, they save the local Jomo from death and the trio faces a dangerous journey through the wild Africa.",
      "tmdbMovieId": 14208,
      "avgRating": 3.2402,
      "releaseYear": "2006",
      "numRatings": 204,
      "posterPath": "/fpedwecERf6PoaNml2Pa8dKncyZ.jpg"
   }
}