{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "farewell",
            "id": 455
         },
         {
            "name": "age difference",
            "id": 965
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "secret",
            "id": 1328
         },
         {
            "name": "sadness",
            "id": 1647
         },
         {
            "name": "coffin",
            "id": 1909
         },
         {
            "name": "funeral",
            "id": 3739
         },
         {
            "name": "gathering",
            "id": 4432
         },
         {
            "name": "surprise",
            "id": 4902
         },
         {
            "name": "lsd",
            "id": 5498
         },
         {
            "name": "studies",
            "id": 5948
         },
         {
            "name": "hallucinogen",
            "id": 6410
         },
         {
            "name": "drug trip",
            "id": 11483
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "arrogance",
            "id": 171070
         },
         {
            "name": "female corpse",
            "id": 189421
         }
      ],
      "imdb_id": "tt0795368",
      "video": false,
      "title": "Death at a Funeral",
      "recommendations": [
         13092,
         12797,
         1262,
         4953,
         67913,
         9388,
         9843,
         401,
         4959,
         19833,
         5236,
         1548,
         10503,
         50204,
         13090,
         623,
         11499,
         8272,
         11439,
         7972
      ],
      "backdrop_path": "/ffXvlcmRhl0F9gyNdvTpFFa4ybt.jpg",
      "revenue": 8,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Daniel",
               "gender": 2,
               "credit_id": "52fe4340c3a36847f8045d1d",
               "name": "Matthew Macfadyen",
               "profile_path": "/2FF3Yjxd7DYR4EIJL6s2GpKDMkJ.jpg",
               "id": 15576,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Jane",
               "gender": 1,
               "credit_id": "52fe4340c3a36847f8045d21",
               "name": "Keeley Hawes",
               "profile_path": "/1gPPMAbUlZG2WexWDc3RzwYeJ1z.jpg",
               "id": 22809,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Howard",
               "gender": 2,
               "credit_id": "52fe4340c3a36847f8045d25",
               "name": "Andy Nyman",
               "profile_path": "/dYke6Bvu3zb4Ea86Fjyjucwrl9.jpg",
               "id": 22810,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Justin",
               "gender": 2,
               "credit_id": "52fe4340c3a36847f8045d29",
               "name": "Ewen Bremner",
               "profile_path": "/7CQBnBHSNDcbY2LucqWqEpKWsCH.jpg",
               "id": 1125,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Martha",
               "gender": 1,
               "credit_id": "52fe4340c3a36847f8045d2d",
               "name": "Daisy Donovan",
               "profile_path": "/fgX6Ps5eT2eFkkdxeA6zOLgP24u.jpg",
               "id": 22811,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Simon",
               "gender": 2,
               "credit_id": "52fe4340c3a36847f8045d61",
               "name": "Alan Tudyk",
               "profile_path": "/6QuMtbD8kmhpwWhFKfNzEvHRLOu.jpg",
               "id": 21088,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Sandra",
               "gender": 1,
               "credit_id": "52fe4340c3a36847f8045d4d",
               "name": "Jane Asher",
               "profile_path": "/vL9Y4ArXO1Q4ctMYw6Q4JEeiiwm.jpg",
               "id": 22969,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Troy",
               "gender": 2,
               "credit_id": "52fe4340c3a36847f8045d5d",
               "name": "Kris Marshall",
               "profile_path": "/tQkd2dD82bMCTqgVSzvhvf410Xy.jpg",
               "id": 7058,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Robert",
               "gender": 2,
               "credit_id": "52fe4340c3a36847f8045d59",
               "name": "Rupert Graves",
               "profile_path": "/erhJMyO6Cuh95TmSTAfQHNfCAi9.jpg",
               "id": 11278,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Uncle Alfie",
               "gender": 2,
               "credit_id": "52fe4340c3a36847f8045d49",
               "name": "Peter Vaughan",
               "profile_path": "/z9ZplbTA1ojYhgZ8kJUKKhsJ7Gs.jpg",
               "id": 386,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "The Reverend",
               "gender": 2,
               "credit_id": "5619dc9fc3a3681c280013b5",
               "name": "Thomas Wheatley",
               "profile_path": "/e9HA0whzyevXWKY6z5Xp1TdRW1L.jpg",
               "id": 10674,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Victor",
               "gender": 2,
               "credit_id": "52fe4340c3a36847f8045d55",
               "name": "Peter Egan",
               "profile_path": "/kmJJEd3MXSXzbRACya76avqSB8w.jpg",
               "id": 16480,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Peter",
               "gender": 2,
               "credit_id": "52fe4340c3a36847f8045d51",
               "name": "Peter Dinklage",
               "profile_path": "/xuB7b4GbARu4HN6gq5zMqjGbkwF.jpg",
               "id": 22970,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Sandra's Friend",
               "gender": 1,
               "credit_id": "58caab1f9251415dbf00d9a9",
               "name": "Angela Curran",
               "profile_path": "/uUzym4tHDSSbAgnydkr8QBAXvP1.jpg",
               "id": 174700,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4340c3a36847f8045d0d",
               "name": "Frank Oz",
               "profile_path": "/aLH5bYwMIlVxCe4rIDaEsVJqDKn.jpg",
               "id": 7908,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4340c3a36847f8045d13",
               "name": "Dean Craig",
               "profile_path": null,
               "id": 22807,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4340c3a36847f8045d19",
               "name": "Laurence Malkin",
               "profile_path": null,
               "id": 22808,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4340c3a36847f8045d33",
               "name": "Diana Phillips",
               "profile_path": null,
               "id": 21342,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4340c3a36847f8045d39",
               "name": "Share Stallings",
               "profile_path": null,
               "id": 22967,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4340c3a36847f8045d3f",
               "name": "Oliver Curtis",
               "profile_path": null,
               "id": 17253,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4340c3a36847f8045d45",
               "name": "Natalie Ward",
               "profile_path": null,
               "id": 22968,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 11.806517,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 2196,
      "vote_count": 650,
      "budget": 9,
      "overview": "Chaos ensues when a man tries to expose a dark secret regarding a recently deceased patriarch of a dysfunctional British family.",
      "similar": [
         8967,
         115,
         185,
         111,
         141,
         334541,
         452507,
         244772,
         277216,
         258480,
         433,
         4723,
         6637,
         1562,
         956,
         10054,
         1607,
         10795,
         8913,
         223
      ],
      "original_title": "Death at a Funeral",
      "runtime": 90,
      "poster_path": "/zV4kwbDckeTMoIsbSt1lsTIZ2in.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Target Media Entertainment",
            "id": 1014,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "VIP 2 Medienfonds",
            "id": 3801,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "VIP 1 Medienfonds",
            "id": 10760,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Parabolic Pictures",
            "id": 1012,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sidney Kimmel Entertainment",
            "id": 737,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Stable Way Entertainment",
            "id": 1013,
            "origin_country": ""
         }
      ],
      "release_date": "2007-02-09",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Last rites... and wrongs.",
      "adult": false,
      "homepage": "http://www.deathatafuneral-themovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Frank Oz"],
      "runtime": 90,
      "synopsis": "The story is set in England and takes place mainly at a family home where Daniel and his wife Jane live with his parents. When the story opens, it is the day of Daniel's father's funeral and, while in the process of organising this event, Daniel and Jane plan to purchase a flat and move away from the parental home. Daniel's brother Robert, a renowned novelist living in New York City, would rather spend his money on a First Class airline ticket to England than help finance the funeral, leaving Daniel to cover the burial expenses. As guests begin to arrive at the family home, where the funeral service is to be held, he struggles to complete a eulogy, although everyone expects Robert the writer will be the one to deliver some appropriate remarks. Daniel's cousin Martha and her fiancé Simon are desperate to make a good impression on Martha's uptight father Victor. Their hopes for doing so are dashed when Martha, hoping to calm Simon's nerves, gives him what she believes is Valium but actually is a designer hallucinogenic drug manufactured by her brother Troy, a pharmacy student. While on the way to the funeral, Simon begins to feel its effect. A dwarf named Peter introduces himself to Daniel, who is too busy to speak to him at that moment and suggests they talk later. None of Daniel's relatives can identify the man. The service begins and the hallucinating Simon, certain the coffn is moving, tips it over, causing the body to spill out onto the floor. During the ensuing chaos, Martha drags Simon outside, where her father forbids her to marry him. When Simon is told why he is reacting as he is, he panics and locks himself in the upstairs bathroom. Martha tries to persuade him to open the door while fending off the unwelcome advances of Justin, with whom she once had a one-night stand that she deeply regrets and would like to forget. When the drug overcomes Simon, he steps out of the window naked and sees Justin kissing Martha. Thinking what he sees reflects mutual feelings, he proceeds to climb onto the roof, where he threatens to jump. Hoping to calm him, Martha reveals she is pregnant with their child. While most of the guests are caught up in Simon's seeming insanity, Peter meets privately with Daniel and Robert and reveals he was their father's lover. Unhappy that he was left nothing in their father's will, Peter reveals photographs that prove his relationship, and attempts to blackmail the family for £15,000. The brothers panic and bind and gag Peter, and to calm him down they give him the hallucinogenic drug they also believe is Valium. Peter manages to free himself, but in his drug-induced state he jumps repeatedly on the sofa before falling and hitting his head on a glass coffee table. Troy and family friend Howard cannot feel a pulse, so they believe Peter to be dead. Forced to dispose of the body as quickly and surreptitiously as possible, Daniel and Robert decide to place it in the casket with their father. The service resumes, and Daniel's awkward eulogy is interrupted when the still very-much-alive Peter leaps from the coffin and the compromising photos fall out of his pocket for everyone, including the widow, to see. Daniel demands everyone stay calm and declares his father was a good man, although clearly one with secrets, and he delivers a loving tribute to the man. That same night after the all the mourners (including Peter) have left, Robert tells Daniel that he plans on taking their mother to New York so that Daniel and Jane can finally get an apartment and live alone like they'd always wanted. Their conversation is interrupted when Jane shows up and tells them that Uncle Alfie will be staying over that night because of his panic attack after having seen Daniel and Robert move the body. She also tells them that she gave him some \"Valium\" (unbeknownst to her it is actually Troy's hallucinogenic), which shocks Daniel and Robert. The scene cuts to a shot of Uncle Alfie on the roof, naked like Simon had been, complaining about how \"everything is so fucking green\".",
      "writers": ["Dean Craig"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0795368/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNjYyODU1NF5BMl5BanBnXkFtZTcwMDk4OTQ0MQ@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Matthew Macfadyen, Peter Dinklage, Ewen Bremner | See full cast and crew »"],
      "reviews": [
         "A midget, hallucinogenic drugs, homosexuality, sibling rivalry, nudity, and a funeral come together in riotous chaotic harmony in Death at a Funeral. The films story unfolds in the span of an afternoon and despite the short duration of plot Frank Oz, directory, endears us to the characters with witty and realistic dialog. What better setting than a funeral to highlight the humor and irony of life? The characters' mourning is completely relatable because it isn't overwrought or melodramatic and is thus all the more genuine. Family turmoil overshadows the funeral and propels the characters into awkward but hilarious situations. The film does not forget it takes place during a funeral and by the end a heartfelt eulogy is delivered in spite of the lunacy surrounding it. The humor is just dry enough to complement the somewhat dark comedy but not so dry that it alienates the audience. I haven't laughed this much at a film in a very long time...especially a film about a funeral.",
         "I went to this screening expecting it to be a serious movie -- you don't expect to be laughing at a movie with both \"Death\" and \"Funeral\" in the title -- but this film was hilarious! It wasn't just me -- the theater was full of people screaming with laughter and clapping at various moments. Alan Tudyk is hilarious every moment he is on screen. Finally this underrated actor has gotten a good-sized part where he can show off his comedy skills. Most of the actors are British and I did not recognize them, but they were excellent. One I recognized was Jane Asher (she was Paul McCartney's girlfriend in the 60s -- he shoulda married her -- she's still alive and she's not a gold-digger). She plays the very composed widow here. (Oddly she has fewer creases on her face than her middle-aged sons.) This film reminded me a bit of \"Four Weddings and a Funeral\", but even more of those British madcap black comedies of the 60s with Alec Guinness or Peter Sellers.",
         "I saw this at a screening and I had a rousing good time. It starts with a chuckle in the opening credits and slowly builds to spotty laughter, belly laughs, and loud groaning silliness. This is British farce with an expert ensemble cast. Everyone hits their marks and a couple go completely overboard and over-broad (Mr. Vaughn, we're looking at you.) Tudyk and Dinklage have the showiest parts and they feast on them. The rest of the cast is inspired and spot on. It's a delightful combination of highbrow meeting lowbrow and everything in between. A dash of wit and charm mixed in with a few genuine surprises. A few old tropes are trotted out but there is a bit of backspin on them. If you want a laugh, go!",
         "I wasn't quite sure what to expect out of this, even though I had enjoyed the trailer in the theater. There had been some comments about cruel humor, which I just didn't see. The story was well structured, with groundwork laid early on for very funny bits much later in the film that got us laughing hard without hitting us over the head with the joke. The moments of comic tension were good, without that excruciating sense that someone was going to be horribly embarrassed, or hurt, or whatever, that American films seem to have. The situation is very well known to everyone who's been to a family funeral, although in America we would have the service in a funeral home or church, and we've all had moments when we want to laugh at the wrong time, or notice something a little out of the ordinary in the service that seems to cry out for comment. My husband, 14 year old daughter and I enjoyed the film immensely, and we all gave it an 8 out of 10, with some good carryover lines to quote amongst ourselves. Go see it, enjoy, and leave the political correctness at home.",
         "I found this to be the funniest movie that I've seen in ages. We saw it today (July 12th) in Herzliya, Israel at the local movie theater at the mall. There were only 8 people in the whole audience, and my husband and I filled the room with howls of laughter. The actors are fabulous, especially Alan Tudyk, Khris Marshall, Andy Nyman, Peter Dinklage, and Daisy Donovan. Actually, the whole ensemble was great. Especially Alan Tudyk keeps his frenetic performance absolutely hysterically funny, throughout most of the film! Free of Hollywood hype, this film was a pleasure. The wackiest Funeral you'll ever witness.",
         "I watched this movie yesterday at a pre-screening in Berlin. Without knowing what to expect I went there with a friend. When we came out of the theater, we've had tears in our eyes - it was just too hilarious! I haven't laughed that much in a movie for quite a while. If you love black-humor, \"Death at a funeral\" is definitely a must-see movie! It's full of bizarre scenes (partly earthy though, nevertheless funny), great cast (especially Alan Tudyk, who's having quite a lot of laughs on his side) and the script is so awesome! Dean Craig has done an excellent job by writing it, Frank Oz by directing one of the year's best comedy movies! You won't regret watching it!",
         "It's been ages since I had such a good time enjoying a movie. While other movies about dysfunctional families are so dramatic and serious, Death at a Funeral makes things brighter and funnier even at a funeral. The characters are not complex, but various - an accidentally drugged men, a hurting widow, a famous writer and his brother who cannot escape the other one's glorious shade, a hypochondric young men, a sever father, a sour old men, a homosexual blackmailer... and much, much chaos. This antithesis between life, with its different forms of manifestation, and death makes Death at a Funeral a juicy mild-black comedy.",
         "It's been a while since there's been a genuinely good British farce, but this one pressed all the right buttons. Memorable performances from Andy Nyman playing neurotic fool Howard and straight man Matthew MacFadyen make this a real crowd pleaser. Comedy is edgy enough for teens to enjoy although overall it will probably appeal to slightly older audiences. It would be great if this could do a Four Weddings. Only downer is the miscasting of the drug dealing brother who seems far too middle class and unrealistic for role. And the 'drug' joke seems to go on a bit. Uncle Alfie is an absolute hoot and script is generally full of some really good gags.",
         "When the subject of great comedies comes up for discussion, this movie must be included. What a funny movie! Normally any movie that includes the word \"death\" in the title is a movie that is implicitly telling the audience to beware, it's going to be morbid. Well, this movie is not only not morbid, it is hilarious, not just in a black-comedy way, but in a straightforward matter that uses a funeral as the basis for generating some very funny scenes. The movie contains no morbidity. Rather, it is like an extended sitcom that portrays various people acting very silly and goofy. Everyone in this movie was funny, and one should not be turned off by the title because although death is a serious subject that should not be treated lightly, the movie really isn't about death at all, but actually about life and how silly and crazy people can act when the situation presents itself.",
         "The laughs begin during the animated credits which prepares the film going public for the buffoonery to follow. Death at a Funeral (DaaF) is directed by Frank Oz. Because of the nature of this film I believe Mr. Oz is paying homage to the late, great, director, Robert Altman, particularly his film A Wedding. Both A Wedding and DaaF are both off beat, extremely, funny, and very non-typical of weddings and funerals, in which they both portray. In tribute to Mr. Altman, Mr. Oz also uses an ensemble cast of well known actors by face but not by name. The audience has seen their work and in this film they most definitely make you laugh. This is an adult comedy with an R rating for adult themes, nudity, recreational drug use, religious issues, postmortem issues, and the absurdity about death. Remember this is an adult comic opera taken to the extreme. At this funeral the mourners may come with their inhabitation's in check but due to the outlandish antics of many of the other grievous members assembled, all of the gathered, loose all claim to sanity. The audience becomes one with the collected zany members of this grieving group. Since the players on film have lost their inhabitation's so to does the audience. Remember this is an adult, knee slapping, laugh out loud farce. This film is outrageously funny, in an adult vein, not intended for children. If you go to a sporting event, after you have paid for your ticket and bought your seat, people around you cheer, yell, scream and sometimes even in funny costumes as well. A film house is the same communally shared type of experience and environment for entertainment but patrons of the silver screen tend to hold their laughter within, as of being afraid of upsetting the patron in the next seat. Is it not time to unshackle this age old concept and enjoy yourself along with others? I am certain that is the reason why Frank Oz made this film, so the audience could laugh and laugh at themselves. I personally want to thank you Mr. Oz for the laughter and the comedy of Death at a Funeral."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Sidney Kimmel Entertainment",
         "Parabolic Pictures Inc.",
         "Stable Way Entertainment"
      ],
      "summaries": [
         "Daniel is a decent young man, married to Jane, still living at his father's home. When his father dies, it is up to him to organize his funeral. On this painful morning, the suitable grave expression on his face, Daniel is ready to welcome his father's friends and relatives. But preserving the dignity inherent in such circumstances will be a hard task. Particularly with an undertaker who botches his work, the return from the USA of his famous but selfish brother, his cousin's fiancé who has accidentally ingested drugs, the presence a moron who takes advantage of the sad event to win back the heart (or rather the body) of a woman who is about to marry another, of a handicapped old uncle who is also the most unbearable pain in the neck. To cap it all, Daniel notices the presence among the mourners of a mysterious dwarf nobody else seems to know...",
         "After Daniel's father passes away, he arranges to contact their extended family and friends, which include an wheel-chair bound grouchy uncle; a self-serving and unsuccessful writer brother; several cousins - some of who are impaired with drugs. Nothing, however, will prepare him for the bizarre incidents that will occur and bring their very parentage into question.",
         "Chaos ensues when a man tries to expose a dark secret regarding a recently deceased patriarch of a dysfunctional British family."
      ],
      "budget": 9000000
   },
   "movielensId": 53956,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-02-09",
      "dvdReleaseDate": "2008-02-26",
      "directors": ["Frank Oz"],
      "runtime": 90,
      "movieId": 53956,
      "title": "Death at a Funeral",
      "mpaa": "R",
      "actors": [
         "Matthew Macfadyen",
         "Keeley Hawes",
         "Andy Nyman",
         "Ewen Bremner",
         "Daisy Donovan",
         "Alan Tudyk",
         "Jane Asher",
         "Kris Marshall",
         "Rupert Graves",
         "Peter Vaughan",
         "Thomas Wheatley",
         "Peter Egan",
         "Peter Dinklage",
         "Angela Curran"
      ],
      "imdbMovieId": "0795368",
      "originalTitle": "Death at a Funeral",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["neCY4hh1wJg"],
      "plotSummary": "Chaos ensues when a man tries to expose a dark secret regarding a recently deceased patriarch of a dysfunctional British family.",
      "tmdbMovieId": 2196,
      "avgRating": 3.70398,
      "releaseYear": "2007",
      "numRatings": 1885,
      "posterPath": "/zV4kwbDckeTMoIsbSt1lsTIZ2in.jpg"
   }
}