{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "space marine",
            "id": 1826
         },
         {
            "name": "sunlight",
            "id": 2725
         },
         {
            "name": "plant",
            "id": 3704
         },
         {
            "name": "space travel",
            "id": 3801
         },
         {
            "name": "saturn",
            "id": 4165
         },
         {
            "name": "biotope",
            "id": 4166
         },
         {
            "name": "greenhouse",
            "id": 4168
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "space",
            "id": 9882
         },
         {
            "name": "food",
            "id": 10637
         },
         {
            "name": "robot",
            "id": 14544
         },
         {
            "name": "space station",
            "id": 156039
         }
      ],
      "imdb_id": "tt0067756",
      "video": false,
      "title": "Silent Running",
      "recommendations": [
         10514,
         830,
         10803,
         8974,
         12101,
         13820,
         11234,
         11850,
         1410,
         10785,
         4923,
         10540,
         31682,
         11935,
         2161,
         11549,
         10176,
         828,
         636,
         20424
      ],
      "backdrop_path": "/yLxNGRQQov8osrNCGPmJzDomJ5f.jpg",
      "revenue": 0,
      "reviews": [
         {
            "author": "DanDare",
            "id": "594322f19251417f570150a1",
            "content": "Silent Running features another unhinged performance from Bruce Dern. He plays Freeman Lowell, a scientists aboard a spaceship looking after the only remaining examples of Earth's plant life as it heads off to Saturn.\r\n\r\nLowell has become attached to the eco-system in the spaceship and less with his crew mates who he kills when they receive orders to destroy the plant life.\r\n\r\nOn his own, alienated, staving off madness, all Lowell has are three droids for company and then his plants start to die as they get less sunlight as the craft nears Saturn.\r\n\r\nDouglas Trumbull in some ways has directed a low fi science fiction film, in some ways the interior sets reminded me of a television series from the early 1970s. It also contains some folk songs to accompany its environmental message.",
            "url": "https://www.themoviedb.org/review/594322f19251417f570150a1"
         },
         {
            "author": "DanDare",
            "id": "594442ec925141400d00158f",
            "content": "Silent Running features another unhinged performance from Bruce Dern. He plays Freeman Lowell, a scientists aboard a spaceship looking after the only remaining examples of Earth's plant life as it heads off to Saturn.\r\n\r\nLowell has become attached to the eco-system in the spaceship and less with his crew mates who he kills when they receive orders to destroy the plant life.\r\n\r\nOn his own, alienated, staving off madness, all Lowell has are three droids for company and then his plants start to die as they get less sunlight as the craft nears Saturn.\r\n\r\nDouglas Trumbull in some ways has directed a low fi science fiction film, in some ways the interior sets reminded me of a television series from the early 1970s. It also contains some folk songs to accompany its environmental message.",
            "url": "https://www.themoviedb.org/review/594442ec925141400d00158f"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Freeman Lowell",
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021ac5",
               "name": "Bruce Dern",
               "profile_path": "/fYhCiXGBARWUevnWDkeCEpwi4h4.jpg",
               "id": 6905,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "John Keenan",
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021ac9",
               "name": "Cliff Potts",
               "profile_path": null,
               "id": 12121,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Marty Barker",
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021acd",
               "name": "Ron Rifkin",
               "profile_path": "/hukx9wydqjFEu3xXToQWln1PMxN.jpg",
               "id": 12122,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Andy Wolf",
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021ad1",
               "name": "Jesse Vint",
               "profile_path": "/yJKMTKJgvoqEdy4ExnJlNjrszVi.jpg",
               "id": 12123,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Drone",
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021ad5",
               "name": "Steven Brown",
               "profile_path": null,
               "id": 12124,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Drone 2/Huey",
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021ad9",
               "name": "Mark Persons",
               "profile_path": null,
               "id": 12125,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Drone 1/Dewey",
               "gender": 1,
               "credit_id": "52fe427ac3a36847f8021add",
               "name": "Cheryl Sparks",
               "profile_path": null,
               "id": 12126,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4279c3a36847f8021a85",
               "name": "Douglas Trumbull",
               "profile_path": "/gBnl4wS6WzKM0egvdtZyBT6L1xs.jpg",
               "id": 12112,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe427ac3a36847f8021a8b",
               "name": "Deric Washburn",
               "profile_path": null,
               "id": 12113,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021a91",
               "name": "Michael Cimino",
               "profile_path": "/pJZY5Ls2l7NihaMkMjHn4Wt1soE.jpg",
               "id": 12114,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021a97",
               "name": "Steven Bochco",
               "profile_path": "/hwvLpSn14uKWHeHgPQXDydpanC2.jpg",
               "id": 12115,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021a9d",
               "name": "Michael Gruskoff",
               "profile_path": null,
               "id": 12116,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021aa3",
               "name": "Marty Hornstein",
               "profile_path": null,
               "id": 2504,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021aa9",
               "name": "Douglas Trumbull",
               "profile_path": "/gBnl4wS6WzKM0egvdtZyBT6L1xs.jpg",
               "id": 12112,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe427ac3a36847f8021aaf",
               "name": "Peter Schickele",
               "profile_path": null,
               "id": 12118,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021ab5",
               "name": "Charles F. Wheeler",
               "profile_path": null,
               "id": 12119,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021abb",
               "name": "Aaron Stell",
               "profile_path": null,
               "id": 8484,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe427ac3a36847f8021ac1",
               "name": "Frank Lombardo",
               "profile_path": null,
               "id": 12120,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 7.698293,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 811,
      "vote_count": 215,
      "budget": 1000000,
      "overview": "In a future Earth barren of all flora and fauna, the planet's ecosystems exist only in large pods attached to spacecraft. When word comes in that the pods are to be jettisoned into space and destroyed so that the spacecraft can be reused for commercial purposes, most of the crew of the Valley Forge rejoice at the prospect of going home. Not so for botanist Freeman Lowell who loves the forest and its creatures, so decides to take matters into his own hands to protect what he loves.",
      "similar": [
         157336,
         871,
         348,
         2103,
         841,
         869,
         2048,
         17431,
         19,
         62,
         95,
         19959,
         19995,
         262543,
         126889,
         8077,
         698,
         395992,
         274870,
         81796
      ],
      "original_title": "Silent Running",
      "runtime": 89,
      "poster_path": "/kyEljmcf7YYmp85BdZffqiuRLfV.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Trumbull/Gruskoff Productions",
            "id": 23276,
            "origin_country": ""
         }
      ],
      "release_date": "1972-03-09",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Amazing companions on an incredible journey...that journeys beyond imagination!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Douglas Trumbull"],
      "runtime": 89,
      "synopsis": "Silent Running takes place in the not-so-distant future, at a time in which Earth's plant life has been decimated. Only a few specimens of flora have been preserved, and are currently in space in a fleet of orbiting greenhouses. Freeman Lowell (played by Bruce Dern) is the main character, one of four extraterrestrial forest rangers aboard the Valley Forge, one of the 2,000 metre-long green house freighters. He is passionately dedicated to preserving the orbiting forests and their natural inhabitants, and eventual returning them to Earth for reforestation of his now-barren planet more so than his crewmates, whose main priority seems to be returning to Earth after their one-year deployment to space. The main conflict comes when Lowell and his crew are ordered to destroy the orbiting greenhouses and redeploy the freighters to commercial service. Lowell decides to disobey orders and save the forests he has worked so hard to preserve. Lowell's crewmates manage to jettison and detonate four of the six greenhouse domes on the Valley Forge. Lowell kills one of his crewmates in a struggle to save the two remaining domes, during which he seriously injures his leg. He then manages to trap the other two crewmen in the other remaining dome, which he then jettisons and destroys. With help from the ship's three robots, Lowell feigns a premature dome detonation to fool his superiors, then alters the orbit of the Valley Forge , redirecting it towards Saturn in an attempt to preserve the last forest dome. Injured and alone with three robots, Lowell programs them to perform surgery on his leg. Still in communication with the rest of the fleet, Lowell is informed that the Valley Forge is on a collision course with Saturn's rings, and there is nothing he can do to stop the catastrophic event. The ship will likely be destroyed. With communications failing due to the distance now between the Valley Forge and the rest of the fleet, the ship passes through the rings of Saturn. While the three robots are outside the ship on maintenance duty, one is blown away from the ship, leaving two remaining robots. The ship, and its single greenhouse dome, emerge undamaged on the other side of the rings. Lowell and the two remaining robots chart a course into deep space, far away from the fleet. Alone except for his accompanying drones, Lowell befriends them and renames them Huey, Dewey and (posthumously) Louie. He teaches them to play poker, plant trees, and bury the killed crewmember. Lowell soon realizes that despite all his efforts, his forest is dying from unknown causes. In a desperate and rushed attempt to save the dome he badly damages Huey in an accident with one of the ship's buggies. Repairs are unsuccessful, the forest continues dying, and Lowell begins to come to realize that his mission to save the forest is bound to fail. After weeks alone in space, faint radio chatter is heard from a rescue party mounted from the Valley Forge's sister ship, the Berkshire, which has located the freighter after a long search. Finally able to communicate with Lowell, they inform him that they will be able to reach him within six hours he must jettison the dome but not detonate the nuclear charge, as it is too dark to do so safely. At this point it dawns upon Lowell that what was killing the forest was lack of sunlight. With little time to work, he activates a series of lights to simulate the sun and instructs his last active robot, Dewey, to \"just maintain the forest.\" Realizing that his crime will be uncovered when the Berkshire finds him, Lowell jettisons the last dome to safety with the words \"take good care of the forest, Dewey.\" With the Berkshire only two hours away from docking, Lowell and the damaged Huey sit facing each other while he arms the last of the six nuclear charges. As he prepares to destroy himself and preserve the last dome, Lowell says to Huey: \"When I was a kid, I put a note into a bottle, and it had my name and address on it. And then I threw the bottle into the ocean. And I never knew if anyone ever found it.\" With that, Lowell destroys the Valley Forge with the last of the onboard nuclear charges. The final scene is of a well-lit forest greenhouse drifting into space, tended by the sole remaining robot with a battered watering can. The scene is accompanied by Joan Baez's rendition of the film's theme song.",
      "writers": [
         "Deric Washburn",
         "Michael Cimino"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067756/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4NjIyMjYwN15BMl5BanBnXkFtZTgwMDk0NjAxMDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bruce Dern, Cliff Potts, Ron Rifkin | See full cast and crew »"],
      "reviews": [
         "Watching Silent Running for the second time, many years later, I was amazed how different it was from my recollection. I remembered a story with a slight environmental message, cute robots that talked and a totally sympathetic lead character played slightly woodenly by Bruce Dern. Seen again, the green message ISN'T subtle, the robots DON'T talk, and far from wholly sympathetic, Dern plays a man suffering a complete nervous breakdown. Not only that, but it has an incongruous, jarring soundtrack by Joan Baez. So, it was a different film to how I'd remembered, but perhaps someway the better. Dern is far from wooden, and gives the performance of a lifetime. Even though this performance was overlooked for an Oscar nomination, it is still remarkable that the film was made at all. Can you imagine pitching this film to a Hollywood exec of the 90's? \"There's this guy who's in his late thirties who looks after a forest in space. There's no love interest, instead the guy is lonely, a little nerdy, socially inept, and kills all his friends in cold blood. The remainder of the film hangs not on tension but on whether or not his plants whither. Oh, and some robots help him out, but they might be psychotic, too\". As a result, Silent Running is utterly unique, and even if not judged as the best sf film ever made, it is certainly one of the most important.",
         "This film doesn't hit you over the head with million-dollar special effects. It doesn't contain action scenes every two seconds for the easily distracted. It just rips your heart out, and makes you think long after the movie is over. It is about isolation, alienation, lost causes, and the inevitable future. In short, it is a genuine science fiction film, not a gunfight covered with techno-glitz and special effects calling itself science fiction. Star Wars is great science fantasy, but the essence of science fiction is about what could happen, and is happening, and by the end of the film we have the disturbing feeling that it is a prediction of the future that will happen without intervention. The feelings of sadness and hope this film evokes are inextricably linked in this film, right up until the end. If you rent this movie, you will be haunted by its images long after you have forgotten other films. Ten out of ten stars; from the writing, directing and acting, right down to the three robot drones (Huey, Dewey and Louie), there is nothing to fault with in this film.",
         "Universal Studios funded several low-budget productions in the early seventies. By far the best to come out of this program was 'Silent Running', an ecologically-minded 'message film' that stands out today as one of the truly great films of the science-fiction genre. Bruce Dern stars as Freeman Lowell, a futuristic Park Ranger minding Earth's last forests, sealed in gigantic domes aboard an equally gigantic freighter in space. When ordered to destroy the domes and return home, Lowell is forced to choose between his crewmates and his beloved forests. The motif of a polluted, or simply, homogenized Earth, the ultimate triumph of human progress over nature and wilderness, is a standard theme of science fiction in the 20th century, and the film is not too different from many other films and episodic television programs seen since the postwar period. Rarely, however, has the theme been explored from the point of view of ecological ethics. The storyline is kept deliberately simple, and asks not the question 'How Would You Act In Such A Position', it merely shows how one particular man might. The characters are given seminal, yet subtle opportunities to flesh themselves out (comments made during meals and card games are particularly noteworthy), and even if the character of Lowell is ultimately dislikeable, he remains oddly sympathetic. Dern produces a remarkable performance here, as a tortured, perhaps even mentally-ill, loner. His work here is still fresh and understated and certainly not of the over-the-top calibre, despite the insistances of some. The film possesses truly amazing visual images, from the spacecraft itself (the decommissioned and soon-to-be-scrapped aircraft carrier Valley Forge) to the domes (an aircraft hanger at Van Nuys Airport) to the unforgettable Drones, uncanny little robots designed around the amputee-actors that give them life. Visual effects are excellent, the direct prototypes of even more fantastical films to come. The music, composed for the film by Peter Schickele (known internationally as P.D.Q. Bach), is by turns boldly triumphant, softly mournful, and is quite effective; some viewers may hate the vocal work of Joan Baez, but she is a logical choice for this production and time period. While many films have suffered since the release of 'Star Wars'(which is NOT, strictly speaking, science-fiction) due to dated visuals and obsolete effects technology, 'Silent Running' is still startlingly clean and visionary. A worthy film for all science-fiction fans to see.",
         "Recently someone asked me what was the best sci-fi movie I'd ever seen. \"Best\"? On what basis -- story, acting, special effects? Generally one would usually choose one of the high-tech, high-priced, superstar biggies. But I had to say \"Silent Running.\" Oh, it has special effects all right, and I think they're good enough for the purpose; I certainly felt the cramped dimness of the station against the vast implacability of space. Maybe you'd say it doesn't have enough action, surprises, or gore. But maybe this story doesn't need them. Then why is it my nomination? Because when it was over, I had to turn off the TV -- couldn't let its mood and memory be violated by a late-nite commercial -- and just quietly weep for its poignancy. Anything less (or more) would have denied it the respect it deserved. If you must, watch it as just more fodder for your entertainment urge. But if your soul is deeper than that... if you can, as Bruce Dern does, put yourself in the place of a character who so cares about the earth and its place in the cosmos ... you'll appreciate the eloquent statement of this film and the way it's presented. A man, not a god. But if it were you, if you were there... would you, COULD YOU do what he did?",
         "I remember first seeing this film on television I think in 1973 and being mesmerized by it. Even though I found the the premise to be absurd (more on that below), the story and movie triumphs regardless. This is flim making at its most brilliant. With the exception of Terrence Malick's \"Badlands,\" I cannot think of a finer directorial debut. It is one of the tragedies of contemporary cinema, that Douglas Trumbull could not find any work as a director for years afterwards. What a loss! The studio completely blew it. The movie. Yes, the premise is incoherent and it has to be dealt with. Sometime in the early years of the next century what is left of America's forests are gathered up and put on space freighters and shipped to . . . Saturn. Why is most unclear. Putting the forest domes in orbit around earth would have made perfect sense. Moreover, the film goes to great lengths to show that the robots are fully capable of tending to them alone so the whole bit about the unhappy human crew is unnecessary. But off to Saturn we go (where the light for the plants -- surprise -- is really bad). I understand that Trumbull was thinking of an alien contact story initially -- I am certain to be going out on a limb on this one -- which seemed to bear some resemblence to the Poul Anderson novella \"Southern Cross.\" The aliens were soon dumped, however. What remained turned out to be an utterly compelling psychological drama of a man alone in space that is unlike any SF movie I have seen (it does bear some similarity to a few Twilight Zone episodes, however). This is an astonishing technical achievement in movie making. Everything about this film works: music, effects, photography, sets, acting, editing, direction, you name it. Folks, this was done for all of one million dollars and is a hundred times more compelling than films that cost a hundred times as much. This is art. This is literature. Get the DVD. Just sit down an watch it. This is a lovely, timeless, piece of work. Then weep because they don't make 'em like this anymore. .",
         "Maybe one of the most moving things about this film is the fact that the drones (small droids) give such powerful performances without ever being able to utter a word. Maybe a \"nod\" in some ways to the days of the silent movie. The environmental message is as powerful today as it was in 1972. An extremely good yet brief film that I felt I had to comment upon it. Enjoyed the hippy theme tune as well just because it fitted right in. These types of film are rare but precious. I remember watching this as a child and it had an impact on me then so I thought I should revisit the piece 20 years later. Absolutely not disappointed.",
         "This film is by no means flawless. Its various problems have been well documented, but I have to say this is a film that stays with you over the years. The ambiance is unique, there is nothing else like it - although everyone else pinched bits of it! The film has a charm way beyond that which it is technically entitled to. If the environmentalism seems laid on with a trowel, remember this film would have been one of the first, if not *the* first, to put such things on the big screen. Subtlety would only work I think, when the audience is already familiar with the basic premise - that concreting over the entire planet is not such a good idea. It has a message beyond the fairly obvious environmental one though - the sheer contentment earned by those who do what is necessary, regardless of the thanks they won't get for it! The hero is not especially smart, but hes still smarter than everyone else. We are used to our heroes being mostly perfect, but where is that written in stone? This is just one bad tempered hippy, who for his crimes, gets followed around the place by a screaming Joan Baez. Notable also for one of the saddest scenes in the history of film - the two droids staring with complete incomprehension at the remains of their friend.",
         "Sometime in the future all the forests on Earth have been destroyed. The last forests are transported in giant greenhouses aboard space ships near the planet Saturn. Freeman Lowell, crew member of the space vessel Valley Forge, is an outsider and the only one who cares about what is left of our planet's nature. When orders reach their vessel to destroy the forests, he goes mad. He kills off the other crew members and starts a lonely odyssey... There's something to be learnt in this movie. More than 30 years old now, it stands the test of time with its message, as mankind is still working on what possibly could end in a scenario like this. Bruce Dern may be overacting in some scenes, but his character is still much more likeable than his crew comrades. Scenery and music are beautiful, fitting well to the dark, moving and unique story. And this is the movie that made \"Star Wars\" possible. Director Douglas Trumbull and other SFX masters like John Dykstra and Richard Yuricich were chosen to work on \"Star Wars\" because of the state-of-the-arts special effects they did for \"Silent Running\". In 1971, they were ahead of their time. In fact, they are easily as good as today's CGI effects, but much more memorable for their time. Even the droids that help Lowell are predecessors of the ones in \"Star Wars\"... A must-see movie for SF fans and everybody interested in Hollywood classics.",
         "I'm not sure if SILENT RUNNING is up there with other sci-fi classics such as FORBIDDEN PLANET, 2001, PLANET OF THE APES or ALIEN but I think that it deserves a mention. It's a typical 70's sci-fi where the earth has experienced some form of Armageddon either through war, a biological disaster, overpopulation, pollution or massive environmental catastrophe. Often with these type of movies you are left scratching your head trying to figure out what happened to the earth and how did they manage to into that mess? The plots can become convoluted and the premises pretty far fetched. Although it is true in this film it never the less is absorbing viewing not least because of Bruce Derns performance and his portrayal of the character Lowell. Again we are years in the future and the earth is void of forests with it's natural habitat. It now only exists in an artificial environment in outer space housed in domes. Bruce Dern as Lowell was well cast in this and is very believable as the odd man out in the crew of the 'Valley Forge' space freighter. The other members of the crew come across as the equivalent of company roughnecks that can't wait to return to the earth whatever it resembles. They are the face of the \"ugly American\" that you would run into in any bar in the USA swigging beer and stuffing their face with hot buffalo wings who would be more interested in NASCAR, college hoops or a pre-season Mets game than anything of real substance or importance. Lowell comes across as eccentric by comparison because he has a soul and is troubled by the companies decision to destroy the last remaining forests, presumably because of cost, what else? Bruce Dern steals the show with his performance. At the beginning he is overbearing as he preaches to his crew mates, yet this is tempered by the viewers irritation towards them with their attitude, ignorance and stupidity . As they mock and make fun of him, Lowell becomes more likable despite his obsessive personality. The viewer begins to despise the rest of the crew and their crass attitude towards their responsibilities, you have little sympathy for them when Lowell decides to sacrifice them for the greater good as he see's it. However, because he has a conscience he is riddled with guilt over their deaths but never the less sees it as the only way to save what is left of the earths natural beauty. In the end you like Lowell, he is kind, is compassionate and is prepared to sacrifice himself to make sure that what is left will survive. Although the special effects are very Gerry Anderson i.e. UFO, THUNDERBIRDS etc and it is all made in a studio it's still an interesting and entertaining watch, it's very colourful with great definition and has been digitally restored. Perhaps a remake should be done, maybe George Clooney as Lowell?",
         "Originally having seen this film years back, all I could remember were a few squatty little robots, some kind of personal crusade, and alot of tears from Bruce Dern. Now, after a few years of having the film in my collection, I'm relieved to say that I recall (know) alot more about the underlying storyline therein. Silent Running is by no means a great science fiction film; it is instead a simplistic story about one man's refusal to destroy that which is dear to his heart, against all odds. What makes this film stand out from others, however, is a combination of great special effects (Trumbull was, of course, mentored by Stanley Kubrick on the set of 2001), a good message and... All of that emotion from Bruce Dern. I must admit that, even after all these years, those tearful moments when Dern breaks down stick in my imagination. Looking for a fabulous, laser blastin', grostesque alien, hyperspace shoot 'em up? Then don't rent Silent Running. However, if you are in the mood for a light, (not too preachy) thoughtful, sci-fi tale of a lonely, one-way journey, check this one out."
      ],
      "genres": [
         "Drama",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Trumbull/Gruskoff Productions"
      ],
      "summaries": [
         "In a future Earth barren of all flora and fauna, the planet's ecosystems exist only in large pods attached to spacecraft. When word comes in that the pods are to be jettisoned into space and destroyed, most of the crew of the Valley Forge rejoice at the prospect of going home. Not so for botanist Freeman Lowell who loves the forest and its creatures. He kills his colleagues taking the ship deep into space. Alone on the craft with his only companions being three small robots, Lowell revels in joys of nature. When colleagues appear to \"rescue\" him, he realizes he has only one option available to him.",
         "The loner crew member of a spaceship harbouring Earth's last nature reserves goes renegade when he is instructed to jettison his beloved forests and return home. Accompanied only by three robots, he ponders the fate of his last pocket of nature and the murders of his fellow crew members in this far-looking speculative film.",
         "Freeman Lowell looks after plants in giant space greenhouses. Back on earth, all the trees have long vanished, so Lowell puts a lot of heart into his work. When orders from earth are received to destroy the greenhouses, Lowell can't go through with it, and cannot persuade his three colleagues to help him save the plants, so he makes other \"arrangements\".",
         "In a future where all flora is extinct on Earth, an astronaut is given orders to destroy the last of Earth's botany, kept in a greenhouse aboard a spacecraft."
      ],
      "budget": 1100000
   },
   "movielensId": 5410,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1972-03-09",
      "dvdReleaseDate": "2003-10-07",
      "directors": ["Douglas Trumbull"],
      "runtime": 89,
      "movieId": 5410,
      "title": "Silent Running",
      "mpaa": "G",
      "actors": [
         "Bruce Dern",
         "Cliff Potts",
         "Ron Rifkin",
         "Jesse Vint",
         "Steven Brown",
         "Mark Persons",
         "Cheryl Sparks"
      ],
      "imdbMovieId": "0067756",
      "originalTitle": "Silent Running",
      "genres": [
         "Adventure",
         "Drama",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "TckJBvl_uT0",
         "4YoJaG-9XZE"
      ],
      "plotSummary": "In a future Earth barren of all flora and fauna, the planet's ecosystems exist only in large pods attached to spacecraft. When word comes in that the pods are to be jettisoned into space and destroyed so that the spacecraft can be reused for commercial purposes, most of the crew of the Valley Forge rejoice at the prospect of going home. Not so for botanist Freeman Lowell who loves the forest and its creatures, so decides to take matters into his own hands to protect what he loves.",
      "tmdbMovieId": 811,
      "avgRating": 3.49791,
      "releaseYear": "1972",
      "numRatings": 955,
      "posterPath": "/kyEljmcf7YYmp85BdZffqiuRLfV.jpg"
   }
}