{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "poker",
            "id": 383
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "cementery",
            "id": 180397
         },
         {
            "name": "cheating at cards",
            "id": 180398
         }
      ],
      "imdb_id": "tt0062626",
      "video": false,
      "title": "5 Card Stud",
      "recommendations": [
         6610,
         198537,
         14710,
         41954,
         202776,
         79921,
         4868,
         67880,
         13847,
         43329,
         35030,
         83099,
         81741,
         43335,
         43884,
         34269,
         92312,
         20153,
         38751,
         1673
      ],
      "backdrop_path": "/jIITeVoAHbuj8Ib5n4yZrdHwQAZ.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "589be2ccc3a3684ce20024bc",
         "content": "When he played he played for blood.\r\n\r\n5 Card Stud is directed by Henry Hathaway and adapted to screenplay by Marguerite Roberts from a novel written by Ray Gaulden. It stars Robert Mitchum, Dean Martin, Inger Stevens, Roddy McDowall, Katherine Justice, John Anderson, Ruth Springford and Yaphet Kotto. Music is by Maurice Jarre and cinematography by Daniel L. Fapp.\r\n\r\nRincon, Colorado and when a gambler is caught cheating at poker, the rest of the players administer frontier justice and hang the man. All except one man that is, Van Morgan (Martin), who tried desperately to stop the lynching. When members of the card school from that night start being killed off, it's clear that somebody is also administering their own brand of retribution justice. Morgan teams up with the new unorthodox preacher in town, Reverend Jonathan Rudd (Mitchum), to try and crack the case.\r\n\r\nI don't think anyone would seriously try to argue that 5 Card Stud is a great movie, but it is a fun picture made by people who knew their way around the dusty plains of the Western genre. Basically a Western take on Agatha Christie's Ten Little Indians, it's a whodunit at the core, but surrounded by Western staples as fights, gun-play, murders, barroom shenanigans and thinly veiled prostitution exist during the run time, while the Durango location photography is most pleasant (TCM HD print is gorgeous).\r\n\r\nIt's not short of flaws, mind. Jarre's musical score is simply odd, I'm not even sure what film genre he thought he was scoring, but it's about as far removed as being in tune with a film as can be. McDowall as a whiny weasel villain doesn't work, the costuming is a bit sub-par and the reveal of the perpetrator is revealed too early. Yet film overcomes these problems because being in the company of Mitchum and Martin brings rewards.\r\n\r\nDino harks back to his Western glory days in the likes of Rio Bravo, and Mitch gets to parody his Night of the Hunter preacher whilst adding six- shooter charms into the bargain. The girls are short changed by the writing, but both Stevens and Justice grace the picture with their presence, and Kotto enlivens a role that quite easily could have been standard fare. A good time to be had with this Poker Oater © 7/10",
         "url": "https://www.themoviedb.org/review/589be2ccc3a3684ce20024bc"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Van Morgan",
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f80789ff",
               "name": "Dean Martin",
               "profile_path": "/jSKT0dtqCaCFccga7bweuwYXQI8.jpg",
               "id": 4299,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Reverend Jonathan Rudd",
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a03",
               "name": "Robert Mitchum",
               "profile_path": "/q8imDThRFNQnfyRxadlBrKzGp4u.jpg",
               "id": 10158,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lily Langford",
               "gender": 1,
               "credit_id": "52fe43ecc3a36847f8078a07",
               "name": "Inger Stevens",
               "profile_path": "/7zmYbdwFkit9Nb6WWEL6XgQqeVZ.jpg",
               "id": 40056,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Nick Evers",
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a0b",
               "name": "Roddy McDowall",
               "profile_path": "/2vwhHtQoICsqrKB5YVzFPiPKtdA.jpg",
               "id": 7505,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Nora Evers",
               "gender": 1,
               "credit_id": "52fe43ecc3a36847f8078a0f",
               "name": "Katherine Justice",
               "profile_path": "/5lcixTfnwYi83trvopNuarFe8Et.jpg",
               "id": 40445,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Marshal Dana",
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a49",
               "name": "John Anderson",
               "profile_path": "/pM45pKyjU1c9nkO087hEr2dCNPw.jpg",
               "id": 19111,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Mama Malone",
               "gender": 0,
               "credit_id": "52fe43ecc3a36847f8078a4d",
               "name": "Ruth Springford",
               "profile_path": null,
               "id": 1091873,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Little George",
               "gender": 0,
               "credit_id": "52fe43ecc3a36847f8078a51",
               "name": "Yaphet Kotto",
               "profile_path": "/qsaWzjzI41EXMldEn6sSp5fnsQ0.jpg",
               "id": 5050,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Sig Evers",
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a55",
               "name": "Denver Pyle",
               "profile_path": "/cnO648FW7r1NQqHZsPkJBACfXal.jpg",
               "id": 6462,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Joe Hurley",
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a59",
               "name": "Bill Fletcher",
               "profile_path": null,
               "id": 152654,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Dr. Cooper",
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a5d",
               "name": "Whit Bissell",
               "profile_path": "/aOe39nPJuZpGYGR3WuRo5PiYGwK.jpg",
               "id": 13786,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Eldon Bates",
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a61",
               "name": "Ted de Corsia",
               "profile_path": "/63mhu9Qa62Viwy9tAdOFL9Spsf.jpg",
               "id": 2097,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Rowan",
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a65",
               "name": "Don Collier",
               "profile_path": null,
               "id": 97478,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Mace Jones",
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a69",
               "name": "Roy Jenson",
               "profile_path": "/swkMoVqkIw3CKTKkIzR2yHEfyF3.jpg",
               "id": 12298,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43ecc3a36847f8078a15",
               "name": "Henry Hathaway",
               "profile_path": "/aHXD9EFWbtftnaBzPYfO2dkLLKd.jpg",
               "id": 37360,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a1b",
               "name": "Maurice Jarre",
               "profile_path": "/yJDDi7RKlxHjb7g8NZTEhnS4drG.jpg",
               "id": 2704,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a21",
               "name": "Daniel L. Fapp",
               "profile_path": "/iVQCNRHUxLnbp6Xs73kSzyXmlmV.jpg",
               "id": 5806,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ecc3a36847f8078a27",
               "name": "Ray Gaulden",
               "profile_path": null,
               "id": 1091870,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe43ecc3a36847f8078a2d",
               "name": "Marguerite Roberts",
               "profile_path": null,
               "id": 39760,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a33",
               "name": "Joseph H. Hazen",
               "profile_path": null,
               "id": 1029442,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ecc3a36847f8078a39",
               "name": "Paul Nathan",
               "profile_path": null,
               "id": 1091871,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ecc3a36847f8078a3f",
               "name": "Hal B. Wallis",
               "profile_path": null,
               "id": 4123,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ecc3a36847f8078a45",
               "name": "James V. King",
               "profile_path": null,
               "id": 1091872,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Western",
            "id": 37
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.822968,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 4993,
      "vote_count": 24,
      "budget": 0,
      "overview": "The players in an ongoing poker game are being mysteriously killed off, one by one.",
      "similar": [
         357096,
         15069,
         984,
         11423,
         8090,
         96,
         979,
         281,
         75780,
         948,
         807,
         281957,
         395834,
         445954,
         3134,
         45569,
         10651,
         2749,
         123109,
         18587
      ],
      "original_title": "5 Card Stud",
      "runtime": 103,
      "poster_path": "/ow1esWlXoRPijAvR6GZQbv0uv9r.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1968-07-28",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "A card cheat was hung... then all hell broke loose!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Henry Hathaway"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Marguerite Roberts",
         "Ray Gaulden"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0062626/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MTM5NDExNl5BMl5BanBnXkFtZTcwMDk3MDYyMQ@@._V1_SY299_CR1,0,214,299_AL_.jpg",
      "actors": ["Stars: Dean Martin, Robert Mitchum, Inger Stevens | See full cast and crew »"],
      "reviews": [
         "Murder mystery westerns don't come along every day, and while this one is kind of slow moving, it's still a great movie. Dean Martin is cool and steady as the gambler who takes part in a game of five card stud that turns deadly. When he tries to stop the lynching of a cheating player, he's overpowered. Soon after the lynching, every one in the game is methodically murdered in the most inventive ways. One man is strangled with barbed wire, another is drowned in a flour barrel, etc. Dean spends the rest of the movie trying to figure out who's doing the killing. While Dean is great, Roddy McDowall is fantastic as the sniveling brother of Dean's girlfriend. He's a mean, cowardly, lying weasel, and no one ever played a weasel better. Yaphet Kotto is fine as the bartender, and Inger Stevens has a small, shining role as the local purveyor of tonsorial delights (a barber). Robert Mitchum comes into the film a little late; while he's straight and true as the scripture-spouting preacher who sweeps out the long abandoned church and begins hold services, you know he's hiding something. All in all a fine film. Maybe a little too long, though; the whole movie doesn't amount to much more than enjoyable entertainment, but the actors and the acting in it make this really worth watching.",
         "Despite his attempt to stop the execution, Van Morgan (Dean Martin) was hit by a gun on his head and thrown out, at night, in the streets of Rincon, Colorado and the clumsy crook was lynched\u0085 Feeling uncomfortable, Van Morgan leaves for Denver the next day \u0085 In the days of his absence, two of the seven card players have been dead, one being drowned in a flour barrel, the other got it with a twist of wire\u0085 For Little George (Yaphet Kotto) who went to see Van in Denver, it looks to him somebody is out to kill every man at that party which is a real good reason for Van to steer clear of Rincon if he is figuring on coming back\u0085 Meanwhile, a gold rush has brought a bunch of outsiders to the town so, on his return, Morgan finds new faces like Jonathan Rudd (Robert Mitchum), the preacher with a Bible in his hand and a Colt in his belt ; and Lily Langford (Inger Stevens), with her elegant barbershop and her gorgeous lady 'barbers.' Robert Mitchum plays the man who is looking for the man who is looking for him\u0085 Tension mounts when Nick Evers (Roddy McDowall) saves the hunter a long hunt\u0085 Dean Martin waits as the gambler who doesn't bank on his cards, because if he does, he winds up broke\u0085",
         "5 Card Stud is a re-make of Dark City which was released in 1950 and was Charlton Heston's feature film debut. Dean Martin is now playing the Heston part and in many ways he's reprising the role he did in Some Came Running. The role of gambler comes natural to him, it was one of many professions Dino tried in his youth before discovering show business. In the original the part Robert Mitchum plays originated with Mike Mazurki. Mazurki had a limited role in Dark City so Mitchum's part has been built up considerably. As always Robert Mitchum is interesting. The original Dark City involved a high stakes poker game in which Don DeFore got trimmed of the rent money and just about everything else. Rather than go home, he kills himself. Soon afterward his psychotic brother goes on a rampage against everyone in that game. It's no suicide here, but a lynching as the victim is caught cheating. If you've seen Dark City than you already know who the murderer is and it's not too hard to figure it out here. In the supporting cast, standing out are Roddy McDowell as the spoiled son of a local rancher who leads the lynch party and Yaphett Kotto who is the bartender in the saloon where the fatal poker game took place. Martin and Mitchum work well together, this is good entertainment.",
         "The corrosion of any sort of quality in the screenwriting of recent decades makes tight plotting a surprise wherever one finds it. Here it is. The ongoing verbal duel between Martin and Mitchum is Shakespeare compared to the posturing of recent tough-guy flicks. Also see Martin's acting in \"Rio Bravo\" to find significant talent in an often-overlooked comic actor.",
         "(It seems that some people are offended by the title of my review because they do not know Agatha Christie's English title of \"and then they were none\" which includes a derogatory world ;could you please delete my first review and put this one instead:it's the same with the American title of Christie's book) Agatha Christie meets western.It's really a whodunit!A cheat is lynched and then someone is doing away with the hangmen,one by one.And like in Christie's classic ,they are guilty and their deaths follow the same pattern:they all die strangled .Murders scenes recall more a thriller than a western .So does Maurice Jarre's music.The cast is perfect with an excellent Roddy McDowall whose character holds a grudge to the whole world.A lot of witty lines add spice to the plot.Dean Martin sings the title song.",
         "It's a film noir/Western/suspense of bizarre beauty and extraordinary performances ; being based on a novel by Ray Gaulden and interesting screenplay by Marguerite Roberts . A card shark is caught cheating, he is taken out and lynched , later on , this engenders several murders . The players in an ongoing poker game are being mysteriously killed off, one by one . A professional gambler (Dean Martin) who attempted to prevent the lynching tries to ensnare the assassin with the aid of a preacher (Robert Mitchum) with a weapon . Suspenseful film dealing with a card player who is lynched by the drunkards he was playing against. Tension from the opening game going on until ending and never lets up , being for Agata Christie aficionados . This is a tremendously exciting story of an obstinate card player and a strange preacher with a gun . It begins as a slow-moving Western but follows to surprise us with dark characters , strong supporting work , solid plot and in whodunit style . The tale is almost grim , a priest comes to a town just in time to make sure its citizenry but later the events get worse . Main cast is frankly magnificent . Sympathetic Dean Martin as as a reluctant card gambler and nice Robert Mitchum as a gun-toting preacher . First-rate Robert Mitchum in similar role and performance to ¨Night of the hunter¨ that was the acting of his life . In addition , Roddy McDowall steals the show as the cynic Nick . Supporting cast is extremely good such as Inger Stevens as Lily Langford , Katherine Justice as Nora Evers , John Anderson as Marshal Dana , Yaphet Kotto as Little George , Denver Pyle as Sig and Whit Bissell as Dr. Cooper , among others . Good Technicolor cinematography by Daniel F. Fapp . Enjoyable musical score ties up a top-notch Western package ; it is composed by the maestro Maurice Jarre . Furthermore , agreeable song by Dean Martin , including lyrics by Ned Washington . Watchable results for this offbeat Western . This well-paced in cracking style flick is compellingly directed by Henry Hathaway and usually works very well , taking a firm grip on the action and suspense . Here he directs efficiently Dean Martin and with strong screen presence by Robert Mitchum , both of whom collaborated in some Western . Hathaway himself was only even nominated for an Oscar , but his movies themselves are testimony to his skills to heighten narrative tension and shoot action so exhilarating it made adrenalin run . He does the human touch and full of insight that accompanied him during most of his films and the story develops pleasantly in a large frame with an interesting plot and fully adjusted to the requirements of the action . Henry was a craftsman who had a long career from the 30s with successful films , and especially Westerns , as ¨Brigham Young¨ and ¨Raw Hide¨ . In his 60s Hathaway still got the vigour to make some fiery movies as ¨From Hell to Texas¨, ¨How the West was won¨, ¨Nevada Smith¨, and ¨Shoot out¨ . He was an expert on Western genre as he proved in ¨True grit¨ , ¨Five card stud¨ , ¨Nevada Smith¨ ,¨How the West was won¨ , ¨Rawhide¨ , ¨Brigham Young¨ , ¨Buffalo Stampede¨, ¨Garden of evil¨ and ¨The sons of Katie Elder¨. Rating : nice Western that will appeal to Robert Mitchum and Dean Martin fans .",
         "There can't be more whodunit westerns out there, which makes 5 card stud unique. The plot is a watered-down westernised version of Agatha Christie's 'Ten Little....whatever', or 'And Then There Were None' to give it it's American title. After a fellow poker player is exposed as a cheat, Van Morgan, (Dean Martin), tries to stop a lynching and only succeeds in getting blindsided by a gun butt for his trouble. The culprit and leader of the lynch mob is Nick Evers, (played by a slightly miscast Roddy McDowall). Unable to go to the town Marshall he opts to leave town instead. It is only when he hears about the killing of two members of the lynching party he becomes suspicious that one of the other poker players are trying to cover their tracks by bumping off the others. Not happy about being a potential target, he returns to town to find the killer, before more deaths occur. Robert Mitchum is the town's new arrival as Reverand Johnathan Rudd. Rudd's a Reverand with a difference, he's just as quick with a gun as he is to pull a quote from the good book. Van immediately takes a liking to this 'Pastor with a Pistol', and to all around he seems a pleasant amiable fellow if not a bit of a religious nut case. With each death, Van knows that his odds of survival are shortening and uncovers the identity of both the killer and the guy who's been tipping him off just in time. Even though Roddy McDowall had been in America for nearly 30 years at this point, he is still just too English to have been cast in a western. This was also not Robert Mitchum's first time playing the mad pastor. He'd done it before in 1955 in the gripping The Night Of The Hunter though his portrayal of Harry Powell in that movie had a more psychotic edge than Rev. Rudd's friendly persona. Dean Martin happily sleeps his way through his role with relative ease, as only he could, and does it with style. However, we're given a love triangle sub-plot with Katherine Justice and Inger Stevens, which isn't really needed and thankfully doesn't detract from the main plot. Another thing worthy of note is the Maurice Jarre penned theme tune sung brilliantly by Dean Martin, in my opinion the best singer of 'em all. However, the closing credit informing the audience that it was Martin singing seemed a little redundant as he had one of the most unmistakable voices in show business. Great Western though a little outdated for the time given that Hang 'em High. The Wild Bunch and Butch & Sundance were it's contemporaries. Enjoy.",
         "\"Garden of Evil\" director Henry Hathaway's western whodunit \"5-Card Stud\" pits 'hellfire gambler' Dean Martin against 'gunfire preacher' Robert Mitchum in a frontier tale about lynching, murder, and revenge. Mind you, deducing the whodunit will pose only a minor challenge for astute audiences. You will spot the actor committing the crimes long before the film identifies him in its second-to-last scene. If you study the stable strangling scene, the killer's headgear reveals his identity. The characters in \"True Grit\" scenarist Marquerite Roberts' screenplay, based on Ray Gaulden's novel, are flat since they change neither their mentality nor their morality. Nevertheless, Roberts boots around a provocative question about \"who people were before they became who they are\" which segues with the mystery. Otherwise, this Hathaway horse opera is sturdy enough, contains a believable cast and knows how to blend comedy with drama nimbly enough so it rarely becomes either heavy-handed or repetitious. Compared with Hathaway's other oaters, \"5-Card Stud\" doesn't top \"True Grit,\" \"The Sons of Katie Elder,\" \"Garden of Evil,\" \"From Hell to Texas,\" or \"Rawhide.\" \"5-Card Stud,\" however, does surpass \"Shoot Out\" and \"Nevada Smith.\" Although some critics didn't cotton to Maurice Jarre's orchestral score and even denigrated it as '\"Dr. Zhivago\" on the range,' I contend it is superb music and differs from anything that Jerry Goldsmith, Elmer Bernstein, or Ennio Morricone would have provided. Jarre's score enlivens the action and enhances the atmosphere. The Dean Martin \"5-Card Stud\" title song marks this sagebrusher as a traditional western. As far back as the 1950s, most major sagebrushers contained a ballad about the story or the hero with lyrics like \". . . play your poke and he'd leave you broke.\" The song here paints a portrait of the protagonist and his poker playing skill. Interestingly, \"5-Card Stud\" makes some racial references that chipped away at the usual barriers. In one scene, Mitchum's gunslinging preacher doesn't think it inappropriate that a black man be buried among whites, something that marked this western as a departure from Jim Crow mentality. John Sturges' \"The Magnificent Seven\" had broken ground earlier with a gunfight so an Indian could be buried in a white graveyard. Professional gambler Van Morgan (Dean Martin of \"Sergeants 3\") takes a break from a Saturday night poker game while Sig Ever's son Nick (Roddy McDowell of \"Planet of the Apes\"), stableman Joe Hurley (Bill Fletcher of \"Hour of the Gun\"), Mace Jones (Roy Jenson of \"Big Jake\"), storekeeper Fred Carson (Boyd 'Red' Morgan of \"Violent Saturday\"),and Ever's ranch hand Stoney Burough (George Robotham of \"The Split\") continue to gamble with newcomer Frankie Rudd (Jerry Gatlin of \"The Train Robbers\") until Nick catches Rudd cheating 'red-handed' and assembles a lynch party. They haul Rudd against his will out to a stream and string him up from the bridge. Barkeeper George (Yaphet Koto of \"Live and Let Die\") warns Morgan, and Morgan lights out after Nick and company to thwart the necktie party. \"You don't hang a cheat,\" Morgan growls, \"you kick him out of town.\" When Morgan arrives, Frankie is swinging with a noose around his neck, and Nick buffalos Morgan on the back of the head with his six-gun. Mama Malone (Ruth Springford of \"Vengeance Is Mine\") discovers Morgan strewn on the boardwalk the following morning and summons George to help the battered gambler to his room. Morgan decides to pull out of Rincon and try his luck in Denver. Before he leaves, he rides out to Sig Ever's spread to bid goodbye to Sig's comely daughter Nora (Katherine Justice of \"The Way West\") and deck Nick as repayment for clobbering him at the hanging. Naturally, the town marshal (John Anderson of \"Young Billy Young\") can neither identify the lynch mob nor can he identify the hanged man. Later, participants in the card game begin to die. One is wrapped up in barbed wire. Another is hanged in the church. Still another is suffocated in a barrel of flour. Indeed, Hathaway and Roberts make each death look different. Eventually, George visits Morgan in Denver and Morgan decides to return to Rincon. Two things have changed since Morgan rode out. First, the town has acquired a gun-toting pastor who renovates the church and holds services. Second, Lilly Langford (Inger Stephens of \"Hang'em High\") has opened a barbershop that features a $20 item that intrigues Morgan when he visits her establishment. Lilly and Nora contend for Morgan, while our hero closes in on the new preacher Jonathan Rudd. \"5-Card Stud\" boasts several good scenes. Hathaway does a good job of staging a shoot-out in the streets of Rincon when paranoid miners go berserk because they fear they may be the next victims of the local serial killer. If you slow down your DVD or VHS copy, Dean Martin loses his Stetson when he seizes an axle to let a wagon haul him out of harm's way. You can see his headgear fall off completely. In the next scene, Martin's hat is back on his head. Nevertheless, it is still a neat gunfight with Morgan and Rudd standing back to back against the opposition. The scene at a windmill where Rudd hits each of the windmill blades because he was aiming at the spaces between the blades is fun, too. George plays a role in the story and provides his buddy Morgan with a clue to the killer's identity. The animosity between Nick Evers and Van Morgan is feisty throughout the action with Nora trying to do her best to dampen it. Van Morgan and Lilly have some amusing banter. The expository scenes about Nick's childhood almost make his character marginally sympathetic. Indeed, \"5-Card Stud\" is no classic, but it is good enough for a rainy day.",
         "Probably wouldn't have stuck with this one if I didn't know Robert Mitchum was showing up eventually but it ended up getting a lot better as it went on. The plot was interesting and I liked the way they didn't reveal the killer in a sensational twist seeing as most people would have worked it out by then. A good example of suspense being better than surprise. That being said the structure of the film was a bit loose, It spent a lot of time on things that didn't really have any importance to the story when I thought it could have spent more time establishing certain characters motivations and relationships and I thought sometimes the snappy style dialog was a bit stilted. Some of the acting was also a bit awkward. It was only about a third to about a half way through the movie that I decided I liked it but in the end it was quite enjoyable and once again Mitchum was awesome",
         "Not a bad movie. Robert Mitchum and Dean Martin pull this one off pretty good. There are a few flaws in the plot but it all works out in the end. It's a good popcorn movie to watch when you have nothing to do. Besides the mild violence, I think your kids could watch this one with you as a family movie. Roddy McDowall plays the whinny little weasel perfect. You hate him from the start to the ending, and can't wait for him to get his. And this is what a great actor can make you feel. And Inger Stevens plays the temptress so well. How could anyone not fall for a beautiful woman like her? She could make a good man go bad, and a bad man blush. So break out the popcorn, sit backs and don't expect too much, and you might have a smile on your face after the movie."
      ],
      "genres": [
         "Western",
         "Mystery"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "After a card shark is caught cheating, he is taken out and lynched by the drunkards he was playing against. Soon afterwards, the men who were in the lynch mob start being murdered, one after another; all by hanging, strangling, or smothering. Who will be killed next and who is responsible? Is it one of the original party seeking to cover their accursed deed, or perhaps the mysterious Rev. Jonathan Rudd, who has recently arrived in town?",
         "Gambler Van Morgan runs a little card game in town but one night things get out of hand. A stranger amateurishly tries to cheat and, though Morgan tries to stop it, his fellow players string him up. The gambler leaves town but returns when he hears that the other players are being killed off one by one. It could be that someone will soon be after him too.",
         "The players in an ongoing poker game are being mysteriously killed off, one by one."
      ],
      "budget": 0
   },
   "movielensId": 5429,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-07-28",
      "dvdReleaseDate": "2003-05-13",
      "directors": ["Henry Hathaway"],
      "runtime": 103,
      "movieId": 5429,
      "title": "5 Card Stud",
      "mpaa": "",
      "actors": [
         "Dean Martin",
         "Robert Mitchum",
         "Inger Stevens",
         "Roddy McDowall",
         "Katherine Justice",
         "John Anderson",
         "Ruth Springford",
         "Yaphet Kotto",
         "Denver Pyle",
         "Bill Fletcher",
         "Whit Bissell",
         "Ted de Corsia",
         "Don Collier",
         "Roy Jenson"
      ],
      "imdbMovieId": "0062626",
      "originalTitle": "5 Card Stud",
      "genres": [
         "Action",
         "Western",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "0NFRsdAtPwE",
         "OouIqvU6Uj4"
      ],
      "plotSummary": "The players in an ongoing poker game are being mysteriously killed off, one by one.",
      "tmdbMovieId": 4993,
      "avgRating": 3.00806,
      "releaseYear": "1968",
      "numRatings": 62,
      "posterPath": "/gev2WX8alGl0f7Ql0JZfeOY8uDg.jpg"
   }
}