{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jules verne",
            "id": 385
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "exotic island",
            "id": 911
         },
         {
            "name": "hot air balloon",
            "id": 3497
         },
         {
            "name": "giant insect",
            "id": 7035
         },
         {
            "name": "giant bird",
            "id": 7038
         },
         {
            "name": "stranded",
            "id": 9743
         },
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "marooned",
            "id": 10792
         },
         {
            "name": "pirate",
            "id": 12988
         },
         {
            "name": "giant animal",
            "id": 158252
         },
         {
            "name": "escaped prisoner",
            "id": 169271
         },
         {
            "name": "american civil war",
            "id": 179585
         },
         {
            "name": "captain nemo",
            "id": 191409
         },
         {
            "name": "volcanic island",
            "id": 239713
         },
         {
            "name": "ammonite",
            "id": 239731
         }
      ],
      "imdb_id": "tt0055207",
      "video": false,
      "title": "Mysterious Island",
      "recommendations": [
         831,
         28763,
         18158,
         17897,
         43715,
         50425,
         11940,
         34276,
         15515,
         18784,
         68163,
         74719,
         28893,
         29570,
         35002,
         31604,
         31283,
         27179,
         33076,
         3483
      ],
      "backdrop_path": "/iZ7cuT59n2NGxc96Rr4ve9YiqEG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Capt. Cyrus Harding",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2507",
               "name": "Michael Craig",
               "profile_path": "/soRvhopKFqdkkJajp1psrw3KTJ5.jpg",
               "id": 25536,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Gideon Spilitt",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2513",
               "name": "Gary Merrill",
               "profile_path": "/zmZqg96QgZgm5hOgpy627DFIiii.jpg",
               "id": 10608,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Herbert Brown",
               "gender": 0,
               "credit_id": "52fe47b19251416c750a250f",
               "name": "Michael Callan",
               "profile_path": "/k8q7kwNVOV2IqfOx0G9hoEGDyx8.jpg",
               "id": 30928,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Elena Fairchild",
               "gender": 1,
               "credit_id": "52fe47b19251416c750a251b",
               "name": "Beth Rogan",
               "profile_path": "/jggh00s98oiCQTHNdJkozLipo0q.jpg",
               "id": 119587,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lady Mary Fairchild",
               "gender": 1,
               "credit_id": "52fe47b19251416c750a250b",
               "name": "Joan Greenwood",
               "profile_path": "/o8cxWwGtJtpJ6FqsWyLd9P0Iz0O.jpg",
               "id": 45466,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Sgt. Pencroft",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a251f",
               "name": "Percy Herbert",
               "profile_path": "/5ZUj6cyhZ237SbeyF5fwAv2jvjD.jpg",
               "id": 33220,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Cpl. Neb Nugent",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2523",
               "name": "Dan Jackson",
               "profile_path": "/wgFxfcJdN7Q1g8YBbMPuGnAw0K0.jpg",
               "id": 119588,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Captain Nemo",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2517",
               "name": "Herbert Lom",
               "profile_path": "/85tCjSGBH778wpycsIDb7mxhZia.jpg",
               "id": 14503,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47b19251416c750a24eb",
               "name": "Cy Endfield",
               "profile_path": null,
               "id": 76882,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b19251416c750a24f1",
               "name": "John Prebble",
               "profile_path": null,
               "id": 76884,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b19251416c750a24f7",
               "name": "Daniel B. Ullman",
               "profile_path": null,
               "id": 103382,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b19251416c750a24fd",
               "name": "Crane Wilbur",
               "profile_path": "/ou3qil42C78krnQtobNwGZfjho9.jpg",
               "id": 84940,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2503",
               "name": "Jules Verne",
               "profile_path": "/cFBorm2GCm2UKHQjg0IlRPnI8wh.jpg",
               "id": 2088,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2529",
               "name": "Wilkie Cooper",
               "profile_path": null,
               "id": 20397,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b19251416c750a252f",
               "name": "Charles H. Schneer",
               "profile_path": "/2HUfWC6uXFy7ed3eciHwORt6aVm.jpg",
               "id": 66759,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5412fc8c0e0a26731400134f",
               "name": "Bernard Herrmann",
               "profile_path": "/nuGwEH9lJIBTEzsmB4bGDgJ9qgj.jpg",
               "id": 1045,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5412fc9fc3a3682f55001470",
               "name": "Frederick Wilson",
               "profile_path": null,
               "id": 19245,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5412fcaec3a3682f6800145c",
               "name": "William C. Andrews",
               "profile_path": null,
               "id": 1078629,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5412fcbe0e0a26730d0014bb",
               "name": "Ray Harryhausen",
               "profile_path": "/nxsvHuPnWQBFuGOq6Gs100kh74R.jpg",
               "id": 66758,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 2,
               "credit_id": "5a5f96269251415a2e005e7b",
               "name": "Raymond Anzarut",
               "profile_path": null,
               "id": 21780,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5a5f96500e0a2650a3005e34",
               "name": "Robert Sterne",
               "profile_path": null,
               "id": 1371059,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5a5f965e0e0a2650a500622e",
               "name": "René Dupont",
               "profile_path": null,
               "id": 57261,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "5a5f96b10e0a2650a3005ea7",
               "name": "John Cox",
               "profile_path": null,
               "id": 12246,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 2,
               "credit_id": "5a5f96be9251415a5b005889",
               "name": "Peter Handford",
               "profile_path": null,
               "id": 1713005,
               "department": "Sound",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "5a5f96dbc3a3687766005c31",
               "name": "Bob Jones",
               "profile_path": null,
               "id": 13323,
               "department": "Sound",
               "job": "Sound Recordist"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 3.60535,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 18993,
      "vote_count": 46,
      "budget": 0,
      "overview": "During the US Civil War, Union POWs escape in a balloon and end up stranded on a South Pacific island, inhabited by giant plants and animals. They must use their ingenuity to survive the dangers, and to devise a way to return home. Sequel to '20,000 Leagues Under the Sea' .",
      "similar": [
         10204,
         5925,
         2270,
         22,
         49529,
         198663,
         294254,
         286217,
         58,
         285,
         10488,
         2501,
         264644,
         14043,
         1408,
         2897,
         16998,
         20815,
         115348,
         6646
      ],
      "original_title": "Mysterious Island",
      "runtime": 101,
      "poster_path": "/gTHr5r7Ei5EZJj2I64R1hQQNEHk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Ameran Films",
         "id": 8488,
         "origin_country": ""
      }],
      "release_date": "1961-12-18",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "A world beyond imagination! Adventure beyond belief!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Cy Endfield"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "John Prebble",
         "Daniel B. Ullman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0055207/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzNTMxMDIxNV5BMl5BanBnXkFtZTcwNDI4NjMyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Craig, Joan Greenwood, Michael Callan | See full cast and crew »"],
      "reviews": [
         "Forget the Harryhausen special effects. What really makes this movie great is the dress the main female character wears. It's incredible! We are introduced to the dress like this: our heroes (escaped POWs) are stranded on a desert island filled with gigantic animals. At some point, two women (aunt and niece if I recall) wash onto shore, after surving a ship accident. The aunt decides to make her niece a new dress, because her old one is all torn up. So she constructs a dress out of leather, and HOLY &@$%#!* what a dress! I don't fully understand why she would make a dress like that, being from the conservative 1860's Midwest and all, but it is the most erotic dress I have ever seen. It's so tiny and skintight, it looks like she can't bend over or it would explode into a million pieces. I spent the entire movie leaning forward in rapt attention, because it honestly looks like it is going to tear apart at any moment. Wow! The rest of the movie is pretty good, too. The special effects are wonderfully fun. The only really annoying thing is the stupidity of the characters. Case in point: after encountering a giant crab and a giant chicken, a guy and the girl (still looking great in that dress!) wander into a cave, and see giant honeycomb. \"Hmm, interesting,\" they say. Then they hear this buzzing sound, and wonder what it is. \"What's that buzzing noise?? It's getting closer...\" I don't believe it is humanly possible to be that stupid. It's GIANT BEES, you idiots! Get out of there! Oops, too late. Now a colossal bee is cornering you. Didn't see that one coming, huh? Worth watching for the FX and the dress. 8/10 stars.",
         "This film starts off with adventure and rarely ever lets up. Starting off with a daring hot air balloon escape by Union prisoners from a Confederate prison camp through a treacherous storm which blows them off course until eventually they land on a mysterious island full of strange giant creatures such as a giant crab, a giant bird and giant bees. These creatures are magnificently brought to life by stop-motion master Ray Harryhausen. This one will appeal mostly to those young in heart and spirit. Herbert Lom is quite good in his role as Captain Nemo, a man trying to find a means of destroying the causes of war. Also has a wonderful score by Bernard Herrmann. Great fun.",
         "This is a nice, satisfying telling of the Verne story, with special effects by Ray Harryhausen and a good score by Bernard Herrman. Escapees from a Civil War prison camp are blown way off course in a balloon they stole. They find themselves on an apparently deserted island somewhere in the Pacific, are joined by two women who were shipwrecked, and eventually come face-to-face with Captain Nemo and the wrecked Nautilus. They have to deal with pirates, an erupting volcano and Harryhausen's creature threats. These include very large versions of a hungry red crab, an aggressive chicken (or dodo), a bee and an unhappy squid. Some of the creatures turn out to be very good boiled or roasted. The movie holds up well because of a strong story, good action, and fairly well-defined characters. It features Herbert Lom, in my view an under-rated actor, and Joan Greenwood. By this time Greenwood was taking character parts and doing a lot of stage work. But from the mid-Forties to the mid-Fifties she was, I think, one of the sexiest, smartest actors Britain has ever produced. Her plummy, smoky voice is inimitable.",
         "Harryhausen crossed Jules Verne with King Kong in his version of Mysterious Island, giving the author's Civil War castaways something really mysterious to look at for a change. The result is a Skull Island-style adventure with a nifty 19th century set-up, and one of the stop-motion maestro's most satisfying films. Harryhausen movies are at their best when Harryhausen is unabashedly the star\u0097-as he is here in Mysterious Island. From this high-water mark in the early Sixties, Harryhausen's films slowly began to shipwreck on two constantly reiterated movie-making clichés. First, writers began to tell Harryhausen that his effects ought to be better integrated into the overall plot, that they ought not to be isolated set pieces sprinkled through the picture like plums in a fruitcake. Secondly, critics continued to repeat the old film music legend that movie scoring is best when it fades unnoticed into the background. Both of these old saws were, in fact, horrible lies. And Mysterious Island is great because Harryhausen and his composer were still refusing to take any notice of them. The effects sequences in Mysterious Island aren't plums in a fruitcake, they're solos in a symphony, they're like the soliloquies in Shakespeare. And Bernard Herrmann's scoring for these episodes is in your face\u0085as it should be. It jumps up and screams \"THIS IS A SET-PIECE\u0085AND A GREAT ONE. KICK BACK AND ENJOY IT!\" And this, once again, is as it should be. The truth is, that stop-motion isn't an effects technique. It's an art form. If you can't enjoy it for it's own sake, then you can't enjoy it. Every attempt Harryhausen later made to \"integrate\" his stuff just encouraged people to take it seriously--as a serious attempt, that is, to duplicate reality. Which it isn't. We go to a Harryhausen film for Harryhausen, just as we go to a Chaplin film for Chaplin. If you came in for some other reason, then you picked the wrong movie. That said, Mysterious Island really does work, I think, as a 60s \"Jules Verne\" picture. The period atmosphere is some of the best in any of those movies and the interesting Nautilus variation we see here is fun to look at in its own right. The acting is quite good also, and Cy Endfield is one of the better Harryhausen directors. But the Verne elements are really just the frame around the picture. Like I said, go for Ray's monsters--then go out and tell the world.",
         "While most critics, and fans alike, consider Harryhausen's \"Jason and the Argonauts\" (released two years later) to be the apex of the special effects master's career, \"Mysterious Island\" stands as one of his best, also. Loosely based on the Jules Verne 19th century novel, the film boasts some memorable special effects wizardry: an awesome escape from a Confederate prison via balloon, the giant crab, the prehistoric \"chicken,\" the bees, and a cool Nautilus - closely resembling Disney's version from \"20,000 Leagues Under the Sea.\" The cast is good, beginning with Michael Craig as the leader of the band of island dwellers. Gary Merrill, who at once was the husband of legend Bette Davis, as well as her co-star in \"All About Eve,\" is effective as the war correspondent that serves as the voice of reason among the band, along with being the group's cook. Herbert Lom does a great \"Nemo,\" significantly different from James Mason's interpretation in the Disney classic. English actress Joan Greenwood is appropriately aristocratic as \"Lady Fairchild.\" But, it is Harryhausen's effects, along with Bernard Herrmann's brilliant score, that elevate this to one of the best fantasies of the 60's. Filmed at a brisk pace, the story never lets up, keeping the viewer captivated until the thrilling conclusion.",
         "Mysterious Island is a very political movie as it progresses, which is a sign of the times as opposed to the very traditional Journey to the Center of the Earth which was released just two years earlier. While Journey to the Center of the Earth was absolutely magical, Mysterious Island is explosive and dynamic. The magic is on hand, with wondrous shots and music to go along with the island's flora and fauna. The movie is also extremely charismatic. Michael Craig is too good to be true as the lead, Captain Cyrus Harding, but he has a hard edge that gets respect. The supporting players, especially Gary Merrill and Percy Herbert, more then pull their weight. Merrill's role reminds me a little of Dr. Smith from Lost in Space, and Percy Herbert is a gas as Pentcroft. Neb's character is treated like one of the gang, although I believe that Union regiments in the Civil War were either all white or all black so it is somewhat unrealistic. Indeed, how the character's mix together for the good of all is a hallmark of the movie. The strengthening of Michael Callan's character seems to be a major plot point but it gets lost along the way and is moot when Nemo shows up. Beth Rogan is sexy as Elena and the Lady Mary Faichild character ( I can't remember the actresses' name) shoots the movie full of musky, female intensity. The special effects are brilliant and (I hate to keep harping on it) blow away the \"movie within a movie\" digital nonsense of today. The bees are worth the price of admission alone and the movements of the crab are top notch. When Nemo arrives, the movie gets so political that I feel that I'm back in college. Herbert Lom is a little too snitty for me as Nemo but he's a cool guy and is great in other things so I accept him. The music is absolutely awesome and is one of my favorite musical scores of all time. A grossly underrated movie overall that is clearly meant to manipulate at the end. Along with Journey to the Center of the Earth, this movie would look incredible back on the big screen.",
         "Schneer and Harryhausen team up to create a film that has all the allure and adventure of Kong's Skull Island. It's a war story, an adventure and a fantasy all in one. Each scene is gripping and doesn't really slow down for me until the introduction of Capain Nemo. I wish the film had taken a different direction at that point, but I realize that it was a necessary part of the story to include him. If only the contestants on \"Survivor\" had it so good! With the boiled crab, fresh oysters and BBQ chicken, who needs take-out? And the girl's outfit is just as skimpy; several years ahead of Raquel Welch in \"One Million Years BC.\" This movie is everything that \"The First Men in the Moon\" is not. It has mood and atmosphere that is lacking in the fore-mentioned movie. I thoroughly enjoyed this movie. It succeeds on the strength of its story and is only enhanced by the wonderful Harryhausen creations, wisely spaced evenly throughout the movie. I only offer one word of advice: climbing to the rim of an active volcano is never a good idea. But, what the heck, the climb was worth the goat's milk!",
         "Wow, I loved the \"Seventh Voyage of Sinbad\" as a kid, the cyclops, the giant roc bird, the skeleton fight, etc. and then the team of Charles Schneer and Ray Harryhausen did it again with the great film \"Mysterious Island\". I don't know if Island topped Sinbad, but I loved both of those films in equal amounts. How about the musical score of Bernard Hermann....right from the start that pounding, intense musical score, you knew this film would be so good. Loved the scenes of the escape from the confederate prison camp and the photography of the 4 men who fought with all they had to stay tucked inside the hot air balloon as it blew out of control over uncharted territories. Landing on an uncharted island they became a Robinson Crusoe foursome and set up a camp and foraged for food. How lucky they were to stumble onto a giant, and I mean giant rock lobster to feed the men for weeks and a giant bird who supplied a tasty bird dinner. Also two saucy women shipwrecked to add spice to the film as they provided companionship and love for one of the men. Throw in pirates, a floating trunk of weapons, monsters to fight, a cave hidden in a mountain, giant bees, the discovery of Captain Nemo and his hidden nautilus submarine anchored in the cave while he plotted a new scheme to provide food for mankind with experiments that produced the giant creatures, you were thoroughly entertained for two hours. Then check out the underwater scenes with the fight from a giant squid, reminiscent of the Disney classic \"Twenty Thousand leagues under the Sea\" and home made sea shell \"aqua lungs\" to breathe under water.....wow! I just loved this film as a kid and now at age 60 I still love this film and watch it a few times a year on DVD. Believe it or not the first time I saw this film as a kid was in 1963 at a Saturday afternoon matinée along with \"Seventh Voyage of Sinbad\"...my brother and I were mesermized by two such great films. The great English actor Percy Herbert with an accent as a captured confederate prisoner was a gem. Gary Merrill as a union war correspo dent plays the role of the so called cook in the film with his goofy shenanigans....Herbert Lom another underrated English actor with a stellar performance as Captain Nemo. Michael Craig as the captain of the so called \"crew\" with a tough disposition to follow as the leader of the group. Great entertainment for all ages.",
         "This is a splendid adventure story from the Schneer-Harryhausen team, adapted freely from the Jules Verne novel. A group of union soldiers in a Confederate prison hijack a weather balloon during a storm, which, due to some very strange climatic conditions, takes them across the United States and over half the Pacific ocean. Miraculously, they land on an island, where they soon encounter, among other things, a giant crab, bees the size of cows, and a smoking volcano. The story is too good to give away, and much of the pleasure of the film is the way it unfolds, chapter by chapter, as it were, without seeming episodic or forced. Harryhausen's stop-motion creatures are breathtaking, and movie is overall beautiful to see, very imaginative, managing to walk a fine line between the fantastic and the realistic, with just enough artifice in some of the exterior shots to make it seem larger than life, but not so much as to come off as contrived. Director Cy Enfield deserves his share of credit for keeping the focus on the story, not the effects, and maintaining a deliberate pace. The script could be wittier, though its plainness makes the movie suitable for children.",
         "My favorite Harryhausen film, and for that matter, one of my favorite movies ever. Even when the excellent stop-motion monsters aren't on screen, the film is fun to watch and well-paced. And when they ARE on screen... whoa! The giant bird is the best. And the Herrmann score is absolutely one of the finest adventure movie soundtracks ever written. \"Contact with my own species has always disappointed me. Solitude gives me a freedom of mind and an independence of action.\" -Captain Nemo"
      ],
      "genres": [
         "Adventure",
         "Family",
         "Sci-Fi",
         "Fantasy"
      ],
      "productionCompanies": ["Ameran Films"],
      "summaries": [
         "During the US Civil War, Union POWs escape in a balloon and end up stranded on a South Pacific island, inhabited by giant plants and animals. They must use their ingenuity to survive the dangers, and to devise a way to return home. Sequel to '20,000 Leagues Under the Sea'.",
         "In 1865, during the siege of Richmond, Virginia, Union soldier POWs Captain Harding, Neb and Herbert escape in a balloon during a hurricane with two confederate prisoners, Sergeant Pencroft and journalist Spilett. The storm takes the balloon to a mysterious island near New Zealand in the South Pacific. Captain Harding proclaims himself leader of the group and they look for food. They discover that they are stranded on an island and soon are attacked by a giant crab that becomes their first meal. In the following days they build themselves shelter and find the island inhabited by other giant animals. One day they find two castaways on the beach: the aristocratic Lady Mary Fairchild and her sexy niece Elena. Later they find a trunk with weapons and a sextant and then they find the hut and journal of a man once marooned on the island by pirates. When pirates later return to the island, the castaways are surprised to be helped by Captain Nemo of the legendary submarine Nautilus. (Nemo -- notorious for his war against slavery -- was supposedly sunk and gone missing eight years earlier.) Finally, when a volcano threatens to obliterate their island, all must plan an escape.",
         "As the war between the States is coming to an end, an imprisoned Union captain, two other prisoners, a confederate soldier and a civilian newspaperman escape in a hot air balloon. Strong winds carry the across the country and out over the Pacific where they eventually land on what at first appears to be an uninhabited island. They are soon joined by two women, survivors of a pirate attack. While they manage to make a home for themselves, they have to deal with extraordinarily large animals including a giant crab and giant bees. The giant fauna is the result of experiments by Captain Nemo who has lived on the island aboard his crippled submarine, the Nautilus, for eight years. They also have to deal with an active volcano and time is short if they are to leave the island before it explodes.",
         "The film bears little resemblance to the original Jules Verne novel. The characters have the same names and there's a granite house and that's about it. The film, for all its \"issues\" is more fun than the book, which runs nearly 700 pages and is slow and plodding.",
         "During the Civil War a group of Union soldiers and two Confederates escape the stockade using a hot air balloon and end up on a strange Pacific island."
      ],
      "budget": 0
   },
   "movielensId": 5830,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1961-12-18",
      "dvdReleaseDate": "2002-10-29",
      "directors": ["Cy Endfield"],
      "runtime": 101,
      "movieId": 5830,
      "title": "Mysterious Island",
      "mpaa": "",
      "actors": [
         "Michael Craig",
         "Gary Merrill",
         "Michael Callan",
         "Beth Rogan",
         "Joan Greenwood",
         "Percy Herbert",
         "Dan Jackson",
         "Herbert Lom"
      ],
      "imdbMovieId": "0055207",
      "originalTitle": "Mysterious Island",
      "genres": [
         "Fantasy",
         "Science Fiction",
         "Adventure"
      ],
      "youtubeTrailerIds": ["zZXIZKqm1pE"],
      "plotSummary": "During the US Civil War, Union POWs escape in a balloon and end up stranded on a South Pacific island, inhabited by giant plants and animals. They must use their ingenuity to survive the dangers, and to devise a way to return home. Sequel to '20,000 Leagues Under the Sea' .",
      "tmdbMovieId": 18993,
      "avgRating": 3.46269,
      "releaseYear": "1961",
      "numRatings": 201,
      "posterPath": "/gTHr5r7Ei5EZJj2I64R1hQQNEHk.jpg"
   }
}