{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dc comics",
            "id": 849
         },
         {
            "name": "superhero",
            "id": 9715
         },
         {
            "name": "based on comic",
            "id": 9717
         },
         {
            "name": "super power",
            "id": 33637
         }
      ],
      "imdb_id": "tt0902272",
      "video": false,
      "title": "Justice League: The New Frontier",
      "recommendations": [
         30061,
         76589,
         17445,
         22855,
         45162,
         13640,
         56590,
         103269,
         15359,
         13851,
         69735,
         217993,
         166076,
         65291,
         43641,
         19323,
         251768,
         183011,
         40662,
         297556
      ],
      "backdrop_path": "/qkdmZFwy8wTGEHgPAS1HX2lOdK6.jpg",
      "revenue": 5231128,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Hal Jordan / Green Lantern (voice)",
               "gender": 2,
               "credit_id": "52fe45c29251416c7506183d",
               "name": "David Boreanaz",
               "profile_path": "/66AnFnTXGGKBnDxZxFca0RfMFi6.jpg",
               "id": 25934,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Barry Allen / The Flash (voice)",
               "gender": 2,
               "credit_id": "52fe45c29251416c75061841",
               "name": "Neil Patrick Harris",
               "profile_path": "/3GJBcsLf6Kfy0x5DeSXKsIqcctP.jpg",
               "id": 41686,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Carol Ferris (voice)",
               "gender": 1,
               "credit_id": "52fe45c29251416c75061845",
               "name": "Brooke Shields",
               "profile_path": "/zOyzH2LjJ3CbzpiJcAmpsiC7d1O.jpg",
               "id": 15110,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Batman (voice)",
               "gender": 2,
               "credit_id": "52fe45c29251416c75061849",
               "name": "Jeremy Sisto",
               "profile_path": "/o2FDlQQWOxF18Bq6hDvhiQZE8i9.jpg",
               "id": 23958,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Superman (voice)",
               "gender": 2,
               "credit_id": "52fe45c29251416c7506184d",
               "name": "Kyle MacLachlan",
               "profile_path": "/ykDb80YOPY2HLuRClLDpSYxUCPX.jpg",
               "id": 6677,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "J'onn J'onzz / Martian Manhunter (voice)",
               "gender": 2,
               "credit_id": "52fe45c29251416c75061857",
               "name": "Miguel Ferrer",
               "profile_path": "/fvRncqShcaV8R45IJGYZ7IAvrsO.jpg",
               "id": 15860,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "The Centre (voice)",
               "gender": 2,
               "credit_id": "52fe45c29251416c7506185b",
               "name": "Keith David",
               "profile_path": "/nwAC9TgwRkj0Ritq93O8GeublyL.jpg",
               "id": 65827,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Wonder Woman (voice)",
               "gender": 1,
               "credit_id": "52fe45c29251416c7506185f",
               "name": "Lucy Lawless",
               "profile_path": "/eFJ5CR1DyOpdabtJWPUZ4yj5w6g.jpg",
               "id": 20584,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Rick Flagg (voice)",
               "gender": 0,
               "credit_id": "52fe45c29251416c75061863",
               "name": "Lex Lang",
               "profile_path": null,
               "id": 571309,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "King Faraday (voice)",
               "gender": 2,
               "credit_id": "52fe45c29251416c75061867",
               "name": "Phil Morris",
               "profile_path": "/k4qdKVAiWQ9lhttUviatyRBFWdO.jpg",
               "id": 56853,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Lois Lane (voice)",
               "gender": 1,
               "credit_id": "52fe45c29251416c7506186b",
               "name": "Kyra Sedgwick",
               "profile_path": "/udLKlspMdXSC9LMdhygL5rcJ4XI.jpg",
               "id": 26467,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Bugs Bunny (voice)",
               "gender": 2,
               "credit_id": "52fe45c29251416c7506186f",
               "name": "Joe Alaskey",
               "profile_path": "/1l7kY4Uu6CF7qrf2jUimpvocUKi.jpg",
               "id": 86434,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Sportscaster (voice)",
               "gender": 2,
               "credit_id": "52fe45c29251416c75061873",
               "name": "Jeff Bennett",
               "profile_path": "/bms3A7TA0QItjtUlB28qv4MFFAH.jpg",
               "id": 34982,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Abin Sur (voice)",
               "gender": 2,
               "credit_id": "52fe45c29251416c75061877",
               "name": "Corey Burton",
               "profile_path": "/2YzqhrgSpWqm8lxZoyIR4F0nusM.jpg",
               "id": 35219,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Dr. Magnus (voice)",
               "gender": 2,
               "credit_id": "52fe45c29251416c7506187b",
               "name": "Townsend Coleman",
               "profile_path": "/j7PvxQ7XuOQc1ggSRHWRP6CB8CU.jpg",
               "id": 35035,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c29251416c75061853",
               "name": "Dave Bullock",
               "profile_path": null,
               "id": 76243,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c29251416c75061881",
               "name": "Sander Schwartz",
               "profile_path": null,
               "id": 1228735,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c29251416c75061887",
               "name": "Kimberly Smith",
               "profile_path": null,
               "id": 1290435,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c29251416c75061893",
               "name": "Stan Berkowitz",
               "profile_path": null,
               "id": 1074237,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c29251416c75061899",
               "name": "Darwyn Cooke",
               "profile_path": null,
               "id": 1233653,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c29251416c7506189f",
               "name": "Gregory Noveck",
               "profile_path": null,
               "id": 1172894,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c29251416c750618a5",
               "name": "Michael Goguen",
               "profile_path": null,
               "id": 85561,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "537067850e0a2647c4014549",
               "name": "Bruce Timm",
               "profile_path": "/2MaucKEFexM0MMcpsHHbDtDVZbk.jpg",
               "id": 34934,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 10.421805,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14011,
      "vote_count": 148,
      "budget": 3500000,
      "overview": "The human race is threatened by a powerful creature, and only the combined power of Superman, Batman, Wonder Woman, Green Lantern, Martian Manhunter and The Flash can stop it. But can they overcome their differences to thwart this enemy using the combined strength of their newly formed Justice League?",
      "similar": [
         1924,
         1452,
         141052,
         8536,
         9531,
         379291,
         13640,
         155,
         415,
         24428,
         49521,
         99861,
         299534,
         209112,
         11253,
         297762,
         30061,
         272,
         364,
         382322
      ],
      "original_title": "Justice League: The New Frontier",
      "runtime": 75,
      "poster_path": "/l3yNQyvUozuMuAWmf2Vxx9iX4ZO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/l5zW8jjmQOCx2dFmvnmbYmqoBmL.png",
            "name": "Warner Bros. Animation",
            "id": 2785,
            "origin_country": "US"
         },
         {
            "logo_path": "/2Tc1P3Ac8M479naPp1kYT3izLS5.png",
            "name": "DC Entertainment",
            "id": 9993,
            "origin_country": "US"
         }
      ],
      "release_date": "2008-02-26",
      "vote_average": 6.6,
      "belongs_to_collection": {
         "backdrop_path": "/v4ijBegXGXDltrqRbhlEQqfoDl2.jpg",
         "name": "Justice League (Animated) Collection",
         "id": 256287,
         "poster_path": "/ot4XTk6kXtWykmeFMMBoEgBn3Kp.jpg"
      },
      "tagline": "We stand, today, on the edge of a new frontier...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Dave Bullock"],
      "runtime": 75,
      "synopsis": "The film (set from 1953~1960) begins with an unknown entity (voiced by Keith David) explaining how it has witnessed the evolution of life on Earth: Like all things on this hurtling sphere, I emerged from the molten center of creation. But mine has been a unique path. Isolated, I developed attributes beyond those of lesser beings. Then the sphere was struck by a vast celestial stone. Black chunks of death filled the skies and the world became a chaotic garden of doom. Soon the sphere began to nurture new kinds of life. And there was one that stood above the rest. Its fragile shell belied its vicious nature. And in what seemed like a heartbeat, these things proliferated in both number and destructive means. Now they have harnessed the most destructive force. And I, The Centre, have concluded that the sphere must be cleansed of them. This explanation is shown being written and illustrated under the title \"The Last Story\" by a mysterious person who then shoots himself. The film cuts to the end of the Korean War, where United States Air Force pilot Hal Jordan (voiced by David Boreanaz) and his wingman, Kyle \"Ace\" Morgan (voiced by John Heard), are attacked by enemy pilots not yet informed of the ceasefire. Hal is shot down in the ensuing conflict, and forced to kill a North Korean soldier after ejecting to safety. The trauma of this event leads Hal to a mental ward within a hospital for about six months. Elsewhere at Gotham Observatory, the last survivor of the Green Martian race, J'onn J'onzz (voiced by Miguel Ferrer), is inadvertently teleported to Earth by a scientist, Dr. Saul Erdel. The shock of J'onn's appearance causes Erdel to succumb to a heart attack, though not before he apologizes for stranding the Martian. Unable to return to Mars, he disguises himself as Dr. Erdel using his shapeshifting abilities and takes Dr. Erdel's wallet and identification; apprently having read Erdel's mind in his last moments of life to gain an understanding of life on Earth and hence the need for identification. The following year, Superman (voiced by Kyle MacLachlan) meets Wonder Woman (voiced by Lucy Lawless) in Vietnam where she celebrates with a group of women she rescued from political rebels. The Amazon allowed them to exact their own brand of fatal justice upon their captors, which Superman is horrified to learn. He reminds Diana that the government is distrustful at best of super heroes, which has led to the Justice Society's disbanding and Hourman's death, as well as Batman's branding as a fugitive vigilante. Superman also tries to remind her that mitigating the general public's fear is why they signed loyalty oaths to the United States government. Diana, however, resolves that she must do what she feels is right. The two part at odds, and Diana later leaves America to return to Paradise Island. Superman later confides in Lois Lane (voiced by Kyra Sedgwick) about Wonder Woman and Batman, neither of whom, he says, would sacrifice their principles for each other. In Gotham City, J'onn J'onzz has been living quietly under the guise of Dr. Erdel, while learning what he can about humans and Earth society through television. He shape-shifts into different guises during his nightly viewing, such as Groucho Marx and Bugs Bunny, before settling on the form of a film noir detective. In Las Vegas, reporter Iris West (voiced by Vicki Lewis) is on assignment to interview singer Buddy Blake, at the same casino where Hal Jordan and Ace Morgan are enjoying themselves. While Iris is on the phone with her boyfriend Barry Allen (voiced by Neil Patrick Harris), Captain Cold (voiced by James Arnold Taylor) arrives to rob the casino. Hearing the events on the phone, Barry races to Vegas from Central City as The Flash and confronts Cold, who tells him he has hidden six cryogenic bombs around Vegas set to go off in 90 seconds. Flash zips around the city and locates five of the bombs, but deduces the sixth is a decoy, and captures Cold before he can escape by helicopter. Before being subdued, Cold is possessed by the unknown entity from the prologue, who asks Flash why he is faster than \"the other lesser beings\" before leaving the villain. Hal and Ace leave the casino and head into the desert. Hal is unclear about their destination, which Ace keeps a surprise. Ace notices Hal has been acting differently, and Jordan confesses things haven't been the same since the war and his time in the hospital. He also admits his past hospitalization has kept him from getting a job with a top aircraft company. It's after Hal confides in Ace that the two arrive at Ferris Aircraft, where an opening as a test pilot is indeed waiting for Hal, thanks to a recommendation from his friend. Back in Gotham, J'onn joins the Gotham City Police Department under the name John Jones, and with his integrity, cunning analytical skill, and telepathy, quickly rises to the ranks of detective in just two years. After investigating a kidnapping of a child which was later discovered to be part of a sacrificial ritual for a cult that worships something called The Centre, J'onn and his partner Slam Bradley (voiced by Jim Meskimen) meet Batman (voiced by Jeremy Sisto) for the first time as he is also investigating the kidnapping. The two cops join Batman in battle against the cult, but a fire is started during the fight, rendering J'onn powerless until Slam extinguishes it. Afterward, when Batman attempts to free the boy from his bonds, the child is terrified at the sight of him. J'onn arrives to calm the boy down and then he and his partner free the child themselves. The entity which possessed Captain Cold speaks through the incapacitated cult leader, identifying itself as \"The Centre\" and warning of an impending judgment. Hal Jordan begins training exercises under Col. Rick Flag (voiced by Lex Lang) at Ferris Industries. His joking, devil-may-care attitude rubs Flagg the wrong way, but Carol Ferris (voiced by Brooke Shields) is understanding and recognizes Hal's natural ability. Carol also recognizes that Hal needs to know the true nature of his training, which she soon reveals to him: the government has commissioned Ferris Aircraft to build a spacecraft capable of travel to Mars. Special agent King Faraday (voiced by Phil Morris) is assigned to oversee the project, which is in response to Dr. Erdel's contact with Mars and J'onn's arrival. Back in Gotham, the Dark Knight reveals his knowledge of J'onn's true nature in his apartment, as he is able to find a way to shield his mind from J'onn's telepathy, and suggests that they should form an alliance as they are both investigating the cult that is rising throughout the world a cult that worships the Centre. J'onn's demonstration of kindness toward the boy they rescued led Batman to believe that he can be a trusted ally. However, he warns J'onn that should he betray him, he is fully aware of and willing to use the Martian's vulnerability to fire against him. In Central City, The Flash defeats Gorilla Grodd (or, rather, a robotic duplicate), but is targeted by government agents, as they attempt to capture him in an effort to learn the secret of his powers. Though he narrowly escapes, the experience leads the Flash to consider retiring from his crimefighting career as he announces it upon crashing a news report. J'onn J'onzz interrogates Harry Leiter, a former Ferris employee apprehended for murder while under the influence of the Centre. During the questioning, Harry lets word slip about the launch to Mars. Leiter's ramblings are confirmed when Faraday arrives to take him into custody. J'onn briefly glimpses into the agent's mind and learns the truth. After watching the Flash announce his retirement on live television, and seeing the public contemptuous response, a disheartened J'onn attempts to stow away on the rocket so that he may return home. Before leaving, he arrives in Batman's headquarters, the Batcave, revealing that he's been aware of Batman's secrets for quite some time (using his cunning detective skills instead of his telepathy), and gives him the last of his research on The Centre. J'onn reveals to Batman that he's losing faith in humanity, as he sees that there's too much hatred, ignorance, and conformity within the people around him, which made him decide to leave Earth. Batman's response is cold and brief, as he tells J'onn some people don't have the luxury of leaving Earth. While attempting to board the ship, J'onn is seen on camera by Faraday, who confronts J'onn and fights him on the launchpad. J'onn is able to beat Faraday, but saves him from the rocket exhaust by flying him to a platform before collapsing due to exposure to the flames. The rocket is damaged and malfunctions shortly after exiting the atmosphere. Hal wants to attempt a landing, but his co-pilot, Col. Rick Flagg, reveals that the rocket is loaded with weapons of mass destruction, and as such he won't risk a crash landing that could detonate the weapons. After a brief struggle, Hal is ejected from the cockpit. Though he is saved by Superman, the distraction allows Flagg to detonate the rocket. J'onn J'onzz is held as a prisoner by Faraday. Superman blasts Faraday for treating J'onn differently from him (a Kryptonian and thus also an alien), just because J'onn looks radically different. He also points out the captivity is entirely J'onn's decision because he can escape at any time using his powers. On Paradise Island, Wonder Woman trains with Mala, and tells her of how America has changed since the war. Her training partner says the island has changed as well, and that many Amazons desire a change in leadership. Though Diana quickly fends off a challenge from her fellow Amazon, the two of them are soon beset upon by the approaching Centre. Hal Jordan is later found by Abin Sur (voiced by Corey Burton), the Green Lantern of Sector 2814. The destruction of the rocket Abin had been traveling in badly wounds him as he enters Earth's atmosphere, so he instructs his ring to find a worthy replacement. He leaves his ring with Hal, and tells him of The Centre, which he describes as a \"monstrous creature\" that fears humans and seeks their destruction. In the Batcave, Superman reviews J'onn's research with Batman and meets Robin (voiced by Shane Haboucha) for the first time. Batman has altered the design of his suit so it won't frighten an innocent, but is still able to strike terror in the heart of a guilty. As they discuss the Centre, they hear Lois reporting on the attack of a giant pterodactyl at Cape Canaveral. Superman arrives at the scene and quickly defeats the creature. Almost immediately afterwards, Wonder Woman's invisible jet makes a crash landing, its cockpit smeared with blood. Before losing consciousness, Wonder Woman warns Superman that the Centre is coming. Faraday eventually befriends J'onn who saved his life, and occasionally plays chess with him. J'onn reveals to Faraday that he decided to remain at the agent's base willingly because of the upcoming battle with The Centre, and had telepathically looked into the agent's mind during their battle at the platform. J'onn found that Faraday believes that one day the world won't be living in fear and hate. Finding that within Faraday, J'onn has renewed hope for humanity and decides to participate in the battle to save Earth. Before leaving with Faraday, J'onn adopts a new Martian/human superheroic hybrid form as the Martian Manhunter, believing it is honest to his heritage with a friendly appearance to human perception. The Centre Following this, the Centre begins its attack in earnest at the coast of Florida, finally revealed as a massive flying island, with an army of mutated dinosaurs to guard it. The threat draws heroes such as Flash (whom Iris talks into coming out of retirement), Green Arrow, Adam Strange, the Challengers of the Unknown, and the Blackhawks, who clash with the soldiers on base. The conflict is stopped by Superman, who advocates cooperation between the two sides. He is unexpectedly seconded by Faraday, accompanied by J'onn, who agrees that the government and the heroes must work together for survival. With that, Superman heads out to do reconnaissance on the Centre, but is swiftly and shockingly defeated. Moved by his effort, the rest of Earth's superheroes and military forces band together to defeat the Centre. Batman interrupts a meeting between Faraday, J'onn, Will Magnus (voiced by Townsend Coleman), and the Challengers. Batman brought with him Ray Palmer, a scientist known for his work with matter reduction. When one of the Challengers argues the technology is too unreliable, destabilizing anything it shrinks (eventually causing the object to explode), Batman replies that's exactly the point, and a plan is formed to use Palmer's reduction ray to destabilize the island. The heroes will distract the Centre with a frontal assault (while Hal and Ace fly a bombing mission into the creature), leaving Flash to quickly crisscross the island with the ray. While the aerial assault (including Batman and Green Arrow as pilots) is nearly outmatched before the intervention of the Blackhawks, Faraday's ground forces are ambushed by a herd of rampaging mutant dinosaurs. J'onn is overwhelmed by the psychic impact from The Centre and is rescued by Faraday, who is shortly thereafter captured by a dinosaur. As he is about to be eaten by a tyrannosaurus, Faraday grabs two hand grenades and pulls the pins. The dinosaur swallows Faraday and immediately afterwards its head explodes from the grenade detonation, killing both it and Faraday. The shock of his friend's death helps J'onn shake off the Centre's hold, and he and a recovered Wonder Woman help turn the tide of the ground battle. Hal Jordan and Ace Morgan manage to shoot their way into the core of the creature, but are disoriented at first by a hallucinogenic attack. The creature secretes a thick red fluid that jams their weapons and almost suffocates them. It is then that Hal's ring activates, relaying instructions from the Guardians of the Universe (voiced by Robin Atkin Downes) as to its use. Ace manages to detonate his payload, and is rescued by Hal now dressed in a costume identical to Abin Sur's just before his plane explodes. The explosion gives the ground crew their opening as they prepare to send Flash to finish the creature. The speedster is struck by the gravity of the situation and his role in it, but J'onn reassures him that everyone will be behind him. Flash races across the ocean and leaps onto the Centre's surface, covering the entire surface on foot before leaping into the ocean. The Centre begins to shrink, but realizing its imminent destruction, it heads toward land to destroy the humans along with it. Hal realizes what he must do, and envelops the island in green energy, then tows it into space where it explodes. The entire world celebrates the Centre's defeat. As many participants in the battle attend a ceremony, Hal celebrates the victory his own way by pursuing his lifelong dream: flying through space with the aid of his new power ring. During the celebration, Superman is revealed to be injured but still alive, saved by a man named Arthur (voiced by Alan Ritchson) who claims to be from an underwater kingdom. He and his subjects treated Superman's wounds during the battle with the Centre. Superman is reunited with Lois and the rest of the heroes, who are touted so on the front page of the Daily Planet. This monumental victory and display of teamwork changes public opinion about superheroes, and a montage of various heroes and villains (with cameos by Black Canary, Captain Marvel, Plastic Man, Robin, Supergirl, the Teen Titans, Ra's al Ghul, Black Manta, Brainiac, Cheetah, Darkseid, Doctor Light, Doctor Sivana, Gentleman Ghost, Joker, Key, Lex Luthor, Monocle, Mister Mxyzptlk, Harley Quinn, Riddler, Star Sapphire, Two-Face, and Ultra-Humanite) as well as the birth of the world's second generation superhero team: Justice League, set to the titular John F. Kennedy speech, is shown just before the film ends.",
      "writers": [
         "Stan Berkowitz",
         "Darwyn Cooke"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0902272/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyMDA5NDQ0Nl5BMl5BanBnXkFtZTcwMDI2MjU1MQ@@._V1_SY317_CR31,0,214,317_AL_.jpg",
      "actors": ["Stars: David Boreanaz, Miguel Ferrer, Neil Patrick Harris | See full cast and crew »"],
      "reviews": [
         "The original comic New Frontier was a lavish, loving tribute to both the heroes of DC comics and the spirit of 1950s America, and this movie captured both almost as well. Many of the comments here that are critical of this film apparently are not at all familiar with comics of that era, and don't realize what this story tries to evoke. Some of the incongruities (Batman and Superman's costumes, the white Green Lantern) are NOT errors or sloppiness. These were depictions of the characters as they were nearly a half century ago. Remember, there were visions and versions of these heroes that existed prior to the Cartoon Network, and this is their story. I love the Justice League cartoon, and this movies stands shoulder to shoulder with the best of that show.",
         "I'm always checking out these animated superhero movies, and most of the time they're very disappointing. For example all of the ultimate avenger movies, superman: doomsday etc. But this one did not disappoint,they did a great job with it, and it's one of the best animated movies I've seen in a longgggg time. As a fan of the justice league series, I had big expectations for this movie, and it may not have been as good as the series but it was still very enjoyable to watch. I advise any superhero fans to watch this. I hope they continue to make more animated movies like this one.",
         "This is a fantastic film, retaining the style and flavour of the original tale, and for me bringing back a real sense of the earliest Justice League stories and the original heroes of the DC Silver Age. Reading some of the other reviewers they seem to want the glitzy shiny polished versions that have been popularised these days, but I've got to be honest - these stocky built characters beat out the ballet dancer heroes of today in my book. And the feel of Jack Kirby through especially the latter part of the film. The story itself does a great job of integrating the Golden Age Justice Society days and the Silver Age Justice League days. A worthy piece of work, and I hope we see more of these special projects from the Warner animation department (and Bruce Timm!)",
         "I can remember 40 years ago reading DC comics that would \"step outside\" the regular series to explore \"what if\" plot ideas: what if humans advanced in 100 years to be almost as powerful as Superman, or what if the Legion of Superheroes were caught in a planetary concentration camp, or what if Superman lost his powers and became a superhero similar to Batman using Kryptonian technology (and similar plots). This movie is based on a graphic novel using a \"what if\" type of idea: it's the same characters as in the Justice League comic book series (and other series characters), but with variations as necessary to develop the plot. As long as you don't expect the usual and familiar, this movie takes the characters in interesting new directions with more adult themes. By the way, since this is more adult you may not want very young children to view this (or at least watch it without them first before you decide to let them see it). The beginning of the movie in particular may not be suitable.",
         "Along with a quick moving story line, mature themes and strong character work, this is a movie with heart. It never pauses, and rarely misses a beat as it tells its story. The person who said its a mockery, really should go back and read the comics of the period, this had the best art since Fleischer did Superman, and it all works. Loved seeing Batman in his original costume, and Superman and Wonder Woman as adults. It was absolutely fantastic, wish for more work and good tidings in Future enterprises. The story focuses mostly upon Hal Jordan as he becomes the Green Lantern. The dark themes of McArthyism and a thing called the Center that is destined to destroy us all is typical of the comic, but had not been seen in any of the cartoon ventures thus far. Let me say it again. This is the best DC animated project since Mask of the Phantasm! Next! IDENTITY CRISIS!",
         "I've collected and read since 1959, and being the consummate comics fan, I've seen all of the incarnations, followed all the Secret Crises and plot lines and threads, and what I missed, my best friend collected and we shared. Adaption of the concept: 10. What did the McCarthy Era cause for the superheros, and would the \"Common Man\" plan be used as we saw? Adaption of the characters: 9. The only reason for this is the divergence from the \"new\" comic reality that the WWII Wonder Woman was in actuality Queen Hippolyta. Adaption of the comic: 7.5. It would have been better if some of the side plots were developed, and had the Losers been more explained. The last bits of King Faraday were not jarring per se, but would have gone a lot more to explaining what was going on had the Losers been developed out in the story. However, the inclusion at the beginning of the author's final moments helped clarify a lot that was scattered in the original mini-series. Adaption of the story: 8. Hal Jordan's 'discovery' should have happened at the beginning, as indicated. Wildcat's fight should have been shown along with the various side characters, along with the Challengers of the Unknown (Ace Morgan named alone explains nothing). Likewise, Captain Nathaniel Adam, Ray Palmer and others who were merely named without explanation, as well as the Blackhawks and Green Arrow...there was only a mention of Hourman without explanation, and we needed a bit more than a \"Hawwwkk-AA-AAA!\" to carry on... But...there _was_ a \"Hawwwkk-AA-AAA!\"...and an Arrow Plane... And Batman at the end, putting it all together for even the most brilliant scientific minds (though I would have preferred to see Adam Strange released from Arkham Asylum...). Put it all together, and for me, who has seen every incarnation of the JSA/JLA/JLE/JLI/JLU... This was a masterpiece of reconstructive ret-con. Superbly done, relying heavily on a fundamental comic book knowledge, but loosely enough that people can at least identify who the characters are and their purpose. The closing scenes were ripped from the books, and beautifully handled, and while I'm not sure if that was his voice or a clever impersonator, it was the masterstroke to the masterpiece that completed the epic. To those (some of whom have already posted) who will whine and kvetch that \"this is not the JLA I know\"... You're absolutely right; this isn't any JLA that I knew of before reading the books or seeing the adaption, and I've been reading them long before many of you appear to have been born or even knew of Happy Harbor, Maine. But as \"Origin Stories\" go, this is one of the best to be presented, and will hopefully open the pocketbooks of viewers to watch and encourage the rich history within the Golden Age, Silver Age, and Modern/Crisis Age of Comics to be brought to \"life\" in animation. I just snagged the collected serials of BATMAN from 1943 in their entirety, so I'm off-line to enjoy that. Now, if only Lucas would exercise his options to bring the Blackhawks to the silver screen...",
         "There's a lot to like about Justice League: The New Frontier, but I'm afraid all of that is counterbalanced by one of the silliest stories I've ever seen in animation. Set mostly in the 50s and featuring the DC hero fashion of that period the paranoid US government have blackballed all superheroes, claiming that they have something to hide beside their identities and dismiss them as Commies. The Flash is even ridiculed because of his RED costume. But soon they will have to come together again to fight a common enemy when (and I'm not kidding) a large floating, living island of dinosaurs called The Center plans to wipe out humanity. I've read hundreds of comic books in my life and that is seriously the dumbest crap I have ever heard. Every other part of JL: TNF is far superior to this 'Center' nonsense, so it's such a shame that the main plot drags it down. I especially like the story about the Martian Manhunter and the Flash. Most of the JLA get a look-in but these two have the most substantial plots. The animation style will be familiar to those who are fans of Warner/DC cartoons such as Batman and the 50s production design creates a nice atmosphere. But that idiotic plot...",
         "There are a lot of things going in favor of Justice League: The New Frontier. The shear scale of the storyline, a world devouring creature who's sole wish is mankind's eradication, striking in a world that has abandoned its heroes, its brilliant, and it is EPIC. From the opening montage to the closing glimpses of the future, there really is a lot of mythos and grandeur to this storyline, and that's a big plus. The storyline is set right in the heart of the 1950's and McCarthyism, driving the JSA to shame and retirement, and causing the public to cast a wary eye on the newly blossoming roster of heroes. Superman, Batman, Wonderwoman, and the Flash are all well established at this point, however the true stars of the show are Green Lantern Hal Jordan and Martian Manhunter. Not my personal favorites, but the story for them is quite good. The voice acting was in my opinion the greatest weakness of the movie. The problem wasn't the voices themselves, but the delivery of lines that should have given me chills fell flat. The flash especially spoke way too fast, as did Hal Jordan. The 70 minute run time should easily have been extended by several more minutes and they could have allowed the actors to actually ACT and not run through their lines at breakneck speed. Jeremy Sisto did a great job as Batman, but sadly he was given about 5 lines in the whole movie, and therefore was a truly wasted talent. The movie also took a decidedly more mature turn than its predecessors, not to spoil key moments, but blood, death, even rape are not out of bounds in this outing, so be mindful of the children. What annoys me is that while there were more mature tones in the action, the dialog and the plot still condescended to 10 year old children. WB really needs to choose who they're shooting for, because they will alienate everyone with this approach. Overall, for fans of DC comics, this is worth a look. GL fans in particular should be happy to see his story finally animated in full, however lovers of the core trinity (Superman, Batman, Wonder Woman) will be disappointed by their lack of screen time. They shouldn't have tried to hard to include some action with everyone, because everyone winds up getting short changed. The throwback costumes are a big plus though. 7/10 from a hardcore Superman/Batman fan.",
         "Synopsis: This animated feature is set in the 50s during the era of cold-war paranoia with a population that doesn't trust superheroes and a government that doesn't trust anyone. There is a malevolent force which has watched humanity grow in strength and violence and it has decided it has to eliminate it. Also included in the plot are shortened versions of Martian Manhunter and Green Lantern's origin stories. This film's setting is really used to great effect and the heroes have a classic Golden Age look about them (though their attitudes remain anachronistically modern, especially Wonder Woman). I'm sure there references to many of the other DC characters that I'm just not very familiar with. Overall the main story was fairly routine. There may have been just too many characters and the story tried to do too much. Aquaman got one line and I don't think Green Arrow even got that. Even though I liked it I think it's going to mainly be one for the comic book fans",
         "This is what fans have been waiting for. This film did an excellent job of following Darwyn Cooke's vision of the JLA as well as provide great continuity to the DC Universe. As for the negative comments about the characters from one certain naysayer. Get educated in the mythos before you critique it 1. That was superman's original 'S', read the damn books before you criticize. Understand the character's roots first. 2. Hal Jordan was the original Green Lantern from Earth. Jon Stewart is the third. The JL series is not DC Dogma. 3. They followed Bob Kane's Batman to the umpteenth degree. From the first issue he appeared in up to where Robin is introduced. Overall, this is the best film DC has ever produced, I'm keeping in mind Richard Donner's Superman and Tim Burton as well as Chris Nolan's Batman films. As far as the comics go, this film is the best. I also appreciated the followup to the issue of the JSA where the heroes were confronted by McCarthy to give up their secret identities, and quitting saving an ungrateful nation. The Red scare despite red being part of the trinity of colors on our own flag. After WWII America becomes less and less American, and this movie played off that. This movie couldn't have been told at a better time. GOOD WORK DC! Hope the momentum keeps going up."
      ],
      "genres": [
         "Animation",
         "Action",
         "Adventure",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": ["Warner Bros. Animation"],
      "summaries": [
         "Adapting the award-winning DC Comics miniseries DC: THE NEW FRONTIER by Darwyn Cooke, Justice League: The New Frontier spins a tale of the DC Universe in the 1950s, focusing on test pilot Hal Jordan (Green Lantern) and the Martian Manhunter. The story also features other DC characters, including Barry Allen (the Flash), Superman, Wonder Woman, Batman, and many more.",
         "In the 1950s, a new generation of superheroes must join forces with the community's active veterans and a hostile US government to fight a menace to Earth."
      ],
      "budget": 3500000
   },
   "movielensId": 58404,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-02-26",
      "dvdReleaseDate": "2008-02-23",
      "directors": ["Dave Bullock"],
      "runtime": 75,
      "movieId": 58404,
      "title": "Justice League: The New Frontier",
      "mpaa": "PG-13",
      "actors": [
         "David Boreanaz",
         "Neil Patrick Harris",
         "Brooke Shields",
         "Jeremy Sisto",
         "Kyle MacLachlan",
         "Miguel Ferrer",
         "Keith David",
         "Lucy Lawless",
         "Lex Lang",
         "Phil Morris",
         "Kyra Sedgwick",
         "Joe Alaskey",
         "Jeff Bennett",
         "Corey Burton",
         "Townsend Coleman"
      ],
      "imdbMovieId": "0902272",
      "originalTitle": "Justice League: The New Frontier",
      "genres": [
         "Action",
         "Adventure",
         "Animation",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["HGoU6KOA9ZI"],
      "plotSummary": "The human race is threatened by a powerful creature, and only the combined power of Superman, Batman, Wonder Woman, Green Lantern, Martian Manhunter and The Flash can stop it. But can they overcome their differences to thwart this enemy using the combined strength of their newly formed Justice League?",
      "tmdbMovieId": 14011,
      "avgRating": 3.36957,
      "releaseYear": "2008",
      "numRatings": 161,
      "posterPath": "/l3yNQyvUozuMuAWmf2Vxx9iX4ZO.jpg"
   }
}