{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "chase",
            "id": 3713
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "psychopath",
            "id": 6259
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "torture",
            "id": 13006
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "evil",
            "id": 156075
         },
         {
            "name": "neo-noir",
            "id": 207268
         }
      ],
      "imdb_id": "tt0804552",
      "video": false,
      "title": "WΔZ",
      "recommendations": [
         22007,
         14459,
         26587,
         13849,
         44862,
         19197,
         21398,
         71033,
         47518,
         38033,
         33057,
         133989,
         17618,
         6948,
         204904,
         35004,
         14223,
         244009,
         84924,
         191094
      ],
      "backdrop_path": "/mPNBuvgVmXNxUamxqxU1UBWjJ5P.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "562e3274925141285700a774",
         "content": "Altruistic Nightmare!\r\n\r\nBodies have started turning up with W∆Z carved into their skin, cops Eddie Argo (Stellan Skarsgård) and Helen Westcott (Melissa George) investigate and find something truly disturbing is afoot.\r\n\r\nIt's cut from the same cloth as Saw, Seven and to a degree Hostel, in that it's torture pornish in narrative essence, and aesthetically grim with its neo-noir greens and browns. Tom Shankland's movie is undeniably bleak, but sift through the blood and the grime and you find there's an intelligent film at work, one that opens up an uncomfortable can of worms about human nature. But of course if you like it bloody and mean, then that is served up with relish as well, with all the key scenes packing an emotional whack to go with the jolts.\r\n\r\nBrains to go with the splatter, some very smart photography (Morten Søborg) and engaging lead performances, these all lift this above average. If only it hadn't cheapened things down with the daft finale then this would have garnered more support in horror circles. 6/10",
         "url": "https://www.themoviedb.org/review/562e3274925141285700a774"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jean Lerner",
               "gender": 1,
               "credit_id": "52fe46359251416c75070e15",
               "name": "Selma Blair",
               "profile_path": "/xltCuuG4xjACQ6vQm55iuR5LFJC.jpg",
               "id": 11826,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Helen Westcott",
               "gender": 1,
               "credit_id": "52fe46359251416c75070e19",
               "name": "Melissa George",
               "profile_path": "/6FwOUF7oxvMA7AEZ8uVQwAhQIpH.jpg",
               "id": 27755,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Eddie Argo",
               "gender": 2,
               "credit_id": "52fe46359251416c75070e1d",
               "name": "Stellan Skarsgård",
               "profile_path": "/zSCU2agleLtJEvzj98jEesVhBxa.jpg",
               "id": 1640,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Elly Carpenter",
               "gender": 1,
               "credit_id": "52fe46359251416c75070e29",
               "name": "Sally Hawkins",
               "profile_path": "/iQV1udEUKw6P3sk3vJWOQwLwN0r.jpg",
               "id": 39658,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Jack Corelli",
               "gender": 2,
               "credit_id": "52fe46369251416c75070e2d",
               "name": "John Sharian",
               "profile_path": "/o3XD2Aeyzhz2CYyzM1k2qkXKajD.jpg",
               "id": 36900,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Gelb",
               "gender": 2,
               "credit_id": "52fe46359251416c75070e25",
               "name": "Paul Kaye",
               "profile_path": "/hQHptsWpzIDtgHRXEn05CzIdY7E.jpg",
               "id": 71281,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "O'Hare",
               "gender": 0,
               "credit_id": "52fe46369251416c75070e31",
               "name": "Michael Wildman",
               "profile_path": "/lMD5D5luP2n70SZJI97FYNxLFdi.jpg",
               "id": 30085,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Daniel Leone",
               "gender": 2,
               "credit_id": "52fe46369251416c75070e35",
               "name": "Ashley Walters",
               "profile_path": "/1jhnUvvzLJJw6lXZNnUSJQovfBy.jpg",
               "id": 61364,
               "order": 7
            },
            {
               "cast_id": 4,
               "character": "Pierre Jackson",
               "gender": 2,
               "credit_id": "52fe46359251416c75070e21",
               "name": "Tom Hardy",
               "profile_path": "/4CR1D9VLWZcmGgh4b6kKuY2NOel.jpg",
               "id": 2524,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46369251416c75070e3b",
               "name": "Tom Shankland",
               "profile_path": null,
               "id": 47724,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "538708f4c3a3681aea0027e8",
               "name": "Clive Bradley",
               "profile_path": null,
               "id": 1325589,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5387090fc3a3681af000299d",
               "name": "Allan Niblo",
               "profile_path": null,
               "id": 60322,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53870929c3a3681ae3002938",
               "name": "James Richardson",
               "profile_path": null,
               "id": 41532,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5387093cc3a3681ae300293c",
               "name": "David Julyan",
               "profile_path": null,
               "id": 558,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5387094ec3a3681ae3002942",
               "name": "Morten Søborg",
               "profile_path": null,
               "id": 1175,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "53870960c3a3681af3002ae2",
               "name": "Tim Murrell",
               "profile_path": null,
               "id": 1000569,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "53870973c3a3681aed002a98",
               "name": "Gary Davy",
               "profile_path": null,
               "id": 47205,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "53870992c3a3681af00029ac",
               "name": "Ashleigh Jeffers",
               "profile_path": null,
               "id": 982992,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "538709a7c3a3681ada00299e",
               "name": "Shane Bunting",
               "profile_path": null,
               "id": 1325591,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "538709bbc3a3681ada0029a3",
               "name": "Gillian Devenney",
               "profile_path": null,
               "id": 1042042,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "538709cec3a3681ada0029a6",
               "name": "Nigel Pollock",
               "profile_path": null,
               "id": 1325592,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "538709e3c3a3681ada0029ac",
               "name": "Maggie Donnelly",
               "profile_path": null,
               "id": 1155167,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "538709f8c3a3681ae300294c",
               "name": "Tanya Lodge",
               "profile_path": null,
               "id": 41545,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.671418,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 15069,
      "vote_count": 49,
      "budget": 0,
      "overview": "There is something horribly wrong with the bodies found in the dark city streets. Some are mutilated while others have the Price equation (wΔz = Cov (w,z) = βwzVz) carved into their flesh. Detective Eddie Argo and his new partner Helen Westcott unearth the meaning of the odd equation and realise each victim is being offered a gruesome choice: kill your loved ones, or be killed. Before long it becomes clear that the perpetrator has suffered a similar fate and is now coping by seeking a way to solve this philosophical dilemma.",
      "similar": [
         357096,
         4771,
         2749,
         979,
         75780,
         948,
         238636,
         3597,
         3600,
         445954,
         984,
         310137,
         10651,
         11423,
         207270,
         479,
         9568,
         26390,
         20676,
         10900
      ],
      "original_title": "WΔZ",
      "runtime": 104,
      "poster_path": "/8lPZ59iQRqUELprKuB0myy7u6Zm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/s5DhzAWbXlySdySIGmpghpMRmPp.png",
            "name": "Vertigo Films",
            "id": 10393,
            "origin_country": ""
         },
         {
            "logo_path": "/6CLoZ59fLPG7UyxQtGTqRevjf58.png",
            "name": "UK Film Council",
            "id": 2452,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Ingenious Film Partners",
            "id": 289,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Northern Ireland Film and Television Commission",
            "id": 4394,
            "origin_country": ""
         }
      ],
      "release_date": "2007-05-19",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Would you kill the one you love to save yourself from death?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Tom Shankland"],
      "runtime": 104,
      "synopsis": null,
      "writers": ["Clive Bradley"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0804552/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1MTg2OTU4Nl5BMl5BanBnXkFtZTcwODEzNjQ5MQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Stellan Skarsgård, Melissa George, Ashley Walters | See full cast and crew »"],
      "reviews": [
         "I went to one of the first official screenings of this film last night at the frightfest in London, West End. It was brilliant! I wouldn't suggest that I was sceptical, but more open minded and intrigued to discover exactly what this movie was going to be like. I had heard mixed reviews about pre-completed screenings and at the end of the day, didn't want to waste my Sunday evening. I am pleased to say that 'WaZ' is a perfect mixture of raw grit, commercial trends and generic cliché's. I am not always a fan of modern day camera work and cinematography, yet this film comfortably took it to the limit and told a great story in an innovative way. Well done to Mr Shankland and fellow cast and crew, as this film will (in my mind) no doubt keep thriller fans on the edge of their seats when spending the close approaching weekend evenings at the flicks.",
         "To begin with, this movie isn't just another torture porn flick that we've seen a glut of in recent times (Saw, Hostel and the like). There's actually a decent plot regarding the murderer and their victims, something that examines humanity's darker side yet goes beyond the base sadism displayed in actual torture porn, which this isn't. The marketing campaign gave it the appearance of such a film and i was nearly put off, however my optimism got the better of me as I confess, I am a huge horror fan and there were glimpses that it could be quite good. And it is, in fact it's very good. There's a rugged brutal efficiency in the way this film goes about delivering the goods. You've got your cops, new and old, with sketchy case files and hints of crookedness, a scientific theory of genetics being exploited by our murderer and a gang of outlaws who are being targeted. All of it is carried out with appropriate macabre and occasional wit and humour, good, edgy hand-held camera techniques, clever acting and a pacey script. I thought it was great on an intelligence level and I squirmed every time there was a 'nail' scene. I was even more surprised to learn afterwards that this was a British production, was shot in Belfast and used a largely British cast, yet had me fooled as to it's New York setting and convincing accents. What more can i say apart from wow, i love this movie? I also realised after that Waz is Saw backwards, and a cynic may say that is opportunistic marketing, but to them i say, see the movie and tell me it doesn't at least give Saw a run for it's money, if not kick it's stupid face off. Saw's ideas were good, but their killer seemed a flimsy afterthought to me. In Waz, the killer and their motives are integral to the plot,(which surprises before a satisfactory ending)and it's hard not to find empathy for the killer, something i never got in Saw. The great script and acting add depth and character to the story, which hit me with surprises and left me feeling contemplative, which is unusual for horror today. Verdict: Come for the torture, stay for the good movie",
         "The most influential American horror movie of the last 20 years is \"Seven\". This much is undeniable. I really liked \"Seven\". Great movie. It might be one of my favourites. The only problem is that every inner city set horror thriller made since comes across, to me, as \"Seven\"-lite. Which brings me to \"Waz\". A city of permanent night. A cop on the edge. A diabolical killer. Inventive, ingenious torture and murder. Victims with a reason for being victimised. Yup. \"Seven\"-lite. Not necessarily a bad thing in itself, because you have to take every movie on it's own merits, but disappointing when witnessed over and over again. \"Waz\" isn't bad. It is just unoriginal and a triumph of style over substance. The city is effectively portrayed as grim, dirty, cold and wet. You wouldn't want to go there on holiday. You wouldn't want to hang out with any of these people. The tone of the film is unpleasant, seedy and black. To coin a dated phrase, a video nasty. It will get you down. It also has one of the most disturbing filmed sequences of sexual abuse I have ever seen. All insinuated, you don't see a thing, but it is horrible. Melissa George has been better and is frankly wasted as the pouting sidekick, but \"Waz\" does have a superior cast (Stellan Skarsgård, Selma Blair, Tom Hardy, etc.) for what is effectively a straightforward genre movie. Some of the questions I had as to why they signed up for this movie were answered during the denouement, when the motivations behind Stellan Skarsgård's actions are revealed and his character develops levels way beyond that of a tormented cop. So, \"Waz\" was OK. Not bad for a walk on the dark side.",
         "When the body of the pregnant girlfriend of the criminal Wesley Smith (Michael Liebman) is found electrocuted, detectives Eddie Argo (Stellan Skarsgård) and Helen Westcott (Melissa George) are assigned to investigate the case. They seek out Wesley with his gang of low-life criminals and Pierre (Tom Hardy), Jamal (Sean Brian Jordaan) and Daniel Leone (Ashley Walters) tell that they have not seen him. They move to a crack alley and the addicted whore Elly (Sally Hawkins) tells that Wesley is upstairs. They find Wesley tortured, with two fingers burnt and hanged with the equation W∆Z = Cov + E engraved on his flesh. Then they find Jamal and his twin brother Khaled killed in the same modus operandi and the coroner finds the dissociative anesthetic Ketamine in the autopsy. Helen finds that the only laboratory with the controlled substance available in the area is the one managed by the researcher Dr. Gelb (Paul Kaye). When they arrive, Dr. Gelb explains the meaning of the equation a.k.a. Price equation, which is a mathematical description of evolution and natural selection, i.e., there is no altruism in nature. Their further investigation discloses that Dr. Gelb's former assistant was Jean Lerner (Selma Blair), a young woman that was gang raped by Pierre and his gang and forced to kill her own mother. Due to contaminated evidences, the criminals have never been sentenced. Now she is forcing each rapist to kill the one he or she loves to save himself or herself from death, influenced by Dr. Gelb researches. Further, Helen suspects that her partner and detective Jack Corelli (John Sharian) intentionally destroyed the evidences. \"W∆Z\" is a solid and dark police story and it is inevitable the comparison with the style and cinematography of \"Se7en\". The plot is very well resolved, supported by an excellent screenplay, great direction and stunning performances. The gruesome locations are depressive, using a dark cinematography, and the relationship between Eddie and Danny is a surprising twist. The characters are believable, with corrupt police and criminals living in the gray division between law and crime. This is the type of movie in which the killer has good motives for her actions. The plot is clever, raising questions about the existence and meaning of love and evolution of species. My vote is eight. Title (Brazil): \"W∆Z � Matemática da Morte\" (\"W∆Z � Mathematic of the Death\")",
         "I was surprised when I watched this movie at the Fantasy Film Festival in Stuttgart/Germany. And I'm surprised that it got a high rating here at IMDb too. Not because it doesn't deserve it in my eyes (obviously as seen in my rating). I just didn't expect a relatively small movie (even with a stellar cast, and yes pun intended) to be noticed that much, but I was wrong. The movie itself is very dark and gritty. It's also not for the faint hearted! There are scenes here, that might make you squeal, if you're not up for the brutality of what is shown! Allow yourself into this brutal and dark world and be amazed by it's \"beauty\"! That's all I have to say, about this thriller ...",
         "For fans of the detective and suspense genres, this is a worthwhile pick. One could legitimately criticize the art direction as being derivative of \"Se7en\" or \"Saw,\" but why bother? The writing, the direction, and particularly the acting are so far superior to the vast majority of the horror/thriller/suspense movies that are churned out by the hundreds these days that you'd be denying yourself the chance to see an intelligent, thought-provoking, not unbelievable, suspenseful film if you passed on it for that reason. It is, psychologically, dark; and there are a few scenes of torture - but they aren't gratuitous and they aren't gratuitously gory. They are essential to advancing the plot and developing the characters; and most of the violence is implied, not shown. If you're looking for torture porn, you'll be disappointed. The plot twists are interesting, atypical, and believable, and the movie has something significant and thought-provoking to say about the human condition. The characters (with the exception of Melissa George's) are written with moral complexity, and all of the acting (including Ms. George's) is top-notch. It's a shame this didn't get a theatrical release in the U.S. Judging from the disappointment of torture-porn fans, my guess is that it was not well-marketed.",
         "It seemed to me as though the film is confused whether it is an edgy noir-esquire thriller or 'torture porn' in the vein of Saw. On the one hand the production is excellent with hand-held camera-work and a sensitive use of low-key lighting (the film is VERY dark) adding to the ubiquitous air of suspense. On the other hand it could be said that the torture at the end is a bit excessive, crowd-pleasing and/or shatters the Hitchcockian intensity associated with allowing the audience to conceive the horrors in their own minds (though personally I like a bit of gratuitous violence). At the heart of this film though is a battle between love and hatred that gets you thinking. Some on these boards have said that it has changed their whole view of life and love. While it probably hasn't affected me quite so profoundly I would have to say that everyone should watch this film as it's guaranteed to entertain, engage and inspire, which is what all art should do. Overall a very good movie: 8/10.",
         "I was not very interested in watching WAZ, because the plot summary sounded as another poor rehash of Seven and Saw.However, I took a huge surprise with this film.WAZ ended up being an excellent thriller, and although it shares a few elements with them, I think it is a big mistake to say it is a rehash of Seven and Saw. The screenplay from WAZ is truly brilliant.Recent \"torture-porn\" films (like The Strangers, Saw V or Captivity) bored me very much, because they do not endorse the torture scenes with a solid screenplay.Fortunately, WAZ endorses its brutal violence with interesting characters and a very intelligent story which reflects about some fascinating topics.And, because of that narrative complexity, the torture scenes have a much bigger emotional impact than almost all the others \"torture-porn\" thrillers.Besides, this movie has an ingenious twist at the end which does not leave any plot holes and closes the story perfectly. Stellan Skarsgård and Melissa George bring great performances.They both show a good level of intensity, and they are very involved on their characters, so they result very credible.Pity these two perfect performances went completely unnoticed. I really did not expect to like this movie so much.WAZ is an excellent (not to mention very underrated) thriller which deserves an enthusiastic recommendation, with the warning that the scenes of violence may result too intense for some people.I took a huge surprise with this film.",
         "Unfortunately, I'm afraid this film is destined not to receive the acclaim it fully deserves. Don't watch this film if you are easily put off by sexual violence. Having said that though - I watched the film with my wife & 18yr old niece (both of whom I would describe as sensitive individuals), & they were both impressed with the film whose 18 certificate serves only really to protect from it's sensitive subject matter & is not an indication of overtly graphic violence/gore. We gave the DVD a go one afternoon, not really knowing what to expect. Although the conditions were not what i'd normally regard as conducive to 'horror' viewing (sun creeping through closed curtains), the film instantly had me hooked with the underlying tension which is apparent even from the beginning, and builds right up to it's revealing climax. The whole 'WAZ' equation theory almost becomes insignificant. OK, so you might see the twists & turns coming a long way off, but for me that doesn't affect the film in the slightest. What really makes the film is it's dark simplicity, brilliant direction & solidly real performances from a non-A-list cast. This film is for me what SAW always promised to be but got lost in it's pursuit of 'ever more creative ways to die'. WAZ isn't an in your face gore-fest with fantastically OTT special effects on a massive budget. It's so much more than that - A dark, gritty, highly atmospheric thriller with a dose of real emotion! You will love it or hate it! I hope it's the prior.",
         "When taking a chance on a sight-unseen, used DVD, my expectations are usually fairly reflective of the few bucks I shell out for it. \"The Killing Gene,\" while boasting a fine cast, struck me as nothing more than another blurb-happy, sledgehammer obvious entry in the Dimension 'Extreme' line of hit-or-miss horrors. After having watched it, all I can say is...holy hell. Obviously targeting the audiences that made \"Saw\" and \"Hostel\" the New Torture Vanguard (one of the box blurbs directly references the former, not without accuracy), \"The Killing Gene\"--despite some transparently derivative elements pulled from the genre--comes very close to trouncing its competition. Remember that moment near the end of \"Saw\" when Cary Elwes does the unthinkable with the titular tool? Well, imagine that degree of gritty intensity stretched out over the course of 102 nerve-shredding minutes, and you have a good idea of what to expect here. Stellan Skarsgard (bearing an uncanny resemblance to Donald Pleasence) plays a homicide detective investigating a string of torture-murders with novice cop Melissa George; suspicions are running that the killer is targeting a group of vile gang members out of revenge for an equally hideous crime (which I won't reveal here; it's a truly horrifying scene). Clive Bradley's script doesn't use the torture angle as a mere marketable throwaway, nor does it treat the characters as meat for the machine; there is a surprising amount of development here, to the point where our sympathies and doubts become one and the same. From a visual standpoint, director Tom Shankland (\"The Children\") uses jerky digital video and claustrophobic close-ups to convey a sense of urgency within a decaying urban nightmare from which all hope has been drained (this could very well be the most squalid metropolis since David Fincher's \"Se7en\"). As an unapologetic, unashamed horror fan, I often find myself sitting through garbage that isn't worth the DVD it's pressed on, which makes something like \"The Killing Gene\" all the more refreshing. Yes, there are some parts you'll feel as though you've seen before; but damned if the overall experience doesn't leave you shaken and adequately disturbed afterward. (It also bears noting that this R-rated film contains some of the most unglamorous, boundary-pushing violence in recent memory.)"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Vertigo Films",
         "UK Film Council",
         "Ingenious Film Partners"
      ],
      "summaries": [
         "A series of deaths have started occurring in New York; Some are being found mutilated while others have an equation wÎ\"z = Cov (w,z) = Ã\u009fwzVz carved onto their skin. As police investigate they discover each victim was forced to choose between sacrificing their own life or a loved ones' life. Before long it becomes clear that this perpetrator has suffered just such a similar fate...so now is coping by seeking a way of solving this philosophical enigma, can Captain Maclean and his officers such as Eddie Argo and his new partner Helen Westcott stop this suspect, because he/she won't not until he/she gets to the end of this equation.",
         "A calculating killer coerces a detective to pay for his previous mistakes."
      ],
      "budget": 5000000
   },
   "movielensId": 61035,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-05-19",
      "dvdReleaseDate": "2008-08-12",
      "directors": ["Tom Shankland"],
      "runtime": 104,
      "movieId": 61035,
      "title": "WΔZ",
      "mpaa": "R",
      "actors": [
         "Selma Blair",
         "Melissa George",
         "Stellan Skarsgård",
         "Sally Hawkins",
         "John Sharian",
         "Paul Kaye",
         "Michael Wildman",
         "Ashley Walters",
         "Tom Hardy"
      ],
      "imdbMovieId": "0804552",
      "originalTitle": "WΔZ",
      "genres": [
         "Crime",
         "Drama",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["ibjhBxn2s1U"],
      "plotSummary": "There is something horribly wrong with the bodies found in the dark city streets. Some are mutilated while others have the Price equation (wΔz = Cov (w,z) = βwzVz) carved into their flesh. Detective Eddie Argo and his new partner Helen Westcott unearth the meaning of the odd equation and realise each victim is being offered a gruesome choice: kill your loved ones, or be killed. Before long it becomes clear that the perpetrator has suffered a similar fate and is now coping by seeking a way to solve this philosophical dilemma.",
      "tmdbMovieId": 15069,
      "avgRating": 2.85294,
      "releaseYear": "2007",
      "numRatings": 34,
      "posterPath": "/8lPZ59iQRqUELprKuB0myy7u6Zm.jpg"
   }
}