{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "1970s",
            "id": 1228
         },
         {
            "name": "drums",
            "id": 2696
         },
         {
            "name": "groupie",
            "id": 4044
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "rock",
            "id": 5288
         },
         {
            "name": "heavy metal",
            "id": 5540
         },
         {
            "name": "headbanging",
            "id": 5544
         }
      ],
      "imdb_id": "tt1031969",
      "video": false,
      "title": "The Rocker",
      "recommendations": [
         12569,
         10074,
         6575,
         13260,
         2179,
         16991,
         10071,
         9750,
         52067,
         15373,
         7553,
         13595,
         34423,
         10878,
         1792,
         10956,
         9900,
         9927,
         11543,
         9718
      ],
      "backdrop_path": "/ykRRqcQwvtcZIokueITkL7xjFM5.jpg",
      "revenue": 8762890,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Robert 'Fish' Fishman",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d19",
               "name": "Rainn Wilson",
               "profile_path": "/Adq8cYhhzmSYRwMWDTc7O53L7FR.jpg",
               "id": 11678,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Matt Gadman",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d1d",
               "name": "Josh Gad",
               "profile_path": "/6ctni3kK4lPteBAInd7kKZyCdZD.jpg",
               "id": 54415,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Kim",
               "gender": 1,
               "credit_id": "52fe433d9251416c75008d21",
               "name": "Christina Applegate",
               "profile_path": "/irUHUE17vDaSSYsOOJAxnHyEiSo.jpg",
               "id": 18979,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Amelia",
               "gender": 1,
               "credit_id": "52fe433d9251416c75008d25",
               "name": "Emma Stone",
               "profile_path": "/lhjnYohEn2HflqCEnWuuilcNUsj.jpg",
               "id": 54693,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Curtis",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d35",
               "name": "Teddy Geiger",
               "profile_path": "/3vH3Pt4NiMombHHJcgd9U3IIAnj.jpg",
               "id": 203772,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Stan",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d39",
               "name": "Jeff Garlin",
               "profile_path": "/cBs7u7rBTvDFp5MFCnvrPeF7SI2.jpg",
               "id": 60074,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "52fe433d9251416c75008d3d",
               "name": "Jane Lynch",
               "profile_path": "/1vjkjyIfphST9onBsMTKmTSl3z8.jpg",
               "id": 43775,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "David Marshall",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d41",
               "name": "Jason Sudeikis",
               "profile_path": "/pYH7faNg8R4KpNOtU3keL4wgu7G.jpg",
               "id": 58224,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Lex",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d45",
               "name": "Will Arnett",
               "profile_path": "/vHCqn3SHfSV6GOWrxzEtoDaSMoU.jpg",
               "id": 21200,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Gator",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d49",
               "name": "Howard Hesseman",
               "profile_path": "/AvzHr1Ul5xmcoGvmGW8t9mrwBTG.jpg",
               "id": 35516,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Kerr",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d4d",
               "name": "Fred Armisen",
               "profile_path": "/d4RwMcYqEGsetnYsfWUZyG1ix3P.jpg",
               "id": 61110,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Trash",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d51",
               "name": "Bradley Cooper",
               "profile_path": "/z5LUl9bljJnah3S5rtN7rScrmI8.jpg",
               "id": 51329,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Sticks",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d55",
               "name": "Lonny Ross",
               "profile_path": "/kliCi3hJV1doLuOoMsYRZI85kcQ.jpg",
               "id": 205300,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Billy",
               "gender": 0,
               "credit_id": "52fe433d9251416c75008d59",
               "name": "Jon Glaser",
               "profile_path": "/7E8nSDRkCnDEOGiunF8OARebtNl.jpg",
               "id": 59842,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Carol",
               "gender": 1,
               "credit_id": "52fe433d9251416c75008d5d",
               "name": "Jane Krakowski",
               "profile_path": "/sOeuLd0MLBk3M6P0nyvZ8TCDUeK.jpg",
               "id": 13636,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Violet",
               "gender": 0,
               "credit_id": "52fe433d9251416c75008d61",
               "name": "Samantha Weinstein",
               "profile_path": "/7C4xAKsVQvSCkGMo5lV7lK2xFHj.jpg",
               "id": 220922,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Kip",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d65",
               "name": "Demetri Martin",
               "profile_path": "/fldjScjsz4SwxwEzSKGqjJuwgvo.jpg",
               "id": 84075,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Aziz",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d69",
               "name": "Aziz Ansari",
               "profile_path": "/aUbZbJWLEnJ5JeT56AmGo94nxAd.jpg",
               "id": 86626,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "Erica",
               "gender": 0,
               "credit_id": "52fe433d9251416c75008d6d",
               "name": "Ellie Knaus",
               "profile_path": null,
               "id": 1114481,
               "order": 18
            },
            {
               "cast_id": 25,
               "character": "Amelia's Mom",
               "gender": 1,
               "credit_id": "52fe433d9251416c75008d71",
               "name": "Laura de Carteret",
               "profile_path": "/4YfnRLg9dQ7yNN7PasKNL1VYX8T.jpg",
               "id": 63858,
               "order": 19
            },
            {
               "cast_id": 26,
               "character": "Amelia's Dad",
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d75",
               "name": "Steve Adams",
               "profile_path": "/xjh3xEFrkF94LTvxqIwqP2ca7l6.jpg",
               "id": 66934,
               "order": 20
            },
            {
               "cast_id": 27,
               "character": "Moby Type Kid",
               "gender": 2,
               "credit_id": "55e41cb2c3a368418e00313d",
               "name": "Keir Gilchrist",
               "profile_path": "/vFrziqS1PDoHYFs2Vn9ro3577Ry.jpg",
               "id": 132712,
               "order": 21
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d09",
               "name": "Peter Cattaneo",
               "profile_path": "/k96pAMgYi84Ddd6fcuHGZOO70v4.jpg",
               "id": 57630,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe433d9251416c75008d0f",
               "name": "Maya Forbes",
               "profile_path": "/o7Z3Oeg4MO8yCIhRTCf7YTz7Qn2.jpg",
               "id": 67360,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d15",
               "name": "Wallace Wolodarsky",
               "profile_path": "/dvmEq92L4UwL20uO2BOQ8vnpPBP.jpg",
               "id": 486,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d2b",
               "name": "Shawn Levy",
               "profile_path": "/bgu9dR2Xlt6xNgcNRgNWhySvFwV.jpg",
               "id": 17825,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe433d9251416c75008d31",
               "name": "Anthony B. Richmond",
               "profile_path": null,
               "id": 14139,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 9.077693,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10186,
      "vote_count": 206,
      "budget": 15000000,
      "overview": "Rob \"Fish\" Fishman is the drummer in '80s hair metal band Vesuvius. He's unceremoniously booted as the group signs a big record deal, is out of the music world for 20 years - and then receives a second chance with his nephew's band.",
      "similar": [
         786,
         31802,
         63973,
         18947,
         525,
         6477,
         824,
         630,
         27586,
         20575,
         3902,
         2005,
         10947,
         11887,
         11899,
         8079,
         9591,
         192657,
         6575,
         2750
      ],
      "original_title": "The Rocker",
      "runtime": 102,
      "poster_path": "/yQfng0iKQVuGDdI5JeoKPINlXuH.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Fox Atomic",
         "id": 2890,
         "origin_country": ""
      }],
      "release_date": "2008-08-20",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Opportunity rocks.",
      "adult": false,
      "homepage": "http://www.rockermovie.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Peter Cattaneo"],
      "runtime": 102,
      "synopsis": "Its 1986 in Cleveland. The band Vesuvius is playing in a bar and the crowd is going wild. The band consists of 4 members Lex (Will Arnett), Kerr (Fred Armisen), Trash (Bradley Copper), and Robert Fish Fishman (Rainn Wilson). They all have the big 80s hair and tacky clothes. They look like a mix of Kiss, Aerosmith, and Guns and Roses. The crowd is going wild and at the end of their last number they go even wilder. Fish jumps out from behind the drums and throws his extremely sweaty vest into the crowd knocking a woman over. The crowd still goes wild and Vesuvius goes backstage and celebrates. They keep talking about how great the show is and high fiving each other. They all cheer on how famous theyre going to be and their manager comes down to congratulate them on a good show. He gives Fish the money to go buy some beers and Fish leaves to go back to the bar. Backstage the agent tells them how Matchbox Records really wants to sign them and how big theyll be theres only one catch. They have to drop Fish so the record labels owners nephew can be the drummer. The band protests saying no because he made the band, came up with the name, and wrote half of the songs. The manager says he understands and gets on his very large, 80s cell phone to call the record label to cancel their deal. He mentions while on the phone that theyll be opening for White Snake and the band members change their minds and decide to leave Fish behind. The manager goes back to the bar and breaks to news to Fish. Fish drops all his beers and runs out back to see the band driving off in their van. He chases them and almost makes it through the back door but they drive off leaving him behind. In the van they all talk about how its ok that they leave Fish because he wasnt all that great and how theyll never get the opportunity again. While drinking Jack Daniels, Trash spits it out in shock because Fish amazingly caught up with them and is running right by the van. But they get ahead of him and think theyve lost him. Again he finds his way to the roof and stabs his drumsticks in the roof of the van attacking them all. They put on brakes and he falls to the ground. He sits up and looks at them all. Instead of doing the right thing they back the van up and drive off. 20 years later Fish is working at a call center looking miserable. One of his co-workers keeps talking about the new Vesuvius album thats out and how awesome they are. He keeps bugging Fish about it and he says he knows but isnt that big a fan of heavy metal. His co-worker says he needs to hear it and puts it in his computer to start playing the music. Fish gets upset but ignores it and takes his next call. The co-worker plays it louder and louder bugging Fish to rock along. Fish puts his call on hold and starts pummeling his co-worker. Later on hes fired and thrown out and catches the bus. Adding insult to injury there are Vesuvius posters all over the place and on the bus he catches even an old man is reading a Rolling Stones magazine with the band on the front. Fish arrives to his place and his girlfriend, Carol (Jane Krakowski) tells him she cant make it works since he lost his job over something that happened 20 years ago. Shes about to break up with him and Fish interrupts so he can break up with her first. He then tells her to get out and she says how since its her apartment. Fish leaves with all his stuff. He arrives at his sister Lisas (Jane Lynch) and is eating dinner with the family. She tells him that shes sorry he lost his job but asks if hell get on his feet within a week. He says no he cant do that and needs to stay a little longer. He then asks his brother-in-law, Stan (Jeff Garlin) how his nephew Matt (Josh Gad) is doing. You can tell Stan admires that Fish used to be a rocker while Lisa is annoyed he wont give up the dream. Stan tells him that Matt got into MIT and that hell be playing with his band at the prom. Fish congratulates him but his niece Violet (Samantha Weinstein) rudely says that its not that great. Matt tells her to shut up. Fish says its a good way to get to the prom and Violet says its the only way hell get to go. Matt says if she doesnt shove it hell shave her head in her sleep. Violet says shed still be the pretty one and Lisa makes them stop. Fish follows Matt upstairs and asks him what his band is and he tells him its called ADD. Fish thinks its called add and Matt has to tell him it stands for Attention Deficit Disorder. Fish says it sounds better and wishes him luck with the show. Lisa then takes Fish to his room and tells him he needs to get a job and leave. Fish asks why she always talks to him like that and she says its tough love. He says why cant she give him kind love instead and she says because he needs a reality check. That night he goes to sleep looking at the stadium in Cleveland. The next day ADD consisting of Matt, Curtis (Teddy Geiger), and Amelia (Emma Stone) are waiting for their drummer. Their drummer shows up with his mother yelling at him and she tells him to explain what happened. He explains that he brought hash brownies to class and got everyone high and his mother yells at him to tell what else he did to the teacher. She angrily blurts out that he drew a penis on her forehead and now hes suspended and cant go to prom. He also wont get to walk at graduation he leaves with his mother smacking him. They panic and Matt mentions his uncle Robert (Fish) used to play for Vesuvius. Curtis says no and Amelia says they can find somebody else. They then have a series of auditions that go wrong. They have a tatted up drummer with no rhythm, a beat boxer, and a techno dancer. It wakes Fish up and goes to the garage unplugging the device calling it a disgrace to real drumming. The kid says that tons of songs have techno and Fish fires back that just because they play Celine Dion in elevators doesnt make it right. The kid leaves and Fish says his work is done and leaves. Curtis and Amelia look at Matt and ask if thats his uncle. Matt says yes and thinks it would be a good idea to have him play at their prom. Matt goes upstairs and asks Fish if hell do it. Fish says he hasnt played in 20 years and doesnt plan on playing ever again. Matt says that since Fish hasnt been a good uncle it would be nice. He mentions that he only comes around for money or when hes down on his luck and that he called Matt Max for many years. He tells Fish that it would help him to get girls to like him and Fish starts to listen thinking about his glory days. Matt says it would mean a lot to him since Fish is family it would make up for all the times he let his family down. Matt leaves and Fish starts to think about it. On prom night Fish is walking down the hall in his tacky, dated rock clothes. ADD is sitting in the back room waiting for him yelling at Matt that Fish was supposed to be there. Matt says not to worry that Fish will be there and he shows up acting arrogant even though hes late. Curtis says theyll be opening in 5 minutes and Fish looks shocked saying because theyre the headliner they shouldnt start until 11. Amelia says because its the prom it ends at 11. Fish gets nervous and pukes. He then takes a piece of his puke and puts it in his pocket. Amelia asks if he just and he says yes he uses it as a good luck charm. They all get grossed out and go out on stage. Curtis tells Fish to follow his lead and he does. The band starts playing and at first are a hit with the school. Then the prom king and queen are called to do a dance. ADD starts singing a slow song, but Fish starts to get carried away. He starts playing out of rhythm and goes wild. The crowd stops and horridly stares at Fish. He then throws his drumsticks out in the crowd and everyone keeps staring at Fish. ADD storms off mad at Fish because he ruined the show. He keeps going on about how great it was and madly Curtis kicks Fish out of the band. The next day Fish is upstairs and feels bad about what he did. So he wont feel like such a jerk he goes to Curtis house to apologize. He comes to the door and Curtis Mom, Kim (Christina Applegate), is tending to her plants. Fish approaches her and asks for Curtis. Kim asks who he is and he tells her. She says she didnt know he was so much older than them she thought he was college age. She tells him her name and he notices that she only said Ms. not Mrs. He tries to ask her out and Kim turns him down. She lets him in and he starts talking to ADD about how he screwed things up. He apologizes telling them he has an idea and that they can make it as a band since they have a moody rocker, a punk chick, a tech nerd, and a sloppy drummer. He also tells him that hell get the band gigs. Matt tells Fish to go outside and theyll think about it. While Curtis is quite doubtful, Matt and Amelia agree with Fish that they do have the typical rock band and that if he could get them gigs they would have a possible career. Curtis agrees to it and says hell make Fish apart of the band if he can get them gigs. They look outside while Fish stands on a swing swinging it back and forth. Soon Fish is trying to get ADD gigs. Hes calling every bar in town and everywhere to get a venue for the band. He goes to a coffee shop and runs into Curtis writing songs in his notebook. Curtis looks pissed to see Fish but Fish sits down at his table anyways. Fish asks him if hes writing and Curtis says yes. Fish asks if he can read some of his lines and Curtis closes the book. Fish then starts saying in a band people should share everything. Reluctantly Curtis gives him the notebook and Fish tells him how talented he is. Fish then starts to ask Curtis if his dad just ran off and Curtis says yes. Fish says hes sorry and that hell be ok and hes glad that theyre in a band together. Curtis then asks Fish if he found them a gig spot and Fish lies saying that its going well. Curtis tells Fish that none of his demos have done well and its a stupid dream for him to hold on to. Fish decides to use an old method of getting in the car and blasting his demo while driving down the street. He says if it makes him feel like hes on top of the world then he is worth a record deal. They get in the car singing ADDs music and Curtis starts feeling good about his music. It works so well he starts warming up to Fish and feels more confident. The next day Lisa answers the phone and yells for Fish. Fish answers the phone and yells in excitement obviously getting them a gig. Fish runs to the garage and tells ADD they got a gig in Fort Wayne, Indiana. They all protest that theyll never be able to go because of their parents. Fish tries to convince them to go without permission but they say no. Suddenly Amelia comes up with the clever idea to lie about going to a church retreat since most parents buy into it. They all say yes and prepare for the trip. Saturday night Fish steals Lisas car and is driving Matt, Curtis, and Amelia. Curtis is writing again and Fish asks what hes writing this time. He reads some lines about being bitter and Fish instantly loves it. Fish gets them all hyped up about going to their first gig talking about how nothing can stop them. Unfortunately they get pulled over by the cops and have to stop. The next day Lisas yelling at Fish about stealing her car. She grounds Matt and kicks Fish out the house. Stan thinks its cool and risky that they stole her car to do a gig but Lisa yells at him to shut up. When Fish leaves, Stan tells him to take care of himself and Fish tells Stan to rock on. That day Fish goes to a Chinese food restaurant with the owner to the basement. The owner tells Fish he ordered so much it paid for his kids to go to college and that he can stay until he gets back on his feet. The owner hands Fish a large spoon and Fish asks what its for. He tells him to kill the rats that frequent the basement. Soon a rat comes out of a corner and Fish almost hits it when Matt comes downstairs to find him. Fish asks Matt what hes doing there. Matt tells Fish even though hes grounded and cant see Fish again he came up with a solution so they can still practice and brings Fish a laptop so they can practice together online. The next day they connect on their computers to practice. Fish keeps checking the microphone and camera to see if it works. He hears the others of ADD and walks back to his drums. But hes completely naked butt showing in the camera nothing left to the imagination. They all freak out until he sits down to start drumming. It doesnt make it any better because he keeps moving around with everything freely hanging in the camera. At the same time Violet is trying to do a school project over the internet and on the phone complaining to her friend that she cant make the internet go fast enough because of Matt practicing with the band. She pulls up the page of them practicing and sees Fish naked. She freaks out at first but then puts them on YouTube to humiliate Fish. It instead works in their favor and the band gets over 1 million hits. People even recognize Fish with clothes on in public. Fish comes home and Lisa, Stan, Matt, and a manager, David Marshall (Jason Sudeikis), are all standing on the front porch. David tells Fish that hes a hit and that even though they mainly look at the video to see the naked drummer they start singing the songs and that Matchbox Records wants to sign them. They later go to a recording studio starting to play their music. At first the song Curtis wrote about being bitter is too depressing and needs to be changed. Fish tells Curtis to sing hes not bitter and to make it a lot more upbeat. They give it a shot and it works making the song easier to rock to. David loves it and offers them a summer tour. In Matts garage, his, Curtis, and Amelias parents are listening to Fish talk about achieving their dream and how going on tour would be a good idea. Kim interrupts and says she doesnt think it would be right to let the kids keep thinking what if all their lives. They agree with her and let the kids go on tour with Fish. The next day the tour bus pulls up and they tour around the Midwest. They first go to a bar and start encountering technical difficulties. But they bounce back and start getting the attention of the crowd. After the show, a fan comes backstage to tell ADD how great they are. Fish tells them they just got their first fan. He then hugs all 3 of them very, very sweaty making them all wet. Soon some groupies come downstairs offering to buy beer. Fish says no because theyre underage but hell gladly take a drink. The groupies say no they wanted to talk to the boys more their own age and leave. Matt, Amelia, and Curtis go upstairs and play video games and text while Fish comes in asking why they arent partying like real rock stars. They say theyre tired after playing and just want to rest. Fish tells them they arent real rock stars and starts jumping on the bed and breaking things. While on tour, they play a show and go to rest, Fish is getting into any and everything out there. Hes jumping off roofs, jumping in pools, and getting drunk at bars. It all goes wrong when the band is having a party in the hotel room and Fish throws a TV out the window. They all get arrested and are sitting down after getting mug shots. Fish goes to Curtis telling him thats what being a rock star is all about. Curtis says hes all about the music. Fish tells him hes right and Curtis tells him why music has been important to him. He says he hopes his father will come back one day if he sees him in music and how talented he is. Fish says he cant keep looking for something thats never going to happen and that Curtis dad lost out. Curtis smiles at him and the cop comes to them letting them know theyve been bailed out. Fish thinks its some fans but then finds all of their parents there. They all yell at Fish knowing he wasnt a mature adult. But Curtis yells they cant quit the tour and disappoint all the fans they have. Kim volunteers to go on tour with them. On the tour bus Kim and Fish are already at odds with each other. Fish tells her how shes killing his buzz and she says had it not been for him she wouldnt be on the bus. He takes a nap and they ride along. The tour is going well while on the bus the band starts to discover some things about each other. Since the beginning Fish has been trying to get Amelia to smile but she wont. Curtis tries to make her smile and even glances at her to see if anything makes her smile showing that he likes her as more than a friend. After another great performance David tells them they have a music video shoot. They get excited and soon show up at the shoot. Everyone is standing there ready until they notice Amelias not coming out. Kim runs out with a woman dressed as Amelia and she tells them its a bad day for her. Fish goes to her dressing room to handle it. Amelia yells that shes upset the stylist brushed her hair and she lets Fish see her. Its all messy and big and all over the place. She says if thats what people want her to look like then she doesnt belong in music because she isnt like all the other pop stars out there. Fish tells her shes not like them and that hell help her with her hair. She comes out looking like herself again and thanks Fish. You can tell Curtis is looking for a smile but it still doesnt come. At the shoot Kim and Fish start talking. Kim tells him she used to be a rocker in an all girl band when she was young. He asked why didnt she stay with it and she tells him a 17 year old pregnant lead singer didnt set well with MTV. Fish tells her they had limited vision and starts to see some similarities in both of them. That night after another performance the band does well and David invites them to a YouTube party. A yellow Hummer limo pulls up for them to get in. Amelia, Curtis, and Matt all run into the Hummer while David tries to make a play for Kim. He first asks her if shes heard of a MILF and then says hed never call her that. He calls her a MILMSLT (mom Id like to make sweet love to). She then calls him a PILS (person Id like to slap). David leaves embarrassed while Fish walks out there. Kim asks him why Fish isnt going to a party and he tells her she found 2 ladies to go on a date with. He says goodnight while she goes back to her hotel room. At the YouTube party, theyre all socializing with the other patrons. Matt is walking around nervous, Amelia notices and walks over to him asking him whats wrong. He says he cant talk to girls and wants to talk to a girl with a shirt on saying she loves him. Amelia says it shouldnt be so hard but he still punks out saying hes never kissed a girl. Amelia kisses him and makes him go talk to the girl and he finally approaches her. Amelia looks over at Curtis seeing him bombarded by a bunch of girls and she looks away. Curtis then looks to see her soon bombarded by a bunch of guys asking for her autograph and he looks away defeated. In the hotel parking lot Fish sees Kim playing Guitar Hero in her room and knocks on her door to get in. She lets him in and they play together. In Davids office ADD and Kim sit together to see the new video they made. Problem is Fishs face is being covered the whole time by the editing. But the good news is theyll be released to TRL at number 9 in a month even though the video hasnt been released yet. David then tells them they have a chance to play at the biggest venue in Cleveland with 20,000 fans and open for Vesuvius. They all pause and have a look of horror on their faces. Fish storms out and goes to the roof saying no he wont do it and Kim chases him up the stairs. Downstairs Curtis says no they cant do it because theyre a band and theyre a family and would never do that to Fish. At first David tries to get them to drop Fish because hes old and so accident prone hes basically in a full body cast. The band still says no keeping Fish unlike his last band. David says ok and walks away to the roof to talk on the phone and possibly convince Fish to do otherwise. On the roof Kim tells Fish he needs to grow up and that he should take the opportunity for ADD since its been 20 years he should get over it. Fish wont shut up and Kim kisses him right when David walks to the roof to catch them. Kim tells him she did it to shut him up. David then goes to the elevator and catches Curtis on the way up. He tells him hes glad theyre keeping Fish since hes banging Curtis mom it would make since. Curtis gets mad and goes to his room. The next night they perform at another venue and again have a happy crowd. Curtis then tells the crowd hes happy theyre going to open for Vesuvius even though the rest of the band didnt know it. Fish says he wont do it and Curtis says they will since he shouldnt be such a loser if hes dating his mom. Fish gets so upset he jumps in front of the stage spraining his ankles with already broken bones. Kim looks shocked to hear the news and when Fish runs out back she chases him. He says he wont do it and Kim says he needs to grow up again. He says she didnt want to give up on her dream either but she says its true she just chose to grow up. Soon Fish quits the band and goes back home to the basement of the Chinese restaurant. The band gets a replacement drummer who seems to be completely ungrateful and nonchalant about getting the spot. He doesnt even fit their image. Fish decides to get a job while Stan helps him in the interview because its where he works. Fish also cuts his hair off to look the part totally giving up on the dream. That night Amelia and Matt are waiting for Curtis while the replacement drummer isnt paying any attention to them blasting his headphones. Curtis comes in and Amelia yells theyve been waiting for 2 hours while he was hanging out with groupies obviously mad. Matt tells him they need Fish back and that Curtis was mean to him. Curtis said he was selfish and immature and they replacement drummer is fine. Matt says hes not because he looks like an Abercrombie model. Curtis walks off upset. The next day Fish is going to work and sitting at the table eating lunch. Curtis approaches him at work and sits down to tell him hes sorry and how much it would mean to him if they played for Vesuvius. Fish still refuses and Curtis tells him hes not a working stiff. He tells him he needs to stop going after something that was never there and to open that night with them. Fish changes his mind and gets excited enough to jump on the table to be crowd surfed out by Stan and his co-workers. That night they show up at the arena and David tells Fish hes glad hes back after the big fight. They all go backstage to change for the show and rehearse when the members of Vesuvius run into ADD. They start talking to ADD and Fish asks if they remember him. They laugh and say they do remember him the whole time in a British accent. Fish asks why they changed their accents all of the sudden even though none of them are from England. Fish then says hes been waiting for 20 years to tell them what hes wanted to do and says if it were a week ago he would be clawing their faces. But now hes over that and wishes them good luck. They part ways and ADD goes to perform. After a good show and the crowd going wild ADD goes off stage. Curtis then asks Amelia if she would like to go to dinner and she says shell call Matt. He says he just wanted it to be the 2 of them and she gets excited enough to smile and say yes. Fish is happy that she smiles and she keeps smiling for a while. Next Vesuvius is being cheered on stage and ADD watches them from the side. During the show things are going wild until Lex drops his microphone while singing and the music skips for a little bit showing theyre lip synching. The crowd doesnt notice it until Lex runs around on stage trying to cover it up and knocks over all the equipment by accident because of his mistake. It costs him because the sound crew cant fix it and the crowd knows booing them off stage. ADD looks shocked that for 20 years Vesuvius isnt singing anymore while David is on the phone freaking out to the record label explaining it as an Ashlee Simpson situation. Vesuvius is kicked off the stage by beer cans and everything else being thrown at them and they angrily leave. Soon the crowd keeps chanting ADD over and over again. David says no it doesnt look good outdoing Vesuvius and it would piss of the record label. Curtis says they dont have a choice they have to go on stage and perform and get a new manager. David changes his tune saying hes ok with it but Fish tells him once again hes fired. They go on stage and perform to a crowd of screaming fans and the movie ends with them jumping in a still shot.",
      "writers": [
         "Maya Forbes",
         "Wallace Wolodarsky"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1031969/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyMTgzMTQ0MF5BMl5BanBnXkFtZTcwNTE3OTU3MQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Rainn Wilson, Josh Gad, Christina Applegate | See full cast and crew »"],
      "reviews": [
         "So I just went to a pre screening of this film in downtown Chicago and Mr rainn Wilson himself was there to do a Q & A afterwards. This movie was actually laugh out loud funny, it shows a lot of character sub plots and builds a good and funny funny time telling about each character. This is a go for the win movie and even gave me tingles once and awhile. There is a lot of sub plots and it all works together for the ending. It is about Rainn's character who was in a in a rock band that was on their way to being huge and they kick him out of the band. He starts a band with his nephew and his friends and show them how to be true rockstar giving himself the chance and the dream that was cut from him. I give it a 8 out of 10 and Rainn was a true comic.",
         "This was the biggest surprise of the year - bar none. A great comedy - as in laughs, feel good, and just plain enjoyable. The plot of the loser who makes good at rock'n'roll second time around is very Jack Black and Rainn Wilson does a GREAT job - there is no recourse to gross or sarcastic humor here - rather it plays on its rock roots, chucks in some stupidity, and some kick-ass tunes, and lots of excellent one liners and like I say totally surprised us as to how genuinely funny and warm-hearted this is. Great cast and a great script - sure it's not perfect, but after all the pseudo-comedy and angst of 2008 it was refreshing just to sit back and enjoy an entertaining movie. we loved it and are normally really cynical about comedies - but this rocks and would recommend to anyone as a real effort by all involved to stop being smarter than the audience and just enjoy life - in two and a half words? - it rocks!",
         "1986 - Robert 'Fish' Fishman is the drummer of an up and coming rock band called Vesuvius. However, on the night they are offered a massive record deal, they are told there is a catch.... they have to sack the drummer. Twenty years later, Fish is still angry about that, but when offered the chance to play drums for his nephew's rock band at the Prom, he see this as a chance get to live the rock lifestyle he always wanted.... In many ways, The Rocker is a sequel to School Of Rock, in that you have the older band member, with much younger band members. The difference here though, is that they are all in their late teens. But even these similarities don't hide the fact that for it's running time, The Rocker is hugely enjoyable. The cast, lead by Rainn Wilson are all good. Wilson as Fish gets to over the top as he lives out his dream, and while some of his antics are a bit childish at times, they are probably no worse that what actual bands get up to at times. The fact that the rest of the band, are normal teens makes Fish's antics even funnier. As for the rest of the band members, yes you do have some clichéd characters. There is the sensitive lead singer/song-writer, the Indie- spirited girl, and the genius but shy keyboard player. Despite this however, each person develops as the movie progresses, even Fish and while some plot developments in the movie are very predictable, this doesn't detract from the enjoyment. Peter Cattaneo, who also directed The Full Monty, keeps things moving along nicely. The script, while not a laugh out loud riot (for me anyway), did keep a smile on my face all the way through. The music in the movie is also well done. Not only in the choice of background music, but also the songs that the band have written themselves. The Rocker will never be remembered as an all-time comedy classic. But for it's running time, it is very enjoyable, keeps you smiling and is very entertaining.",
         "I don't know why, from the trailer I didn't really want to see The Rocker, it looked like another silly teenage comedy, but I had the opportunity to see it for free and decided to go ahead and give it a fair chance. So I saw it yesterday and honestly, I thought it was a pretty decent comedy, much better than I expected. But it fell flat and became a predictable movie, I don't mind them every once in a while, but this story could have had a better ending that surprised us all. I love Rainn Wilson, ever since I saw him way back in House of 1000 Corpses, I just thought something strange stood out about this guy, he eventually became bigger in the hit TV show The Office. He's now the new male lead in a comedy, now he's decent, he did make me laugh like crazy in a lot of his scenes, but I think he could have held his own a little better, he's good, but he's not great as a leading comedic actor. He plays Fish, a drummer for a rock band that later goes platinum after kicking him out. His life as an adult isn't so great, the band is doing very well even 20 years later. Fish moves in with his sister, his nephew asks him to play drums in his band when their drummer can't play with them any more, but later Fish gets in trouble with his sister and can't live with her any more. But his nephew sets up a way through the internet and camera's, but when Fish doesn't know the camera is filming him naked, a new internet era is born of the Naked Drummer. ADD, the band he's playing with his nephew, becomes huge and fame takes a tole on the kids as well as Fish's old age. Now over all, I did like The Rocker, I think it's worth a matinée price, it's a fun and silly comedy that gives you a few good laughs. Mainly by Rainn Wilson, I couldn't help but laugh hysterically when he finds out the band is kicking him out and he jumps on the van that they're driving away in and is holding on by his drum sticks, sounds stupid, but when you see the look on his face, it reminds you of The Terminator 2: Judgement Day with the T-1000. Like I said, the ending flops a bit though, I think they could have done something different, but it's a good movie for laughs. Like I said if you want to see it in the theater, I'd recommend the matinée, but otherwise it's just a rental. 6/10",
         "Some critics have called the latest \"rock-n-roll world\" lampoon flick \"The Rocker\" an incomparable imitation of the critical darling of the same theme \"School of Rock\". To drum it up in simplistic syntax, both films ROCKED!!!!! \"The Rocker\" is not a carbon copy narrative of \"School of Rock\"; it does have a musical story life of its own. \"The Rocker\" stars the zany Rainn Wilson as Robert \"Fish\" Fishman, an over-the-top boisterous drummer. Fish was about to dive into the school of \"Rock-Roll Fame & Fortune\" when he was the drummer of an 80's heavy metal band called Vesufius. Just before Vesufius made it to stardom, Fish got the firing bait when the band's agent persuaded the Vesufius band members to let the Fish go so he can be replaced with a recording studio hotshot's son. Therefore, Fish was a musician out of the musical waters for the next twenty years. That is until Fish's nephew Matt asked Fish to be the drummer of his high school band entitled A.D.D. (are you with me?, lol) because the original juvenile drummer boy was being a bad boy and got expelled. Fish accepts and the rocker show begins! Fish is one to rebel and follow the beat of his own ludicrous drum and therefore A.D.D. chaos follows. Due to parental control issues of the remaining A.D.D. band members, the band is forced to rehearse each from their own home utilizing technical wizardry so they can view each other. Fish chooses to rehearse in the nude and before you can say \"a little bored girl put it on You Tube and got zillions of hits\" it did that exact same thing. That undoubtedly is the scary \"naked truth\" on the Fish following. Consequentially, fame and fortune follow for A.D.D. as they land a recording contract and tour gigs all over the country. Rainn Wilson's breakthrough performance as Fish was a comedic vivacious delight that should rain him in some more starring comedic roles. I also loved Jeff Garlin's role as the rocker-fantasy suburban dad. Screenwriters Maya Forbes & Wallace Wolodarsky scripted a trendy and modern narrative that symbolized the present youth obsessions & dilemmas in combination with the 80's retro fixations of the forty-year old generation. It was also quite damn hilarious for those young and older. And Director Peter Cattaneo brought the script to cinematic life by orchestrating a fine-tuned comedic machine. \"The Rocker\" might not be nominated for any Oscars, Golden Globes, or even Grammys, but it's a flick that simply (well you know\u0085) ROCKS in the comedic entertainment \"hysterically laugh out-loud\" record category. ***** Excellent",
         "Though it borrows liberally from its genre brethren, The Rocker showcases a keen sense of parody and heart with a powerful star performance from the Jack Black-channeling Rainn Wilson. The \"naked drummer\" doesn't stray too far from his Office persona, but the random foul-mouthed spurts and goggle-eyed expressions certainly add a welcome layer of comic ingenuity. In 1986, Robert \"Fish\" Fishman (Rainn Wilson) drums for the popular rock band Vesuvius and a lucrative career seems destined to embrace him. However, a chance to play at a killer gig causes his bandmates to sell him out for fast fame, and the drummer is literally kicked to the streets. Twenty years later, Robert finds himself in a dead-end desk job with no hope of escaping his mundane lifestyle. But good luck and misfortune strike simultaneously leaving him jobless, homeless, and shacked up at his sister's house \u0096 where the desperation of his nephew's rock band lands him a spot as their drummer. What starts off as a rocky, mismatched collaboration inadvertently becomes a rapid success and Robert, along with Amelia (Emma Stone), Curtis (Teddy Geiger), and Matt (Josh Gad) may finally get to live the dream they've worked so hard to obtain. For his debut leading film role, Rainn Wilson manages a diverse blend of comedy and emanates the better qualities of funnyman Jack Black. Rainn keeps his character under control so as not to get annoying but remains erratic enough to evoke plenty of laughs. Most of the physical comedy (and nudity, unfortunately) belongs to the Office veteran who competently handles elaborate falls and crazed expressions with sincere enthusiasm. Spouting off random quotable gibes, Wilson utilizes a copious amount of offbeat one-liners and bizarre references that will result in a hearty chuckle for those attuned to the borderline-offensive brand of comedy. While the primary band members fill their roles quite ably, a surprising amount of laughs come from the hilarious supporting characters and their moments of inspired lunacy. Most notable are Will Arnett as a crazed 80's rocker and Jason Sudeikis as an arrogant record label agent whose offensive pick-up lines never fail to amuse. Numerous cameos also fill the screen, from stand-up comedian favorites to famous musicians and anchored comedy character actors. Though the whole cast turns in fine performances and Rainn Wilson conjures up a delirious beast of a drummer, The Rocker's downfall may be its heavily treaded subject matter. The cliché-filled plot resembles far too many others and even the rather unique pieces feel drowned out by the surplus of stereotypical events. What clearly rocks though is the hysterical frontman and a host of great cameos and fantastic supporting characters who bring an edgy absurdity to the whole affair. - Joel Massie",
         "Late August used to be a dumping ground for crappy movies, but now look at how \"The 40 Year Old Virgin\" has changed all that. The \"sleeper hit\" genre has become a key part of August, so much so that it's hard to tell the difference anymore. Take \"The Rocker\" for example, the first starring role for Rainn \"Dwight\" Wilson from \"The Office\", a seemingly crappy movie that is already bouncing around the title of \"The Summers Sleeper hit.\" Now usually the \"sleeper hit\" genre has been attached to Judd Apatow-related flicks like \"Virgin\" and last summers \"Superbad\", and its really hard to picture Wilson in a lead role at all so this all seems like a pretty hefty claim, but the question remains, is \"The Rocker\" a crappy movie or is it a sleeper hit? Wilson plays Fish, the drummer for up and coming 80's metal band Vesuvius. Just when the band is about to make it big, Fish is cut out of it, leading to 20 years of working dull, soul-crushing jobs while Vesuvius quickly becomes one of the biggest bands ever. Some salvation comes his way in the form of his nephew's High School band, A.D.D. The band has just lost its drummer to a High School prank and is in desperate need of a replacement, leaving them with no one else to turn to except Fish. The band, which includes nephew Matt (Josh Gad), brooding lead singer Curtis (Teddy Geiger), and lone girl bassist Amelia (Emily Stone) is at first reluctant to accept the nearly forty year old drummer but in a plot twist that can only happen in movies, a Youtube video they make leads to big time fame. Soon A.D.D is playing the clubs and Fish is even romancing Curts' young mom (Christina Applegate). Just like all bands, they are not without their conflicts. Wilson comes from the Will Ferrell school of comedy, in that he goes for cheap and sophomoric material. The movie relies on vomit, sweating, Wilsons flabby body jiggling in the wind, and when all else fails, him getting hit with something or a pratfall. Sure the shock value from these things is worth a chuckle sometimes but he doesn't have the same sort of buffoonish innocence that Ferrell does and a lot of what makes this kind of material hilarious is the sort of personality doing the delivery. Wilson doesn't seem to have it and so a lot of the jokes just look like what they are, cheap and sophomoric. And the story doesn't help either. It follows \"School of Rock's\" storyline pretty closely of build a band, learn life lessons, encounter a problem, and finally rock out in front of a huge crowd. Just \"Rock\" had an infectious enthusiasm for music as well as a sweet side but this is more a generic retread of most stories about the successes and perils of starting a band. No real surprises here. The cast does OK. I'm not saying Wilson is a bad comic actor but this material doesn't seem suited for him at all. All the 80's headbands and weird outfits can't disguise the fact that he's better playing a much weirder character like Dwight from \"The Office\". Christina Applegate seems to light up any film she's in and I wish she was given more screen time here. Emma Stone, Josh Gadd, and Teddy Geiger each get do their best in throwaway roles as musicians dealing with teenage angst. Will Arnett and Fred Armisen are both pretty funny as Fish's old band mates and Jeff Garlin and Jane Lynch are pretty much wasted in unfunny roles. There is one person who makes out like a bandit in this movie though and that is Jason Sudeikis as the A.D.D's asshole manager. Known to me only for a recurring role on \"30 Rock\", he gets the best lines and when he gets them he knocks them out of the park. \"The Rocker\" itself just doesn't rock though. It just felt too cheap and sophomoric, too conventional, too much of a waste of talented actors, and above all, a completely wrong type of vehicle for Rainn Wilson.",
         "Saw the movie with very low expectations...but was surprised. I mean seriously, i thought this movie was going to be completely lame, and i was just waiting for that one \"stupid\" moment that defined the movie as a complete Flop,etc. But to my surprise, the movie just seemed to keep getting better! (especially the beginning, with Rain Wilson chasing after his ex-band mates in the van, WOW, i literally almost fell out of my chair! I love unpredictable crazy moments like that...and this movie was full of them.....) Im a huge fan of Rain Wilson, and I KNOW he's an underdog actor who is not being used to his full potential. I just LOVE how his character is throughout the movie, he's just got this whole Jack-Black meets Dwight(from the Office) thing going on! He does a very good job of portraying a kind of washed up crazy rock star, yet still very sharp and witty at times....he just seems to be able to switch them on and off during the movie. Overall this movie was A lot better than i thought, had a very good rock flow to it, yet positive mood. If you see this movie, go into it NOT expecting much!(just like the trailers make you think) You'll be most likely surprised by all the witty funny moments that just flare out of nowhere! ----- THE GOOD - -Rain Wilson is VERY funny -He does a good job acting, \"The Office\" fans will like it -Movie has a decent positive storyline IMO -The costumes were PRICELESS -The faces Rain makes, and his quotes were excellent..(not quite as weird/good as the Office, but definitely good enough.) -Alot of unpredictable little quick moments and quotes! THE BAD - -I couldn't stand the borderline EMO sounding songs the band played thru-out the movie sometimes!(although Rain was still his hardcore self and never missed a friggin beat!) -The storyline just suddenly moves REAL FAST...then all of a sudden slows back down to normal speed....like how they suddenly get a record contract,etc....",
         "Peter Cattaneo MBE is probably best known for his hit film, \"The Full Monty.\" But here, he really utilizes top character actors and actresses to create some memorable and humorous moments. Rainn Wilson maybe the star but he's not alone. Jeff Garlin and Jane Lynch plays his brother-in-law and sister. Christina Applegate plays the mom of one of the musicians. The story isn't as sweet or vulgar as one would think of today's comedies. The only questionable scene is Rainn's character is naked for the rehearsal which lands him better known as the naked drummer. The beginning is humorous with Fred Armesen and Will Arnett as members of Vesuvius who ditched the drummer, Robert Fishman (Rain's character) right on the verge of stardom. Fish retrieves to having a somewhat normal life even has a normal girlfriend played for a few minutes by Jane Krakowski. Jason Sudekis plays the band's manager. Howard Hesseman plays their RV driver. I loved the casting of this film because of all the familiar faces. Jane Lynch is one of my favorite actresses because she can be both dramatic and comedic at once. This film is rated PG-13 and I think it has to do with that one nude scene but apart from that. They really have a message about working together as a team. This film wouldn't have been made without the teamwork of the cast and crew itself.",
         "I was lucky enough to see The Rocker at a free screening and laughed all the way through the movie. Very funny. I enjoyed the movie so much, I saw it again at another screening, and it was just as funny the second time. Rainn Wilson turns in a very good performance as Robert \"Fish\" Fishman in his movie debut, however the part could have just as easily been played by Jack Black. Wilson plays a rock drummer who is kicked out of his band just before they make it big. Fast forward 20 years and he has a chance to live the rock-n-roll dream again with a new band. If you liked \"Almost Famous\" or \"School of Rock,\" then you will like this movie more. While rated PG13, the movie contains no F-bombs or sex scenes and is a movie parents can feel safe letting their teen and pre-teen children go see. Parents will want to see this movie as well."
      ],
      "genres": [
         "Comedy",
         "Music"
      ],
      "productionCompanies": [
         "Fox Atomic",
         "21 Laps Entertainment",
         "Rocan Productions"
      ],
      "summaries": ["The Rocker tells the story of a failed drummer who is given a second chance at fame. Robert \"Fish\" Fishman is the extremely dedicated and astoundingly passionate drummer for the eighties hair band Vesuvius, who is living the rock n' roll dream until he is unceremoniously kicked out of the band. Twenty years after his rock star fantasies are destroyed, just when Fish has finally given up all hope, he hears that his nephew's high school rock band A.D.D. is looking for a new drummer. They reluctantly make him the newest member of the band, giving him a chance to reclaim the rock God throne he's always thought he deserved, and taking the young band along for the ride of their lives."],
      "budget": 15000000
   },
   "movielensId": 61255,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2008-08-20",
      "dvdReleaseDate": "2009-01-27",
      "directors": ["Peter Cattaneo"],
      "runtime": 102,
      "movieId": 61255,
      "title": "The Rocker",
      "mpaa": "PG-13",
      "actors": [
         "Rainn Wilson",
         "Josh Gad",
         "Christina Applegate",
         "Emma Stone",
         "Teddy Geiger",
         "Jeff Garlin",
         "Jane Lynch",
         "Jason Sudeikis",
         "Will Arnett",
         "Howard Hesseman",
         "Fred Armisen",
         "Bradley Cooper",
         "Lonny Ross",
         "Jon Glaser",
         "Jane Krakowski",
         "Samantha Weinstein",
         "Demetri Martin",
         "Aziz Ansari",
         "Ellie Knaus",
         "Laura de Carteret",
         "Steve Adams",
         "Keir Gilchrist"
      ],
      "imdbMovieId": "1031969",
      "originalTitle": "The Rocker",
      "genres": [
         "Comedy",
         "Music"
      ],
      "youtubeTrailerIds": ["QFpOSZIegeg"],
      "plotSummary": "Rob \"Fish\" Fishman is the drummer in '80s hair metal band Vesuvius. He's unceremoniously booted as the group signs a big record deal, is out of the music world for 20 years - and then receives a second chance with his nephew's band.",
      "tmdbMovieId": 10186,
      "avgRating": 2.97287,
      "releaseYear": "2008",
      "numRatings": 387,
      "posterPath": "/yQfng0iKQVuGDdI5JeoKPINlXuH.jpg"
   }
}