{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "desperation",
            "id": 1333
         },
         {
            "name": "highway",
            "id": 3306
         },
         {
            "name": "wilderness",
            "id": 3593
         },
         {
            "name": "getting lost",
            "id": 5930
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "desert",
            "id": 18034
         },
         {
            "name": "friend",
            "id": 225061
         }
      ],
      "imdb_id": "tt0302674",
      "video": false,
      "title": "Gerry",
      "recommendations": [
         383,
         126193,
         43878,
         146662,
         155006,
         52105,
         47143,
         8942,
         27432,
         42206,
         42164,
         33324,
         18292,
         753,
         49559,
         154815,
         45126,
         1999,
         15867,
         22478
      ],
      "backdrop_path": "/2nxWZQegYEeezdAylleaQ53o09m.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Gerry",
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e02d",
               "name": "Casey Affleck",
               "profile_path": "/kPNMpiZHsAzeQar4DiNsrekwHBU.jpg",
               "id": 1893,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Gerry",
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e031",
               "name": "Matt Damon",
               "profile_path": "/elSlNgV8xVifsbHpFsqrPGxJToZ.jpg",
               "id": 1892,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e00b",
               "name": "Gus Van Sant",
               "profile_path": "/3vLQK7nbmOTBVJrdfrmySCYZFJX.jpg",
               "id": 5216,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e011",
               "name": "Harris Savides",
               "profile_path": "/7B7o49bFyrfoiUvEujqqXNW8avK.jpg",
               "id": 10688,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e017",
               "name": "Dany Wolf",
               "profile_path": null,
               "id": 10687,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e01d",
               "name": "Casey Affleck",
               "profile_path": "/kPNMpiZHsAzeQar4DiNsrekwHBU.jpg",
               "id": 1893,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e023",
               "name": "Matt Damon",
               "profile_path": "/elSlNgV8xVifsbHpFsqrPGxJToZ.jpg",
               "id": 1892,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e029",
               "name": "Gus Van Sant",
               "profile_path": "/3vLQK7nbmOTBVJrdfrmySCYZFJX.jpg",
               "id": 5216,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e037",
               "name": "Matt Damon",
               "profile_path": "/elSlNgV8xVifsbHpFsqrPGxJToZ.jpg",
               "id": 1892,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e03d",
               "name": "Casey Affleck",
               "profile_path": "/kPNMpiZHsAzeQar4DiNsrekwHBU.jpg",
               "id": 1893,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e043",
               "name": "Gus Van Sant",
               "profile_path": "/3vLQK7nbmOTBVJrdfrmySCYZFJX.jpg",
               "id": 5216,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4326c3a36847f803e04f",
               "name": "Goro Koyama",
               "profile_path": null,
               "id": 20228,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "52fe4326c3a36847f803e055",
               "name": "Andy Malcolm",
               "profile_path": null,
               "id": 20229,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "52fe4326c3a36847f803e05b",
               "name": "Arvo Pärt",
               "profile_path": null,
               "id": 20230,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "56865c9c92514131df01bd53",
               "name": "Felix Andrew",
               "profile_path": null,
               "id": 20227,
               "department": "Sound",
               "job": "Sound mixer"
            },
            {
               "gender": 2,
               "credit_id": "56865cc4c3a36828f5014bc4",
               "name": "Leslie Shatz",
               "profile_path": null,
               "id": 56765,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 2,
               "credit_id": "56865cccc3a36828f5014bc6",
               "name": "Leslie Shatz",
               "profile_path": null,
               "id": 56765,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "56865d2bc3a3684bcc02044e",
               "name": "Todd Beckett",
               "profile_path": null,
               "id": 1409220,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 7.297951,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1956,
      "vote_count": 95,
      "budget": 3500000,
      "overview": "Two friends named Gerry become lost in the desert after taking a wrong turn. Their attempts to find their way home only lead them into further trouble.",
      "similar": [
         26388,
         28178,
         40807,
         290512,
         68718,
         281957,
         75174,
         394117,
         23168,
         336843,
         347031,
         397422,
         13523,
         7191,
         862,
         585,
         38365,
         62211,
         41630,
         9433
      ],
      "original_title": "Gerry",
      "runtime": 103,
      "poster_path": "/1lu054JL6OPG65N99MaYCdI6y8T.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Epsilon Motion Pictures",
            "id": 1171,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tango Films",
            "id": 32598,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "My Cactus",
            "id": 32599,
            "origin_country": ""
         }
      ],
      "release_date": "2002-01-12",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Gus Van Sant"],
      "runtime": 103,
      "synopsis": "We are driving a flat, winding, dry and isolated road through desert brush. Everything is quiet. Two young men in a car say nothing to each other. They arrive at a marked \"wilderness\" trail and head off without anything but the clothes on their back and an extra shirt. With energy and boundlessness they go and go and go. They mention the \"thing\" that they're apparently going to and how it should be there somewhere. They have no map. The landscape changes, they run, they smoke cigarettes and finally they decide they don't really want to go to this \"thing\" and they turn around. The shots are very long and tedious. We realize they're lost. The brush disappears and it is mountains, then it is rocks, then it is desert. Then it is night and they sit by a fire. The next day goes on and on and it is unclear how many days are now passing, though the landscape still keeps changing: a lunar surface, and crags of jagged rocks. Their clothes and faces dirty, their clipped exchanges almost indecipherable. They separate and then find each other again, Gerry stuck at the top of a huge rock formation. They discuss him jumping down and the other Gerry makes him a \"dirt mattress\", which is successful and they keep going. Finally flat white salt is all that's beneath them. They are both barely moving, shuffling their feet like broken-down machines. Gerry, who was falling behind, drops to his knees and lays down. Gerry stops and walks back to him, lying on the ground beside him. After a while, Gerry says that he's leaving and slowly, painfully, reaches over to Gerry as if to find comfort in holding his hand as he draws his last breath. Gerry shakes him off and, his movements stilting and awkward, he rolls on top of him, struggling, not with a hug but with a fraughtful busrt of energy to strangle him. He then lays still. After a while he gets up and walks in another direction, leaving dead Gerry, seeing moving forms on the horizon. We see the vast unbearable landscape move by quickly, no longer within it we are safely on the outside now, in a car. Gerry is sunburnt and dead-eyed, he turns to look at the young boy sitting in the backseat with him, looking out the window.",
      "writers": [
         "Casey Affleck",
         "Matt Damon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0302674/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4MzM4MzE0MV5BMl5BanBnXkFtZTYwNTMzNDY3._V1_SX214_AL_.jpg",
      "actors": ["Stars: Casey Affleck, Matt Damon | See full cast and crew »"],
      "reviews": [
         "I was curious about this film, but totally unprepared for how much it affected me. GERRY worked, for me, on many different levels. In some ways, it felt like a horror film, but without any supernatural element. Two men get lost. That's the premise, and the movie takes its time to really explore what it feels like to suddenly have no idea where you are. As the film went on, something about it began to feel abstract, as if the film wasn't just about being lost physically, but about what it feels like to feel alone in the universe. I don't mean that to sound flighty or pretentious, but the film gradually moves into a state of deep sadness that is hard to describe. I'm sure (from the looks of some of the particularly angry comments some people have posted) that this film won't be appreciated by everyone who sees it. Some may find it dull. I found it completely absorbing, and unlike anything I'd ever seen. (By the way, if you don't like a film, that's fine. But some of the ANGER displayed below is completely unjustified, and perhaps a sign of some deeper trauma that has nothing to do with the movie you didn't like.)",
         "\"Gerry\" is rare movie that, if you yield to its spell, will provide a fresh, raw experience of a pure, simple, terrifying kind. For those who can't locate the patience and concentration \"Gerry's\" minimalism requires, it won't work worth a damn. Two young men named Gerry (Matt Damon and Casey Affleck) get out of their car and go on a desert wilderness trail. There are no opening credits, only a long, long silent shot of the two guys in a middle-aged Mercedes driving impassively along the highway for miles and miles up to the trail. They leave their car and head off with no preparations, carrying nothing. After a time they know they've come to the trail, because they see a few people heading back on it. But instead of entering it themselves they decide to take a side path around it, just to be \"different,\" go their own way, figuring everything is bound to go back around to \"the thing\" the same as the main path -- \"the thing\" the trail leads to. After a while walking, not talking, they run, they play around a little, and they continue to go forward through brushland on their little personal side trail. Already we get used to how they walk, because that's all they do. They hardly talk any. When they do it's so natural and telegraphic we can barely understand them. So this is how they walk: Matt Damon seems to fall forward a bit awkwardly, big hipped, and his pectorals bounce up and down as he goes. Casey Affleck strides forward with more grace: he's thinner than the muscular Damon and at a distance against the sky he looks like a Giacometti striding sculpture. After a lot of walking like this the two suddenly decide, with no discussion, to go back before they even get to \"the thing,\" because it's just \"a thing.\" Only they don't get onto the right path to return, because they never got to \"the thing\" that the right path leads to and from. And so -- they get lost. As twilight approaches, the two young men wander through hills and plains. They stop and stare in all directions, and from the way they stop and stare we know they know they're lost. The vast landscape seems to have opened out and become beautiful, cold, and remote. They stride over small mountains, into sandy desert. Vast vistas of a terrifying beauty extend in every direction. We don't know where they're going and neither do they and this is all that happens and all that we see. We're alone with the vastness of it all and the lostness of the two young men, because they say so little: that too is terrifying. The first night they build a fire of small branches and brush that burns brightly and they sit by it, like Keanu and River in \"Idaho,\" and one of them tells a long story about a game he lost. At one point he jokes and says there's a man up high a short distance off staring at them. It's not so funny because everything is blackness beyond them and they're lost in this great desert wilderness. They smoke cigarettes. They have nothing to eat or drink. There's no knowing how far they are from their car. The next day is interminable. They agree to \"scoutabout\" on separate small mountains in different directions to see what they can see. Their plan as before is hasty and confused. They see nothing but vastness in all directions. Casey Affleck yells at Damon from a big rock he's scrambled onto. He's too high up to jump safely off and for a long time he stands up there and they talk about what to do to get him down without an injury that would finish them. Damon gathers dirt in a shirt and dumps little piles of it in a soft mound as a bed for Affleck to jump onto. It's very slow. We're in real time here for sure. Not much talk happens. They're serious. The moment is excruciating. Finally they're satisfied with the dirt mound and Affleck jumps and he lands unhurt, instead of twisting his ankle or hitting his head on a rock and killing himself as it looked like he might do. At some point if you are staying with this action and this huge landscape, two elemental, lifelong fears begin to be awakened in you: the fear of getting lost and the fear of abandonment. The two Gerries are well and truly lost, and there's some danger that one will abandon the other, by mistake, or on purpose. Having lost their way they could easily lose each other. Their (improvised) conversation is the laconic and impulsive talk of close friends (as the two actors really are), and in it there's an element of macho dare which, added to growing fear and anger, threatens to become a lethal mixture. Nature's lovely when your car's at the end of the trail you're on and you know where food and water are. When you're lost and so exhausted and thirsty you've begun to hallucinate and you can't think straight any more, nature menaces you and mocks you. And this is where \"Gerry\" very quickly takes us and keeps us throughout its short but palpable length. Owen Gleiberman in Entertainment Weekly described \"Gerry\" as \"Andy Warhol meets Ansel Adams meets Blair Witch Project meets Beckett,\" and his remark is a wise one. The dialogue is improvised and boring and slow as among non actors, images are worthy of the great landscape photographer, the use of nature to terrify has the economy of \"Blair Witch,\" and the laconic plodding is like a millennial endgame by the great Irishman and follows his rule: less is more. These allusions are needed, because \"Gerry\" is either a failed art piece or an epic statement. We need some guidelines to decide. Economy requires us to participate. The two Gerries tell more by what they don't say than by what they do. They don't say they're tired or thirsty or scared. They don't tell us about themselves. One may be stronger than the other, but not much: they're both \"Gerries,\" and a \"Gerry\" is a goof-up. This absence of anecdotal chatter helps us identify with their experience. The sympathy we develop makes the ending deeply shocking. Yes, this is like Beckett: \"Gerry\" jumps from the trivial and humiliating to the epic and tragic in a minute. As in Beckett, the two characters are like active and passive versions of one self, nagging each other, jogging alongside each other mindlessly and doggedly. There are many moments of tonic (but also difficult, unfamiliar, scary) silence and stillness in the movie, only mildly mitigated by the music of Arvo Pärt. By the end the two men's faces are harrowing to look at. It's as if they're not only well beyond exhaustion into hallucination but there's horror and madness in their sweaty sun-blotched faces. \"Gerry\" deeply scared me without even seeming to try. It was very courageous of Gus Van Sant to undertake this project, which redeems him of past missteps and reminds us of the poetry and unique vision of his best work.",
         "I have spent a lot of time in the desert and I think what Gus Van Sant was trying to portray (and maybe not very effectively) is that space/time warp you experience when you find yourself in a place where your attention span must go from 1/2 second to a billion years, where one's sense of the passage of time becomes almost irrelevant. The human brain, especially in this age of MTV, cannot fathom the slowness of geologic change in the desert, and has trouble fathoming the change of perspective, where everything seems closer than it really is. I have \"walked that walk\" where the object you're heading toward keeps receding into the distance, and the tendency is to walk as the two Gerrys were walking in the slow shot of the sides of their heads, and hear nothing but the measured crunching of your footsteps. The long shot was perfectly appropriate. Maybe one has to spend time in the desert to \"get it\", but I thought the film was dead right-on with the music, the visuals and the pacing. I loved the film and will watch it again and probably again.",
         "(I was lucky enough to see this movie at its premiere at the Sundance film fest 2 years ago in park city with Matt, Casey, and brother Ben a few rows away.) For all of you who thought it was boring and hated it, I'm sorry. I was a bit uneasy myself at first when I was sitting there. The more I let myself go with it though, the more amazing I found it. It is not a movie made for everyone -- not in the slightest. It was made for people like me. Thank you Gus. This movie probably has the least amount of dialogue of any movie I have ever seen (silent moves apart...), yet I find myself cracking up and quoting its lines all the time. (Going on a \"mountain top scout about.\" And the best: \"How'd you get up there?\" \"...scrambled.\") I only wish more people had seen this movie so they know what the heck I'm talking about. I love how Van Sant lets your mind wander. It relates real people. I can completely picture a couple of my close friends carrying on the same conversations, walking along silently, or finishing a half told story days later. Nothing is pushed in your face except maybe the 'as-is' quality of it all. He lets it grow and lets you see it all. Here I am, two years after seeing it, still getting a huge kick out of it. For me, thumbs up.",
         "I've seen \"My Own Private Idaho\", \"Finding Forrester\" and \"Good Will Hunting\" by Gus Van Sant which were all fairly impressive but now am very eager to watch the 2003 Palme D'Or winner \"Elephant\", especially after my initial screening of \"Gerry\" last night which tops all the Van Sant flicks I've seen to date. This is an engaging effort from Gus, and outstanding career highlight performances for the main actors Casey Affleck and Matt Damon. I can see why people are saying that some shots are \"too long\" and other comments like \"I fell asleep\", however I love this style of cinema which reminded me a lot of the spectacular effort from Kitano with \"Dolls\". Minimal, hypnotic, and great shots throughout. The camera trickery has to be highlighted with varying depth of field shots giving you a deluded sense of fatigue, plus the ongoing buzzing sound which intensifies with the sun throughout the evolving journey, similar to the buzzing lights in Noé's \"Irréversible\". The main point I want to bring up is the film was very well structured and scripted for the time it covers. It's realistic and well balanced with regular events. However if your comfort zone sits around the 'Hollywood standard' where there's a 5 camera shoot for every scene with 3 second cuts between shots and the suspenseful default score to keep you 'on your seat', then you'll be pleasantly appalled with this 'real' rendition of a devastating true story. 8/10",
         "This is not a good film. But it's not a bad film either. Consider the blank canvas hung in the museum. Questions arise: What is this? Why is this here? Who did this? Why did they do this? And most importantly, do I care about this? These are the type of questions you will be left with after seeing `Gerry.' The film is painfully slow to watch, the dialogue unrewarding, the landscape more interesting than the cinematography, the characters undefined, and the plot full of holes. And yet, the film sticks with you and makes you think... just as the blank canvas does. After leaving the theater, you truly contemplate the strange trip you just took through the middle of nowhere while you draw parallels to your own adventures. And for these reasons the journey is worthwhile... the film, worth seeing.",
         "Two college-aged men who refer to each other as \"Gerry\" (Casey Affleck and Matt Damon) venture into the desert for a carefree, fun adventure, seemingly oblivious to the dangers that such an environment may conceal. At face value, the story is not logical. Two guys with brains would never hike into a desert without water. Nor would they be so ignorant about geography that they couldn't get their compass bearings straight, with sun and stars to guide them, and in a landscape with such varied terrain as mountains, scrub brush, and salt flats. Further, in the absence of a safety kit, hiking long distances in rugged country almost certainly would have resulted in feet blisters, making further hiking impossible. Ergo, we are left with two interpretations of this film. On the one hand, as some suggest, Damon and Affleck conceived the film as a joke to fool gullible viewers who naively perceive the film as \"art\". Alternately, the film may be construed as a genuine cinematic expression of existential philosophy consistent with Kierkegaard and Nietzsche, with themes that run deep. The first interpretation is cynical. With their credibility on the line, and with the film's budget at over $3 million, reputable actors, directors, or producers would not pursue a project with such a devious motive as to try and fool the audience, in my opinion. Accordingly, I take the position that \"Gerry\" is a well-crafted \"art\" film produced to counterbalance modern Hollywood films that are characterized by gaudy and intrusive special effects, loudness, irritatingly fast action, absence of thematic depth, and unnecessary complexity. In \"Gerry\", depending on scene, the dialogue ranges from sparse to nonexistent. Background music is slow, mournful, mystical, and toward the end ... ominous. Images are simple and stark. Extremely long camera \"takes\", with the average length of each camera shot being about sixty seconds, render a pacing so slow that most viewers will fidget in their seats, become impatient, or may even give up watching. But for those willing to \"endure\", the film makes for good soul medicine. \"Gerry\" thus has qualities that make it rather Zen-like. \"Gerry\" reminds me of \"The Tracker\" (2002). In both films, every single scene, without exception, takes place outdoors. And, with its desolate mountains, lunar landscape, and general absence of human artifacts, \"Gerry\" recalls to mind the 1964 sci-fi film \"Robinson Crusoe On Mars\". In all three of these films, the emphasis is on sparseness, simplicity, and survival. Most filmmakers travel in cinematic ruts. Most viewers live with the herd, and travel the same worn paths in life. As the film's director, Gus Van Sant ventures down a different, less traveled cinematic path, one meant to invoke themes that will appeal mostly to nonconformists. For viewers who can endure the slowness and the tedium, the film has a lot to say about decisions, fate, responsibilities, despair, and about life in general. Its story may not be altogether logical. But neither is a Zen koan. And those forbidding landscapes are hauntingly beautiful.",
         "Or how NOT to have a safe, enjoyable hike. The best I can say about this piece is that it was an \"interesting\" (boring actually, I kept looking at my watch or falling asleep) exercise in experimental cinema. SPOILERS AHEAD OK, Two guys both named Gerry go to an out-of-the-way place, apparently to have a hike (we see a few other hikers from a distance at the start of the film). They apparently expect it will only take a few hours, as apart from hiking boots they have no water, provisions of any kind or shelter such as a tent. Before too long it is apparent they are lost - wandering around in circles or whatever. This might be an opportunity for the film to muster some interest, but their responses are well, just very very ordinary. No sexual encounters with beautiful female aliens, or (more seriously) no rages of blame, no startling revelations or deep voyages of personal discovery... Rather just a few minor disagreements on how they got there and the best way to get out of the situation, interspersed with some cussing. There is little talking in the film as it is. Affleck's speech I found to be often garbled and incomprehensible. Thankfully Damon, as the more mature actor, articulated mostly clearly. The early part of the film, when there was no background music at all, was further spoilt by the occasional blurry shot (sometimes when only one Gerry was supposed to be the subject), and a distinct lack of closeups. Distant rather indistinct shots seemed to be the word. The latter part of the film had some reasonable background music (too little too late?) and the views of scenery etc were certainly better than those in the first half of the film, where they look like the snaps of an unenthusiastic holiday maker. The film held few surprises and virtually no tension of any kind. Either this sad pair are going to die of thirst, stumble across their vehicle or somehow be rescued. The end proves to be a combo of the latter two, as Daemon stumbles upon a road and a rescuer. This film didn't work at all for me, and I could not tolerate watching it again. 1/10",
         "This film is not for the passive observer. It requires patience and presence. I hear you if you don't have it; but I loved this film. I sat for minutes afterwards, stunned. We don't often get a parable that speaks so vehemently to our time. When the machinations, the technology, the hatreds, the unfairness, and even the landscapes get ripped away; we have only our unmapped paths stretching before us to trudge, clueless. Bravo, Van Sant. Bravo, Damon and Affleck. An unforgettable and unforgiving piece of work.",
         "This is a truly dull film. Endless shots of people walking, or driving or the sun rising over a mountain top...slowly, very painfully, slowly.... Its not arty, its not big, its not clever, its just really dull. There are people who have posted positive things about this film, I can only say your boredom threshold must be stupendous. At least I watched it on DVD so could fast forward through it. The film is 100 minutes long, the plot about 2 minutes long. I know this film isn't about plot, but even what there is makes no sense. I do hiking, if you got lost you'd retrace your steps, they walked with the mountain range on their left on the way out, so walking with it on their right on the way back would get them back to the car. Instead they go in a completely different direction and climb a mountain! Gerry gets stuck up a rock, but can't get down. Why not? He managed to climb up the darn thing, he should just be able to come back the same way. Finally the ending, and I don't think I'm giving much away here, but SPOILER AHEAD...They are about to die, having given up all hope, then Gerry just ups and walks to the road, hurrah, what a bloody corny ending. Given they didn't have to think of any plot for the rest of the story they could at least have come up with a better ending. Anyway I thought the film was pants, so if you're going to hire it make sure you are ready for a very slow, very uneventful film, and maybe get a back up DVD too."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Mystery"
      ],
      "productionCompanies": [
         "Epsilon Motion Pictures",
         "My Cactus",
         "Tango Films"
      ],
      "summaries": [
         "Two friends that call each other Gerry decide to hide in the wilderness to see something and they do not find it. They decide to return to the car but they get lost in the desert, without water, supplies or a compass. Now they have to walking trying to find the road to survive.",
         "A friendship between two young men is tested when they go for a hike in a desert and forget to bring any water or food with them."
      ],
      "budget": 3500000
   },
   "movielensId": 6162,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-01-12",
      "dvdReleaseDate": "2003-11-11",
      "directors": ["Gus Van Sant"],
      "runtime": 103,
      "movieId": 6162,
      "title": "Gerry",
      "mpaa": "R",
      "actors": [
         "Casey Affleck",
         "Matt Damon"
      ],
      "imdbMovieId": "0302674",
      "originalTitle": "Gerry",
      "genres": [
         "Mystery",
         "Drama",
         "Adventure"
      ],
      "youtubeTrailerIds": ["WxVBfJ0oZxs"],
      "plotSummary": "Two friends named Gerry become lost in the desert after taking a wrong turn. Their attempts to find their way home only lead them into further trouble.",
      "tmdbMovieId": 1956,
      "avgRating": 3.14595,
      "releaseYear": "2002",
      "numRatings": 346,
      "posterPath": "/1lu054JL6OPG65N99MaYCdI6y8T.jpg"
   }
}