{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "allegory",
            "id": 1501
         },
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "radio",
            "id": 2135
         },
         {
            "name": "nudity",
            "id": 2483
         },
         {
            "name": "reality",
            "id": 3026
         },
         {
            "name": "brother",
            "id": 5301
         },
         {
            "name": "sister",
            "id": 5923
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "apocalypse",
            "id": 12332
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "nature",
            "id": 18330
         },
         {
            "name": "unicorn",
            "id": 163227
         },
         {
            "name": "hidden",
            "id": 169925
         },
         {
            "name": "tyranny",
            "id": 189433
         }
      ],
      "imdb_id": "tt0072709",
      "video": false,
      "title": "Black Moon",
      "recommendations": [
         37994,
         44065,
         42695,
         1479,
         125602,
         18919,
         16127,
         1559,
         31581,
         58257,
         51429,
         192142,
         95597,
         20122,
         101929,
         17128,
         104441,
         124485,
         122445,
         90041
      ],
      "backdrop_path": "/uA8eQKEoCrnbrq9HvMZRgbuHdjZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Lily",
               "gender": 1,
               "credit_id": "52fe4544c3a368484e0506a9",
               "name": "Cathryn Harrison",
               "profile_path": "/55iM1CKI9sMRYTWq2c6d4jPCSKM.jpg",
               "id": 136835,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Old Lady",
               "gender": 1,
               "credit_id": "52fe4544c3a368484e0506ad",
               "name": " Therese Giehse",
               "profile_path": "/1tWcLlN2CCZ3f6FaddfVbnbWf7i.jpg",
               "id": 40251,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Sister Lily",
               "gender": 1,
               "credit_id": "52fe4544c3a368484e0506b1",
               "name": "Alexandra Stewart",
               "profile_path": "/2hiKef95taRinlseKp6uFhVDTIR.jpg",
               "id": 18765,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Brother Lily",
               "gender": 2,
               "credit_id": "52fe4544c3a368484e0506b5",
               "name": "Joe Dallesandro",
               "profile_path": "/lxpfX2F8yBF8rsIGkmWwN04B4qJ.jpg",
               "id": 29915,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4544c3a368484e050699",
               "name": "Louis Malle",
               "profile_path": "/58db1ci6IPJ60hO6Cbbhfsc54H1.jpg",
               "id": 15389,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4544c3a368484e05069f",
               "name": "Louis Malle",
               "profile_path": "/58db1ci6IPJ60hO6Cbbhfsc54H1.jpg",
               "id": 15389,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4544c3a368484e0506a5",
               "name": "Joyce Buñuel",
               "profile_path": null,
               "id": 136834,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "52fe4544c3a368484e0506bb",
               "name": "Claude Nejar",
               "profile_path": null,
               "id": 1116061,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4544c3a368484e0506c1",
               "name": "Sven Nykvist",
               "profile_path": "/2S1wtqPzCUlAMVpor5o0YHkme21.jpg",
               "id": 11905,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4544c3a368484e0506c7",
               "name": "Suzanne Baron",
               "profile_path": null,
               "id": 5785,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5723eccbc3a36809db0018d2",
               "name": "Ghislain Uhry",
               "profile_path": null,
               "id": 1612832,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5723ecd3c3a3682d3f003b83",
               "name": "Rino Carboni",
               "profile_path": null,
               "id": 1458526,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5723ecdcc3a3686a100000cd",
               "name": "Paul Maigret",
               "profile_path": null,
               "id": 1582941,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5723ece6c3a36809db0018d7",
               "name": "Fernand Moszkowicz",
               "profile_path": null,
               "id": 1612833,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5723ecefc3a368222d000534",
               "name": "Pierre Roudeix",
               "profile_path": null,
               "id": 1612834,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.367995,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 27361,
      "vote_count": 47,
      "budget": 0,
      "overview": "There is a war in the world between the men and the women. A young girl tries to escape this reality and comes to a hidden place where a strange unicorn lives with a family: Sister, Brother, many children and an old woman that never leaves her bed but stays in contact with the world through her radio...",
      "similar": [
         9946,
         948,
         1433,
         8810,
         122,
         281,
         4170,
         8413,
         12994,
         979,
         73,
         80752,
         600,
         81774,
         150540,
         112160,
         298312,
         9679,
         263472,
         17609
      ],
      "original_title": "Black Moon",
      "runtime": 100,
      "poster_path": "/37z2YdnGnesEhY7LlJRfM8EWrW7.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bioskop-Film GmbH",
            "id": 403,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nouvelles Éditions de Films (NEF)",
            "id": 753,
            "origin_country": ""
         }
      ],
      "release_date": "1975-09-24",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "An apocalyptic Alice in Wonderland!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Louis Malle"],
      "runtime": 95,
      "synopsis": "After enjoying critical and commercial successes with Murmur of the Heart and Lacombe, Lucien, Malle decided to go for something much more experimental and free-form. Always a great fan of myth and fantasy, and especially of the work of Lewis Carroll, Malle tries to create the special, charged atmosphere of a world in which actions, objects and creatures are never quite what they seem. The film begins when the teenaged Lily (Harrison) has a road accident and discovers she's landed smack in the middle of some kind of civil war. Fleeing into a nearby field, she comes upon a lonely mansion inhabited by an old lady (Giehse) who knows how to talk to animals. Shot by the great Sven Nykvist, Black Moon offers a distinctively different approach to the theme of adolescent self-realization that has been a frequent concern in Malle's work.",
      "writers": [
         "Louis Malle",
         "Joyce Buñuel"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0072709/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxMzcyMDcyMl5BMl5BanBnXkFtZTcwMTM1ODg3NA@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Cathryn Harrison, Therese Giehse, Alexandra Stewart | See full cast and crew »"],
      "reviews": [
         "Working late hours sometimes can provide a movie buff with unexpected rewards: for example, getting off at 11:00 PM means getting home in time to fix a cup of hot chocolate in hopes of an early visit to Dreamland. Or it can mean being comfortably wide-awake, and stumbling across a rarely-seen film gem by Louis Malle. Or getting to view a rarely-seen cinematic conundrum also created by Louis Malle. That would be \"Black Moon,\" made in 1975 and featuring Joe Dallesandro and Cathryn Harrison, grand-daughter of Rex Harrison, and a gaggle of naked children running wild with a large white pig. And a talking unicorn. And a manor house where something is always cooking. Without a doubt, Malle's \"Black Moon\" is one strange and beautiful movie concoction. Labelling it as futuristic is entirely inappropriate, as it is set in modern ( but pre-Internet ) times. Released in September of 1975, the film takes place in the French countryside, and begins with a young woman racing along a deserted highway while trying to find something on the car radio. Within minutes, she encounters a military roadblock where she sees soldiers ( some wearing gas masks ), executing their prisoners, who are all female. Although she's dressed like a man, it only takes a flip of her hat to reveal her long blonde hair and so she bolts the scene in her little red car. She races through a field with bullets flying past her. Eventually this young woman, Lilly, comes to a dead end on a dirt road, very near to a manor house. It is there she first sees the unicorn and then a flock of sheep. What little dialog there is in this movie, is in English, with a few lines spoken in German or Italian by Therese Giehse, the veteran character actress from Germany. She plays an elderly invalid who talks to animals, or to people unseen, on her two-way radio. It is up to a very young Cathryn -- then only fifteen during production -- to carry this hallucinatory tale. Along with Giehse, who stars as the crazy old lady of the manor house ( surrounded by sheep, goats, pigs and the naked feral children ), Dallesandro and Alexandra Stewart as Brother and Sister Lilly round out the credited cast. The photography for \"Black Moon\" is sumptuous. The plot, if there is one, is so close to being a cinematic hallucination as to make the viewer positively giddy. Harrison is so very luminous and beautiful that it brings up the guiltiest feelings, upon discovering she was only sixteen, when it was released in September of '75. Near the end of this puzzle on film, there's a long section of Wagner's \"Tristan and Isolde\", which is sung in the middle of the night, by two children, as Lilly plays the piano. When it ends, the new day is breaking and shortly after that, the \"reality\" of the war comes crashing down with shell bursts and the rat-a-tat of submachine guns in the fields around the house. At this point, the cranky old lady has disappeared, the unicorn has reappeared for about the fourth time, and Lilly closes the window and retreats into the on-going hallucination of this manor house. And then, the film freeze-frames on an image of her beautiful face and penetrating eyes, and then simply fades away. The viewer never gets to know what happens with Brother and Sister, nor what becomes of the rampaging feral children and their huge white pig. In that regard, \"Black Moon\" ends and ends up being almost wholly unsatisfactory !! However, the rest of the 100 minutes of this film are so well-crafted, and Cathryn Harrison is so appealing, that the final state of confusion seems to be less like a cop-out than an appropriate way to end a film which, after all, has no plot at all. And it must be said that despite the hallucinatory quality of \"Black Moon,\" it is not a movie about taking drugs, or tripping, or going cold turkey from drugs, and there isn't so much as one cigarette in the whole film. And, also, no, there's no clue as to what \"Black Moon\" really means, and the context of the film never discloses the purpose of the allegories contained within it. It's not a parable. There's no real story and therefore it has no \"moral to the story.\" It is only certain that there's absolutely no connection whatsoever to the Fay Wray horror-flick of the same name, from 1934.",
         "In the mid-70s when this film was made there was - in the real world - a 'battle of the sexes' with militant feminism in full swing (if not an actual 'war', there was a lot of bruised feelings and anger in the air - witness works of fiction like 'Who needs men?' and 'The Woman's Room'); the student riots of the late 1960s were a fresh memory, as were images of Vietnam (and for British viewers, the latest IRA atrocities). Black Moon may not 'make sense', but it's more understandable as a dream, from beginning to end (forget the idea that any of it is meant to be set 'in the near future'), by a pubescent girl, subconsciously worried by the apparent war between the sexes and disturbed by her budding sexuality (note the juxtaposition of the idealised vision of heterosexual love, presented by music from Wagner's Tristan und Isolde first heard on the car radio, quickly followed by the shocking images of war). As mentioned elsewhere, this is beautifully filmed, and IMHO captures beautifully the quality of dreams where one event follows another in a 'stream of consciousness' manner (yet with certain obsessive themes), and the dreamer does everything as if it were the most rational thing to do (as one does in a dream). On first viewing I suspected this film to be a rather self-indulgent exercise, but there's a strangely compelling quality about both the narrative and the beauty of the actual cinematography. Highly recommended.",
         "I must say, seeing this film was like an adult orientated verison of Alice in Wonderland; the material is dark and surreal as the music is eerie to set the mood of the film. The story revolves around a girl 'Lily' who finds herself stuck in a strange and bizarre world between fantasy and reality. Such events occurred in this film contains a talking unicorn, a teenager breast feeding an old woman (and later a unicorn?) and a naked children, frocking around the meadow as if nothing were watching them. Not since 'Eraserhead' have a seen such a bizarre, disturbing and fascinating work of art. A must see indeed for those of you who Cherish rare pieces of work like this.",
         "It's the last war on Earth, men and women are the last opposing armies, and when they've killed each other, humankind will end. The girl Lilly, a virgin, not yet a woman, not yet a combatant tries to escape the carnage. She's looks human, but she really isn't quite, she has such fine senses that she hears plants cry out in pain. For a time she escapes the war, and lives outside of reality. She sees a rough and tumble unicorn, and makes her way to a ramshackle farmhouse. She finds an old woman there. The old woman symbolizes the World or History or perhaps Civilization. The twin man and woman, both named Lily, that attend the old woman stand for the male and the female forces of civilization. The horde of little children symbolize human impulses or dreams that aren't yet clothed in ideas or form. After the unicorn talks to Lilly in the garden, he becomes disgusted and says \"I won't be back for 154 years\" The old woman dies and Lilly eventually takes her place. The old world dies and the new world is reborn. Some of the animal symbols: The unicorn's horn is an antidote to poison, and represents healing of the world from biological or radioactive warfare. The eagle is the oldest being perched on top of Yggdrasil - the Tree of Life in Norse Mythology. The Eagle watches and remembers everything that's happened in the world, and then finally dies at Ragnarok - Götterdämmerung - the destruction and rebirth of the world. (Possibly the picture on the wall of the hero cutting down an eagle in the air, and slicing off it's wing refers to Finga, a hero who wore a single eagle wing on his helmet, who appears in Gaelic mythology and the poems of Ossian) The Black Horse is a symbol of Death by Famine. The sacrificed lamb symbolizes the death of the innocent or blameless. Lilly recalls the mythic Lilith, the \"first wife of Adam\" , the owl demon who had little milk, who wouldn't defer to Adam, and defended her right to be his equal. Astrologers referred to the dark side of the moon as Lilith. The twins that fight at the end could represent Líf and Lífthrasir (from the same root word as Life), brother and sister, last man and last woman on Earth that will repopulate the world after Ragnarok. Or maybe not, since we don't see any other humans after Lilly takes to bed, just teeming flocks of sheep and turkeys outside the house.",
         "Weird movie by Louis Malle, Which was filmed at Malle's own Manor, with Joe Dallesandro acting in his first (and only), non speaking role, Playing the brother of a twin sister. The film starts off with a girl, played by Cathryn Harrisson (Actor Rex Harrison's granddaughter, who was only 16), driving in her car in the dark and runs over some kind of beaver or something, later on down the road she encounters a road-block, put up by men with army suits and gas masks. The men in masks with machine guns mow down about 6 women in plain view of her. One of the guys in the masks starts approaching her car, she's dressed like a guy with a hat and her long hair tucked underneath it. The guy in the mask pulls off her hat and her long blonde hair streams out, alarmed, she suddenly pins the gas and gets away. Later she encounters men in more masks killing more women, and things get even weirder from here. Almost too weird. The movie no doubt, has a very surreal tone to it, very ALICE IN WONDERLAND. Trying to comprehend what really this movie is about is impossible. Only Louis Malle knows what king of message this movie was intended to give. And that just suits me just fine, because I find the imagery of the different scenes and various characters keep me occupied through-out the film, and interpretations are mixed with each time I watch it.",
         "Black Moon is not for everyone and thank goodness for that. Those who follow Malle know what to expect in his films in terms of the surreal and those who enjoy this sort of film should perhaps not gnash their teeth over its non-Hollywood approach to film-making. It's ashame one has to go back to the mid-70's to find this kind of film amidst the blockbuster generation of \"films\" coming out of Hollywood. The film is effective in generating a frightening dreamlike environment in which no one knows what to expect. More like life than not. This rarely seen film is well worth viewing if you can find it. I happened to catch most of it on satellite recently and it was great to see the quality of Eastman color film and how well it is holding up in our digitally defined era. I especially enjoyed the tension created during the piano segment.",
         "I watched this film on French TV when I was in Saudi Arabia in winter of 1998 on the front porch of a GP tent out in the middle of a cold desert on one of my nights off and found this a fascinating film. It's very hard to describe. A young English woman is driving down the French countryside and some sort of apocalypse takes place and she pulls over to an old country cottage and starts having hallucinations of a unicorn living nearby, a crippled old woman, several other weird things. It is totally European in every respect and only die-hard art house fans would enjoy this. Apparently, it has never been released in America. I know Louis Malle is an acclaimed director, but I really don't know much about his work and haven't seen any of his films, except Atlantic City, which was much different from this.",
         "I saw this film when it was first released in the US in 1975. It played at the Carnegie Hall Cinema right underneath Carnegie Hall. One reviewer called it a disappointment but they must have seen another movie. The group I was with was about as sophisticated as film goers get and everyone of them were simply awed by this film. This is not a film you think you way through rather you let the archetypal symbolism sweep over you. The film works on the deep subconscious of the viewer and what at first appears to be complete madness slowly turns into a new reality that works. Eventually it all appears to be perfectly normal even though it's anything but. I will never forget walking home from the theater to the upper west side that night in the freezing subzero temperatures. Homeless people, wrapped in whatever clothes they could find, trying in vain to keep warm held out their empty hands in hope some one would drop a coin in them. It was a dark, empty and bitter cold city devoid of any feeling and I recall thinking that this was the real madness and the movie seemed so warm and inviting by comparison. I consider this film to a true masterpiece that for some bizarre reason has simply dropped off the radar screen. Carl Jung would have loved it, see it and see what I mean, if you can find it. Magnificent and exquisite cinematography by Sven Nykvist, Ingmar Bergmans famous director of Photography.",
         "Before the film begins, even before the logos of the producers and distributors appear, Malle posts a disclaimer in French that translates roughly like this: \"This film does not address your sense of logic. It describes another world for you, at the same time familiar and different. Like your dreams. Come inside, with your emotions, with your senses. Let yourself be carried away, it's a journey I'm offering you.\" Malle's dream/nightmare story is filled not with psychic symbols or mystical patterns, but with the visual equivalent thereof. It just won't do to try to sort things out into a symbolic code, because the images, as familiar as they sometimes seem, are also uncannily different because they're separated from the usual scheme of a puzzle waiting to be solved. Certainly there are a number of patterns running through the movie, such as the quest of the lovely young girl, Lily (Catherine Harrison), but it never clear whether she is running from or to something. At the beginning she runs from the war that's going on at the borders of the movie, a war between two brutal armies, one of men and the other of women. Then she happens upon a farmhouse in the countryside where the rest of the story unwinds. The war is never far away, and never explained. Nothing is explained; in fact, there are long passages in which nobody speaks, and when they do speak it does not always make sense. The inhabitants of the house are a bedridden old lady, her son and daughter, a crowd of naked children, and various animals (pigs, lambs, birds). People appear and disappear, disorienting Lily, until finally she seems to be absorbed by the strange household, accompanying two children as they sing Wagner, pursuing and talking to the local unicorn, and offering her breast to the old invalid to suckle just as the daughter did earlier. The unicorn is decidedly unexpected\u0097it's not a tall, white horse but a small, roly poly pony with a shaggy mane, some strands of which are pink. Though there are some fleeting suggestions of sexual awakening, they're just impressions added to the mix, not real components of the plot, and not the key to the hidden meaning of the story. The main characters are always interesting to watch: Lily fair and slim and intent on discovering what's going on and flushed by the effort, the son and daughter (Joe Dallesandro and Alexandra Stewart) all cheekbones and enigmatic looks and practically no words spoken, the old woman (Therese Giehse) alternately plaintive, furious, comatose, malicious, welcoming, and bizarre--she talks to a rat, and he talks back. Of all the deliberately mystifying films of this sort I've seen, this is my current favourite. It teases the viewer with the promise of understanding at the same time it dances away from riddle-solving with surprising grace.",
         "It played here in Berkeley in the late 1970's at the repertory UC Theatre (now defunct of course), I saw it in Cologne in 1976, but it doesn't seem to have been picked up by any US distributor and it is not and has never been available on VHS, Laserdisc, or DVD anywhere in the world, AFAIK. And I have never seen it on cable tv (Sundance, IFC, you listening?). A neo-surrealistic fantasy, it was promoted in newspaper ads in Germany as The Movie Where Animals Talk to People! Weird and wonderful from beginning to end, IMHO. An old woman sitting at her kitchen table talking to a rat sitting on it. An 8 year old or so boy and girl playing in the yard and suddenly breaking into the complete love duet from Tristan & Isolde. Joe Dallesandro of Andy Warhol/Paul Morrisey movies, and lots more. I can't remember it very well at this point, it's been a quarter of a century since I saw it. The number one film on my want list."
      ],
      "genres": [
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Nouvelles Éditions de Films (NEF)",
         "Bioskop Film"
      ],
      "summaries": [
         "There is a war in the world between the men and the women. A young girl tries to escape this reality and comes to a hidden place where a strange unicorn lives with a family: Sister, Brother, many children and an old woman that never leaves her bed but stays in contact with the world through her radio. Since the content of this picture is not as important as the pictures and allegories, the simple plot can not be described further.",
         "In a dystopian future, a mid-teen named Lily is trying to escape the bloodshed associated with the war between the sexes, she barely getting away from a group of men that have just assassinated a group of women. Lily is able to take \"fantasy\" refuge on a farmhouse property, which is inhabited by among others: an old bedridden woman, who speaks largely in some foreign tongue, speaks to others over a wireless radio, has a rat named Humphrey as a friend, and receives her nourishment in an unconventional manner for a person her age; a non-speaking brother and sister both also named Lily (although his is spelled differently), who she assumes are the bedridden woman's children, and the brother who communicates through touch; a group of naked children shepherds; and a talking unicorn. Although Lily's relationships with the others are not always in harmony, especially with the elderly woman, she tries to find her rightful place there in light of the alternative.",
         "To escape a war, a girl flees to a remote farmhouse and becomes part of an expansive family's unusual, perhaps even supernatural lifestyle."
      ],
      "budget": 0
   },
   "movielensId": 62764,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1975-09-24",
      "dvdReleaseDate": "2011-06-28",
      "directors": ["Louis Malle"],
      "runtime": 100,
      "movieId": 62764,
      "title": "Black Moon",
      "mpaa": "R",
      "actors": [
         "Cathryn Harrison",
         " Therese Giehse",
         "Alexandra Stewart",
         "Joe Dallesandro"
      ],
      "imdbMovieId": "0072709",
      "originalTitle": "Black Moon",
      "genres": [
         "Fantasy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["GXvo7U4kDwg"],
      "plotSummary": "There is a war in the world between the men and the women. A young girl tries to escape this reality and comes to a hidden place where a strange unicorn lives with a family: Sister, Brother, many children and an old woman that never leaves her bed but stays in contact with the world through her radio...",
      "tmdbMovieId": 27361,
      "avgRating": 2.95385,
      "releaseYear": "1975",
      "numRatings": 65,
      "posterPath": "/37z2YdnGnesEhY7LlJRfM8EWrW7.jpg"
   }
}