{
   "tmdb": {
      "original_language": "pl",
      "keywords": [
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "simulation",
            "id": 2423
         },
         {
            "name": "future",
            "id": 2964
         },
         {
            "name": "reality",
            "id": 3026
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "weapon",
            "id": 6110
         },
         {
            "name": "addiction",
            "id": 6782
         },
         {
            "name": "gang",
            "id": 10726
         },
         {
            "name": "cyberpunk",
            "id": 12190
         },
         {
            "name": "battle",
            "id": 14643
         },
         {
            "name": "game",
            "id": 18249
         },
         {
            "name": "getaway",
            "id": 159700
         },
         {
            "name": "rumor",
            "id": 189868
         },
         {
            "name": "illegal",
            "id": 198158
         },
         {
            "name": "player",
            "id": 199050
         },
         {
            "name": "level",
            "id": 202597
         },
         {
            "name": "virtual",
            "id": 202599
         }
      ],
      "imdb_id": "tt0267287",
      "video": false,
      "title": "Avalon",
      "recommendations": [
         9389,
         14573,
         32151,
         25664,
         49291,
         32168,
         2463,
         10355,
         5845,
         23834,
         21522,
         253775,
         5844,
         87859,
         32157,
         5822,
         19644,
         19635,
         5889,
         35851
      ],
      "backdrop_path": "/3sai5B5D7PbNbzOOiG3xntts0y8.jpg",
      "revenue": 8826094,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ash",
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e17b",
               "name": "Małgorzata Foremniak",
               "profile_path": "/xcJaDMHpH8dHEKf71pdWCgNy1bW.jpg",
               "id": 67278,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Game Master",
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e17f",
               "name": "Władysław Kowalski",
               "profile_path": "/4kJIzT5BN882lgMZjudOmLDMGA0.jpg",
               "id": 17889,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Murphy",
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e183",
               "name": "Jerzy Gudejko",
               "profile_path": "/tv18qAwWsmv7IE5JCoEwBILGbOy.jpg",
               "id": 17890,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Bishop",
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e187",
               "name": "Dariusz Biskupski",
               "profile_path": "/4o2f4jP1FOqTYWnvfAgkTXB8Bcm.jpg",
               "id": 67279,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Stunner",
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e18b",
               "name": "Bartlomiej Swiderski",
               "profile_path": "/kcBq35Iz2oG97TdcsdIcl4bElLZ.jpg",
               "id": 67280,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Receptionist",
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e1cb",
               "name": "Katarzyna Bargiełowska",
               "profile_path": "/bBLQsA6BMXq7erMyRDDuriSeyeb.jpg",
               "id": 1076083,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Gill",
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e1cf",
               "name": "Alicja Sapryk",
               "profile_path": "/uVGkVfruCNz2cND4bWU9cH3RP15.jpg",
               "id": 1190322,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Murphy of Nine Sisters",
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e1d3",
               "name": "Michal Breitenwald",
               "profile_path": "/kqVfW57rGL6Dm8aG4VN6067eExj.jpg",
               "id": 1190323,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Ghost",
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e1d7",
               "name": "Zuzanna Kasz",
               "profile_path": "/pJRkXNsMDt9zDUyfBa78XQIkdCN.jpg",
               "id": 1190324,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Player A",
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e1db",
               "name": "Adam Szyszkowski",
               "profile_path": "/8FlMqAekoOp1sKRFv4EkB8iDdbu.jpg",
               "id": 1190325,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Player B",
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e1df",
               "name": "Krzysztof Szczerbinski",
               "profile_path": "/5cg9aEOp4kw0Ry93Qe2V32iyBW4.jpg",
               "id": 1190326,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Player C",
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e1e3",
               "name": "Marek Stawinski",
               "profile_path": null,
               "id": 1190327,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43c99251416c7501e191",
               "name": "Mamoru Oshii",
               "profile_path": "/2MXFEwxLu7gT9vvi5Otx4LQgsvZ.jpg",
               "id": 12180,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c99251416c7501e197",
               "name": "Kazunori Ito",
               "profile_path": "/gHLjymYpgHONtxLleogmxt5EVj7.jpg",
               "id": 57302,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e19d",
               "name": "Tetsu Kayama",
               "profile_path": null,
               "id": 67281,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e1a3",
               "name": "Atsushi Kubo",
               "profile_path": null,
               "id": 67282,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e1a9",
               "name": "Naoyuki Sakagami",
               "profile_path": null,
               "id": 67283,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e1af",
               "name": "Toru Shiobara",
               "profile_path": null,
               "id": 67284,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c99251416c7501e1b5",
               "name": "Shigeru Watanabe",
               "profile_path": null,
               "id": 12184,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c99251416c7501e1bb",
               "name": "Kenji Kawai",
               "profile_path": "/jIhpBTVJ4JmPFUbTlXROgL6GMCT.jpg",
               "id": 57304,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c99251416c7501e1c1",
               "name": "Grzegorz Kedzierski",
               "profile_path": null,
               "id": 67285,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43c99251416c7501e1c7",
               "name": "Hiroshi Okuda",
               "profile_path": null,
               "id": 67286,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 7.478924,
      "production_countries": [
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "PL",
            "name": "Poland"
         }
      ],
      "id": 10881,
      "vote_count": 115,
      "budget": 8000000,
      "overview": "In a future world, young people are increasingly becoming addicted to an illegal (and potentially deadly) battle simulation game called Avalon. When Ash, a star player, hears of rumors that a more advanced level of the game exists somewhere, she gives up her loner ways and joins a gang of explorers. Even if she finds the gateway to the next level, will she ever be able to come back to reality?",
      "similar": [
         605,
         5548,
         604,
         281,
         335984,
         131631,
         9739,
         9381,
         2048,
         2666,
         602,
         949,
         861,
         12244,
         180,
         603,
         7555,
         9693,
         19,
         78
      ],
      "original_title": "Avalon",
      "runtime": 107,
      "poster_path": "/6r6LjdPVIRBqzQW0umjHA1JEItl.jpg",
      "spoken_languages": [{
         "name": "Polski",
         "iso_639_1": "pl"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Media Factory",
            "id": 7967,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Deiz Production",
            "id": 5853,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bandai Visual Company",
            "id": 528,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dentsu Productions Ltd.",
            "id": 3340,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nippon Herald Films",
            "id": 1598,
            "origin_country": ""
         }
      ],
      "release_date": "2001-01-20",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Dare to enter a world of future videogames.",
      "adult": false,
      "homepage": "http://www.miramax.com/movie/avalon",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mamoru Oshii"],
      "runtime": 107,
      "synopsis": null,
      "writers": ["Kazunori Itô"],
      "originalLanguage": "Polish",
      "imdbLink": "http://www.imdb.com/title/tt0267287/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTEwMDYwMTMyMDVeQTJeQWpwZ15BbWU3MDc4MjU0MjE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Malgorzata Foremniak, Wladyslaw Kowalski, Jerzy Gudejko | See full cast and crew »"],
      "reviews": [
         "* Director Oshii Mamuro. Known for his slow pace, attention to detail, quite complicated storylines and his moodsetting. Always works together with Kenji Kawai (sound) and Ito (story). Other movies include Ghost In The Shell, Patlabor 1/2/OAV/Minipato, Urutsei Yatsura:Beautiful Dreamer. Also contributed to Jin-Roh and Blood. All these are worth a peek, especially if you like Avalon. Strange little fact : Oshii's a total dog freak. Watch his movies carefully. * Story Well, I can be short here. Set in an alternative present/future, a girl (Ash) sets out to find a hidden level in a VR-game (Avalon). It may be a bit thin, but a good setup for the main theme of the movie. Besides that, Oshii's movies were never all that story-based to begin with, as he pays a lot more attention to general moodsetting of his alternate realities. Oh, and for those who claim it's too confusing, try to focus a bit. After two viewings, most of it can be understood (minus a few little details). One warning though. The pace is as slow as ever. Oshii is one to leave you a lot of time to think about certain things that happen. Some like this, most of you probably won't. * Acting Kinda hard to judge, as the movie was made in Poland, with Polish actors. Personally, I find the acting adequate. No oscar nominations here, but good work from the leading actress and the guy that plays Murphy. It all depends on what you like. To me the charm came from the exotic language, some will probably find this a turn-off. The conversation is minimal and not so important. It's just there to deliver the facts, not to explain emotions. Comments about the coldness of Ash have nothing to do with bad acting, but with the character she plays (another one of Oshii's trademarks). * Characters Typical Oshii. A cold female in the leading role. The only time she shows emotion is when she's in the vicinity of her dog / dogs in general. Besides that, she's an ice cube. Personally, I like 'em like that. The others are interesting because of their little quirks and oddities, not because of their background stories, emotional struggles or deeper motives. All in all, they're a memorable bunch, but only there because you can't make a movie without characters. * Themes Every Oshii movie has it's own theme. Beautiful Dreamer was about the boundary between dream and reality, Patlabor 1 about the relationship between mankind and machinery and Patlabor 2 about war in general. Avalon tries to question the boundary between reality and virtual reality, using the first-person game genre as an ideal setup. Which world is real, which isn't, does it actually matter and is there a way to find out what's real and what isn't. Oshii poses all these questions, but doesn't deliver any answers. Which, in my humble opinion, is the best way to handle it. When a movie does try to give you an answer (Existenz), it doesn't stimulate the viewer to think about it afterwards. So, it all depends on what you're looking for. You want some questions to think about, this is your movie, you want a quick story with cheesy moral (Existenz again), avoid. * Special effects Again, the opinions here are diverse. I think it's one of the most visually impressive movies I've ever seen. Everything looks absolutely gorgeous, especially when you compare the original shots with the result. But allow me to stretch the term SFX a bit. This isn't The Matrix with twirly, flashy, in-your-face SFX. Instead, the first hour or so is completely reworked with a superb sepia-colored filter, which gives the movie a 1940 postcard kinda look. Besides that, the SFX are a lot more subtle. Those which are in-your-face (like the rendered vehicles) are done nicely. I especially liked the Citadel, and although the rendering is not perfect, the designs are marvelous. * Music Oshii regular Kenji Kawai made all the songs for this film. Oshii's one of the last to realize the effect a good soundtrack has on a movie. And I don't mean finding some pop idols and putting them on a CD, but really incorporating the songs in your movie for extra effect, and even working the other way around, by adjusting the images to the sound. All the songs were written for Avalon and vary from ambient to something close to opera. Even if you don't like the movie or haven't seen it yet, the soundtrack should be part of your CD/MP3 collection. * General Moodsetting Well, this is what makes the movie one of the best there is. It requires a special kind of taste to like it though. The characters' reality is a bleak and cold one, with little room for emotions, yet portrayed in such a way that it still feels kind of warm and cosy. It's hard to explain but I believe it's best compared with the darker side of romance. The feeling you get when you're sitting in front of your window, it's raining outside and your girlfriend just left you. It's a sort of gentle comforting sadness. He atteigns this through the music, the sepia filter, slow pace and briliant camera swoops/positions. One of the fears I had before I saw the movie, was that he wouldn't be able to capture this mood in a live action (he normally makes animated movies, which all have a certain style of their own to begin with), but he did a magnificent job. Very unique and stylish. * Overall I would like to say this movie has no similarities with The Matrix or Existenz whatsoever. People who expect a movie like the afore mentioned will be disappointed. This is 100% Oshii. It's a bit difficult to recommend to people who don't know him and his way of working. My advise is, try to watch Ghost In The Shell first. It has an easier job holding your attention (if you like animation that is), but is still representative for his other work. Personally, I think this ranks among the five best movies ever. It's refreshing, it's unique and made with passion. Hollywood fans beware, others, try it out.",
         "I think many of the complaints about this movie are by those that overlook one of the most obvious statements of the movie... that day to day life is boring & tedious, (walking hallways, taking lonely boring train rides, feeding your dog, watching an annoying person eat) all the while the visual world (read spiritual, artistic, visionary, higher level, etc.) is breath-taking. None of the characters of this world are privy to the visual poetry we are being exposed to as viewers... and that is part of the point, they are blind to it... yet it's a reminder that technological obsessiveness, or material obsessiveness, blinds everyone from simple visual beauty. The lighting alone in the movie was incredibly inventive, variations of sepia tones that went from red to green to blue during the course of the movie... overall the lighting and photography in the movie was amazing. You could take any given frame of this film and have a very beautiful photograph. There is a lot of CGI work in this movie that many nay-sayers called \"low budget\" and didn't even notice. Watch at the very end of the movie how the ghost's mouth wavers, almost like the Mona Lisa, from sad half-frown into a smirk, and this was done in post. I'm sure many people missed very subtle and beautiful touches like this on first viewing. If someone were to critique it for lack of complexity, I would agree... Blade Runner was not \"deep\" in the same way... but both, upon multiple viewings, remain almost timelessly poignant while being very reflective of when they were made, and I'm sure in 10 years this movie will seem as striking, as Blade Runner is to me now over 20 years since it's release. This will be one to watch over and over again every 6 months. One caveat... the Miramax version is rubbish. The translations are horrible and stupid. Literally you lose half the meaning of the film. At one point Ashe is talking to the Gamemaster discussing Avalon (the mythic island) and discussing Odin and the helmet of forgetting... right as she puts the VR helmet on. In the Miramax version... the Gamemaster just says \"be careful it's dangerous in there\"... etc. Not even close, it's like they didn't bother even attempting a real translation, pathetic.",
         "There is an interesting parallel between The Matrix and Avalon. The first is heavily based on Manga/Animee style, in visual dynamics much more than in pace as well as storytelling, the latter IS an Animee movie without the animations - in fact, Avalon is a VERY typical Oshii film in every other aspect going. It's slow. It has to be. It either bores you stiff or chains you to a subtle, incredibly intense way of visual storytelling - takes you back to a time when the attention span as well as the will required to catch a drift - to hold a thought and work on it - lived longer than a few seconds. On the surface, this movie is what one could call a cyberpunk poem. For that alone it already claims a unique position amongst whatever one might want to compare it to at first glance. A chillingly dark and detailed as well as beautifully crafted ballad of a heroine seeking much more than sense between realities and illusions. She seeks the home we all desperately try to cling to in belief for lack of knowledge. As always in Oshii's movies, one has to be prepared to be drawn into the unsettling realm between suffocating rules of conduct and complete uncertainty to get at the tiny grain of hope hovering so painfully close to the wheels that try to grind you. The dialogue doesn't tell us much. In fact, the more wordy the explanations get, the more they deflect us from what we see and feel. That's pretty much what Ash has to cope with as well to find the way to HER reality as well as illusion. To call the acting understated, slow and painfully introverted would be an understatement in itself. To call it bad for that would be the most idiotic conclusion. Malgorzata Foremniak (Ash) is a true discovery. The intensity and sheer impact she can give to 'silence' alone makes her the ideal Oshii actress. There is no empty move, no hollow gesture, no shallow expression in her entire performance. Quite an accomplishment if one keeps in mind that Ash leads a depressingly empty, hollow as well as shallow life on the surface. It's an equally depressing fact that this incredible Polish actress will stay in obscurity as far as the billion dollar mainstream movie world is concerned. The cinematography and lighting by Grzegorz Kedzierski is nothing short of exquisite. So is Barbara Novak's production design. Budget-wise, this is a B-Movie, but they all turned that restriction into a virtue. One last praise has to go to the composer as well as the musicians. The title track 'Avalon' alone, a grand piece for orchestra, choir and soprano, is nothing short of a masterpiece. As I said, this movie is a poem. Take a quiet place, wind down from the hassle of your day and let yourself sink into illusions which might even show the occasional glint of YOUR reality. * 10 out of 10 Schogger13",
         "Avalon is a beautiful movie, but not for everyone. If you mainly like action or fast-paced movies you may be turned off by some of the slow scenes during the movie. Avalon has action though, and explosions galore. Some of the story is a little ridiculous and hard to follow, but that isn't necessarily a bad thing at all. This is the only film I know of that was a co-production of both Japan and Poland. Directed by Mamoru Oshii, but filmed mostly in Poland and in the native Polish language. While watching this movie you get a feeling of a very unique quality. It was filmed (or altered in post) to resemble an old Sepia toned film, but still with the high-resolution of today's film standard. This adds a very bleak and depressive visual style to much of the movie. That's a good thing, because this is not a happy movie in the least. Avalon relies heavily on CGI throughout the movie, due to the \"cyber game world\" that the movie is largely dealing with. Much of the CGI effects are quite interesting to watch. You can often tell they are CGI effects, but it's obvious that it's a computer dominating world with players inside it. Another effective element to the film was the excellent music score by Kenji Kawai. This has to be one of the most beautiful and engaging film scores I've heard in a long time. It ranges through many different forms, even to the operatic. Very layered and complex, yet easy on the ears. Recorded with the Warsaw Philharmonic Orchestra, tons of people played the various musical instruments in the recording of the score, according to the end credits. I would compare it in a sense to Christopher Young's otherworldly and haunting score for the first two Hellraiser films. It's a shame that the soundtrack to Avalon is currently only available as an expensive import CD. Even if you dislike the film, you must watch it once just for the amazing music...it really is that good.",
         "This is a stunningly visual film which takes many of the best elements of the minor sub-genre of 1980s and 1990s sci-fi involving virtual reality, and blends them into an interesting story exploring social withdrawal, addiction, the nature of reality, and the value of life. The film does have a bit of new wave pretentiousness to it - using cliché hacker-names for the players of Avalon, etc, but no more so than many of its competitors (and a bit less than The Matrix). If this sort of thing doesn't appeal to you - and especially if you're the type who wants a film to simply entertain and tell you a simple story, don't bother to read any further. The film uses a story-telling technique common in good literature but unfortunately under-used in film - that of intentional ambiguity. The best example of this is the main character - well played by Malgorzata Foremniak. You simply don't know what to make of \"Ash\". Though I found it easy to relate to this character, and I think I understand her, I am not sure most viewers will. In my opinion, Ash is best interpreted as a person with an iron-clad grip on reality, who nevertheless maintains a distance from the people around her, and prefers to keep her relationships \"in-game\". This is not at all an uncommon personality type, especially among women and mature males in the real worlds of virtual reality and on-line gaming. The film focuses on Ash's ambitions to become the best player of Avalon - an ultra-real and sometimes deadly virtual reality game - in the world. Avalon is illegal and run on LANs which are set up in what looks like futuristic crack houses. To become recognized as the best, Ash has to complete a level which tends to put anybody who enters it into a catatonic state. She comes to believe that an old team mate of hers - Murphy - inhabits that zone, and wants to rescue him. But of course the designers of the game have other plans, and maybe Murphy himself does as well. Foremniak does a great job of playing this ambiguous yet sympathetic character. Ash, the carefully developed script, the excellent soundtrack, and the superb and beautiful visual effects, all keep you guessing until the very end. I never knew what to expect from this film, and I was very pleased by the way it developed its own concepts of logic and justice - remaining centered on Ash throughout. Avalon was interesting enough for a second and perhaps a third viewing. I will update my review (if needed) after my next round with it. For now, I will only give it a very high recommendation to anybody who has read this far. After all, if you've read this far in the review, you're probably interested enough in the film to see it.",
         "I noticed the movie got rated somewhat better by the younger part of the public and frankly, that doesn't surprise me. You'll have to have played an online shoot-em-up or war game at least once to see why the idea of a gamer making a life of her addiction in a near future isn't such an outlandish idea. Avalon takes this idea to new extremes, without being cheap or easy and adds a healthy dose of magical realism. The artwork is stunning, the soundtrack very strong (and classical instead of the usual techno), the acting is cool and distant, which is all perfect for the dark setting. Even the choice of Poland as the scenery seems right on. Why then doesn't this flic deserve a 10? Well, although I liked the story and though it does have depth, it is a bit one-dimensional. The world doesn't seem to harbor more than this one story and that's a shame. The movie could have become a classic with a little bit more background plot. But nonetheless, a must-see.",
         "Well, this movie I enjoyed very much. To answer to those complaining about the slow pace: you're right. That's what's different and pretty nice in my opinion. For instance that moment when Ash is slicing a cabbage, cooking in her apartment. Boy! What a slow yet intense moment. Nothing to \"see\" but how much to feel. I'd say i like John Wo's movies too you know, but this style is the opposite, and better i think if a comparison can be made. You might think i'm a weirdo but next time you see it try to focus on the apparent emptyness of some of the scenes ... like the one in the subway ... i hope you'll see what i mean.",
         "There is a lot to recommend this movie, including a richly-stylized world, exciting action, and excellent music. I will admit that I was first interested in this movie because I knew of the director Mamoru Oshii from the anime \"Ghost in the Shell\", so I wasn't surprised to find that the movie felt much like a very stylized high-quality anime movie. Indeed, I wasn't surprised that the Japanese director revealed (in an interview included with the DVD I watched) that his relationship with the Polish actress playing the main character Ash was much like his relationship with a character from one of his anime projects, since he could no more communicate personally with Malgorzata Foremniak than he could with one of his anime characters. To him, the actress was entirely her character, and it's intriguing to see what became of that very unusual relationship on film. I'm always wary of getting carried away with a first reaction to a film, so I should admit that this film isn't perfect. I found myself wanting to know more about the background of the main character, and her family, and how she came to become the person we see in the film; certainly, Malgorzata Foremniak does a very good job of playing a character whose fantasy life (the life of her online RPG character) is more real than her 'real' life, but the lack of background detail makes her character Ash very much like a two-dimensional anime character, and that can be considered a weakness. Also, this movie bears an obvious similarity to \"The Matrix\" (which predated it), so most viewers will inevitably compare this movie to \"The Matrix\" and find it perhaps wanting in that it doesn't lay out the background of the virtual world of the Avalon RPG as clearly as \"The Matrix\" lays out the background of its world. These factors notwithstanding, I still enjoyed \"Avalon\" and I recommend it to anyone with more than a passing interest in virtual reality stories, anime, or highly-stylized science fiction in general. In the aforementioned interview, the director mentions that his films tend to deal with a borderline between fantasy and reality, and it's quite apparent that Ash's 'real world' is somehow both grittier, and less real, than the world of the Avalon RPG which she's so obsessed with. The action sequences in the film (featuring real-world equipment from the Polish army, such as tanks and attack helicopters) are exciting in their own right, but the special effects of the film (such as explosions reduced to 2-D images and bystanders who disintegrate when shot) make it clear what is supposedly real and what is supposedly virtual. Also, the contrast between fantasy and reality is much more vivid here than in the Matrix movies - and that's especially apparent toward the end of the movie where the viewer is left to wonder just what (if anything) is ultimately real, and what is simply imagined. Also, I must say that the music of this film is extraordinary, including choral music that is downright eerie, but also beautiful at the same time. A world both real and unreal is conjured very effectively in this movie, and therefore I would recommend it to any fans of this sub-genre of science fiction in particular, and fans of highly-stylized film-making in general.",
         "Avalon can be seen as part of a trilogy, the first installment of which would be Ghost in the Shell, the last, Ghost in the Shell: Innocence. Avalon contains many direct references to Ghost in the Shell, and shares a lot of its motif of philosophical search for the self. They also share the cyberpunk imagery, and the fact that the main heroine is an impassive female warrior. I mention all this because I think it's inadvisable to watch Avalon if you haven't watched Ghost in the Shell (and pondered on it a bit). Avalon can be extremely heavy at times. This movie does not make you think; watching Avalon is like trying to decipher a zen poem, which I think can be done, but not through intellectual decoding. In Avalon, a lone hunter in a virtual reality game shares her life with a basset dog, and all her activities seem to be centered around getting better in the illegal, dangerous game and getting food the dog with the money she earns there. The game is illegal because you can die playing it; \"really\" die in the concrete, bleak urban world that Ash, the main hero, lives every day. However, apart from the possibility of virtual death, the game offers a secret - the highest level, Avalon. The legendary Avalon is the \"Isle of the Blessed\", where King Arthur lies in eternal sleep. In the movie, it is a mystery, which haunts Ash ever since the deaths of her last player team. The search for Avalon is depicted in the most beautiful cinematography. The plot is very symbolic and should be considered so; the search for the gate to Avalon can mean many things, and the nature of the quest changes as Ash is getting closer. However, like Ghost in the Shell: Innocence, the movie is heavy and long, and the characters engage in philosophical discussion every time they can. With all its beautiful cinematography, interesting acting (very automaton-like, but intentionally so), and a set of intriguing philosophical questions, this movie suffers from heavy-handed imagery and symbols, sometimes. Hard science fiction pushes the science as far as possible; Avalon is an example of hard cyberpunk, where the confines of the conceptual world dreamed up by the director are explored fully and unremittingly. If you are ready to take a film not as only entertainment, but also a challenge to your thinking power, Avalon, like all Oshii's movies, is a thrill. However, beautiful, intellectually rewarding science fiction does not have to be longish and heavy, as Avalon is at times. Watch Ghost in the Shell before it, watch Ghost in the Shell: Innocence after it, and approach this movie at your most relaxed, for it to be a rewarding rewarding experience; it can wear you down, otherwise. One more thing: if you're Polish, watch the Japanese dub with English subtitles. The Polish lines were translated literally from the Japanese, and they are very often almost gibberish (and the Japanese voice-acting is better, too). Also, do not let the fact that the movie's virtual world seems to be set in your local K-mart detract from your watching experience.",
         "Firstly I was amazed at the effect that this film has on people. After reading other comments here, it does not take long to note that reviewers are either full of praise or downright critical, with little in between. Not many movies are so provocative. I stumbled onto this film late one night at the local video rental and it was like my last option, so I had little or no expectations to be deflated. I was pleasantly surprised. The sombre ambiance of the surroundings (Poland) enchanted me, and the sepia black & white film stock simply added to the mystique of the setting. Indeed I have not experienced such a rich atmosphere in a sci-fi film since Blade Runner!!! The SLIGHTLY low-tech special effects were incredible in that they seemed to add authenticity to the fact that this was a \"video game\" NOT \"reality\", unlike a lot of sci-fi where the special effects are merely another prop. The insular existence of the lead character due to her obsession with her virtual world is perhaps very poignant today more than ever with the advent of cyber space, computer games etc and their potential for social alienation. Perhaps the films shortcoming is that it may not appeal to the younger set who have grown up on a heavy diet of Hollywood Blockbusters where there has to be the mandatory car chase and subsequent sex followed by a gratuitous helping of ultra violence, but for me that was part of this very artistic films charm."
      ],
      "genres": [
         "Action",
         "Drama",
         "Fantasy",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Deiz Production",
         "Bandai Visual Company",
         "Media Factory"
      ],
      "summaries": [
         "In a future world, young people are increasingly becoming addicted to an illegal (and potentially deadly) battle simulation game called Avalon. When Ash, a star player, hears of rumors that a more advanced level of the game exists somewhere, she gives up her loner ways and joins a gang of explorers. Even if she finds the gateway to the next level, will she ever be able to come back to reality?",
         "Gloomy portrayal of the near future in an imaginary town in Central Europe, shot in Poland (Polish is also spoken). The town is dirty and chaotic. Computer games have lost their innocence: they are addictive and large sums of money can be won. Ash lives alone. She doesn't have any contact with other people, only with her dog. Her only activities are cooking meals for the dog and playing games. She is a professional Avalon super warrior, a player on the top-level, that is only accessible under very specific conditions. Once a player is inside, they can only stop by winning the game. Otherwise the player can die. Ash ignores all warnings and decides to play anyway."
      ],
      "budget": 8000000
   },
   "movielensId": 6790,
   "movielens": {
      "languages": ["Polski"],
      "releaseDate": "2001-01-20",
      "dvdReleaseDate": "2003-12-16",
      "directors": ["Mamoru Oshii"],
      "runtime": 107,
      "movieId": 6790,
      "title": "Avalon",
      "mpaa": "R",
      "actors": [
         "Małgorzata Foremniak",
         "Władysław Kowalski",
         "Jerzy Gudejko",
         "Dariusz Biskupski",
         "Bartlomiej Swiderski",
         "Katarzyna Bargiełowska",
         "Alicja Sapryk",
         "Michal Breitenwald",
         "Zuzanna Kasz",
         "Adam Szyszkowski",
         "Krzysztof Szczerbinski",
         "Marek Stawinski"
      ],
      "imdbMovieId": "0267287",
      "originalTitle": "Avalon",
      "genres": [
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "8TTgzumaI0w",
         "0K9keJYO8BM"
      ],
      "plotSummary": "In a future world, young people are increasingly becoming addicted to an illegal (and potentially deadly) battle simulation game called Avalon. When Ash, a star player, hears of rumors that a more advanced level of the game exists somewhere, she gives up her loner ways and joins a gang of explorers. Even if she finds the gateway to the next level, will she ever be able to come back to reality?",
      "tmdbMovieId": 10881,
      "avgRating": 3.43732,
      "releaseYear": "2001",
      "numRatings": 694,
      "posterPath": "/6r6LjdPVIRBqzQW0umjHA1JEItl.jpg"
   }
}