{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "army",
            "id": 6092
         },
         {
            "name": "broadway",
            "id": 156028
         }
      ],
      "imdb_id": "tt0034409",
      "video": false,
      "title": "You'll Never Get Rich",
      "recommendations": [
         35032,
         31798,
         35275,
         43232,
         38716,
         30798,
         28293,
         77448,
         60551,
         52844,
         18651,
         43517,
         26542,
         43239,
         33738,
         97421,
         117033,
         55239,
         90450,
         47310
      ],
      "backdrop_path": "/k0KswfQ5Ix1vrmmgElHC5xCX4ss.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Robert Curtis",
               "gender": 2,
               "credit_id": "52fe45a7c3a368484e067757",
               "name": "Fred Astaire",
               "profile_path": "/tFdgseH9plbGN8XBhBcG9lscfaY.jpg",
               "id": 30181,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sheila Winthrop",
               "gender": 1,
               "credit_id": "52fe45a7c3a368484e06775b",
               "name": "Rita Hayworth",
               "profile_path": "/oG6UWxpq552LN5re0TJESUGP0K7.jpg",
               "id": 33741,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Martin Cortland",
               "gender": 2,
               "credit_id": "52fe45a7c3a368484e06775f",
               "name": "Robert Benchley",
               "profile_path": "/7G3QCdDKHmm265vuXQQvEip2BcT.jpg",
               "id": 94433,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Captain Tom Barton",
               "gender": 0,
               "credit_id": "52fe45a8c3a368484e067763",
               "name": "John Hubbard",
               "profile_path": "/9zTAaXejiTGKEJfFIBUIhHo481t.jpg",
               "id": 33230,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sonya",
               "gender": 1,
               "credit_id": "52fe45a8c3a368484e067779",
               "name": "Osa Massen",
               "profile_path": "/f0wSQH6nF7E5aVQcy5Rw37Goa7Z.jpg",
               "id": 89684,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Mrs. Julia Cortland",
               "gender": 0,
               "credit_id": "52fe45a8c3a368484e06777d",
               "name": "Frieda Inescort",
               "profile_path": "/qzAqyCip9c5ke3d31UMSgCTkUt4.jpg",
               "id": 82383,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Kewpie Blain",
               "gender": 2,
               "credit_id": "52fe45a8c3a368484e067781",
               "name": "Guinn Williams",
               "profile_path": "/nJgaxVjWnS64wCNFQ1MnqeHjvRP.jpg",
               "id": 95276,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a368484e067769",
               "name": "Sidney Lanfield",
               "profile_path": null,
               "id": 97017,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a368484e06776f",
               "name": "Michael Fessier",
               "profile_path": null,
               "id": 108794,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a368484e067775",
               "name": "Ernest Pagano",
               "profile_path": null,
               "id": 108795,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.544115,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28658,
      "vote_count": 12,
      "budget": 0,
      "overview": "A Broadway choreographer (Fred Astaire) gets drafted and puts on a GI show with his girlfriend (Rita Hayworth) and producer (Robert Benchley).",
      "similar": [
         872,
         11224,
         224141,
         82695,
         14128,
         16119,
         15121,
         11970,
         812,
         824,
         10020,
         11631,
         621,
         676,
         703,
         3933,
         46195,
         196867,
         114,
         134
      ],
      "original_title": "You'll Never Get Rich",
      "runtime": 88,
      "poster_path": "/kx8KbJNVOJfvfZm6p4aam0zuQ8E.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1941-09-25",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Exciting loveliness and rhythm in a star-spangled army musical!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Sidney Lanfield"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Michael Fessier",
         "Ernest Pagano"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0034409/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NDI1NDIxNF5BMl5BanBnXkFtZTcwNjA0MzQyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Fred Astaire, Rita Hayworth, Robert Benchley | See full cast and crew »"],
      "reviews": [
         "Released shortly before America's entry into the war, Columbia's \"You'll Never Get Rich\" is one of Fred Astaire's better films during the relatively dry period that extended from his last RKO film with Ginger Rogers to his first films at MGM\u0085 Since leaving RKO and Ginger Rogers, Astaire had danced with Eleanor Powell in \"Broadway Melody of 1940\" and with Paulette Goddard in \"Second Chorus.\" In \"You'll Never Get Rich,\" he had a new partner in Rita Hayworth: a lushly beautiful redheaded actress who was being prepared for stardom in mostly low-budget films\u0085 She was a talented dancer who had worked with her family for many years in a vaudeville act called the Dancing Casinos\u0085 \"You'll Never Get Rich\" cast Astaire as Robert Curtis, a Broadway dance director who is drafted into the army\u0085 He becomes involved in an on-again, off-again romance with Sheila Winthrop (Hayworth), a beautiful chorus girl whose fiancé is a captain in the army\u0085 The not-very-interesting plot is often interrupted for musical interludes\u0085 Astaire and Hayworth dance together twice\u0097to the sensuous Latin beat of \"So Near and Yet So Far,\" and in \"The Wedding Cake Walk,\" a military finale which has a chorus of war brides and soldiers, plus the two stars, dancing atop a huge tank\u0085 Astaire and Hayworth make an attractive dance team, although Hayworth seems a bit too formidable, too \"grand\" for Astaire's self-effacing style\u0085. Astaire also has several numbers without Hayworth: most notably, a dance in a guardhouse to the song \"Since I Kissed My Baby Goodbye,\" in which he combines several kinds of dazzling footwork\u0085 \"You'll Never Get Rich\" is lightweight but amiable entertainment, and it kept Astaire dancing\u0085",
         "I initially thought this one was the lesser of the two pairings. But I have to admit this film- which puts its audience squarely into the start of World War II- is quite sharp, script-wise, and quite lyrical, music-wise. Astaire's dance director shows an early but distant attraction to chorus dancer Hayworth (and vice-versa), but is drafted into the Army (not to mention repeatedly banished to the guardhouse for various insubordination) before they can live happily ever after. They were a sweet coupling, despite their 19-year age difference, and Hayworth, as others have mentioned, was quite a revelation as a tap and ballroom dancer. All of their dances are performances only, not love scenes (which are the duets I have always preferred), but they are sensational. The requisite 'big number' is the finale, the \"Wedding Cake Walk\" (you'll do a double-take at the last image of the tank-shaped wedding cake), and there is an ensemble dance at the start of the film called \"Boogie Barcarolle.\" But two numbers stand out: Astaire's solo dance in the guardhouse, sung by a black jazz chorus (uncredited, called the Delta Rhythm Boys) and entitled \"Since I Kissed My Baby Goodbye.\" Elegant tapping by Astaire is blended with a rich bass vocal by Lucius Brooks. The other number is Astaire and Hayworth's dress rehearsal \"So Near and Yet So Far,\" a stunning rumba which shows off Hayworth in a sheer black gown and expands into intricate layers of choreography. This is one of the last films to show Ms. Hayworth as a brunette; her hair is no longer black, but it is not yet red either, but shortly after this outing her tresses went completely red as she began doing doing Technicolor films. Their follow-up film, \"You Were Never Lovelier,\" had more of the standard romantic shenanigans and more lyrical dance numbers, but this first one was more screwball comedy and, in a sense, more of a challenge to pull off.",
         "Though the 42 year old Fred Astaire was certainly not eligible for the peacetime draft still he plays the would be soldier very well in You'll Never Get Rich. Leaving Rita Hayworth is certain to be a problem though. The first peacetime draft in American history forms the background for this film in the same way as Universal's Abbott and Costello classic, Buck Privates. You'll Never Get Rich bares some resemblance to Buck Privates in the comedy portions of the film though it does stay away from the burlesque aspects that Abbott and Costello brought to it. Remember this is a Fred Astaire film and in the plot it has a lot of resemblance to what Astaire had been recently doing over at RKO with Ginger Rogers. The same kind of kittenish romantic complications with humorist Robert Benchley taking the Eric Blore/Victor Moore part as the one who causes all the problems. The dance numbers bear a strong resemblance to the routines Astaire did with Rogers. But here he is being brought over to Columbia to showcase the woman who would be Columbia Picture's mealticket for the next decade and a half. Rita Hayworth was just coming into her own as a box office attraction when this film was done. On the dance floor she complements the elegant Mr. Astaire divinely. This was the first of two films she did with Astaire and while I like You Were Never Lovelier a lot better than this one, You'll Never Get Rich is still entertaining. Cole Porter wrote the score for this film and it's probably one of his lesser efforts for the screen and stage. Still it did have an Oscar nominated song in Since I Kissed My Baby Goodbye. It's not a song that immediately brings Cole Porter to mind for today's audience though. Will both Rita Hayworth and Uncle Sam get the services of Fred Astaire? See You'll Never Get Rich and find out.",
         "I have to differ with the viewer who feels that though Rita Hayworth was a marvelous dancer she did not measure up to Ginger Rogers as the partner of Fred Astaire. Rita's dancing was so graceful that she was the perfect match for the stupendous Astaire. Her beauty in this movie is a thing to behold. Now after all these years we can only wish that they included a bunch of other dances instead of all the silliness. How can it be that such a lovely as Rita would have such a difficult life? I wonder if the talented Hayworth ever realized that it would be her early dancing that would really be her lasting legacy and if she did would she have given us more to appreciate for the years. Watching her dance as a young woman is a joy that will be repeated for generations.",
         "I really enjoyed the first third of this hour-and-a-half movie. However, when Fred Astaire joins the army, the movie switches from dancing to humor, and the humor is not much. His consists mainly of a fellow soldier who is an expert in double talk. He's pretty good but his act wears thin quickly. So, too, does the storyline: lying, lying, and more lying. That's followed by cover-ups, false accusations, people falling in and out of love at the drop of a hat, etc. - you know, typical stupid fare of the day for these kind of films. Since they were not allowed to pollute the films with profanity and pornography, filmmakers still could promote everything wrong by trivializing adultery, lying, smoking, drinking, cheating and other evils. This movie, like a lot of comedies of the day, gives numerous examples of that. Too bad, because it looked like it was going to be a great film, at least in the dancing of Astaire and Hayworth in the beginning. Those two were great to watch. Hayworth, known more for her glamor, was actually a great dancer and reportedly Astaire's favorite partner. No arguments there! Rita looks fantastic and Astaire's stepping is always perfection. Unfortunately, in Fred's films they had to have a story go along with his dancing. I only give it five points to see Rita.",
         "Ginger Rogers may have been Fred Astaire's ultimate dance partner, but Rita Hayworth makes a very worthwhile play for that title in 'You Were Never Lovelier'. This fun wartime comedy-musical has a very contrived plot that is as flimsy as tissue paper, but when the two stars Hayworth and Astaire are on screen together all faults are forgiven for the sheer brilliance they show together as dancing partners. Hayowrth, early in her career, shows little sign of nervousness before the camera and handles her role as Sheila Winthrop very well, she imbues her with charm, grace and just a hint of sass. Astaire is equally likable as Robert Curtis, Rita's love interest from the beginning. As with all of Astaire's films with Rogers the lovestruck couple experience a series of misdemeanours that hinder their romance, until a romantic finale reunites the pair. Light moments of comedy work well to compliment the bursts of energetic dancing, and Hayworth's and Astaire's charisma shine through perfectly when they are needed to lift the action. The army base setting is refreshing, yet also distracting. A little too much time is given to the rather unamusing antics of Astaire's servicemen buddies. The film isn't overly influenced with visual style, the sets look as if they have been used time and time again, yet Hayworth and Astaire are sublime whatever the situation. Rita looks very beautiful in this one, and she displays a natural acting talent. Astaire was never much of an actor but he lights up the screen like no other. Nice supporting work from Frieda Inescort is a highlight, as is the dancing finale for Hayworth and Astaire atop an army tank. Yes, the army sub-plot came in handy in the end. Margarita Cansino was still undergoing the 'Rita Hayworth' transformation while this film was being made, so Rita still looks quite Latin in most scenes, with darker hair than we are normally accustomed to from the famous redhead. Fred often said that Rita was the best dancer he ever worked with, and at times he does seem in awe of her capabilities that definitely match his. Rita considered this one of the two jewels in her film career (the other being 'You Were Never Lovelier' with, you guessed it, Fred), and it is a gorgeous film. A feel-good musical that isn't a mind-blowing film experience, yet is definitely an enjoyable one. 7/10.",
         "\"You'll Never Get Rich\" is a 1941 film starring Fred Astaire, Rita Hayworth, Robert Benchley, and a very large cast. Benchley plays Martin Cortland, a producer who chases around on his wife (Frieda Inescort) and sets his sights on Sheila (Hayworth), who is in his current show along with Robert Curtis (Astaire). When his wife suspects, Martin has Robert take Sheila out and present her with a diamond bracelet that Martin actually purchased for her but that his wife found in his pocket. Martin then pretends he bought it for Robert to give to Sheila. Sheila angrily refuses it, and when Robert goes to her place to explain, he comes face to face with her boyfriend, whom he thinks is her brother - whoever he is, he has a gun in his hand. Robert finds himself drafted and, desperate to get in and avoid Sheila's boyfriend, pads himself with the 5 extra pounds he needs to get into the service. He then spends just about the rest of the film in the guard house until the grand finale - and even then, he's returned to the guard house. That's the story and admittedly, it's not much. There are some very good dance numbers, but the thing about the film that's special is the partnership of Astaire and Hayworth. They are marvelous together. Supposedly Rita was his favorite partner, and it's easy to see why. She doesn't dance; she floats, and she's so gloriously beautiful, you can't take your eyes off of her. Fred and Rita dance to the \"Boogie Barcarole,\" \"So Near Yet So Far,\" and \"The Wedding Cake Walk,\" sung by Martha Tilton for Rita. Fred's solos include \"Shootin' the Work for Uncle Sam,\" and \"Since I Kissed My Baby Goodbye.\" It's hard to go wrong with stars like Fred Astaire and Rita Hayworth, and while this isn't the best film of either one of them, it's still enjoyable.",
         "Barely five minutes into the film and only thirty seconds long, a small jewel is not to be missed in this vintage 1941 musical, as it ranks among the best dance numbers to be seen from the golden age of Hollywood. It's where Fred Astaire casually asks Rita Hayworth to follow him on a complex tap routine set to Cole Porter's \"Boogie Barcarole\". That Astaire performs flawlessly is to be expected, but the stunning 23-year old Hayworth is startling in her precision and élan. Not only is she absurdly beautiful in her crisp rehearsal togs, but she matches Astaire step for step with unbridled confidence and with her long, gorgeous gams perfectly synchronized with his. The rest of the number, performed with an army of similarly dressed dancers, is not nearly as interesting especially since the fusion between boogie-woogie and classical feels forced. The movie itself, directed by Sidney Lanfield and written by Michael Fessier and Ernest Pagano, is a silly mistaken identity affair that feels lifted from one of Astaire's earlier pairings with Ginger Rogers and then retrofitted into a military theme. Hardly a stretch, he plays Bob Curtis, a Broadway dancer and choreographer who works for philandering producer Martin Cortland, played by Algonquin wit Robert Benchley. Cortland has his eyes on chorus dancer Sheila Winthrop and attempts to give her a diamond bracelet until his wife Julia mistakes the gift for her. He pretends the bracelet is from Curtis, which of course, leads to larger complications, especially when Curtis gets drafted and his superior officer turns out to be Sheila's intended fiancé. Off the dance floor and in her first leading role, Hayworth, already in her 38th film, is charming as Sheila, although Frieda Inescort easily steals all her scenes as the deadpan Julia, a perfect match to the acerbic Benchley. Lowbrow comic shenanigans are interspersed with the Robert Alton-choreographed musical numbers. The highlights are an impressive Astaire tap solo set to \"Since I Kissed My Baby Goodbye\" and two more duets with Hayworth - the alluring rumba, \"So Near and Yet So Far\", and the infectious \"Wedding Cake Walk\" where the pair get married amid a dress-alike chorus, do a mean Harlem shuffle and tap-dance atop a white cake shaped like a tank. In fact, opening two months before Pearl Harbor, the film portends the upcoming war with patriotic ensemble numbers like \"Shootin' the Works for Uncle Sam\". The 2003 DVD includes trailers for this film as well as two classic Hayworth vehicles, the career-defining Gilda, and future husband Orson Welles' pulp classic, The Lady from Shanghai. The movie is very lightweight, but Astaire's artistry is always worthwhile in any setting, and it's easy to see why Hayworth became the fantasy figure of many an American soldier.",
         "Impresario Martin Cortland has a big crush on the showgirl Sheila Winthrop.Her wife may not like that.Mrs. Susan Cortland happens to find a diamond bracelet with Sheila's name on it.He tells a lie that choreographer Robert Curtis bought that to her.They all go out together, which suits Sheila just fine, since she has a crush on Robert.But she starts loathing him after she finds out the game they were playing.Robert notices he has feelings for Sheila.Then Uncle Sam wants him and he is drafted into the army, where he gets in and out of prison.But they'll meet again.Sidney Lanfield's You'll Never Get Rich (1941) is a wonderful wartime picture.It has the brilliant score by Cole Porter.This was the first movie that teamed Fred Astaire and Rita Hayworth.What a great pair they make! Fred even made Rita his favorite dancing partner, before Ginger Rogers.He even knew her father before she was born, as they were dancers on the New York City vaudeville circuit.The movies she made with Fred were Rita's own personal favorites.Robert Benchley does a great job as the womanizing impresario.Frieda Inescort is marvelous as his wife.Osa Massen is very good as his new girl Sonya.John Hubbard is terrific as Captain Tom Barton.Guinn 'Big Boy' Williams is terrific as Kewpie Blain.And so is Cliff Nazarro as Swivel Tongue 'Swiv'.Donald MacBride is magnificent as Top Sergeant.This romantic musical comedy is very entertaining, and often very funny.I had most fun watching that restaurant scene, where they're trying to convince Mrs. Cortland that Sheila is Robert's girl.Also the double-talk routine by Cliff Nazarro at the train station is funny.Or him trying to get some water to Robert as others are trying to sleep.Astaire in a captain's uniform is quite hilarious.And when he goes AWOL.And you could never get bored of watching Fred Astaire's tap dancing.",
         "I think this film is a delightful comedy, with all players playing their respected roles beautifully. I especially love the dance steps and musical number done by Astaire and Hayworth during rehearsal at the beginning of the movie."
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": ["After his wife discovers a telltale diamond bracelet, impresario Martin Cortland tries to show he's not chasing after showgirl Sheila Winthrop. Choreographer Robert Curtis gets caught in the middle of the boss's scheme. Army conscription offers Robert the perfect escape from his troubles- or does it?"],
      "budget": 0
   },
   "movielensId": 6912,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1941-09-25",
      "dvdReleaseDate": "2003-10-21",
      "directors": ["Sidney Lanfield"],
      "runtime": 88,
      "movieId": 6912,
      "title": "You'll Never Get Rich",
      "mpaa": "",
      "actors": [
         "Fred Astaire",
         "Rita Hayworth",
         "Robert Benchley",
         "John Hubbard",
         "Osa Massen",
         "Frieda Inescort",
         "Guinn Williams"
      ],
      "imdbMovieId": "0034409",
      "originalTitle": "You'll Never Get Rich",
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["cVVRCxbsT7k"],
      "plotSummary": "A Broadway choreographer (Fred Astaire) gets drafted and puts on a GI show with his girlfriend (Rita Hayworth) and producer (Robert Benchley).",
      "tmdbMovieId": 28658,
      "avgRating": 3.27419,
      "releaseYear": "1941",
      "numRatings": 31,
      "posterPath": "/kx8KbJNVOJfvfZm6p4aam0zuQ8E.jpg"
   }
}