{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "cave",
            "id": 1964
         },
         {
            "name": "hindu",
            "id": 4096
         },
         {
            "name": "doctor",
            "id": 13005
         },
         {
            "name": "india",
            "id": 14636
         },
         {
            "name": "english",
            "id": 14744
         },
         {
            "name": "magistrate",
            "id": 188719
         },
         {
            "name": "1920s",
            "id": 207876
         },
         {
            "name": "mosque",
            "id": 231027
         },
         {
            "name": "british raj",
            "id": 235774
         }
      ],
      "imdb_id": "tt0087892",
      "video": false,
      "title": "A Passage to India",
      "recommendations": [
         851,
         18988,
         3088,
         907,
         18254,
         13528,
         965,
         14554,
         14741,
         14580,
         976,
         11426,
         32054,
         42122,
         1939,
         77245,
         16559,
         11541,
         11085,
         28145
      ],
      "backdrop_path": "/oMNXFamDcAeT7QXXlaKOIRozaxN.jpg",
      "revenue": 27187653,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Adela Quested",
               "gender": 1,
               "credit_id": "52fe468b9251416c7507ba7b",
               "name": "Judy Davis",
               "profile_path": "/xQMA72T6yz6ebJXv1pCuZC1fDJo.jpg",
               "id": 351,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Dr. Aziz H. Ahmed",
               "gender": 2,
               "credit_id": "52fe468b9251416c7507ba8b",
               "name": "Victor Banerjee",
               "profile_path": "/s19NsocK35S7RFs1vuS61tK3dET.jpg",
               "id": 78951,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mrs. Moore",
               "gender": 1,
               "credit_id": "52fe468b9251416c7507ba83",
               "name": "Peggy Ashcroft",
               "profile_path": "/pZ8ff5C9xwYEl0uYyS0XQzQc1PJ.jpg",
               "id": 3672,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Richard Fielding",
               "gender": 2,
               "credit_id": "52fe468b9251416c7507ba87",
               "name": "James Fox",
               "profile_path": "/27vddrOyr0jnT2pi17cFoKPro4A.jpg",
               "id": 1292,
               "order": 3
            },
            {
               "cast_id": 2,
               "character": "Prof. Godbole",
               "gender": 2,
               "credit_id": "52fe468b9251416c7507ba7f",
               "name": "Alec Guinness",
               "profile_path": "/nv3ppxgUQJytFGXZNde4f9ZlshB.jpg",
               "id": 12248,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Ronny Heaslop",
               "gender": 2,
               "credit_id": "52fe468b9251416c7507ba8f",
               "name": "Nigel Havers",
               "profile_path": "/hZNkoh83CUAlOmqMwAz7i1jwWgi.jpg",
               "id": 53517,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Maj. McBryde",
               "gender": 2,
               "credit_id": "52fe468b9251416c7507ba93",
               "name": "Michael Culver",
               "profile_path": "/njBI1pTMMMlon5LufetA1vHn819.jpg",
               "id": 47520,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Turton",
               "gender": 2,
               "credit_id": "5a7b820cc3a3680f8c003073",
               "name": "Richard Wilson",
               "profile_path": "/zmhxfoHI8KkZFBKMEt9b89DPK5p.jpg",
               "id": 47874,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Mrs. Turton",
               "gender": 0,
               "credit_id": "5a7b82430e0a2632f0003a50",
               "name": "Antonia Pemberton",
               "profile_path": null,
               "id": 1225712,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "McBryde",
               "gender": 2,
               "credit_id": "5a7b82530e0a2632ff0039e1",
               "name": "Michael Culver",
               "profile_path": "/njBI1pTMMMlon5LufetA1vHn819.jpg",
               "id": 47520,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Ali",
               "gender": 2,
               "credit_id": "5a7b82620e0a2633020038fa",
               "name": "Art Malik",
               "profile_path": "/dJ8isTdH4hLfQHDEJu7DQYdfeIz.jpg",
               "id": 10672,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Hamidullah",
               "gender": 2,
               "credit_id": "5a7b82719251414b180033a5",
               "name": "Saeed Jaffrey",
               "profile_path": "/nDSQCtZjVNqeOWG1QooKq2NkElb.jpg",
               "id": 11852,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Major Callendar",
               "gender": 2,
               "credit_id": "5a7b8282c3a3680f8600341e",
               "name": "Clive Swift",
               "profile_path": "/5mbu41Ifih1JjYBxNxiClXj0bUU.jpg",
               "id": 33108,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Mrs. Callendar",
               "gender": 1,
               "credit_id": "5a7b82900e0a2632f0003aa6",
               "name": "Ann Firbank",
               "profile_path": "/xFCoMlE02MUrc1bD26ef0q5jAn4.jpg",
               "id": 17161,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Amritrao",
               "gender": 0,
               "credit_id": "5a7b82a39251414b180033d7",
               "name": "Roshan Seth",
               "profile_path": "/64HQvZuu8IeImXFe7vXgs4aZlUo.jpg",
               "id": 693,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Stella",
               "gender": 0,
               "credit_id": "5a7b82b19251414b1c00330f",
               "name": "Sandra Hotz",
               "profile_path": null,
               "id": 1974347,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe468b9251416c7507ba99",
               "name": "David Lean",
               "profile_path": "/iUTtDo1gl0Phe342xxoPq2w643R.jpg",
               "id": 12238,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe468b9251416c7507ba9f",
               "name": "E.M. Forster",
               "profile_path": "/rAAOtR6gWcdJgtp3iDPiKIrUN7O.jpg",
               "id": 54442,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "59fc88acc3a3681a3f02967f",
               "name": "John Box",
               "profile_path": null,
               "id": 13321,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "59fc88b492514113dd02c3fc",
               "name": "Leslie Tomkins",
               "profile_path": null,
               "id": 5021,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5a5a660cc3a36867e401164c",
               "name": "Robin Clarke",
               "profile_path": null,
               "id": 296,
               "department": "Sound",
               "job": "Music Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 5.320059,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 15927,
      "vote_count": 87,
      "budget": 8000000,
      "overview": "The film is set during the period of growing influence of the Indian independence movement in the British Raj. It begins with the arrival in India of a British woman, Miss Adela Quested (Judy Davis), who is joining her fiancé, a city magistrate named Ronny Heaslop (Nigel Havers). She and Ronny's mother, Mrs. Moore (Peggy Ashcroft), befriend an Indian doctor, Aziz H. Ahmed (Victor Banerjee).",
      "similar": [
         336843,
         281957,
         11121,
         4771,
         11005,
         40807,
         64682,
         1955,
         87827,
         101299,
         49529,
         75780,
         264644,
         346364,
         306819,
         244267,
         121,
         581,
         510,
         956
      ],
      "original_title": "A Passage to India",
      "runtime": 163,
      "poster_path": "/rsgf8xM6O2UhAig6SbdXNt8xPLI.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "हिन्दी",
            "iso_639_1": "hi"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "EMI Films Ltd.",
            "id": 538,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Thorn EMI Screen Entertainment",
            "id": 6179,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Home Box Office",
            "id": 6752,
            "origin_country": ""
         }
      ],
      "release_date": "1984-12-14",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "David Lean, the Director of \"Doctor Zhivago\", \"Lawrence of Arabia\" and \"The Bridge on the River Kwai\", invites you on . .",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["David Lean"],
      "runtime": 164,
      "synopsis": "The film is set in the 1920s during the period of growing influence of the Indian independence movement in the British Raj. Mrs. Moore (Peggy Ashcroft) and Adela Quested (Judy Davis) sail from England to India, where Ronny Heaslop (Nigel Havers), the older woman's son and younger woman's fiancé, is the local magistrate in the provincial town of Chandrapore. Through school superintendent Richard Fielding (James Fox), the two visitors meet eccentric elderly Brahmin scholar Professor Godbole (Alec Guinness), and they befriend Dr. Aziz Ahmed (Victor Banerjee), an impoverished widower who initially meets Mrs. Moore in a moonlit mosque overlooking the Ganges River. Their sensitivity and unprejudiced attitude toward native Indians endears them to him. When Mrs. Moore and Adela express an interest in seeing the \"real\" India, as opposed to the Anglicised environment of cricket, polo, and afternoon tea the British expatriates have created for themselves, Aziz offers to host an excursion to the remote Marabar Caves. The outing goes reasonably well until the two women begin exploring the caves with Aziz and his sizable entourage. Mrs. Moore experiences an overwhelming sense of claustrophobia that forces her to return to the open air. She encourages Adela and Aziz to continue their exploration but suggests they bring only one guide. The three set off for a series of caves far removed from the rest of the group, and before entering Aziz steps aside to smoke a cigarette. He returns to find Adela has disappeared; shortly after he sees her running headlong down the hill, bloody and dishevelled. Upon their return to town, Aziz is jailed to await trial for attempted rape, and an uproar ensues between the Indians and the Colonials. The case becomes a cause celebre among the British. When Mrs. Moore makes it clear she firmly believes in Aziz's innocence and will not testify against him, it is decided she should return to England. She subsequently suffers a fatal heart attack during the voyage and is buried at sea. To the consternation of her fiancé and friends, Adela has a change of heart and clears Aziz in open court. The Colonials are forced to make an ignominious retreat while the Indians carry the exonerated man out of the courtroom on their shoulders, cheering wildly. In the aftermath, Miss Quested breaks off her engagement and leaves India, while Dr. Aziz abandons his Western attire, dons traditional dress, and withdraws completely from Anglo-Indian society, opening a clinic in Northern India near the Himalayas. Although he remains angry and bitter for years, he eventually writes to Adela to convey his thanks and forgiveness.",
      "writers": [
         "E.M. Forster",
         "E.M. Forster"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0087892/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI4MzMzMTUzMV5BMl5BanBnXkFtZTgwNzAzMDUxMDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Judy Davis, Victor Banerjee, Peggy Ashcroft | See full cast and crew »"],
      "reviews": [
         "Steven Spielberg claimed his greatest inspiration in becoming a director was Sir David Lean. In motivating him in making a film, a Lean epic would lift his spirits and inspire ideas. Evidence of his marks of appreciations are in famous Indiana Jones shots, an eye for breathtaking vistas - Empire Of The Sun being most evident (which was originally a David Lean project). The legendary British director, who's larger than life approach to film exhilarated audiences around the globe with immortal classics as 'The Bridge On The River Kwai', 'Lawrence Of Arabia' and 'Doctor Zhivago', made an unexpected return in 1984, 22 years following the last epic with one of the most mythically dream like productions ever to grace the silver screen. He took us on a journey to picturesque India with his trademark scope in crisp cinematography which filled our lungs with the most breathtaking scenery. The new generation must rediscover the works of this great human being who bestowed upon us some of the most memorable, fantastic, larger than life epic experiences that have inspired countless directors in their work. 'A Passage To India' is no exception. It is a heart-wrenching, nightmarishly beautiful film, at the same time so dream like, it transports you to another world that penetrates through the spirit of self discovery. Reminiscent of a famous Australian film \"Picnic At Hanging Rock\" containing similar themes, a masterpiece directed by the poetic film maker Peter Weir, this powerful entry is one of the most memorable films of the 1980's. The film follows the intersection of two unlikely people, English lady Ms. Adela Quested (Judy Davis) and an Indian man Dr. Aziz (Victor Banerjee) during India's British rule in the roaring twenties. It is Adela's first time out of England as she is on her way to visit India to meet her fiancé who's a judge in colonial British territory. Accompanying her is her friend and future mother in law Mrs. Moore (Peggy Ashcroft) who shares common interests with Adela in wanting to see real India - in experiencing the countryside and meeting real Indians. To their astonishment however, they soon realize that the occupying English populace aren't as enthusiastic about the idea of making close contact with these everyday Indians, believing India is best experienced at a distance. But to Adela's hesitation to her surroundings, she insists on organizing an expedition for sight-seeing. Her new found friend and school teacher Richard Fielding (James Fox) assembles a group of well-read, knowledgeable Indians to guide them throughout the expedition, composing Professor Godbole (Alec Guiness) and Dr. Aziz (who by chance acquainted himself with Mrs. Moore the previous night). It isn't long before Adela and Aziz begin to explore interests in one another, but in an untouched natural overwhelming utopia that is India, what happens to Adela in a mystical cave far from home ends as a controversy that threatens to tear Indian/British relations into chaos. The film explores the themes of repression, illusion, racism, tolerance, forgiveness, self-discovery and justice all piled up into an unforgettable symbolically and visually breathtaking masterpiece. What we have here is one of the most emotionally engaging character studies in film history. The film's setting is genius in portraying self discovery in an unfamiliar place far from home. Like in 'Picnic At Hanging Rock', there is strong emphasis on repression and loss of place and time, creating a most delusional reality. Most importantly, it points out the political oppression to perfection, clearly showing English attitudes toward the very people they invaded. Human nature is the film's primary focus. Adele Quested and Dr. Aziz both learn important lessons the hard way, but never-the-less become stronger human beings. This almost mythical film absolutely drew me into this world David Lean so brilliantly brought to the screen. One of the films greatest highlights was the moving, magical, subtle and haunting score composed by legendary Maurice Jarre. It influenced the film's atmosphere so vividly, it fascinates every time I hear it. The cinematography came as no surprise to me and this is David Lean at his indisputable best. I was left grasping for air following the film's poignant conclusion. You feel almost like you're there every time. He is the master at creating an unforgettable atmosphere on an epic scale. This film was literally like a Passage To India. The cast was expertly selected. Judy Davis is perhaps one the greatest actresses that ever walked into a film set. Her commanding physical presence extracts such unforgettable performances, it leaves people in awe of her talent. Her portrayal of Adela is extremely realistic and you feel her emotions with such power. James Fox turns in a very convincing performance as the man who stands for justice, for those who can't gain it. Alec Guiness is arguably out of place as an Indian scholar, but I believe he brought a nice touch to the film - he is one of the greatest actors in the world. Besides, his role wasn't big enough to criticize. Peggy Ashcroft gave in a marvelous performance of a woman who sees the injustices only too well and can't stand the fact that little is being done to compromise. Everything about this film suggests it is the makings of a true artist. And everything about this film suggests that David Lean was a perfectionist who never lost his touch. It is easily one of the most beautiful, haunting, mystical and awe inspiring films ever made. I recommend it to anybody who loves film and better yet, to whoever hasn't seen a David Lean film before. This is the perfect place to start.",
         "Never mind whether or not it's as good as \"The Bridge on the River Kwai\", \"Lawrence of Arabia\", \"Doctor Zhivago\", et al.; the point is, it's a great film that was clearly made by the same David Lean that made the earlier masterpieces. The stuff that usually gets dismissed with a wave of the hand - the art direction, the music (Maurice Jarre reserved his best scores for David Lean, although there's less music here than there usually is), the photography, the editing, the indefinable assuredness of narrative flow - everything that makes up the heart and soul of cinema, in fact - is as marvellous as ever. It's amazing enough when you consider that this was Lean's first film in fourteen years. More astonishing is that it was the first film on which he's credited as editor in forty-two years. Forty-two years earlier, he was working for Michael Powell (the only other British director as good as Lean), who considered him the best editor in the world; and while Lean's wielding the scissors again after all that time may have made very little difference to his overall style, I still think there's something special - even more special than usual - about the way \"A Passage to India\" flows. Maybe it's that Lean adapted the screenplay, then shot it, then cut it himself, but he has such an strong feel for the pulse of the story, such an unerring feel for what follows from what, that even the several jump cuts - jump cuts are usually the most ugly, the most offensively flashy, and the most intrusive of all cinematic devices - are beautiful, natural, even classical. In a way you don't notice that they're there. I've never heard it said that two-time collaborators Powell and Lean have much in common - and they don't. But of all David Lean's creations this one comes closest to being like a Powell and Pressburger picture. There's an element of mysticism (threatening as well as comforting) darting in and out of the story with such fleetness and subtlety that it's hard to tell when it's there and when it's not; and, of course, the incident at the caves (explained exactly as much as it needs to be, and no more) could as easily have come from one of Pressburger's scripts as from Forster's novel. If you've seen \"Black Narcissus\", admittedly a very different kind of film, you don't need me to draw attention to the points of similarity. Lean's imagery may be less openly bizarre than Powell's but the effect can be much the same. \"A Passage to India\", although it lacks the beauty of the films of the three Lean films shot by Freddie Young, contains Lean's most disturbingly powerful shots, yet they're of such things as these: monkeys (echoed later on in the film by a startling shot of a man dressed like a monkey - actually, that IS the kind of thing I can see Powell doing), someone clutching her hand to her chest, the moon, the first raindrops of a storm hitting a dirty window pane, even water - simple cutaway shots of nothing but moonlit water. I haven't read the book, but I do know that if you HAVE to have read the book to see what's wrong with the film, why, then, there's nothing wrong with it. I don't know how much of the book has been lost in the translation but I do know that if too much has been lost to make a rich and powerful film, then whatever has been lost has been more than adequately replaced.",
         "David Lean wasn't an especially likable guy, despite his over-sized ears. When Guiness arrived on the set, Lean told him he'd been hoping for another actor for the part of Godbole. He was so sadistic to Sessue Hayakawa on \"The Bridge on the River Quai,\" blaming Hayakaway's flawed English for all the delays that Hayakawa's breakdown scene was real. He was impatient with crews too, snapping at them because he was losing the light, as if it were the photographer who was turning them down. But, whew, what a resume! From \"Great Expectations\" to this, his last film, and although some are slower than others there is not a clunker among them. (It's hard to believe that more than twenty years have passed since his last work.) His interests were in the story of people involved in cultural clashes and tended to be set against vast landscapes. He was in some ways like John Ford writ large. We get to know the people marching along the skylines. \"Passage to India\" isn't his best film but it's a good thoughtful one, with his usual attention to details of weather, furniture, and wildlife. The imagery, as always, is striking. Near the beginning, two English ladies are having drinks on a train and the delicate conversation is suddenly interrupted by a slow, elephantine kathoom, kathoom, kathoom. The ladies look up, a bit surprised. A cut reveals the girders of a steel bridge across a river sliding past the train window. Ba-Boom. Loud and distinct but far away, like an echo of cannon fire from future revolutions. It's hard to imagine another director willing to take a chance with the splendid simplicity of a shot like that. I'll just mention one more scene in passing, as an illustration of the point. Peggy Ashcroft, as Mrs. Moore, probably best known as the sympathetic and abused farmer's wife in \"The Thirty Nine Steps\", has met Alec Guiness, as Godbole, the Hindu teacher, only once, and then briefly. But after she leaves, Godbole casually refers to her as \"an old soul,\" in the Hindu sense of one who has led many previous lives. And that's it. They don't meet again. Until an hour of two of screen time later, when Ashcroft leaves India, unaccompanied. As the train pulls slowly out of the station, she stares at the silhouette of a figure that appears on the platform and performs an elaborate ritual salute to Ashcroft. A quick closeup shows us that the figure is Godbole. The scene comes as a complete surprise. It is like watching the interplay between the ghosts of two separate cultures. I don't know if I should have used that trope because it reminds me of a Samoan friend who found himself hitch-hiking alone at night on an Arizona highway. He was terrified of ghosts. Not Samoan ghosts, because they were back in Samoa. And not American ghosts because he could speak their language. It was the prospect of Indian ghosts that frightened him because he had no idea of what to say! Sorry. Basically, I guess, in this story we find it almost impossible to doubt the innocence of Dr. Aziz. He's as eager to please as a child. But we have good reason to doubt Judy Davis as Adela Qwested. She isn't exactly sexually liberated, a good stiff clean English woman. When she visits a deserted temple with Kama Sutra sorts of erotic bas reliefs, her presence seems to get the resident monkeys perturbed and they screech at her until she leaves in a near panic. The film also indicates in subtle ways her attraction to Dr. Aziz. (She appears to sweat a lot when she's alone with him.) Of course he has no idea of what's going on. The rape accusation dissolves in court, along with the dust caking the courtroom skylight as the monsoon rains begin. The English go back to England. Dr. Aziz remains bitter because his reputation is totally shot, until the end when he transcends his anger. As Godbole has been saying, \"None of it matters in the long run anyway.\" Of course he's thinking of the really LONG long run. The British colonials try to railroad a person of color into jail, and they fail. The theme is a familiar one to most American viewers, I would imagine, except that in American movies they don't always fail. The ending is sad but sweet and a little uplifting too, as the events at the Marabar Caves and the subsequent trial recede into the past. Time wounds all heels, they say, but there aren't any heels in this movie, except a few British racist snobs, who aren't really evil, just products of their age, as are we all. The raucous celebration of the Indians after the trial, what with the fireworks and all, are a little disturbing in light of the wars yet to come between the Hindus of India and the Moslems of Pakistan. I kind of miss David Lean, as long as I never had to work for him. See this movie and relax and enjoy it.",
         "Sometimes, what you don't see can be of equal importance to what you do see in a film. David Lean's film is no exception ... but more on that later. A film of epic quality, it follows two travelers on their journey from England to India during the Raj colonial period of the 1920s. For Adela Quested, it's her first time out of England to anywhere. For Mrs. Moore, it's a chance to visit her son, Ronny, who is expected to marry Adela during the visit. But, their visit is not without incident. What both Adela and Mrs. Moore discover is an India ruled by British bureaucrats (Ronny being one of them, a city magistrate) who exude personal and cultural superiority over Indians. This was a shock to them since they both expected to find Indians and Britons meeting socially and on friendly terms. The only exception to that rule appears to be Fielding, principal of a college. Through Fielding, Adela is introduced socially to Professor Godbole (a Hindu holy man) and Dr. Aziz (a Muslim physician). Mrs. Moore met Aziz in a previous scene but had not yet met Godbole until that moment. One note on that (a film flaw). During the mosque scene where Mrs. Moore meets Dr. Aziz, Aziz never once mentions his name to her ... yet later, Adela knows his name as mentioned to her by Mrs. Moore. Perhaps his name was mentioned in a brief scene that ended up on the cutting-room floor. But, that omission is trivial and in no way detracts from the enjoyment of the film. During this social introduction, Aziz invites Mrs. Moore and Adela on a journey to the Marabar caves, a tourist destination. On the trip, and tired from all the activity, Mrs. Moore stays at the encampment near the lower caves and encourages Aziz and Adela to explore the higher caves alone. Then, something happened ... and I won't tell you what (grin). Suffice it to say that Aziz finds himself in police custody. A court trial ensues that pits culture against culture, race against race, and clearly demonstrates the differences in attitudes between resident British citizens and Indians. But the trial's climax isn't the most moving part of the film. Lean has risen the film's denouement to a higher level ... one that leaves you smiling and crying at the same time. But what Lean does NOT mention in the film is equally interesting. In today's world, India is beset by inter-sect angst between Hindus, Muslims, Sikhs, and persons of other faiths. In theory, this inter-sect rivalry has been around since before India became a British colony. But, this rivalry was not mentioned once in the film. It is perhaps a testament to the novelist (E.M. Forster) and Lean to realize a potent underlying force in the story ... that British colonial rule held these rivalries in abeyance ... uniting Indians of all faiths into a common bond that eventually forced colonialism to end in India. The film is a masterpiece on every level and remains one of my favorites of all time. P.S. Closing comment to those (like me) who own region-free DVD players that render both PAL and NTSC DVDs. For some reason unknown to me, it's over $10 cheaper to buy the DVD from Amazon.co.uk than it is from Amazon.com ... even after overseas shipping is added in. That's where I ordered mine (from the UK).",
         "Films based on novels (as in this case) must rely on screenplays which condense the material, and supply either voice-overs, or visuals to explain what is going on in a character's head. Usually, a voice-over is a cop-out. David Lean has provided a brilliant substitute for a voice-over in the scene where Adela wanders on her bicycle into the bush to discover a Hindu temple. A central mystery in the book as well as in the film is the ambiguity of the cause for the court case. Forster said that judgment was up to the reader. Lean was a reader, and in my view, he made his decision, and provided us with a clue in that scene (which is not in the book). Here is that scene: Adela leaves the safe British compound on an exploratory trip with a bicycle. She leaves the highway, and cycles down a path through the weeds. The sign- post, which had appeared quite natural when she looked at it, now looks like a Christian Cross when she leaves the road and goes down the path. The music changes from a major key to the minor, suggesting mystery, or menace. She is leaving her familiar culture and riding into the unknown. She sees a fallen sculpture. A voluptuous sculpture. She doesn't turn back. As she rides farther, the weeds grow higher. She is being engulfed by India. She dismounts as she approaches a copse, and walks into the shadows. She sees a ruined Hindu temple covered with erotic sculptures. Amourous couples are coupling. She stares at these apparitions, so abandoned, and so alien to her proper Victorian up-bringing. She is attracted by the spectacle, but she is frightened by her attraction. Suddenly she hears a noise, and looks up to see a troop of monkeys. They chatter menacingly at her and begin to scamper down the temple, over the erotic sculpture, and in panic she flees. Could the monkeys symbolize that emotional, sensual, animal nature that lives in everyone but is supposed to be suppressed in Englishwomen (and American ones, for that matter!)? Are they saying, \"This is our land, the land of emotion; you do not belong here\"? India attracts her. It awakens hidden desires. It menaces her. She flees to the familiar, visibly shaken. Back at the bungalow, with her fiancé, she says \"I want to take back what I said at the polo,\" which was that she wanted to delay the wedding. She was so frightened by the feelings rising in her as she tasted a bit of Indian culture that she wanted to put a stop to passion by marrying! And all of that was said in the film without words. It provides us with a rationale for believing she later suffered an hallucination, which is at the core of the plot.",
         "David Lean ended his illustrious career on a high note with this haunting love song to the exotic & sensual world of India. The action takes place during the last days of England's rule over colonial England. Much of the emphasis in the movie is placed on the culture clash between the two countrys. Judy Davis stars in one of her earliest films as a woman who travels to India on what she imagines will be a romantic adventure to meet up with and marry a waiting fiance. The great Dame Peggy Ashcroft portrays the fiance's mother who accompanies Davis on her \"Passage To India\". Alec Guiness is along for the ride in a culture-bending role as a Hindu spiritual man. Guiness's role is in turn played for laughs then for dramatic punch when needed. The major conflict in the movies arrives from an ill fated tourist jaunt to the Marabar Caves some miles away. What does or does not happen there becomes a legal and moral crisis that involves all the film's key players as well as the entire city. The movie is played with sensitivity as well as allowing for the usual David Lean broad strokes of color and light. It's one of my favorite movies and definitely appealing to more than the \"Merchant & Ivory\" crowd.",
         "A Passage Through India tells a story about the radicalization of a native Indian who happens to be a Moslem. This was in the days before the idea of a separate Pakistan took hold in the independence movement. Victor Bannerjee plays Dr. Aziz Ahmed and as you see by his title he's a professional man. But he's still looked down upon by most of the British who are ruling India. He's befriended by Peggy Ashcroft who is visiting India with her daughter-in-law to be, Judy Davis. Peggy's son is a magistrate. Bannerjee is also friends with James Fox who is an administrator at a local college. He's warned against fraternizing with the British by his friends and family, but Bannerjee goes on a picnic with Ashcroft and Davis and Davis has a horrifying experience in the historic caves at Marabar. It's only her claustrophobia acting up, but Bannerjee winds up accused of rape. And his trial becomes a cause celebre for the Congress Party. Note that Bannerjee has two defense attorneys, a Moslem and a Hindu. E.M. Forster who wrote A Passage to India brought two elements of his background to the writing of this novel. He served as a private secretary to a local maharajah so he knew the customs of India as well as the political scene. Most in the United Kingdom wanted to see India free after World War I. A few very powerful folks like Winston Churchill and some influential press lords, most prominently Lord Beaverbrook did not. There opposition kept India a British colony until after another World War. Secondly Forster was a closeted gay man. His homosexuality was not publicly revealed, he wasn't 'outted' until after he died in 1970. One of his relationships was with a Moslem Indian who died at a young age. He's the model for Dr. Aziz. The India Forster writes about is not Rudyard Kipling's India. A place where the native population is made to feel like outsiders. Forster identified with them in a way Kipling could never conceive. Peggy Ashcroft won a Best Supporting Actress Award for her role as the kindly Mrs. Moore. I've got a sneaking suspicion that Forster modeled her character on his own mother who lived with him until she died in 1945. Judy Davis got a nomination for Best Actress and A Passage to India was nominated in a whole bunch of technical categories. A Passage to India is a disturbing look at a bygone era in a place where you can see a lot of the problems we face today being nurtured.",
         "My interest in caves led me to watch this film. A small, but pivotal, part of the film's plot centers on what happens at the Marabar Caves. While the cave segment was a disappointment to me, I was pleasantly surprised by the film as a whole. It was not the grandiose, pretentious cinematic epic I had feared. \"A Passage To India\" tells the story of a young British woman and her elderly traveling companion who journey from England to India, at a time when the British still ruled that country. The film's theme centers on British attitudes toward the people of India. Those attitudes can be summarized as: condescending, snobbish, and racist. It was the English vision of cultural superiority over the Indian people that E.M Forster wrote about in his 1924 novel, upon which the screenplay is based. That cultural vision represents a bygone, imperial era that today seems quaint. The cinematography here is excellent, though perhaps not quite as sweeping or majestic as in some of Director Lean's previous films. What comes through in the visuals is India's spectacular scenery. The film's acting is competent. And I liked the film's original score. My main complaint is the film's length. It's a two-hour story stretched to fill almost three hours. I would have cut out most, or all, of the crowd and mob scenes because they are not needed, and because they infuse the film with a \"cast of thousands\" aura that moves the film implicitly in the direction of epic status. Even as is, the film is sufficiently low-key and personal to be enjoyable.",
         "Adela Quested (Judy Davis) is a young English girl who arrives in 1920's India to marry the local magistrate, Ronny Moore (Nigel Havers). Falling in with Ronny's mother (Peggy Ashcroft), she decides to partake in exploring the \"real India\". Meeting with a gentle doctor (Victor Bannerjee) who is just as curious about the English as Adela is about India, and an intelligent though dotty Hindu mystic, Godbole (Alec Guinness), the group decides to partake in an expedition to the Marabar Caves. After an ambiguous incident, however, Adela comes to accuse the Doctor, Aziz, of attempt rape, and the resultant tension nearly leads to an explosion of violence between the Indians and British. Only Mr. Fielding (James Fox), the good-hearted local college professor, seems willing to put aside his prejudices and think things through logically - but ultimately, what happens is on the shoulders of Adela. Having read E.M. Forster's novel and heard the very mixed reviews which exist around this film, I wasn't sure what to expect, so I watched this film with an open mind. Boy, was I rewarded! I was absolutely swept away by it; this film is honestly in the same league as David Lean's other masterpieces, \"Bridge on the River Kwai\" and \"Lawrence of Arabia\", and I would definitely rate it ahead of \"Doctor Zhivago\". The film tackles a difficult subject that is pertinent to this day, if perhaps not as immediate as when the book was written: racism and colonialism. Forster's argument is that the English and Indians can't get together without something negative happening, and the film shows this perfectly. At first, both sides are eager and willing to bridge the gaps between them; but as the film progresses, the prejudices and mutual loathing between Indians and Whites rise to the surface, with explosive results (though if you're looking for an action-packed film, you need look elsewhere). The only flaw in Lean's rendering of the story is that he overlooks the internecine conflicts between Indian Muslims and Hindus which did take up a good portion of the book, but given that this is a film and not a novel, it's a forgivable omission. The film, as is expected in any Lean movie, is filled with memorable images: the parade of Sikh lancers in the opening; beautiful shots of the Ganges River at night; the expedition up to the caves with the beautifully painted elephant; the sexually-oriented statues (and monkeys) that Adela encounters while on a bike ride; the rioting crowds of Indians (including, disturbingly, several men painted as lemurs) who confront Adela when she arrives at the court; the monsoon which accompanies the moment of Aziz's triumph. In visual terms alone, this is one of the greatest films ever made - but as mentioned above, it does have an excellent story to back it up. Maurice Jarre's sweeping main theme seems somewhat out of place for the setting; but his incidental music is certainly among his best work. On the whole, the acting is excellent. Judy Davis gives a difficult though ultimately solid performance as Adela. Lean interpreted her as a young woman first becoming aware of her sexuality - which is different from Forster - and Davis does all she can to bring this to life, showing a confused and tormented young woman who has to chose between doing the right thing or letting the \"machinery\" of the trial go on. James Fox is a revelation as Fielding, the fair-minded professor who does not understand the racial differences inherent in colonial India and wants genuine justice; Victor Bannerjee is excellent as Aziz, going from naive and friendly young Doctor to a bitter Anglophobe; and, arguably the best of all, Peggy Ashcroft, who brings a warm humanity to Mrs. Moore, the Englishwoman who is somehow above all of the conflicts presented therein. Alec Guinness is convincing enough as an Indian, and in any case his part is so small it hardly makes an interest. The smaller roles are filled out by equally fine actors: Nigel Havers as Adela's fiancée Ronny; Clive Swift, Michael Culver, and Richard Wilson as bigoted English officials; and Indian actors Art Malik, Saeed Jaffrey, and Roshan Seth as various Indians who become embroiled in the case. \"A Passage to India\" is a fitting farewell for the one of the greatest film makers ever. While not as fondly remember as Lean's other films, his final effort is an intelligent, challenging, and simply astounding epic that deserves recognition for the classic it is. 10/10",
         "If the 1970s saw the birth of modern cinema of blockbusters and mixed-up genres, the 1980s saw the death of what went before. It was during that decade that those actors and filmmakers from the classic era who were still around made their final bows. A Passage to India is the last picture directed by David Lean, one of the most influential and respected directors of his age, and one who, having his most universal successes in the late 50s and early 60s, in many ways bridges the gap between the two generations. A Passage to India is adapted from the novel by E.M. Forster, a work ahead of its time when published in 1924. It condemns the prejudice and injustice of the British administration in India, but it rejects a confrontational attitude, instead looking progressively at Anglo-Indian relations. The story's only real flaw is that, whatever it does in the cause of racial harmony, it undoes for perceptions of women, trotting out as it does the old cliché of women falsely and hysterically accusing men of rape. And yet Forster was an intelligent and even-handed enough writer that he at least attempts to explain and sympathise with Miss Quested's position, something which the motion pictures echoes, actually beginning and ending the film with her story, and showing the courtroom testimonial from her perspective. Released a couple of years after the Oscar-winning Gandhi, A Passage to India could be seen as a companion piece, or at least part of a similar trend in British cinema of making up for the decades of gung-ho pictures about the empire. However, while the earlier picture is factually objective, A Passage to India is a work of pure drama; deep, spiritual and humanistic. For A Passage to India director David Lean also acted as editor, the first time he had done so in forty years. The cutting is particularly tight and in tune with the imagery, and you can see many fine examples of the \"surprise\" editing that characterises Lean pictures. So we get a sudden cut from the dullness and closeness of the English travel office, to the bright open space and sudden burst of noise at the Indian port. Many scenes begin, not with an establishing shot, but an attention-grabbing close-up, such as the Union Jack on the car bonnet that kicks off the scene where Victor Banerjee and Art Malik get run off the road. Lean didn't invent such impactful editing, but he helped to make a popular style of it, and you can see its influence in many contemporary pictures, including the one that beat A Passage to India at the Oscars, Amadeus. Lean is constantly throwing ideas at us as fast as we can absorb them, a reaction shot of some Indian women amid the pomp at the quay, Nigel Havers's smug smile after coldly passing sentence on an Indian. His imagery of evocative landscapes and shimmering moonlight as well as the recurring \"Mrs Moore\" chant bring out the mystical tone of the novel. A Passage to India demonstrates, at the end of Lean's career, his intelligent craftsmanship and his continued relevance to modern cinema. And yet, elsewhere this comes across as a somewhat out-of-time production. The jolly, jaunty Maurice Jarre score is woefully inappropriate, although bizarrely enough it won an Oscar. Jarre referenced Arabic music for Lawrence of Arabia and Russian music for Doctor Zhivago; why could he not reference Indian themes for this picture which so much requires the indigenous touch? Another mistake is the casting of Alec Guinness as an Indian character. Not that ethnic authenticity is an absolute necessity, but this Godbole is a somewhat ridiculous figure, and I'm reminded that one of Guinness's earliest roles for Lean was as a comedy big-nosed Jew in Oliver Twist. Lean's formal style was modern and flexible, but in other areas his thinking was from another era. On the whole however, this is an incredibly well-made work of cinema. Most of the cast perform well, the standouts being Victor Banerjee and Peggy Ashcroft. Their scene together in the mosque (a pivotal moment in the novel) is given the correct level of warmth and dignity that it requires. There are also memorable turns from two of the finest Indian character actors, Saeed Jaffrey and Roshan Seth, as well as nice appearances from British sitcom actors Richard Wilson (aka Victor Meldrew) and Clive Swift (aka Richard Bucket) as trumped-up Englishmen. The ending has a triumphal sense of poignancy, and the large scope of the picture is so delicately tempered with intimacy. It's a fitting coda to Lean's career, drawing together the epics for which he won awards and the emotionally-charged dramas with which he began."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "EMI Films",
         "Home Box Office (HBO)",
         "Thorn EMI Screen Entertainment"
      ],
      "summaries": [
         "Circa 1920, during the Indian British rule, Dr. Aziz H. Ahmed was born and brought up in India. He is proficient in English, and wears Western style clothing. He meets an old lady, Mrs. Moore, at a mosque, who asks him to accompany her and her companion, Adela Quested, for sight-seeing around some caves. Thereafter the organized life of Aziz is turned upside down when Adela accuses him of molesting her in a cave. Aziz is arrested and brought before the courts, where he learns that the entire British administration is against him, and would like to see him found guilty and punished severely, to teach all native Indians what it means to molest a British citizen. Aziz is all set to witness the \"fairness\" of the British system, whose unofficial motto is \"guilty until proved innocent.\"",
         "Adela Quested, a young Englishwoman, travels to India in the late 1920s to visit her fiancé, a British magistrate posted in a small town; her traveling companion is his mother Mrs. Moore. They want to see something of the country and to meet everyday Indians, but are frustrated by the British community's insistence that relations with the locals are best experienced from a distance. Finally, a friend introduces them to a Muslim doctor whom Mrs. Moore had seen briefly on her visit to a mosque. He takes them on an outing to the nearby caverns (a local attraction), but what happens there threatens to destroy any civility between the British and Indian societies.",
         "Cultural mistrust and false accusations doom a friendship in British colonial India between an Indian doctor, an Englishwoman engaged to marry a city magistrate, and an English educator."
      ],
      "budget": 16000000
   },
   "movielensId": 7087,
   "movielens": {
      "languages": [
         "English",
         "हिन्दी"
      ],
      "releaseDate": "1984-12-14",
      "dvdReleaseDate": "2008-04-15",
      "directors": ["David Lean"],
      "runtime": 163,
      "movieId": 7087,
      "title": "A Passage to India",
      "mpaa": "PG",
      "actors": [
         "Judy Davis",
         "Victor Banerjee",
         "Peggy Ashcroft",
         "James Fox",
         "Alec Guinness",
         "Nigel Havers",
         "Michael Culver",
         "Richard Wilson",
         "Antonia Pemberton",
         "Michael Culver",
         "Art Malik",
         "Saeed Jaffrey",
         "Clive Swift",
         "Ann Firbank",
         "Roshan Seth",
         "Sandra Hotz"
      ],
      "imdbMovieId": "0087892",
      "originalTitle": "A Passage to India",
      "genres": [
         "Drama",
         "Adventure",
         "History"
      ],
      "youtubeTrailerIds": ["7mIHIofacDg"],
      "plotSummary": "The film is set during the period of growing influence of the Indian independence movement in the British Raj. It begins with the arrival in India of a British woman, Miss Adela Quested (Judy Davis), who is joining her fiancé, a city magistrate named Ronny Heaslop (Nigel Havers). She and Ronny's mother, Mrs. Moore (Peggy Ashcroft), befriend an Indian doctor, Aziz H. Ahmed (Victor Banerjee).",
      "tmdbMovieId": 15927,
      "avgRating": 3.68476,
      "releaseYear": "1984",
      "numRatings": 479,
      "posterPath": "/rsgf8xM6O2UhAig6SbdXNt8xPLI.jpg"
   }
}