{
   "tmdb": {
      "original_language": "cs",
      "keywords": [
         {
            "name": "stop motion",
            "id": 10121
         },
         {
            "name": "short",
            "id": 214549
         }
      ],
      "imdb_id": "tt0084362",
      "video": false,
      "title": "Dimensions of Dialogue",
      "recommendations": [
         129303,
         168478,
         119855,
         128679,
         118794,
         162512,
         128368,
         127817,
         162551,
         184882,
         126124,
         104398,
         148176,
         129532,
         51929,
         129863,
         145283,
         86735,
         148547,
         10667
      ],
      "backdrop_path": "/yEaMFVJHxVtR4tyjwmizwgpSubk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47b49251416c750a2b63",
               "name": "Jan Švankmajer",
               "profile_path": "/gXKYMMXGZEwGeHLr2c0fI1bfKR1.jpg",
               "id": 83784,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b49251416c750a2b69",
               "name": "Jan Švankmajer",
               "profile_path": "/gXKYMMXGZEwGeHLr2c0fI1bfKR1.jpg",
               "id": 83784,
               "department": "Writing",
               "job": "Author"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 2.353754,
      "production_countries": [{
         "iso_3166_1": "CZ",
         "name": "Czech Republic"
      }],
      "id": 19035,
      "vote_count": 31,
      "budget": 0,
      "overview": "A three-part depiction of various forms of communication.",
      "similar": [
         3933,
         533,
         21385,
         11544,
         10693,
         10882,
         10895,
         10555,
         12092,
         38757,
         62211,
         41513,
         52520,
         72197,
         10144,
         10193,
         10198,
         10527,
         9016,
         14160
      ],
      "original_title": "Možnosti dialogu",
      "runtime": 12,
      "poster_path": "/pOSdLwRfftDa0260yUEpgGEWsoP.jpg",
      "spoken_languages": [{
         "name": "Český",
         "iso_639_1": "cs"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Krátký Film Praha",
         "id": 2329,
         "origin_country": ""
      }],
      "release_date": "1983-01-01",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Czechoslovakia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jan Svankmajer"],
      "runtime": 12,
      "synopsis": null,
      "writers": ["Jan Svankmajer"],
      "originalLanguage": "Czech",
      "imdbLink": "http://www.imdb.com/title/tt0084362/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "\"Moznosti dialogu\" (1982) aka \"Dimensions of Dialogue\" (or it could be translated as \"Possibilities of Dialogue\" is one of my very favorite Svankmajer's short films. It consists of three parts, \"Eternal Dialog\", \"Passionate Dialog\", and \"Exhausting Dialog\". When I watched it, I was thinking about Tennessee Williams' words, \"All of us are locked in our loneliness like in the cage\". Complete loneliness, inability to communicate, impossibility of dialog and understanding - this is quite a dark opinion of the humanity but how masterfully and wickedly funny it was presented. How incredibly unique and marvelous Svankmajer's vision is. Among many spectacular images, the clay lovemaking scene in the \"Passionate Dialog\" was perhaps one of the most sensual I've ever seen in the movies. As any genuine work of Art, Svankmajer's little gem fascinates a viewer on many levels. You can try to explain the images and their deep meaning or you can simply sit back and let the fantasy, Art and imagination take you to the amazing world which you will never be able to forget",
         "Moznosti Dialogu can be translated as Dimensions of Dialogue or Possibilities of Dialogue. In either translation the idea that there is a depth of interpretation within the exchanging of ideas remains. The three \"act\" film by the casual and uninterested eye is assumed to be beyond reason and seen as merely a smörgåsbord of materials arranged and rearranged to create a stunning art show. However, to those who understand that in the time it was made in Czechoslovakia that there was no purpose for purposelessness-no time to be frivolous-the film is speaking volumes about culture, the plight of humanity, and politics. The very fact that most people are stumped or drawn to simple interpretations when asked to explain it means that Svankmajer, a modern-day Melies, did exactly what he set out to do. Unable to risk speaking openly against the Socialist regime, he had to work his magic under the guise of Dadaism and Surrealism. The three parts, according to their titles, deal with different types of communication: discussion, discourse, and conversation. The theme is destruction resulting from interaction. The first and most cryptic part is entitled Exhaustive Discussion, and it explores the interplay of three revolutions: the agricultural, industrial, and informational. Although the only one that is usually seen as a revolution is the industrial revolution, I believe that they are all revolutions in their own right for the changes that were implemented and their intermingling with one another had a significant global impact. Materials are arranged in the shape of a human profile. There is one comprised of vegetables and grains, another of tools and machinery, and a third of writing and calculation materials. The first collision is between the face of agriculture and the face of industry which march towards one another, chomping hungrily, amidst triumphant battle-like music, which set the musical tone for the rest of the film. This continues a few more times, as each face's materials progressively break down into mush. Eventually, these revolutions become an indistinguishable pastiche of food, machinery, and intellectual tools. What results from their regurgitations is a realistic clay face. Finally, instead of creating an opponent, it creates duplicates of itself, procreating alone. The idea is that through the amalgamation of these staples of our evolution we see ourselves as refined humans, although to progress we had to fight, coalesce. But does the end justify the means? Did the exhaustive discussion bring about progress or was something raw lost in the merging and streamlining of each unique form of sustenance? Of course, another more timely interpretation could be anti-socialist propaganda. Through the merging of separated industries, real people will emerge. It is inevitable that a battle will occur when people are divided and seen as mere faces of production. Thus, only through a cataclysm will humanity prevail as such. The fighting will later be replaced with a focus on procreation rather than toil. The second and least cryptic part is entitled Passionate Discourse, and it explores the interplay of relationships in a literal manner. The type of relationship is what the multiple interpretations can be based upon. It could be a romantic relationship, however I am apprehensive about seeing as such because it seems too easy. Another likely option is that it is a creative collaboration expressed by the metaphor of a romantic relationship. As I wonder how this part could be speaking out like the others against Socialism, I know that the last interpretation I can muster up might be a stretch. The romantic relationship theory works well enough to satisfy most people's curiosity. A man and a woman make love, a child is born, neither wants the responsibility, and their fighting leads them into a physical confrontation in which they destroy each other. A deeper look reveals that this could show us a creative endeavor gone wrong. Neither would like to claim the finished article, and in their disgust over creating it, forget all their original feelings in order to vent their frustrations. Or could it be that this is a metaphor for powers coming together with apparently similar interests, reveling in oneiric ideologies, what they see as their brilliance, and then when they realize they have created something that is apart from them, different, neither want to deal with it. They try to ignore it, and when they cannot, when it cries out for help they pass the buck to the other collaborator. Eventually, when they see they cannot rid themselves of the nuisance of the unexpected aftermath of their irresponsible political intimacy, they rage against each other until nothing-no one-is left. The third seems the most likely because I must continue to consider the political problems roiling within the Czech Socialist Republic. In addition, the title adds a tone less indicative of love. Passionate Discourse signifies a formal yet emotional exchanging and debating of intellectual ideas. That sounds like politics to me. The final piece, a middle-ground of oracularity, shows two male heads made of clay. It is called Factual Conversation. The two busts begin by supplying each other with what the other needs. This continues smoothly with various combinations until they switch places. Then everything goes wrong and they do not supply each other with what is needed. They switch places a second time and unfortunately, each supply each other with the same thing. They then begin withering. By the end, they have both collapsed in exhaustion. What is being said is that when people are assigned to take on tasks that others were fine doing to begin with, they will not be as successful, if at all. In trading places, harmony and, thus, productivity is lost. This relates to Socialist ideology because the state controls what a person does and does not do for work, negating the individual's talent or penchant for a particular task. If you think harder and listen more intently, you will hear what is being whispered.",
         "I first stumbled across this mind-bogglingly warped slice of deranged surrealism on late night television, and I was instantly hooked. Jan Svankmajer, love him or loathe him, is a true original - imagine a Nick Park claymation piece rewritten by Robert Crumb at his most acid-fried and animated by a Monty Python-era Terry Gilliam and you'll be on the right track. You'll never forget the stunning ease with which Svankmajer teases out every possible scenario and variation to its logical conclusion, then its illogical conclusion, and then proceeds to go several steps further than that. It's technically brilliant, with some stunning use of sound effects, and exerts a weird, magnetic force that defies you to turn away. You'll never stop wanting to see what happens next. In its own quiet (and disquieting way), a little masterpiece.",
         "This is a rather interesting short film from legendary animator/filmmaker Jan Svankmajer that looks at the notions of communication breakdown and personal alienation. It is a completely stop-motion piece of animation; offering something of a social parable broken into three individual chapters. The sequences include Exhaustive Discussion, Passionate Discussion and finally, Factual Conversation. Each segment is supposed to represent a satirical comment on various aspects of communication breakdown within modern Czech culture, though whether or not you choose to follow this particular interpretation will be entirely down to you. Regardless of the message, which could be viewed as somewhat simplistic in relation to Svankmajer's more engaging works - such as The Flat (1968), Jabberwocky (1971), Alice (1988) and Conspirators of Pleasure (1996) - it is the animation that remains the truly impressive factor in this film's overall design, with the director creating some wonderful characters and scenarios out of a variety of old, inanimate objects. If you are a fan of the bizarre, provocative and imaginative world that this particular filmmaker creates, then Dimensions of Dialog (1982) (or more fittingly, Possibilities of Dialog, given both the design and thematic subtext) should be required viewing.",
         "First of all, don't be scared that it says language Czech on the title page. There is no audible dialog and people from all countries and origins can effortlessly enjoy this short film. Or I should say \"these short films\" as you get three for the price of one. The first is the longest, but at the same time the sequence that interested me the least. It starts with two strange creatures going against each other, one consists of fruit, the other mostly of metal. I assume it's a symbolism of nature vs. technology. The figures merge and the final result spits out a new creation, which goes against the result of the merger and so it goes on and on... You could probably analyze for hours the way the creatures keep looking after their transformations, but you'd almost have to watch the film in slow-motion to really catch all the details and at some point it just felt repetitive to me. The speed, so much happening in so little time, reminded me a bit of the works of current animator PES, although the style is obviously completely different. The second appealed to me more. We see a male and a female creature falling in love and Svankmajer here depicts one of the most beautiful sequences of actual physical lovemaking I've ever seen in animation. Very well done. It's almost erotically stimulating. Unfortunately, the result separates the two and catastrophe ensues shortly afterward. The final part is a nice animated display of how communication works, how effortless things can be when you are on the same layers, but also how destructive the lack of congruence can be.",
         "Dimensions of Dialogue, directed by Jan Svankmajer is a very interesting and amazing film. It is so creative and I can only imagine the hours it took to set up each frame. It is created during the year's right after WWII, an era where a director had to be very careful of the content of his or her film because it could cost them their life. The film is comprised of three different shorts each depicting a form of communication to be interpreted by the viewer as to their thoughts and feelings. I am not sure how I interpret the fist one, which shows fruit devouring and regurgitating fruit turning into kitchen utensils doing the same thing and ending with writing paraphernalia repeating the process. My original thoughts were of progression; things that do not last very long, the fruit, to things that can be around for a time, but eventually rust or break, the utensils, to the written word, which if allowed to, can be around for hundreds of years. The second short probably touched me more than the other two because of the way I interpreted it. It shows two clay figures, man and woman, and how at first are reluctant or hesitant of each other and then become passionate. As a consequence of this passion a third thing is created and how they deal or don't deal with it is so true of many humans today. The thought is not always there of the outcome nor having the mind to rule the will of desire strong enough to accept what has happened. The third depiction was in my opinion, a play on politics where you had these two heads more or less competing to see who could out maneuver the other. At first things seemed to be interchangeable but it became apparent that each had its' own individuality. Over all it was a very interesting concept with just the score and the pictures as the dialogue and each viewer to interpret as they will.",
         "Jan Svankmager's \"Dimensions of Dialogue\" is a collection of short films made up of stop-motion photography, live action, and animation. In the first act, Exhaustive Discussion, two heads made of all sorts of food and utensils are reduced to chunks and pieces through unique stop-motion animation. The heads devour and regurgitate each other into new forms over and over in a apologue of Evolution until we have clay heads continuously devouring and regurgitating. In the second act, Passionate Discourse, the two heads have become male and female, fall in love, and have sensual sex where they blend together. When they revert back to man and women there exists a needy lump of clay in between them, seemingly their child. Neither wants to care for the child and they begin to throw the lump back and forth at one another. The fight continues to escalate until they have virtually destroy one another. In the final act, Factual Conversation, two new heads appear-those of middle-aged men-and they begin spitting out and sucking back into their mouths various objects, interacting with one another through physical use of their tongues to manipulate the various objects for their dual benefit. Their exchanges become increasingly irrational, finally ending in destruction. Through use of human forms which are dismantled, scattered, merged and then weirdly constructed, \"Dimensions of Dialogue\" serves as a visually entertaining pessimistic study about the types of dialogue people have with one another, and the way that these dialogues can go horribly wrong. Some feel that it is Svankmajer's greatest film, and one of the most astounding animated shorts ever made. Whether that's true or not, his films have had a huge influence on modern avant-garde and stop-motion animators, as well as influencing the likes of Tim Burton and the Brothers Quay, and it is a film well worth watching.",
         "This film questions the society of the time with powerful images. These animations portray ideas and beliefs without the use of dialogue. The first piece questions the society and the new level of the industrial age. His second piece is a portrayal of a man and a women couple. They start off with love and create a third entity. This leads to hatred and complete destruction. The last piece takes on the job of two heads. They start with complimentary jobs. As they stray from their natural rhythm they are no longer able to perform well. This lead to total destruction. This could be a take on communism and the controlling government of the time. There are many ways to analyze this work of art but even if one is not looking for meaning the skilled technique of Svankmajor is inspiring just in terms of his form.",
         "OK the part of the movie where there were things eating each other was really cool, and I wish I knew how long it took for those effects to be done. I saw some symbolism in the characters that were eating each other. I think the character with all the books and school supplies represented a part of our culture of people that took the extra step, and continued school and career. And the one with all the food and kitchen supplies represented all the women that didn't continue school and became home makers, and the one with all the tools represent the men that didn't continue school and represent the workign class of people. And the actions show how they sometimes clash. I also Liked the clay man and woman, and how they begin to fight when neither want their creation. It kinda reminded me of that guy that was picked last to play kick ball in school, and how no one wanted him on his or her team.",
         "Warning: may contain spoilers. Jan Svankmajer is an enlightening, funny and an intelligent director. His shorts are simply genius and entertaining. The most fascinating thing about his shorts is their meaning. All of the shorts are filled with metaphors, deep philosophy and psychology. It is great how Svankmajer can represent political and family type issues using simple objects or clay figures. It might take a while to understand what the artist really says, but one can certainly come up with a valid explanation. Most of his shorts are self-interpreted. Another words, a person A might understand it differently from person B. It was a tremendous watching experience."
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": ["Krátký Film Praha"],
      "summaries": ["A three-part depiction of various forms of communication. 'Factual Discussion' depicts three heads (made up of fruit, kitchen utensils and writing implements respectively) endlessly devouring and regurgitating each other. 'Passionate Discourse' shows two clay figures romantically intertwined, and the problems with dealing with the end product of their passion, while 'Exhaustive Discussion' shows two animated heads playing a bizarre variant of the old scissors-paper-stone game."],
      "budget": 0
   },
   "movielensId": 72035,
   "movielens": {
      "languages": ["Český"],
      "releaseDate": "1983-01-01",
      "dvdReleaseDate": "2003-06-10",
      "directors": ["Jan Švankmajer"],
      "runtime": 12,
      "movieId": 72035,
      "title": "Dimensions of Dialogue",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0084362",
      "originalTitle": "Možnosti dialogu",
      "genres": [
         "Comedy",
         "Animation",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["2hv3uANnrbs"],
      "plotSummary": "A three-part depiction of various forms of communication.",
      "tmdbMovieId": 19035,
      "avgRating": 3.82456,
      "releaseYear": "1983",
      "numRatings": 57,
      "posterPath": "/pOSdLwRfftDa0260yUEpgGEWsoP.jpg"
   }
}