{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "suicide attempt",
            "id": 1252
         },
         {
            "name": "puberty",
            "id": 1525
         },
         {
            "name": "magic",
            "id": 2343
         },
         {
            "name": "black magic",
            "id": 4252
         },
         {
            "name": "sorcery",
            "id": 5147
         },
         {
            "name": "female friendship",
            "id": 5248
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "hair loss",
            "id": 167560
         },
         {
            "name": "outsider",
            "id": 170356
         },
         {
            "name": "occult ritual",
            "id": 177872
         },
         {
            "name": "karma",
            "id": 191655
         },
         {
            "name": "newcomer",
            "id": 208787
         },
         {
            "name": "love spell",
            "id": 237016
         }
      ],
      "imdb_id": "tt0115963",
      "video": false,
      "title": "The Craft",
      "recommendations": [
         1547,
         9877,
         9276,
         9871,
         11979,
         8843,
         11601,
         10166,
         10206,
         10307,
         11133,
         6435,
         3600,
         9529,
         3597,
         9378,
         10012,
         11618,
         9035,
         9825
      ],
      "backdrop_path": "/doMoN3efVN4NefceDtLVY8879fR.jpg",
      "revenue": 24769466,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Sarah Bailey",
               "gender": 1,
               "credit_id": "52fe44dcc3a36847f80ae439",
               "name": "Robin Tunney",
               "profile_path": "/oQGr5vfYbkarmJQmhGmSpIhSapL.jpg",
               "id": 17346,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Nancy Downs",
               "gender": 1,
               "credit_id": "52fe44dcc3a36847f80ae431",
               "name": "Fairuza Balk",
               "profile_path": "/cpeniV326TyPyzryxgbAWiXmLkz.jpg",
               "id": 826,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Bonnie",
               "gender": 1,
               "credit_id": "52fe44dcc3a36847f80ae435",
               "name": "Neve Campbell",
               "profile_path": "/171hRggAVnI2J1DKHGNOCiBgxhm.jpg",
               "id": 9206,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Rochelle",
               "gender": 1,
               "credit_id": "52fe44dcc3a36847f80ae43d",
               "name": "Rachel True",
               "profile_path": "/cVN934tgQcX5ZMHNBFLZpw2fNCH.jpg",
               "id": 19222,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Chris Hooker",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae441",
               "name": "Skeet Ulrich",
               "profile_path": "/id0y6bKmNSpr2pYU2Qkiv11EyvR.jpg",
               "id": 22108,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Laura Lizzie",
               "gender": 1,
               "credit_id": "52fe44dcc3a36847f80ae445",
               "name": "Christine Taylor",
               "profile_path": "/99OssnGmgGjduXFA7syxjNqt9tQ.jpg",
               "id": 15286,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Mitt",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae473",
               "name": "Breckin Meyer",
               "profile_path": "/7V3hXjmSJXApsuu2aGkEgFFAy03.jpg",
               "id": 33654,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Trey",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae477",
               "name": "Nathaniel Marston",
               "profile_path": "/q9r3UyrRKWdHTkx8WzO5BT0fS8S.jpg",
               "id": 211998,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Mr. Bailey",
               "gender": 0,
               "credit_id": "52fe44dcc3a36847f80ae47b",
               "name": "Cliff DeYoung",
               "profile_path": "/twUWn2BMLqf8Cr1tlnZq5gKOb8A.jpg",
               "id": 44301,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Lirio",
               "gender": 1,
               "credit_id": "52fe44dcc3a36847f80ae47f",
               "name": "Assumpta Serna",
               "profile_path": "/9FClxFRNnwcGySxoB8zCPwgbhax.jpg",
               "id": 42123,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Grace Downs",
               "gender": 1,
               "credit_id": "52fe44dcc3a36847f80ae483",
               "name": "Helen Shaver",
               "profile_path": "/7DlGkBDdRcKPlPAXuoo6xz6hSAU.jpg",
               "id": 4160,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Jenny",
               "gender": 1,
               "credit_id": "52fe44dcc3a36847f80ae487",
               "name": "Jeanine Jackson",
               "profile_path": "/aTPsYoKNIZFZKche4OGOPoyd639.jpg",
               "id": 152355,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Doctor",
               "gender": 1,
               "credit_id": "52fe44dcc3a36847f80ae48b",
               "name": "Brenda Strong",
               "profile_path": "/gjmYWKrfqST0HJ42bjO52NE4E4A.jpg",
               "id": 101396,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Monsieur Thepot",
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae48f",
               "name": "Endre Hules",
               "profile_path": "/cmxqIcfikG6rr5ag45ZkhYMP51Z.jpg",
               "id": 43461,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Priest",
               "gender": 2,
               "credit_id": "56c76029c3a3680d490078e9",
               "name": "Rod Britt",
               "profile_path": "/oFlEvBJoKf7OGTtdZpeUotspwfu.jpg",
               "id": 166617,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae44b",
               "name": "Peter Filardi",
               "profile_path": null,
               "id": 56973,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae451",
               "name": "Andrew Fleming",
               "profile_path": "/eKmrsArF6QebMIlIHDXY537Smo6.jpg",
               "id": 41549,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae457",
               "name": "Douglas Wick",
               "profile_path": null,
               "id": 931,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae45d",
               "name": "Graeme Revell",
               "profile_path": "/g2Nhv2OCV8ygLYxkeDbhlqnrv7Z.jpg",
               "id": 5912,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae463",
               "name": "Alexander Gruszynski",
               "profile_path": null,
               "id": 33651,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae469",
               "name": "Jeff Freeman",
               "profile_path": null,
               "id": 11876,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dcc3a36847f80ae46f",
               "name": "Andrew Fleming",
               "profile_path": "/eKmrsArF6QebMIlIHDXY537Smo6.jpg",
               "id": 41549,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a6d29f0925141076900f0fa",
               "name": "Ginny Nugent",
               "profile_path": null,
               "id": 102637,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a6e5cca9251410763021462",
               "name": "Marek Dobrowolski",
               "profile_path": null,
               "id": 25748,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "5a6e5ce6c3a3685552022b6f",
               "name": "Deborah Everton",
               "profile_path": null,
               "id": 22107,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "5a6e5cf5c3a368554d0228d5",
               "name": "Nancy Nye",
               "profile_path": null,
               "id": 53182,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 11.95822,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9100,
      "vote_count": 493,
      "budget": 15000000,
      "overview": "A Catholic school newcomer falls in with a clique of teen witches who wield their powers against all who dare to cross them -- be they teachers, rivals or meddlesome parents.",
      "similar": [
         675,
         672,
         674,
         10625,
         27022,
         16859,
         60304,
         3597,
         7326,
         2108,
         8363,
         8193,
         2667,
         671,
         673,
         767,
         129,
         10229,
         85350,
         76492
      ],
      "original_title": "The Craft",
      "runtime": 101,
      "poster_path": "/5QoAIazIjidUcnD4Vggvmvg42NW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1996-05-03",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Welcome to the witching hour.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Andrew Fleming"],
      "runtime": 101,
      "synopsis": "Sarah Bailey (Robin Tunney), a troubled teenage girl who has previously attempted suicide, has just moved from San Francisco to Los Angeles with her father (Cliff De Young) and stepmother. She enrolls in a local Catholic high school, but has trouble fitting in. During French class, her classmate Bonnie (Neve Campbell) witnesses Sarah telekinetically causing a pencil to rotate while standing on its tip. During lunch, Sarah is hit on by Chris (Skeet Ulrich), the school's football star. She asks about Bonnie and her two friends Nancy (Fairuza Balk) and Rochelle (Rachel True). Chris tells Sarah to stay away from the trio, because \"they're witches\". Bonnie tells Nancy and Rochelle that Sarah is the \"fourth\" who will complete their circle and make a full coven. The three girls each have issues: Nancy lives in a trailer with her mom, Grace Downs (Helen Shaver) and abusive stepfather Ray (John Kapelos) , Bonnie has massive burn scars all over her back, and the painful treatment recommended by the surgeon (Brenda Strong) is likely to fail. Insecure African American athlete Rochelle is subjected to racist taunts by the most popular girl in school, blonde Laura Lizzie (Christine Taylor). After school, the three girls befriend Sarah and take her to an occult shop. The owner, Lirio (Assumpta Serna), comments that Sarah is not like the other girls and says to her: \"Maybe you are a natural witch; your power comes from within.\" While leaving the shop, Sarah is harassed by a vagrant (Arthur Senzy), and all four girls simultaneously will for something to happen; the vagrant is then hit by a car. The girls escape, and Nancy is thrilled at their \"connection\". Nancy tells Sarah about \"invoking the Spirit\" Manon, which is their ultimate goal as a coven. Sarah leaves the girls to meet Chris, but refuses to have sex with him. However, at school the next day, Sarah discovers that Chris boasted to the whole school that they slept together, and that she was the worst he's ever had. Nancy, Bonnie and Rochelle comfort Sarah, and invite her on a field trip. They take the bus out to the country. The bust drivers tells them to be careful about wicked boys, but they say that they four are the dangerous ones. While on the countryside, they call the corners and cast some spells: Rochelle asks for the strength not to hate those who hate her, Sarah performs a love spell on Chris, Bonnie asks for beauty inside and out, and Nancy asks for \"all the power of Manon.\" Shortly after the spells are cast, they show signs of working: Chris becomes infatuated with Sarah and goes after her constantly in spite of his friends Mitt (Breckin Meyer) and Trey (Nathaniel Marston) taunting him about it, Bonnie's scars miraculously heal, and the next time Laura bullies Rochelle, Laura's hair begins falling out. At home, Nancy causes the microwave and all light bulbs to explode, and Ray suffers a massive heart attack and dies. Then Nancy and her mother are told by the insurance man (Brogan Roche) that they have inherited $175,000 from an insurance policy, and they feel overjoyed about it. Nancy and her mother move into a posh high-rise where the girls meet one night and learn disguise-changing magic. Nancy's mother looks confused and dazzled. She has bought a weird-coloured sofa and a jukebox with only songs by Connie Francis. The four friends lock themselves in Nancy's room ignoring Nancy's mother, who is left empty and ignored, just as she felt before cashing in on the insurance money. The girls go to Lirio's shop again, where Nancy finds a book about \"Invoking the Spirit\". Later that night, the girls go to the beach and form a circle, calling on Manon. At the culmination of the spell Nancy is struck by lightning. The next day the rest of the girls witness Nancy walking on the water, and from this point on, Nancy's powers have increased. Later on, Rochelle sees a balding Laura in the locker room, hysterically sobbing after swim practice. Laura's two closest friends (Elizabeth Guber and Jennifer Greenhut) try to offer some consolation, to no avail. Rochelle feels remorse for the spell she has cast and when she looks in the mirror at herself, her reflection looks away. Sarah's love spell also backfires on her. She finally accepts to have a dinner date with Chris, but he takes her to the top of a hill and attempts to rape her. Sarah runs away and knocks on Nancy's door. Nancy leaves her home for a party Chris is attending in order to punish him. However, when she arrives to the party, she tries to seduce Chris by disguising herself as Sarah, but when the real Sarah arrives as they engage in foreplay, Nancy causes Chris to fall out a third-story window, killing him. On consequence of this, Sarah starts having nightmares concerning her old friends, and feels like they're following her everywhere to torment her. She tries to stop Nancy - who has become the leader of the three remaining coven witches - by binding her powers so that she won't be able to hurt other or herself, but this does not work and the three other coven girls now hate Sarah. Nancy appears and tells Sarah that in the old days, if a witch betrayed her coven, they would kill her. Needing help, Sarah goes to Lirio, who tells her to invoke the spirit herself. Lirio also reveals that Sarah's mother was a powerful witch, and that her talent has passed on to Sarah. Sarah starts to invoke Manon, but she has a vision of fire and the shop exploding, so she leaves the shop absolutely terrified.. Sarah returns home, where she is tormented by Nancy, Bonnie and Rochelle, who taunt her using magic and intimidate her with threats on her life. Sarah arrives home and nobody is there. She is instructed to turn on the TV set and listens that her family went back to San Francisco thinking that she had run away there, and that their plane had had an accident without any survivors. Without a second of rest, all kinds of snakes and worm appear everywhere. The three other coven girls then appear. After a few seconds of intimidation Nancy says that Sarah will commit suicide. Nancy later slashes Sarah's wrists and a letter on Sarah's handwriting stating the reasons of her suicide magically appear - blaming herself for Chris' death. Sarah runs to her room, while Nancy, Bonnie and Rochelle wait for her to die. Rochelle then tells Nancy that this has gone out of hand. Nancy tells her to go upstairs to check on Sarah and threatens to slit her throat if she doesn't. Bonnie pulls up Rochelle to Sarah's room. Sarah is almost too weak to invoke Manon, but then she hears her mother (Janet Eilber) moving in an old photograph and her sweet voice whispering, \"Don't be afraid. Reach inside yourself\". Sarah successfully invokes Manon and is able to cast spells to fight back, as well as heal the injuries to her wrists. Forced by a counter spell of Sarah's to see themselves and what they've become by catching their reflections in a mirror, Bonnie's face horribly scarred and Rochelle's hair falling out, Bonnie and Rochelle flee, leaving only Nancy and Sarah at home. Nancy and Sarah have a showdown, in which Nancy is ultimately defeated by Sarah as she binds Nancy's power to prevent her from doing any more harm. In the end, Nancy has been sent to a psychiatric hospital, and Bonnie and Rochelle lose any powers they had. They go to see Sarah and half-mockingly tell her not to be angry with them because when Sarah was made to believe that her family had died it was just an illusion. Sarah's father is packing everything in his car to move out of LA. The two girls ask Sarah if she still has any powers, and when she shows no interest in continuing a friendship with the two girls who tried to kill her, they make fun of her as they leave, saying, \"She probably doesn't have powers, anyway\". On hearing this Sarah makes a bolt of lightning strike causing a tree branch to fall, nearly crushing the two girls, revealing that she still has powers. As they stare back at her in shock, Sarah warns them, \"Be careful. You don't wanna end up like Nancy\", and smiles. The scene cuts to a bird's eye view of Nancy's room in the psychiatric hospital. She is screaming like a maniac, telling the nurse (Esther Scott), \"He gave me powers! I can fly, I'm flying, I'm flying, I'm flying!\"",
      "writers": [
         "Peter Filardi",
         "Peter Filardi"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115963/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNTQyNTY1OF5BMl5BanBnXkFtZTYwNTYwNjg4._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Robin Tunney, Fairuza Balk, Neve Campbell | See full cast and crew »"],
      "reviews": [
         "This is a very entertaining blend of supernatural thriller and teen movie. Sarah (played by Robin Tunney) is the new girl at a Catholic shool in Los Angeles where she meets a group of girls (Fairuza Balk, Neve Campbell and Rachel True) who dabble in witchcraft. When Sarah joins the group they discover that they have genuine power and start using it to sort out their personal problems, until the group's leader Nacy (Balk) starts taking it too far. The film is well-made and several shades darker than the average teen movie. The cast are all very good, especially Fairuza Balk who easily steals the film with her part. The film's portrayal of witchcraft is a bit more interesting than the standard Hollywood portrayal, and it certainly doesn't represent it as essentially \"evil\", which makes a nice change. However, as always, this is Hollywood so many liberties will have been taken with genuine wiccan practices. The film is worth a look, however. The only thing that lets it down is the overblown climax.",
         "this movie could have easily been closer to an 8 or 9 with a little more attention to the script. the movie, while enjoyable and well made, has a weird disjointed structure that takes away from the all around excellent performances. of particular note is the stunning performance by Fairuza Balk. she has to have the most hypnotyzing eyes of any actress i've ever seen. i really hope a femme fatalle role is in her future. in addition to having a unique look, she has the ability to get REALLY over the top in the evil category. neve campbell and robin tunney, with ms. tunney being exceptionally beautiful, each deliver solid performances as well. the movie kicks into special effects overdrive at the end and it doesn't completely fit with the feel and tone with the rest of the movie. overrall, though i enjoyed it and i recommend it to anyone looking for a above average witch flick. rating:7",
         "Robin Tunney, Fairuza Balk, Neve Campbell, and Rachel True all star in this yummy film of the mid 90's involving four hot and spicy young women at St. Bernhards Catholic School. Robin Tunney is a major hottie in this one, as she enters the unknown when joining a coven at her new school. With a history of blackness behind her, the most important thing she wants, is to have friends, what else could anyone need? That is when the bitching starts! One false word and you pay the price with these gals. Robin Tunney sizzles as the naive natural witch, with a power beyond good and evil. Neve Campbell: does not get any better than that, all in black. Rachel True is well cast as the misplaced black girl, whom puts every one else in their place. We all know, however, that the best actress award in this flick goes to Fairuza Balk, as she fries the role, and the rest of the film with an over-the-top performance. Balk milks the film for all it is worth, when bringing down the tone to a very black, violent,and witchy nature. Flemming does a magical job transforming these four beauties into guardians of the circle. When first heard of, this would sound like an A-class \"Carrie\" rip-off, but then watch it and realize, it deals with more than powers. It deals with the rules of the wicca generation, and history of the witch. Carrie White was an all powerful demon who stands the test of a different time, these babes, are 100% witches, and ready to turn you upside down! Great job Flemming, you brought us an exciting film, enjoyable over and over again.",
         "One of the complaints brought against this movie by practicing wiccans is that it gives the false impression that wiccans engage in \"bad\" magic -- putting curses and spells on one's enemies. I would like to remind any peeved wiccans who might read this that the biggest lie this movie tells about them isn't that they cast spells, but that their spells actually work. But that's the very lie we expect fantasy films to tell us. We demand it, in fact. This one, at least, does a very nice job of conveying the longing for power that motivates some to practice wicca and other forms of \"magick.\" It's also fun and entertaining, and lovely to look at in places. The famous butterfly scene, in particular, will take your breath away. Over-all, this was a much better movie than it's been given credit for being.",
         "Not a really new story about Witch Craft among girl friends but enough twists and surprizes and effects to rise above most. Very well done by all Especially Robin and Fairuza. Very Good effects. Good vs. Evil conflict really kept you in the movie. Great to see in a theater or on a big screen.",
         "SPOILERS I thought this was a pretty decent teen flick - if you remember that it is, at the end of the day, a teen flick. No one should be expecting massive doses of striking directorial depth or stunning method-acting here. When taken for what it is - ie. a teen jaunt about peer pressure, teen cruelty and the hidden power-trip behind most teens' quest for emancipation, this is a pretty decent film. What surprised me was the fact that, given the opportunity to go ditzy, the script went dark - and that's always good when you're bucking convention. This ain't no \"Clueless\". I think Fairuza is one scary, scary chick and seeing her all tied up in a mental asylum didn't quite put the fear out. Why doesn't she do more horror movies? I think she'd be one helluva a scream queen! 6.5 out of 10! PS check out the somewhat toneless rendition of Peter Gabriel's \"I have the Touch\" in the movie. The original is way better!",
         "This movie was better than I expected. It's about a girl who moves and meets three girls at her new school, who seem to be practicing witchcraft... The movie certainly appealed to me, the acting was not bad, certainly Robin Tunney (who plays Veronica in \"Prison Break\") did a good job, but also Neve Campbell and Rachel True are acting alright. The only person of who I didn't like the acting, was Fairuza Balk. Her voice is (in this movie) not exactly the nicest voice to listen to. But she dóés have some good moments in this movie. Director Andrew Fleming, who's budget for The Craft wasn't so big, did a good job. The movie is -at least in the first half- a good combination between a thriller and a comedy, in the end, all the comedy disappears, the atmosphere darkens and we get a fairly exciting thriller. Some of the special effects are very good. The music was o.k., but (except for a few scenes) nothing more. If you have the chance to watch this, try it! The movie will certainly not appeal to everyone, the movie is more for teenagers and people in their early twenties, I think. Many older people won't appreciate this film so much. But everyone should give The Craft a try!",
         "It's not a scary movie, it's like a weird version of \"Clueless\". It brings me back to when I was in grade school and wanted to be apart of high school. And I always wondered if this was like what my future would hold meeting new people. Witches? The plot is kinda basic \"Evil Dawson's Creek\". :D Sarah is the new girl in town who is trying to fit in with very rude and snobby people at her new school. You can tell from the beginning that there is something very special about her. There are three girls, Nancy, who is the white trash scary goth girl, Bonnie who has severe burn marks all over her back, and Rachelle who is constantly picked on by a racist school girl, they notice Saraa and they happen to be witches who need a forth in their group, guess who that is? Sarah! She is also noticed by the high school jock jerk who uses girls and treats them like whores. She is first frightened by the girls, mostly Nancy, and leaves. She goes to see Chris, but when she refuses a private invite to his house, he spreads a nasty rumor around school about her night with him. She goes back to the girls and they discover how much more powerful they are with Sarah. They perform simple spells at first: flying, love spells, changing appearances. But things get more intense and serious: Bonnie's scars \"magically\" disappear and becomes gorgeous, but snobby. Rachelle's racist bully looses her hair, which seems cool, but is eventually very cruel and immature. Nancy has her step father \"killed\" in some way of a stroke, and inherits $175,000. She also goes as deep as to invoke the spirit of their beliefs of Manoe and becomes crazy. Sarah's love spell on Chris was to only get him to like her and apologize, but it turns on her very badly when he becomes too obsessed with her. Sarah knows that things are bad and decides not to participate her magics with the group and they turn on her, badly. To the point of threatening her life. It's a strange movie, it's entertaining to watch and the acting is pretty decent. You really get into the movie. I'm not sure if you could call it scary. But like the critics said \"It's Carrie meets Clueless\". It's a fun teen movie. So if you liked those movies, you might like this. 8/10",
         "The Craft is one of my favorite movies of all time. I just love it so much, everytime I watch it I go into this fantasy world. It's about a girl named sarah(Robin Tunney) she moves into a new town due to some bad past experiences. In the beginning everything goes great, she becomes best friends with these three girls that are interested in the occult and practice witchcraft. They are known as outsiders in the school, and when sarah becomes friends with them, they form a circle. Sarah feels wonderful, finally she feels like she belongs. The three girls consist of nancy, the gothic wicked leader(fairuza balk), bonnie, the insecure one(neve campbell), and rochelle, the shy one(Rachel True). Suddenly Sarah realizes that their spells and wicked fun have to come to an end. She feels like everything is going out of control and that the gang, especially Nancy is going a little insane and is using her power in evil ways. When Sarah tries to leave the circle, nancy turns her back on her and tries to ruin her life in every way she can. This is seriously a great movie, and if you are looking for a wicked fun time, definately see the craft. All the actresses are great, especially Fairuza Balk, she is so hot and so damn gorgeous. I would give The Craft 10/10",
         "i liked this movie.i found it entertaining,creepy and amusing,for all the right reasons.the cast was perfect for this movie.the four main actresses seemed so natural together and really worked well off each other.it's fairly obvious this movie inspired others as well as some TV shows,one in particular.i loved the soundtrack.it just seemed so fitting not just for the movie but for the subject material.i think they the subject matter well,without making it ridiculous and campy.plus,the movie has many relevant issues for that age group (teenagers in high school) as well as society in general.it also has a great moral lesson,which i won't give away,but is probably fairly obvious.overall,the movie is a fun and thrilling 90 plus minutes.\"The Craft\" is easily an 8/10 from me."
      ],
      "genres": [
         "Drama",
         "Fantasy",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "A new girl moves to a new city with her family to start a new life. She meets up with the girls who are very interested in the occult and together, the four of them have a seemingly unstopable power. They can do anything, from getting thier dream guys to like them to... the possibilities are limitless.",
         "Four girls at a Los Angeles Catholic school form a coven of witches that cast spells on their classmates and each other. Their new powers overwhelm them, leading to an internal power struggle.",
         "Sarah Bailey, a sixteen year old troubled teenager with a painful past and a history of suicidal tendencies and hallucinations, moves to L.A. with her father and stepmother to start a new life - and is enrolled into a Catholic school. It is at school that she comes into contact with three unlikely friends, Nancy, Bonnie and Rochelle, all who are socially outcast with various problems in their lives that they wish they could fix. Nancy, Bonnie and Rochelle dabble in occult practices, and when they notice Sarah has the powers of a natural witch, they talk her into joining their coven. When Sarah joins, they soon realize that with a fourth witch in the coven they can begin to cast spells they couldn't before, and begin to amend all the things wrong in their lives - but like everything else in life - things come with a price.",
         "A newcomer to a Catholic prep high school falls in with a trio of outcast teenage girls who practice witchcraft and they all soon conjure up various spells and curses against those who even slightly anger them."
      ],
      "budget": 15000000
   },
   "movielensId": 724,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-05-03",
      "dvdReleaseDate": "2000-09-12",
      "directors": ["Andrew Fleming"],
      "runtime": 101,
      "movieId": 724,
      "title": "The Craft",
      "mpaa": "R",
      "actors": [
         "Robin Tunney",
         "Fairuza Balk",
         "Neve Campbell",
         "Rachel True",
         "Skeet Ulrich",
         "Christine Taylor",
         "Breckin Meyer",
         "Nathaniel Marston",
         "Cliff DeYoung",
         "Assumpta Serna",
         "Helen Shaver",
         "Jeanine Jackson",
         "Brenda Strong",
         "Endre Hules",
         "Rod Britt"
      ],
      "imdbMovieId": "0115963",
      "originalTitle": "The Craft",
      "genres": [
         "Drama",
         "Fantasy",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["DoM4OXQVCcE"],
      "plotSummary": "A Catholic school newcomer falls in with a clique of teen witches who wield their powers against all who dare to cross them -- be they teachers, rivals or meddlesome parents.",
      "tmdbMovieId": 9100,
      "avgRating": 3.07617,
      "releaseYear": "1996",
      "numRatings": 10582,
      "posterPath": "/5QoAIazIjidUcnD4Vggvmvg42NW.jpg"
   }
}