{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mutiny",
            "id": 1860
         },
         {
            "name": "ship",
            "id": 3799
         },
         {
            "name": "treasure hunt",
            "id": 6956
         },
         {
            "name": "treasure map",
            "id": 11088
         },
         {
            "name": "pirate",
            "id": 12988
         },
         {
            "name": "children's adventure",
            "id": 210246
         },
         {
            "name": "treasure island",
            "id": 220601
         },
         {
            "name": "long john silver",
            "id": 232126
         }
      ],
      "imdb_id": "tt0100813",
      "video": false,
      "title": "Treasure Island",
      "recommendations": [
         68995,
         218460,
         77528,
         179165,
         96279,
         42897,
         82563,
         60664,
         123928,
         44135,
         96592,
         40233,
         63437,
         38877,
         22606,
         7008,
         1608,
         32029,
         25848,
         22555
      ],
      "backdrop_path": "/nDrHIqG5XTM8KgMkVErO18kIXrQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Long John Silver",
               "gender": 2,
               "credit_id": "52fe450ec3a368484e045ef5",
               "name": "Charlton Heston",
               "profile_path": "/pXwJV9JlOCKOHSfEJdt2q61SZVq.jpg",
               "id": 10017,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jim Hawkins",
               "gender": 2,
               "credit_id": "52fe450ec3a368484e045ef9",
               "name": "Christian Bale",
               "profile_path": "/2ocrTd8ChuUyJOzMuD4PsQw8eCB.jpg",
               "id": 3894,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Billy Bones",
               "gender": 2,
               "credit_id": "52fe450ec3a368484e045efd",
               "name": "Oliver Reed",
               "profile_path": "/we10IusqRV1NHRtA68ftyck2N33.jpg",
               "id": 936,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Blind Pew",
               "gender": 2,
               "credit_id": "52fe450ec3a368484e045f01",
               "name": "Christopher Lee",
               "profile_path": "/aVzp6zflzedmdKPLxaPqcZ05PDK.jpg",
               "id": 113,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Squire Trelawney",
               "gender": 2,
               "credit_id": "5a471b8bc3a3680970005335",
               "name": "Richard Johnson",
               "profile_path": "/miDA5sN3ijfED6M4oRZ0NTdBfBR.jpg",
               "id": 20510,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Dr. Livesey",
               "gender": 2,
               "credit_id": "5a471b97c3a36809860056ec",
               "name": "Julian Glover",
               "profile_path": "/2sQWrB4of8O2k7DGwJ3OdGJi2Mj.jpg",
               "id": 740,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mrs. Hawkins",
               "gender": 1,
               "credit_id": "5a471ba3925141578a00524a",
               "name": "Isla Blair",
               "profile_path": "/aqHLIxtiB7TfFVp68vcQLVEdRNu.jpg",
               "id": 749,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Redruth",
               "gender": 2,
               "credit_id": "5a471bcac3a368097000536d",
               "name": "James Cosmo",
               "profile_path": "/523gSqAG9eSSNmKexFFZYh38SxL.jpg",
               "id": 2467,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "George Merry",
               "gender": 2,
               "credit_id": "5a471bd80e0a261718005663",
               "name": "Pete Postlethwaite",
               "profile_path": "/5nbSzrwyDcLhC15buncGdrQqJ8e.jpg",
               "id": 4935,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Black Dog",
               "gender": 2,
               "credit_id": "5a471be5925141578a0052a2",
               "name": "John Benfield",
               "profile_path": "/wbafChQB1kZkOgnFrmAHV4s1QST.jpg",
               "id": 42642,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Dick",
               "gender": 2,
               "credit_id": "5a471bee925141578e0054be",
               "name": "Steven Mackintosh",
               "profile_path": "/3TQVLNfMiiBAcoaCbmWckxXqagN.jpg",
               "id": 978,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe450ec3a368484e045f07",
               "name": "Fraser Clarke Heston",
               "profile_path": null,
               "id": 66076,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe450ec3a368484e045f0d",
               "name": "Fraser Clarke Heston",
               "profile_path": null,
               "id": 66076,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450ec3a368484e045f13",
               "name": "Robert Louis Stevenson",
               "profile_path": "/fGEGp5kpR2mhX89XqAJoJQFGeuG.jpg",
               "id": 29533,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.761232,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 26612,
      "vote_count": 41,
      "budget": 0,
      "overview": "Young Jim Hawkins, while running the Benbow Inn with his mother, meets Captain Billy Bones, who dies at the inn while it is beseiged by buccaneers led by Blind Pew. Jim and his mother fight off the attackers and discover Billy Bones' treasure map for which the buccaneers had come. Jim agrees to sail on the S.S. Espaniola with Squire Trelawney and Dr. Livesey to find the treasure on a mysterious isiand. Upon arriving at the island, ship's cook and scaliwag Long John Silver leads a mutiny of crew members who want the treasure for themselves. Jim helps the Squire and Espaniola officers to survive the mutiny and fight back against Silver's men, who have taken over the Espaniola.",
      "similar": [
         6637,
         9016,
         85,
         87,
         89,
         1996,
         217,
         2059,
         6646,
         9326,
         9838,
         10303,
         1865,
         1995,
         17578,
         166426,
         9710,
         10693,
         22,
         58
      ],
      "original_title": "Treasure Island",
      "runtime": 131,
      "poster_path": "/mIj8UjP9qYxQd1pLeudjmrV3PFv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Agamemnon Films",
            "id": 4542,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Turner Pictures (I)",
            "id": 6189,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "British Lion Films",
            "id": 632,
            "origin_country": "GB"
         }
      ],
      "release_date": "1990-06-08",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Sail the high seas. Battle the pirates. Live the adventure.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Fraser Clarke Heston"],
      "runtime": 132,
      "synopsis": null,
      "writers": [
         "Fraser Clarke Heston",
         "Robert Louis Stevenson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100813/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzg4MDQxOTgzM15BMl5BanBnXkFtZTcwOTc5ODUxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Charlton Heston, Christian Bale, Oliver Reed | See full cast and crew »"],
      "reviews": [
         "Shiver-me-timbers, this is the best version of the Robert Louis Stevenson classic! In fact it is a model of cinematic adaptation. Closely following the book, with whole scenes and dialogue taken straight from its pages, the film never bogs down into the kind of stuffy lifelessness that sometimes afflicts adaptations attempting to be faithful to their literary source. Indeed Frazier Heston's screenplay and direction capture the brisk, page turning pleasure of the book nicely. Add to his sure direction, wonderful locations, a picture-perfect cast and a rousing music score by the Chieftains and you have one of the best pirate movies ever made. And for once they really are pirates and not watered down, sentimentalized versions of them. They're cut-throats all, a scurvy lot of thieves, superstitious and dirty. You can just smell their stench under the hot tropic sun and lush vegetation of Skeleton Island. Oliver Reed as Billy Bones gets the movie going smartly. We first see him with his granite visage at the head of the skiff, an old sea dog home from the sea. With his great hulk and whiskey whisper purr he exudes danger from every rum soaked pore of his being. Of course his old shipmates, the remnants of the crew of the now dead Captain Flint, are pursuing him. Christopher Lee, almost completely unrecognizable, is Blind Pew, a spectral, skeletal figure of death, whose fury, fueled by blindness is like some great ravaging bird of prey. He is wonderful and like Reed he creates a vivid, memorable characterization. A young Christian Bale is the definitive Jim Hawkins. He narrates the proceedings and is at turns appealing, capable and wily. He is a boy on the verge of young manhood who is about to have his mettle tested with the adventure of a lifetime. There is not a trace of the Jackie Cooper mawkishness about him. Richard Johnson as Squire Trelawney, Julian Glover as Dr. Livesey, and Clive Wood as Captain Smollet are all perfect in their roles. They beautifully capture the essence of quiet courage. Heroes without phony heroics, they are solid men of character sure of themselves and quite capable of dealing with Silver and his scurvy crew. This brings us to Charlton Heston as Long John Silver. Ultimately for any version of this work to succeed it rests on the shoulder of the actor portraying the Sea Cook. Happy to say, Heston gives one of the best performances of his long career. Turning his stalwart, forthright screen persona on its head, he creates a monster that is complex, charismatic, and bloodthirsty. There is no Wallace Beery, Robert Newton sentimentality here. This is a natural leader of men who can dazzle with his bigger than life personality and tales of treasure, and the next moment plunge his cutlass into the bowels of his victim without even missing a beat. Never has he used his toothy smile to better effect. It is the smile of a vicious carnivore-a shark. On a lighter note Nicholas Amer brings the right balance of levity and pathos as Ben Gunn, the poor maroon. He is amusing without becoming a caricature, and his scene with Jim when describes his yearning for a piece of toasted cheese is wonderful. Both Pete Postlewaite as George Merry and Michael Halsey as Israel Hands are perfectly nasty. Finally the music score by the Chieftains is superb. It captures by turns the lilting Celtic love of the sea, the grace and sweep of a great sailing ship setting out for adventure and the exotic dangers of buried treasure, pirates, flashing cutlasses, and midnight rendezvous on a far away island in the balmy tropics. Avast, me hearties, this is a film to treasure!",
         "In Fraser Heston's production of Robert Louis Stevenson's masterpiece, an obvious labor of love by all involved, the classic tale sidesteps another excessively kid-friendly incarnation to live and breathe as Stevenson meant it to. Although its made-for-TV scale pokes through now and then, it does so only momentarily in each case. These little blinks aside, this heartfelt reading of the classic adventure is a worthy piece of work. It's still family-safe but this time there's real menace interwoven with the book's more genteel sensibilities. How a film begins is often crucial and this `Treasure Island' begins so beautifully, and correctly. A mournful pennywhistle solo ushers in an opening credit sequence that could have been filmed by the painter N.C. Wyeth, whose vision infuses many of the film's frames. I replay this sequence several times whenever I screen this film because it is so evocative. It also perfectly sets the tone for the entire movie; beautifully done. But if they had just held the rousing, though excellent, music back a bit longer and let the sequence walk through on its own legs, it would have been one of the most perfect opening sequences ever filmed. Charlton Heston as Long John Silver? Don't laugh. His now-familiar voice occasionally surfaces through his 18th century pirate patois, but never detracts. Heston's portrayal is completely effective and is handled with restraint and relish, a fact that is evident the moment his Silver first appears. Silver emerges from the back room of his waterfront Bristol grog shop to confront Christian Bale's uneasy Jim Hawkins who, having walked into Silver's lair, is realizing that he may, quite possibly, not be walking out. Assessing Hawkins through a world-weary expression that has seen it all several times, Silver weighs his options: hear the boy out or drag him into the kitchen and slice him into the salt pork stew, at least. Heston's Silver is no buffoon. Instead, he is a dangerous man, not unlike the Deke Thornton character in Sam Peckinpah's `The Wild Bunch'; an intelligent person who is forced to endure, and make use of, the human dregs of his time, the best of whom can hold only a dim candle to him. Cunning, quietly remorseless, always several moves ahead of everyone in sight, yet patient in the face of relentless idiocy, this Silver is also a man whose soul has not been completely flogged out of him, by circumstance or the whip. His sincere respect for the innocent courage of Jim Hawkins gives this `Treasure Island' much of its humanity. If you don't feel a pang as Heston's Long John gazes chagrined at the loot, which, for the lack of more far-sighted colleagues, would have been his, you may have the proverbial hole in your soul. `Ah bucko', says Silver to Jim Hawkins near the film's end, after Jim rebuffs Silver's last gentle attempt to manipulate him, `what a pair we would have made'. Oh yeah, absolutely. All of the book's heroes are portrayed with heartfelt competence; the blustering Squire Trelawney (Richard Johnson), the tack-sharp, impeccably-mannered Doctor Livesey (Julian Glover), the unflinching Captain Smollet (Clive Wood), and Jim Hawkins' arch-boy (Christian Bale in his mid-teens, filled out a bit post `Empire of the Sun', bearing no resemblance to his homicidal yuppie in `American Psycho'). Arrayed against them are the scurviest sea dogs who ever weighed anchor, complete with terrifying teeth and fierce, implied body odor: Oliver Reed's tragic Billy Bones, Christopher Lee's festering Blind Pew, Israel Hands (what a great name), Silver's murderous, cobra-like shipmate, (Michael Halsey), who provides a taste of what Silver himself may have been like in his younger days, and a most convincing Ben Gunn (Nicholas Amer). Peter Postlethwaite, the super-cool big-game hunter in the first sequel to `Jurassic Park', plays the bewildered George Merry, a man who should always flee from even the slightest ambition; someone who makes you happy to still be you, even if your 401K was riding entirely on Enron. When the time comes for action, it's delivered with conviction. Early on, the tense, hateful confrontation in the Admiral Benbow inn, between the rum-soaked Billy Bones and his scary former shipmate, Black Dog (John Benfield), is beautifully rendered, as is the berserk fight at the island stockade later in the film. To its great credit, the film never tries to be funny, or even light-hearted. It simply forges ahead, telling Stevenson's great story. But near the end comes a scene in which Squire Trelawney confronts Silver, whose schemes are now hopelessly foiled, and attempts to call the old pirate to account. What briefly transpires is the film's only real yuk, but it's a peach. It's easy to over-romanticize the period in which `Treasure Island' is set; swashbuckling as it may now seem, it was a time before widespread bathing (the future George III's German fiancé had to be told to please take a bath after arriving in England), flush toilets, anesthesia, toothpaste, germ theory, and any notion of social justice. But it was also a time when unbroken forests still covered most of North America, when Pittsburgh was just a rough-hewn, barely defensible French fort in the midst of a trackless wilderness (near the present site of the Pirates baseball stadium; Pirates?, hmmm), a time when, given the courage, adventurous spirits still had real room to move. The slate was still largely clean. Many irreversible mistakes had yet to be made. Anyone with a taste for history and, perhaps, a discernible distaste for certain aspects of our own `advanced' age will relate well to this forthright `Treasure Island'. If you've appreciated Charlton Heston as a movie star, you'll appreciate him even more as an actor. This `Treasure Island' is probably the best that will ever be made. A more `updated' version could certainly be produced; one that spurts more blood and exchanges more bodily fluids, with much of the book's period style and manner stripped out, but it would no longer be Stevenson, just Hollywood.",
         "One of the great literary classics is brought to life in this wonderful made for television version. An incredible cast, headed by Charlton Heston as Long John Silver, beautiful location footage and a great soundtrack from Paddy Maloney performed by the Chieftains, makes this one of the liveliest productions ever filmed. Cleverly scripted and directed by Fraser Heston, the viewer is treated to a wonderfully faithful adaptation of R. L. Stevenson's classic adventure tale. Christopher Lee is near unrecognizable in the ghastly make-up of Blind Pew. Add to that the most incredible voice-work and you have one of Mr. Lee's most fascinating characterizations. Although on-screen for a relatively short time, Pew is instrumental to the plot, and Mr. Lee certainly makes the most of his limited time, effectively creating one of the most frightening and memorable characters. Never before, or since, has Blind Pew been quite so well played. His interaction with the late great Oliver Reed as Billy Bones at the Benbow Inn is a wonderful moment, particularly for Hammer fans. The cast includes a phenomenal assortment of remarkable actors. While Charlton Heston is less than perfectly cast, he does turn in a commendable performance and in no way detracts from the production. It is evident that he is enjoying his role. Young Christian Bale in an early performance is excellent and well cast, as Jim Hawkins. Isla Blair does a great job as young Jim's protective mother. Along for the ride we also have Julian Glover in a standout performance as Dr. Livesey. His confrontation with the swaggering Oliver Reed as Billy Bones is a high point in this film. Richard Johnson as Squire Trelawney and Clive Wood as Capt. Smollet round out the cast, with Nicolas Amer (whom I thought was actually Jasper Carrot) as a suitably deranged Ben Gunn. An exceptional cast, which fits together beautifully, results in my favorite version of this oft-filmed classic. While at times reminiscent of some of Hammer's adventure films, it certainly benefits from modern film technique, and rightly exceeds even the best of Hammer's pirate yarns. Even if you are just checking this out for Christopher Lee's or Oliver Reed's performance, you'll find yourself engrossed in a wonderful family film and wondering why more classics aren't given such great treatment. Highly recommended!",
         "Although one of the commentaries states that he would have give 10 of 10 if the movie has been released widescreen in DTS I will give it nevertheless 10 points. This is based not on the technical side. Me as well would have greatly appreciated a Release on DVD in German Language in a Widescreen Apect Ratio but I'm afraid this Picture was shot in an 1.33 open gate Aspect Ratio due to the primary intense to broadcast it on TV (the Movie was produced by HBO). If so, a blow up to a 1.78 or wider would cut of heads or other important parts of the image. HBO has proved a dozen times (The Last Outlaw) that it is even more able to produce absolutely high class movies than some studios or independents simply by using the essence for a good film in a way it has to be: the story. Fraser Clarke Heston who did produce, wrote the screenplay and directed the movie did a really great Job. In his fussy stile (in the most positive tenor) he tried to take the story by Louis Stevenson in an image how it was intended. He meet the fantasy of thousand of readers and involve them in the movie. They are riveted on the picture from the very first minute. This movie is perfect! The Screenplay, the arc of suspense, the Language as it was spoken at that time, the clothes as they were worn, the decoration, the dirt, the teeth, the properties, the ship, the location, the make-up, hair-dresser and even the continuity are perfect. The story is known by all. The Actors as well. Therefore an extensive comment is needless except this one sentence: It's perfect and a great enjoyment to view, watch it !!",
         "Along with George C. Scott's performance as Scrooge in A CHRISTMAS CAROL, Charlton Heston's performance as Long John Silver will go down as one of the highlights of 20th century television. In an utterly amazing turn, Heston metamorphosizes chameleon-like into one of literature's most enduring villains. This is the kind of performance that needs to be seen to be believed- and believe it you will! Had Heston chosen, he could very well have become one of The Silver Screen's leading villains. (THE THREE MUSKETEERS and THE FOUR MUSKETEERS are also offered in evidence.) Superb writing and direction by Fraser Heston in aid of must also be noted. Must-see telemovie.",
         "Cudoes to all those involved. The Hestons (father and son) for daring to risk a lot (in terms of reputation) on so well known a project. A superb and faithfull re-telling that still manages to surprise (the cannon scene was a beautiful coup de theatre). This loving adaptation is the only one I remember that includes the haunting image of Israel Hands slowly sinking out of sight in the water... A description I will always remember from the novel and echoed at the very end of Benchley's JAWS. This television version of Stevenson's book brought back fond memories of a teen-age summer on Prince edward Island, reading the adventures of Jim Hawkins striding the razor's edge between the honest Captain Smolett, and that band of ruffians that follow Long John Silver.",
         "More superlatives from me are not necessary. I will only say that I agree with the other commenters who consider this the best version of Treasure Island made so far. What would make a difference is for it to be released on DVD. If you would like to see this version of Treasure Island released on DVD, as I do, then please go to this link: http://tcmdb.com/title/title.jsp?scarlettTitleId=14882 and vote for it (on the right hand side of the screen). If the link does not work or you don't care to use it, then do a Google search for Turner Classic Movies, then search on the site for Treasure Island (1990). Maybe if enough people vote for it, it will actually be released on DVD. It can't hurt.",
         "I read the book about 20 times a week as a kid. I saw every adaptation for the screen. Disney's was crap! Muppet was a joke. Every animated version was dumbed down. Only this one was faithful to the book. Even better, the actors were perfectly cast across the board. Each and every pirate was terrifying. Each and every good guy seemed nice enough until the fights started, at which they were badass! This movie made me investigate the actors and I was so disappointed that they were all so wonderful in this, but they never had any better roles afterwards. All actors were great, but the standouts were Julian Glover as Dr. Livesey, Richard Johnson as Squire Trelawney, Clive Wood as Capt. Smollet, and Nicholas Amer as Ben Gunn. Christian Bale, Charlton Heston, and Christopher Lee were fantastic and perfectly cast (surprise, surprise!) For any kid, whether an actual kid or a kid at heart, let them watch this, rather than every other one (they are, to a one, crappy).",
         "(it would be 10 for 10 if this were released in WIDESCREEN DTS !!!) This TNT backed (probably made for TV) version had me hooked from the first minute. Faithfully following the tale of pirates treasure, we follow young Jim Hawkins from his fascination with Captain \"Billy Bones\" (a picture perfect performance by the late Oliver Reed) to his adventures aboard the Hispaniola and eventually Treasure Island. The casting is magnificent. Charlton Heston plays his Long John Silver with an air of jaded humanity that we almost empathize with him. The \"good guys\" are also humanized and show some of their \"darker\" sides in the course of the telling of the tale. I just wish this would be released on DVD. It is truly an effort of love and a tribute to the great Robert Louis Stevenson. Truly wonderful, Mateys!",
         "Although this was a made for TV movie, Ted Turner wanted, and got, a great movie from an old story that has been shot on the screen many times. But none, in my opinion, as good as this. Charelton Heston's performance was magnificent. Had the movie been produced for theatrical release, I believe that Heston would have gotten nominated for yet another Academy award, as probably would have the cinematography as well. I highly recommend this movie for a delightful evening that the whole family can and will enjoy. Go ahead, pop some popcorn and find out. And for you true Charleton Heston fans, I'd also recommend another obscure title, \"Mother Load.\""
      ],
      "genres": [
         "Action",
         "Adventure",
         "Crime"
      ],
      "productionCompanies": [
         "Turner Pictures (I)",
         "Agamemnon Films",
         "British Lion Film Corporation"
      ],
      "summaries": ["Young Jim Hawkins, while running the Benbow Inn with his mother, meets Captain Billy Bones, who dies at the inn while it is besieged by buccaneers led by Blind Pew. Jim and his mother fight off the attackers and discover Billy Bones' treasure map for which the buccaneers had come. Jim agrees to sail on the Hispaniola with Squire Trelawney and Dr. Livesey to find the treasure on a mysterious island. Upon arriving at the island, ship's cook and scalawag Long John Silver leads a mutiny of crew members who want the treasure for themselves. Jim helps the Squire and Hispaniola officers to survive the mutiny and fight back against Silver's men, who have taken over the Hispaniola."],
      "budget": 0
   },
   "movielensId": 7770,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-06-08",
      "dvdReleaseDate": "2011-09-27",
      "directors": ["Fraser Clarke Heston"],
      "runtime": 131,
      "movieId": 7770,
      "title": "Treasure Island",
      "mpaa": "G",
      "actors": [
         "Charlton Heston",
         "Christian Bale",
         "Oliver Reed",
         "Christopher Lee",
         "Richard Johnson",
         "Julian Glover",
         "Isla Blair",
         "James Cosmo",
         "Pete Postlethwaite",
         "John Benfield",
         "Steven Mackintosh"
      ],
      "imdbMovieId": "0100813",
      "originalTitle": "Treasure Island",
      "genres": [
         "Adventure",
         "Family"
      ],
      "youtubeTrailerIds": ["WLZC2JQswu8"],
      "plotSummary": "Young Jim Hawkins, while running the Benbow Inn with his mother, meets Captain Billy Bones, who dies at the inn while it is beseiged by buccaneers led by Blind Pew. Jim and his mother fight off the attackers and discover Billy Bones' treasure map for which the buccaneers had come. Jim agrees to sail on the S.S. Espaniola with Squire Trelawney and Dr. Livesey to find the treasure on a mysterious isiand. Upon arriving at the island, ship's cook and scaliwag Long John Silver leads a mutiny of crew members who want the treasure for themselves. Jim helps the Squire and Espaniola officers to survive the mutiny and fight back against Silver's men, who have taken over the Espaniola.",
      "tmdbMovieId": 26612,
      "avgRating": 3.41905,
      "releaseYear": "1990",
      "numRatings": 105,
      "posterPath": "/mIj8UjP9qYxQd1pLeudjmrV3PFv.jpg"
   }
}