{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bounty hunter",
            "id": 801
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "boat",
            "id": 1422
         },
         {
            "name": "way of life",
            "id": 1587
         },
         {
            "name": "coffin",
            "id": 1909
         },
         {
            "name": "denver",
            "id": 1977
         },
         {
            "name": "godmother",
            "id": 2022
         },
         {
            "name": "paranoia",
            "id": 2340
         },
         {
            "name": "hitman",
            "id": 2708
         },
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "psychopath",
            "id": 6259
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "mafia",
            "id": 10391
         },
         {
            "name": "diner",
            "id": 10738
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "illegal prostitution",
            "id": 33625
         },
         {
            "name": "extramarital affair",
            "id": 34094
         }
      ],
      "imdb_id": "tt0114660",
      "video": false,
      "title": "Things to Do in Denver When You're Dead",
      "recommendations": [
         21887,
         6071,
         10859,
         10410,
         9558,
         4997,
         18129,
         10990,
         2620,
         20637,
         15745,
         11060,
         10126,
         19382,
         56448,
         12647,
         10729,
         10169,
         10608,
         10141
      ],
      "backdrop_path": "/5iCxKe3zEPnrc1Y0R0m0YnFdaBO.jpg",
      "revenue": 529766,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jimmy 'The Saint' Tosnia",
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f323",
               "name": "Andy García",
               "profile_path": "/zE3KYH6f6cxCehJJYKDTQa8sCaK.jpg",
               "id": 1271,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Pieces",
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f327",
               "name": "Christopher Lloyd",
               "profile_path": "/iQzG9apaIsHnn7iGrer3YEDp8Zo.jpg",
               "id": 1062,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Franchise",
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f32b",
               "name": "William Forsythe",
               "profile_path": "/3oaz2y7hIm3r3OyDKvQ1i2D8cLR.jpg",
               "id": 4520,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Easy Wind",
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f32f",
               "name": "Bill Nunn",
               "profile_path": "/dcZWC2iGjHasKwdYSwpHcWFQX5a.jpg",
               "id": 5502,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Critical Bill",
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f333",
               "name": "Treat Williams",
               "profile_path": "/uKejRJTEVOy6IOsJX2mJH3SwbTl.jpg",
               "id": 4515,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Joe Heff",
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f337",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mister Shhh",
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f33b",
               "name": "Steve Buscemi",
               "profile_path": "/ieDyVKnQHo7eMGu1GOE7YYr2Fk4.jpg",
               "id": 884,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Lucinda",
               "gender": 1,
               "credit_id": "52fe423ec3a36847f800f33f",
               "name": "Fairuza Balk",
               "profile_path": "/cpeniV326TyPyzryxgbAWiXmLkz.jpg",
               "id": 826,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Dagney",
               "gender": 1,
               "credit_id": "52fe423ec3a36847f800f343",
               "name": "Gabrielle Anwar",
               "profile_path": "/khnEDczzSy6UcbnqZ6Sb4lWxnkE.jpg",
               "id": 5503,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "The Man with the Plan",
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f347",
               "name": "Christopher Walken",
               "profile_path": "/ApgDL7nudR9T2GpjCG4vESgymO2.jpg",
               "id": 4690,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Bernard",
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f34b",
               "name": "Michael Nicolosi",
               "profile_path": "/s3jxEzrq7RFWirtdvycXLAuNN3g.jpg",
               "id": 5504,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Meg",
               "gender": 1,
               "credit_id": "52fe423ec3a36847f800f373",
               "name": "Sarah Trigger",
               "profile_path": "/eKmmWJ38vOkv3k0sNgUoRjWCwjd.jpg",
               "id": 5601,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Alex",
               "gender": 2,
               "credit_id": "54ff7825c3a3685ba6000615",
               "name": "David Stratton",
               "profile_path": null,
               "id": 199303,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Blonde Nurse",
               "gender": 1,
               "credit_id": "582c6a4492514111b100828b",
               "name": "Jenny McCarthy",
               "profile_path": "/itsSilp7prfi3lKQMFn1p5J6hWI.jpg",
               "id": 35597,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f319",
               "name": "Gary Fleder",
               "profile_path": "/fKPxO8iWMuWYQ8sXeH1BPfQzqxm.jpg",
               "id": 5501,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f31f",
               "name": "Scott Rosenberg",
               "profile_path": "/3SqhCboi0IDCVGmEzGtmN4ZNV8I.jpg",
               "id": 3228,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f351",
               "name": "Cary Woods",
               "profile_path": null,
               "id": 5505,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f357",
               "name": "Michael Convertino",
               "profile_path": null,
               "id": 4055,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f35d",
               "name": "Elliot Davis",
               "profile_path": null,
               "id": 5506,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f363",
               "name": "Richard Marks",
               "profile_path": null,
               "id": 3175,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe423ec3a36847f800f369",
               "name": "Ronnie Yeskel",
               "profile_path": null,
               "id": 5507,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f36f",
               "name": "Nelson Coates",
               "profile_path": null,
               "id": 5508,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5a869eee0e0a265453037d57",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 6.492231,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 400,
      "vote_count": 114,
      "budget": 8000000,
      "overview": "A mafia film in Tarantino style with a star-studded cast. Jimmy’s “The Saint” gangster career has finally ended. Yet now he finds him self doing favors for a wise godfather known as “The Man with the Plan.”",
      "similar": [
         769,
         281957,
         27292,
         3134,
         10651,
         8012,
         37645,
         2252,
         9654,
         8456,
         240,
         23483,
         156022,
         180863,
         452507,
         507,
         445954,
         133805,
         2142,
         8292
      ],
      "original_title": "Things to Do in Denver When You're Dead",
      "runtime": 116,
      "poster_path": "/ysKIolKO0376Nl5DV1fDAAPudEq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1995-12-01",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Protect. Love. Honor. Avenge.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Gary Fleder"],
      "runtime": 115,
      "synopsis": null,
      "writers": ["Scott Rosenberg"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114660/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3NDkzNjQ5Ml5BMl5BanBnXkFtZTYwMDQ0Mzk4._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Andy Garcia, Christopher Walken, Christopher Lloyd | See full cast and crew »"],
      "reviews": [
         "One of the greatest appeals of this film is its vernacular. Aside from being cast beautifully by talented actors in diverse roles set in an interesting story, it's the dialogue that is extremely memorable. That, and its great title. And with such a great cast and dialogue, I'm absolutely stunned as to how this great little film slipped through the cracks and didn't get a wider audience. Its theatrical run here in Toronto was limited, actually I'm making an assumption, I don't recall a listing for it, but before you knew it, it was gone. Perhaps it wasn't marketed well or supported strongly enough. I have recommended this film and lent it to many friends and every one of them has enjoyed it. I generally say, if you liked \"Pulp Fiction\", another film which is well cast and with great dialogue, then you will likely enjoy this one also. One of my favourite quotes from the film (or any) comes from a supporting player. Andy Garcia as \"Jimmy The Saint\", seeks the advice of Bill Cobbs, playing \"Malt\", a Soda Jerk, on whether he should impregnate his hooker friend as a favour to help straighten her out, Malt sarcastically replies: \"That's just what the world needs... the unholy offspring of you two bag-o-smashes. That kid will be the anti-christ for sure\u0085 666 written all over it.\" Christopher Walken plays a memorable role of a crippled mob boss, known as \"The Man With The Plan\" who is disturbed by his son Bernard's manic and sexually obsessive behavior after having been dumped by the love of his life for another man. The Man With The Plan insists that Jimmy, come back to work for one job, an action, to scare the living daylights out of this new beau, and tell him to stay away from Bernard's former girlfriend. Jimmy is given the option to assemble his old crew for this action, which he does. A strange bunch of men who have been long out of any illegal action, some of whom miss it, and others whom do not. And that's just about where it gets real interesting. The story is laden with character revelation from a old wiseguy who just doesn't shut up and scenes from everyday people who offer their wisdom to videotape at Jimmy The Saint's legitimate but failing business, \"After Life Advice\" for people who are terminally ill and wish to pass on a legacy to their loved ones beyond the grave. Everyone involved with this film should be proud of their accomplishment. It is a great film and unfortunately hasn't been seen by many, by my account anyway. Let's see if we can't change that.",
         "It would be hard to dislike a film that opens with a Tom Waits tune and gives hitherto typecast actors a chance to, oh, I don't know: Act. First, Andy Garcia. What can I say about Andy? He's an attractive guy who all too often gets slated to play \"the attractive guy.\" (His shamefully undeveloped character from Ocean's Eleven comes to mind). In this little indy film he gets a chance to actually embody a character and not simply be Andy Garcia (with capital letters). Then there's his love interest, Gabrielle Anwar (who elevated the already immortal tango in Scent of a Woman). Poor Anwar has been plagued with a lot of stock roles in lame movies since then, but here, like Garcia, she gets to explore her role and show the audience she can do more than make \"hey I'm famous. Where's my check?\" Al Pacino look good on the dance floor. Also fantastic are Treat Williams, Steve Buscemi, and Christopher Walken (who bests his Annie Hall AND Pulp Fiction cameos). The story is simple: Andy's character is an ex-mob guy who's gone legit then pulled back in for one last job, things go wrong, and he's got 2 days before he's going to be killed. In many hands this would be a B movie, but the writing is so clever and unique that this excessively played mob-movie thing seems like it's done for the first time. There are as many quotable lines in this film as any cult classic; my favorites include: \"I knew the kid was lunchy, but not that lunchy.\" and meeting Anwar's character for the first time: \"What's your name?\" \"Dagney.\" \"Dagney? Wonderful name. Everyone should know a Dagney.\" If you like films like Usual Suspects that combine the action genre with actual thought and character development rent this film and see if you can watch it only once. In the same ballpark try Way Of The Gun with Benicio Del Toro and Ryan Phillippe, another film where \"pretty boys\" are actually allowed to explore their craft of acting.",
         "I guess this one is turning out to be a love it or hate it movie. I don't think the comparisons to Goodfellas or Casino is fair. This is more of a fantasy movie, where the characters happen to be criminals. It's told like a fantasy and the end of course puts re-emphasizes that. Goodfellas was gritty and brutal. Although a great film. I found it very hard to like such ugly characters. Even DeNiro was hard to like. That could of been the point. Or not. I'm not Scorcese. I feel these characters are much more likeable. Yes, there are some seemingly illogical turns in the plot. Like hiring Critical Bill. But I think they explain it pretty well. And the more you watch the movie the more you find details to help explain it. Sure he's nuts but he's fearless. It's a pretty standard movie criminal stereotype. The crazy guy who'll do anything. I don't know why so many people had a problem with him. He was a great character and probably the best thing Treat Williams has done in years. He's likeable but he's just such a nutjob. I love Jimmy's final conversation with him. I think in order to really appreciate it, watch it more than twice. First time it's good but you see holes. The second time the holes get bigger. The third time the holes close up and the characters shine through. Everybody keeps comparing it to Tarantino and most seem to make comments about not liking Pulp Fiction. Not gonna get into the whole defending Pulp Fiction thing but yes this has a lot of Pulp Fiction influence but the sources of Pulp Fiction are more what this references. This is not a non-linear story really. It has flashbacks and asides but it is told in order. And the dialogue I think is different from Tarantino's. Tarantino's has his own lingo. Based on reality. And it is just peppering here and there. It's more about pop-culture. This is more like pseudo 50's gangster lingo made up just for solely this movie. It helps create a microcosm for these characters. You know no one else but these characters use the dialogue. I think it's quite poetic. Scott Rosenberg did a great job with it. It more playful and imaginative. I also think unlike the straight train wreck downward- slope tragedy of Goodfellas, which works perfectly for that movie. This has a romantic tragedy feel. There is a lot of time spent on denied love. Anyways. I just really like this movie and it has grown on me tremendously. Some may hate it sure. Some love it. Either way I can think of worse movies to bet on. I say try it. If you love it it's one of those movies you can watch over and over and those are the best type of movies.",
         "Next to Garcia's work in INTERNAL AFFAIRS, this is really one of his best performances... It's a rich film on every level, and it's too bad the film was caught -- back in 1995 -- in the backlash of Tarantino madness. Scott Rosenberg has a unique voice as a writer, and this film attempts to create its own reality. All those who say they 'hate' this film should rent their copy of HAPPY GILMORE and keep their opinions to themselves. Needless to say, this is a film that provokes and p***es people off and one which should be viewed without conventional expectations...",
         "I feel that a hell of a lot of ppl missed the point on this one; it is less a Tarantino-esque hip, Godfather mob drama, than a meditation on life and death, and the frustration of mortality. Centered around Garcia's character Jimmy, the film follows him tying up his loose ends, after his gang botch up an 'action', and are given a 48hr suspended death sentence by bitter crimelord Walken, before the deadly assassin Mr Shh (Buscemi) is called in. Feeling responsible, and desperate to tie up as many loose ends in his life, the film finds Jimmy constantly striving to choose between options, and to try and finish nobly, and rectify his perceived wrongs. These include trying to secure his fellow gang members (Lloyd, Nunn, Forsythe and the crazed Williams), ensure the wellbeing of prostitute Balk, and ignore his love for Anwar, to avoid dragging her in with him. Throughout it all, Jimmy only succeeds in isolating himself further, fighting his fears and dreams with his logic and pride. Yet as Warden narrates, there is a sense that Jimmy's peace is just around the corner, if only he can do the right things. Garcia truly tranmits his character's pain and suffering, most pertinently through the changing look on his eyes and face as the deadline nears - he tries to maintain his grace, but cant quite hide his fears. All the support are great - Walken and Buscemi as per usual are suitably fearful, Williams and Lloyd in particular represent lost souls going down defiantly very well, whilst the underused women are perfect - Anwar doing well with unhelpful scenes, and Balk truly outstanding as the prostitute with the zeal and realism that Jimmy so badly needs. The dialogue is at times cheesy and clunky, and the mob feel somewhat overdone, but the film feels true, and makes a valuable point about targets, and the temporality of life. And it refuses to lose hope, as proved by the final boat scene. Similar to Spike Lee's new film, the issues of mortality, and aspirations and dreams are key. The film's sombre tone is perfect - not too downbeat (there are many hilarious and happy moments), but enough to make us understand the importance of the issues at stake. Aside from staunch, happy-to-be-cynical other imdb reviewers, the film will affect, and perhaps even instruct. Recommended.",
         "Jimmy `The Saint' Tosnia as a small business recording messages from the terminally ill. He owes money to a local loanshark \u0096 a debt that is called in by The Man With The Plan. The Man wants Jimmy to scare off a man who has stolen away his son's high school sweetheart. Jimmy takes on a group of 4 other men to help him, however the job gets messy and fails, The Man takes the only action he can and puts a contract on their lives \u0096 giving Jimmy the option to run, however Jimmy stays to make sure that the rest of the group get safety into hiding. At the time, cool crime stories were all the rage \u0096 everyone wanted to have a go, the multiplex audience were falling over themselves for jobs gone wrong, violence and snappy dialogue. So into this crowded market place came this film \u0096 it did quite well and was probably above average for the rest of the genre at the time. The plot is nothing new and really is very simple when viewed in a synopsis. What makes the film work is the fact that it does manage to pull off the `cool, snappy' thing. The dialogue is cool and filled with catchphrases `boat drinks' `mama-rammer' `give it a name'. The characters are also written larger than life \u0096 from the silent hitman up to the Man With The Plan, they all have quirks that make them larger than life. Of course this doesn't make a film in itself and it is not without flaws \u0096 at times it does feel like it's treading water, but for the most part the smooth feel helps it glide along. The cast are all good. Garcia has one of his better roles in a while and is effortlessly cool or increasingly desperate as the role requires. Walken doing a sinister bad guy isn't earth shattering but he at least he's putting in effort and isn't slumming as he has of late. Williams is probably the funniest as Critical Bill \u0096 when summing up why the job went wrong he says that it was probably Jimmy's fault for giving him responsibility as, `everyone knows I'm off my t*ts'. Lloyd is good value and Nunn also acquits himself well. Anwar is beautiful and she was well cast \u0096 she really does, as Jimmy says, `glide' when she walks. Buscemi is in a small part but is memorable as always. Overall this may not stand out from the crowd of this genre in the same way as Pulp Fiction does but is does have a certain cool, snappy feel to it that helps it glide along. And, in Garcia, it has a lead that really holds it together and helps bring out an emotional involvement towards the end.",
         "This is an excellent film that has interesting characters, a tricky plot line and alot of cool phrases/sayings. This is a movie critizied for copying Pulp Fiction, but it's not the same kind of movie. It's script was made before Pulp Fiction and is more complex then Pulp fiction. Steve Buscemi is a standout in the cast as a deadly hitman named Mr. Shh, and also noticeable is Treat Williams who is the psychotic Critical Bill. This is a totally original film that should be recognized and talked about, it only had bad timing on it's release.",
         "\"Things to Do in Denver... When You're Dead\" is a smart little crime flick that may not add anything to the genre but is an enjoyable ride. Andy Garcia is thoroughly charming as the honourable Jimmy the Saint who is under increasing time pressure to fix things before his crew get killed for a botched job. Other cast members also put in good performances, while if you are a fan of Steve Buscemi this film probably contains his \"coolest\" work to date. \"Things to Do...\"'s greatest flaw is its slow exposition. It takes a while for things to get moving, by which time you may be questioning why you are watching this movie. Stick with it - \"Things to Do in Denver... When You're Dead\" is a crime film worth watching.",
         "I just wanted to choose one movie out of all the movies I've seen - per chance, I've got something like a list - and vote for it here. I happened to choose \"Things to Do in Denver when You're Dead\", I read a few comments, voted my 8 out of 10 and then I thought: Well, I guess I could easily write an own comment about this one quite quickly. So here is what I feel about it. Generally, I'm a person who objects decisively to too much violence and obscenity, but still I like so much about this movie. I would have avoided many scenes and sure it is also a bit too pathetic, but it's also melancholic and poetic. Never before \"good gangsters\" have been as likeable as here - despite all that exaggerated kind of stuff they talk. As I told you, there is this dark poetry in this picture. The jeopardy of life in which the gangsters find themselves, their only hopes and the way they take it. There is also an unhappy love-story in this movie, no special one whereof you'd remember anything great or particularly touching, but it fits into the picture. Already when you watch the opening scene of the movie - which you might feel quite uncomfortable about - you know that this is a unique and unconventional movie which doesn't like the word *taboo*. Therefore - there IS too much violence and obscenity in it. But also this is - depending on the way you look at it - fascinating: You don't care when someone is shot, but nethertheless you think you DID care for the main characters. And finally the performances must be mentioned. They are really extremely fine and very charming. First of all Andy Garcia's in the lead. I've seen him in a few other movies before, but I didn't know what a good actor he is. In this movie he is absolutely brilliant, he's so very likeable - and melancholic when still full of joy. Christopher Walken of course is always fine, as is Christopher Lloyd as the leper (if he actually is one, tasteless but very very grotesque and funny!) and it's Treat Williams who stands out. Fairuza Balk also deserves being mentioned. And - it's some time ago that I saw the movie, so I can't actually recall why, but - I remember that I also enjoyed Jack Warden, who had a supporting role, very much.",
         "I CAN imagine telling someone this film is 'a reputable film of inherently admirable qualities' - a wide-ranging score, sharp cinematography, a beautiful elegiac tone and a killer script all provide the foundations for one of the most surprising films I've seen. Andy Garcia's A-list performance is superbly supported by a host of brilliantly- cast characters, with Treat Williams, Christopher Lloyd and the malevolent Christopher Walken outstanding. The whole film just sits really well - all the small background details help the plot, flesh out the characters and culture or provide telling counterpoints to the situation. Highly recommended, for those who like their films stylish, well-acted and intelligent."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Miramax",
         "Woods Entertainment"
      ],
      "summaries": [
         "Jimmy the Saint's business is videotaping the terminally-ill, so that they will be around to give 'Afterlife Advice' to their survivors. He hasn't been doing too well lately and has had to turn to loan-sharks to accomodate his failing business, as well as his expensive personal tastes. When an evil gangster-overlord buys up his note and demands a favor of Jimmy, in exchange for the interest that he can't afford, Jimmy capitulates. Jimmy is to scare someone for the gangster-overlord--really rough them up. Without giving too much away (spoiler), the scene goes down badly and Jimmy and his crew all end up with contracts on their heads for their trouble.",
         "Five different criminals face imminent death after botching a job quite badly."
      ],
      "budget": 7000000
   },
   "movielensId": 81,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-12-01",
      "dvdReleaseDate": "1999-06-29",
      "directors": ["Gary Fleder"],
      "runtime": 116,
      "movieId": 81,
      "title": "Things to Do in Denver When You're Dead",
      "mpaa": "R",
      "actors": [
         "Andy García",
         "Christopher Lloyd",
         "William Forsythe",
         "Bill Nunn",
         "Treat Williams",
         "Jack Warden",
         "Steve Buscemi",
         "Fairuza Balk",
         "Gabrielle Anwar",
         "Christopher Walken",
         "Michael Nicolosi",
         "Sarah Trigger",
         "David Stratton",
         "Jenny McCarthy"
      ],
      "imdbMovieId": "0114660",
      "originalTitle": "Things to Do in Denver When You're Dead",
      "genres": [
         "Drama",
         "Crime"
      ],
      "youtubeTrailerIds": ["i1o_PO3ridY"],
      "plotSummary": "A mafia film in Tarantino style with a star-studded cast. Jimmy’s “The Saint” gangster career has finally ended. Yet now he finds him self doing favors for a wise godfather known as “The Man with the Plan.”",
      "tmdbMovieId": 400,
      "avgRating": 3.2691,
      "releaseYear": "1995",
      "numRatings": 3443,
      "posterPath": "/ysKIolKO0376Nl5DV1fDAAPudEq.jpg"
   }
}