{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "magic",
            "id": 2343
         },
         {
            "name": "good vs evil",
            "id": 10842
         },
         {
            "name": "talking animal",
            "id": 11477
         },
         {
            "name": "dragon",
            "id": 12554
         },
         {
            "name": "king",
            "id": 13084
         },
         {
            "name": "narnia",
            "id": 166930
         },
         {
            "name": "fantasy world",
            "id": 170362
         },
         {
            "name": "snowing",
            "id": 182772
         },
         {
            "name": "sea voyage",
            "id": 188280
         },
         {
            "name": "quest",
            "id": 207372
         },
         {
            "name": "turned into animal",
            "id": 241980
         }
      ],
      "imdb_id": "tt0980970",
      "video": false,
      "title": "The Chronicles of Narnia: The Voyage of the Dawn Treader",
      "recommendations": [
         2454,
         411,
         2268,
         32657,
         10527,
         18360,
         8355,
         10192,
         810,
         24021,
         88751,
         18239,
         1979,
         950,
         27022,
         49444,
         76285,
         2486,
         50620,
         809
      ],
      "backdrop_path": "/rB5SbbBEkMZYAS6MgoFp2CTxazo.jpg",
      "revenue": 415686217,
      "reviews": [
         {
            "author": "Matt Golden",
            "id": "51ec288d19c29551e2117035",
            "content": "In the immortal words of Col. Kurtz, \"The horror...the horror.\" Marlon Brando wasn't speaking of this film, of course, but rather the horrors of the Vietnam War. The sentiment remains applicable.\r\n\r\nWhen I write reviews, I do try to give at least a modicum of context, be it a history of the film itself, predecessors to its place in cinema history, or my general feelings on the type of film. In this case, I've just referenced Francis Ford Coppola's classic take on Joseph Conrad's \"Heart of Darkness,\" Apocalypse Now. What does that have to do with Dawn Treader? Nothing, and I couldn't be happier. Why? Because it's distracted my mind with thoughts of a far, far better film. Allow me my few moments of happiness before I have to rifle through the dark filing cabinet of my mind to marshal my thoughts on this atrocity.\\\r\n\r\nWhat went so wrong here, you may ask? We'll start with the history of this franchise. I do not have the highest opinion of this series. We started out with the most famous of C. S. Lewis' Narnia cycle, The Lion, The Witch, and the Wardrobe. I don't know...perhaps if we hadn't been in the middle of such a fantasy film renaissance, I would have found it more palatable. Instead, coming on the heels of Peter Jackson's generation-defining Lord of the Rings trilogy, and the high class and quality of the Harry Potter franchise, that weak take on a book series that didn't thrill me as a child struck me as a cheap, childish appetizer compared to the magnificent feasts audiences had already been served, their stories facile, their acting (aside from a typically great Tilda Swinton) either poor or phoned-in (Paging Mr. Neeson, your paycheck is waiting for you). SHREK co-director Andrew Adamson was the helmer of both Wardrobe and Caspian, and I had hoped those film's failings were due perhaps to his inexperience as a director of live-action. The first film of course wore its Christian allegory on its sleeve (Lewis, for all his writings, never managed to find the definition of \"subtle\"), and it found favor with the churchgoing crowd, whose turnout afforded it a huge box office windfall. The second film was more of a straight actioner (in the vein of Star Wars Episode I, which is to say the supposed action was mired in a swamp of facile and achingly dull political machinations), and didn't find purchase with the same demographic, and box office returns were disappointingly low. Disney, who had financed the films, saw the writing on the wall, and dropped the series. That should have been the end of it.\r\n\r\nUntil 20th Century Fox stepped in. Now, let's remember: Fox doesn't have the best track record with adapting beloved fantasy series into films (a moment of silence for the tragedies that were The Dark is Rising and Eregon, please). Hiring Michael Apted as the director seemed to be bucking the trend of shoveling out crap. Apted isn't really known as an action, fantasy, or epic film director, but he showed promise with the last Pierce Brosnan/James Bond film, The World is Not Enough (I'll not blame him for Denise Richards'...nuclear physicist...sigh). Still, director in place, 20th Century Fox and Walden Media cobbled together another Narnia adventure, and the results were predictably terrible.\r\n\r\nHonestly, I wish I hadn't expected a poor film going in. Because this film not only met but exceeded my expectations of terrible, and it's not because I was pre-judging it. It's because it was simply that bad. The plot is nonsensical, randomly shunting characters from one loosely-connected vignette to the next, with hokey dialogue and dire predictions of eeeevil standing in for actual menace or intrigue. It's a shaggy dog road trip story, waterlogged on a boat, and I found myself half an hour in wishing desperately that the characters would all get scurvy and die.\r\n\r\nThe plot's so thinly-sketched that I may as well not even try to recount it here, but it has something to do with two of the kids from previous films being once again pulled into Narnia at absolute random, with no thematic or plot reason for any of the nonsense in the first place. Once there, our cast is rounded out with their exceptionally annoying cousin, and despite no one knowing quite what's going on, they stumble upon the titular character of the second film, Prince Caspian, and join him on his completely random quest to recover seven old friends of his long-dead father who disappeared for some reason, and no one knows why. So they fight an island made of evil. Good wins, evil is defeated, the end. Please, let it be the end.\r\n\r\nListen: I love fantasy. I love science fiction, I love horror, I love all of the outré genres, the fantastic, the unreal. It fascinates me, and I love wrapping myself in the trappings of the genre like a favored blanket, letting their comforting warmth wash over me in waves of escapism and nostalgia. But this half-assed bunch of hokum had me rolling my eyes, with the stilted dialogue and the hastily-sketched characters and the nonsensical plot and the ARGH it's too much.\r\n\r\nThe icing on this crap cake was the ham-handed, in-no-uncertain-terms Christian allegory with which the film beat the audience over the head with all the grace, power, and strength of an industrial-size sledgehammer. Yes, the evil was SIN. And Aslan is JESUS. Who exists as a lion in an alternate universe or something, apparently. Who pulls children into this alternate universe at random for...no apparent reason whatsoever (the film explicitly states that it's \"to know Him (Aslan i.e. Jesus, in case you didn't already pick up on that) better,\" but if that's the case, why just these four kids? What's the thematic point of this? Why were the elder kids now judged worthy of not having watery allegory poured down their throats again? What did these kids learn at the end of this film that made them better people?\r\n\r\nARGH again. I cannot even begin to catalogue the problems with this series, from either the internal \"logic\" of the series or the external logic of the human brain. Doing so only hurts my head.\r\n\r\nRemember how I said the second film in the series lacked the ham-fisted Christian allegory of the first? Well, 20th Century Fox apparently recognized the church-going demographic was what made the first film such a success, and had them ramp up the religious content from \"allegory\" to \"explicit yelling at the audience and rubbing its nose in it like it's a puppy who peed on the carpet.\" This sentiment struck me as wholly insincere, a manufactured \"message\" shoehorned in by a film studio who wanted nothing more than to reap the box office rewards of the first film which felt, though unsubtle, genuine in its intentions.\r\n\r\nI've seen films more poorly shot, more poorly acted, more poorly assembled. But this boring, useless, preachy slog with no purpose or point had me at the absolute end of my rope. Rare is it that I sit in a darkened theater constantly looking at my watch, biding my time, aching for the dross on the screen to end so that I simply don't have to endure it anymore. But that's exactly what happened with this film.\r\n\r\nBefore anyone jumps on the obvious point of attack, let me say in no uncertain terms that I am Christian. But (and this is an exceptionally important point) just because a the message of a particular film/book/song/etc. is Christian doesn't make the work inherently good. Nor does criticism of the work in some way equal an anti-Christian sentiment. I often feel that works perceived as \"Christian\" get a free pass on quality because of their message, but quality doesn't work like that. Lowering one's standards results only in mediocre pablum like this continuing to be passed off for media conglomerates to make a quick, insincere buck. Do me a favor. If you've enjoyed these films, fine. I whole-heartedly disagree, but I'm certainly not going to tell you you're wrong for enjoying them. But I beg of you: Don't shut off the critical area of your brain just because something agrees with your worldview. Doing so is a disservice not only to yourself, but everyone else like you who has to suffer through trash like this.",
            "url": "https://www.themoviedb.org/review/51ec288d19c29551e2117035"
         },
         {
            "author": "talisencrw",
            "id": "570c752592514144920001c4",
            "content": "Growing up in the Canada in the 70's and 80's, I fondly recall vastly enjoying an animated version of Lewis' 'The Lion, the Witch and the Wardrobe' that was presented by Kraft on CTV. Now as a father of a son, I want to see with him the contemporary versions of the books I adored in my youth, though at present I greatly prefer the craftsmanship of cinema pre-1970.\r\n\r\nIt never bothers me in the slightest, to the ire of my more obsessive-compulsive cinephilic friends, seeing films of series with complete disregard to their order (one of my friends nearly had a heart attack, when he discovered I had watched 'Spider-Man 3' without having previously watched films 1 and 2--don't even get me started about the 'Harry Potter' series...), so, especially curious about how one of my favourite contemporary directors, Michael Apted, would do in the realm of big-budget, CGI-intensive fantasy filmmaking (I expected a fish-out-of-water, like Lord Richard Attenborough helming 'A Chorus Line'), I gave this a shot.\r\n\r\nI enjoyed this more than 'Harry Potter' films I have seen, though it does stretch things from the literary works, but unfortunately, that seems to be the way things are, since film became less about artistry and more about business (just see at Toys R Us how many possible toys you can purchase, and similar commercial off-shoots, and I don't even consider this series a major player in this sort of area, because of its Christian undertones, which really doesn't mesh perfectly with selling tons of toys, though of course the realms aren't mutually exclusive, not by any stretch of the imagination). I think that Apted did a decent job, especially considering that yes, he is a fine director, but this isn't really his cup of tea. I distinctly feel that if these films are your comfort food, you won't be disappointed. I look forward to checking out the series' two preceding entries, and, though they left an opportunity for more films, which I believe wouldn't be from Lewis' works at all, it was a nice summation at its conclusion.\r\n\r\nFinally, it was great to see (or at the very least, hear) Tilda Swinton, Liam Neeson and Simon Pegg, they seem to be thrown in everything these days. I heartily salute their agents--they must have the very best in the business.",
            "url": "https://www.themoviedb.org/review/570c752592514144920001c4"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Edmund Prevensie",
               "gender": 2,
               "credit_id": "52fe43339251416c750075f3",
               "name": "Skandar Keynes",
               "profile_path": "/wETrA0yMoM4805gVJsgwOjAZ2om.jpg",
               "id": 5527,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Lucy Pevensie",
               "gender": 1,
               "credit_id": "52fe43339251416c750075f7",
               "name": "Georgie Henley",
               "profile_path": "/wxV0QGGrQLSbErbRn3pgIkl49PL.jpg",
               "id": 5526,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Reepicheep (Voice)",
               "gender": 2,
               "credit_id": "52fe43339251416c750075fb",
               "name": "Simon Pegg",
               "profile_path": "/23e2uoNlpDvLumNic16fS2YjZjL.jpg",
               "id": 11108,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Lord Drinian",
               "gender": 2,
               "credit_id": "52fe43339251416c750075ff",
               "name": "Gary Sweet",
               "profile_path": "/nccFDKuOANH0BDMvVo4Tpoe035h.jpg",
               "id": 75170,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Rhince",
               "gender": 2,
               "credit_id": "52fe43339251416c75007603",
               "name": "Arthur Angel",
               "profile_path": "/5Zafbt1us6XgqHfBs7iyZ8NnYN1.jpg",
               "id": 107474,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "The White Witch",
               "gender": 1,
               "credit_id": "52fe43339251416c75007607",
               "name": "Tilda Swinton",
               "profile_path": "/eGNo9qwlunvAi4kCVUEFtQFM5X.jpg",
               "id": 3063,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Rynelf",
               "gender": 0,
               "credit_id": "52fe43349251416c7500760b",
               "name": "Tony Nixon",
               "profile_path": "/7YqSwVuWZXmkQg2scLOXLzaVTCz.jpg",
               "id": 143270,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Tavros the Minotaur",
               "gender": 2,
               "credit_id": "52fe43349251416c7500760f",
               "name": "Shane Rangi",
               "profile_path": "/27LjnxN8dMQ3r2yRatAoht3iDhJ.jpg",
               "id": 25134,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Auctioneer",
               "gender": 0,
               "credit_id": "52fe43349251416c75007613",
               "name": "Colin Moody",
               "profile_path": null,
               "id": 143271,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Caspian",
               "gender": 2,
               "credit_id": "52fe43349251416c75007617",
               "name": "Ben Barnes",
               "profile_path": "/cPUCUD5HRMVH0QvZcqXdQiQ3BWd.jpg",
               "id": 25130,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Eustace",
               "gender": 2,
               "credit_id": "52fe43349251416c75007621",
               "name": "Will Poulter",
               "profile_path": "/uzzt8okraVwvxSfoU4MJ39bdHwV.jpg",
               "id": 93491,
               "order": 10
            },
            {
               "cast_id": 43,
               "character": "Lord Bern",
               "gender": 0,
               "credit_id": "52fe43349251416c750076b5",
               "name": "Terry Norris",
               "profile_path": null,
               "id": 187107,
               "order": 11
            },
            {
               "cast_id": 44,
               "character": "Lord Rhoop",
               "gender": 2,
               "credit_id": "52fe43349251416c750076b9",
               "name": "Bruce Spence",
               "profile_path": "/pwJJBmO9MG3OxVX9efGrB6BTFyw.jpg",
               "id": 27752,
               "order": 12
            },
            {
               "cast_id": 45,
               "character": "Coriakin",
               "gender": 2,
               "credit_id": "52fe43349251416c750076bd",
               "name": "Bille Brown",
               "profile_path": "/u6VUTGmbaSt0LfvbXMoY1P2weh8.jpg",
               "id": 42393,
               "order": 13
            },
            {
               "cast_id": 46,
               "character": "Liliandil",
               "gender": 0,
               "credit_id": "52fe43349251416c750076c1",
               "name": "Laura Brent",
               "profile_path": "/vxqGkkAIZmfQModSQxV2bgelkgV.jpg",
               "id": 962438,
               "order": 14
            },
            {
               "cast_id": 47,
               "character": "Susan Pevensie",
               "gender": 1,
               "credit_id": "52fe43349251416c750076c5",
               "name": "Anna Popplewell",
               "profile_path": "/tlGWAZeDgqJtJ5cz57zS0BW5our.jpg",
               "id": 5529,
               "order": 15
            },
            {
               "cast_id": 48,
               "character": "Peter Pevensie",
               "gender": 2,
               "credit_id": "52fe43349251416c750076c9",
               "name": "William Moseley",
               "profile_path": "/7a55ifGzqKIw9TbEYQUc0bnHfnq.jpg",
               "id": 5528,
               "order": 16
            },
            {
               "cast_id": 49,
               "character": "Aslan (voice)",
               "gender": 2,
               "credit_id": "547e3f6b9251411f4e0051c4",
               "name": "Liam Neeson",
               "profile_path": "/9mdAohLsDu36WaXV2N3SQ388bvz.jpg",
               "id": 3896,
               "order": 17
            },
            {
               "cast_id": 56,
               "character": "Gael",
               "gender": 1,
               "credit_id": "575b08d5c3a36851c300039d",
               "name": "Arabella Morton",
               "profile_path": "/4gavImNh4yNXA1WhDGXATNhQGqk.jpg",
               "id": 1633572,
               "order": 18
            },
            {
               "cast_id": 59,
               "character": "Chief Dufflepud",
               "gender": 2,
               "credit_id": "59d551b9c3a368453f01e625",
               "name": "Roy Billing",
               "profile_path": "/4fnmZ3ANu7KcjsOizlzNPjWQSpm.jpg",
               "id": 94793,
               "order": 19
            },
            {
               "cast_id": 60,
               "character": "Dufflepud #2",
               "gender": 2,
               "credit_id": "59d55267c3a368459401fe1c",
               "name": "Neil G. Young",
               "profile_path": null,
               "id": 1900117,
               "order": 20
            },
            {
               "cast_id": 58,
               "character": "Dufflepud #3",
               "gender": 0,
               "credit_id": "59d55176c3a368452801f128",
               "name": "Greg Poppleton",
               "profile_path": "/lanmTJ0vJEkW0se7wSfGWhOFuyu.jpg",
               "id": 1900115,
               "order": 21
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43349251416c7500761d",
               "name": "Michael Apted",
               "profile_path": "/j5KoJlZUepN36ZD8VoDLuvV5BG5.jpg",
               "id": 10781,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43349251416c75007627",
               "name": "C. S. Lewis",
               "profile_path": "/rxEWzN94ygE7mHSIXlouMFL0NuF.jpg",
               "id": 5525,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43349251416c7500762d",
               "name": "Christopher Markus",
               "profile_path": "/tyeKi52yruPdxOkEMKhBKCnkp5V.jpg",
               "id": 5551,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43349251416c75007633",
               "name": "Stephen McFeely",
               "profile_path": "/fa8DAGpANcBTTXO4bbNMrCFufmV.jpg",
               "id": 5552,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43349251416c75007639",
               "name": "Michael Petroni",
               "profile_path": "/6jLxLAE2lRRCtj2wH2T21lStURm.jpg",
               "id": 61239,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43349251416c7500763f",
               "name": "Andrew Adamson",
               "profile_path": "/sI8oEKKzvQmrNzV5kFakrKcNcvB.jpg",
               "id": 5524,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43349251416c75007645",
               "name": "Mark Johnson",
               "profile_path": "/yKGF6cbzyP03Gl1QhVLCu1gWSW6.jpg",
               "id": 5162,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43349251416c7500764b",
               "name": "Cort Kristensen",
               "profile_path": null,
               "id": 1117948,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43349251416c75007651",
               "name": "Philip Steuer",
               "profile_path": null,
               "id": 5541,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43349251416c75007657",
               "name": "Todd Cogan",
               "profile_path": null,
               "id": 1117949,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43349251416c7500765d",
               "name": "Douglas Gresham",
               "profile_path": null,
               "id": 5543,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43349251416c75007663",
               "name": "Perry Moore",
               "profile_path": "/aSOtnEqu7cG9TDqr5COyP709VHr.jpg",
               "id": 5544,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43349251416c75007669",
               "name": "Jose Ludlow",
               "profile_path": null,
               "id": 34854,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43349251416c7500766f",
               "name": "Jessie Thiele",
               "profile_path": null,
               "id": 1117950,
               "department": "Crew",
               "job": "Post-Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "52fe43349251416c75007675",
               "name": "David Arnold",
               "profile_path": "/quJ5BYpkU79sCwn7NHFCvzBSwwX.jpg",
               "id": 6489,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43349251416c75007681",
               "name": "Rick Shaine",
               "profile_path": null,
               "id": 13673,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe43349251416c75007687",
               "name": "Nina Gold",
               "profile_path": "/kljYhRvTAqQfX198mjz0ITP0hFM.jpg",
               "id": 16363,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "52fe43349251416c7500768d",
               "name": "Christine King",
               "profile_path": null,
               "id": 12203,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe43349251416c75007693",
               "name": "Barry Robison",
               "profile_path": null,
               "id": 19284,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe43349251416c75007699",
               "name": "Ian Gracie",
               "profile_path": null,
               "id": 33195,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe43349251416c7500769f",
               "name": "Daniel May",
               "profile_path": null,
               "id": 1117952,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe43349251416c750076a5",
               "name": "Karen Murphy",
               "profile_path": null,
               "id": 1117953,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe43349251416c750076ab",
               "name": "Marco Niro",
               "profile_path": null,
               "id": 9821,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe43349251416c750076b1",
               "name": "Mark Robins",
               "profile_path": null,
               "id": 1319,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "553155f0925141529800054b",
               "name": "Daniel Fotheringham",
               "profile_path": null,
               "id": 1452991,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "5537ecdf9251416518006edd",
               "name": "Sean Button",
               "profile_path": null,
               "id": 1447518,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 0,
               "credit_id": "55422aab9251414ae6003fb2",
               "name": "Hugo Dominguez",
               "profile_path": null,
               "id": 1447543,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 0,
               "credit_id": "554260da92514127aa000015",
               "name": "Yannick Honore",
               "profile_path": null,
               "id": 1447378,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "555ff3b39251417e5f003f46",
               "name": "Gabriele Zucchelli",
               "profile_path": null,
               "id": 1453612,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56ec5a85c3a36822560034c5",
               "name": "Ben Parkinson",
               "profile_path": null,
               "id": 1195356,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5775b3b5925141674a000ccd",
               "name": "Dante Spinotti",
               "profile_path": "/vIb3GU52BvSIQh1MXZRFDVRnqsm.jpg",
               "id": 11099,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 35.842525,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10140,
      "vote_count": 2047,
      "budget": 155000000,
      "overview": "This time around Edmund and Lucy Pevensie, along with their pesky cousin Eustace Scrubb find themselves swallowed into a painting and on to a fantastic Narnian ship headed for the very edges of the world.",
      "similar": [
         34584,
         808,
         809,
         37933,
         2486,
         14442,
         2454,
         12155,
         411,
         10882,
         68735,
         57158,
         41513,
         12445,
         76285,
         27022,
         140300,
         116149,
         266647,
         278927
      ],
      "original_title": "The Chronicles of Narnia: The Voyage of the Dawn Treader",
      "runtime": 113,
      "poster_path": "/pRzEyrMSyvpHf92EhsVSg9Yr81t.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Walden Media",
            "id": 10221,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dune Entertainment",
            "id": 444,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fox 2000 Pictures",
            "id": 711,
            "origin_country": ""
         }
      ],
      "release_date": "2010-08-13",
      "vote_average": 6.2,
      "belongs_to_collection": {
         "backdrop_path": "/3dPVWuhk0MpnDkxUeNcYvUmsRTK.jpg",
         "name": "The Chronicles of Narnia Collection",
         "id": 420,
         "poster_path": "/sh6Kn8VBfXotJ6qsvJkdfscxXKR.jpg"
      },
      "tagline": "Return to magic. Return to hope. Return to Narnia.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Apted"],
      "runtime": 113,
      "synopsis": "Edmund Pevensie (Skandar Keynes), almost but not quite an adult, envies adult men. He tries to enlist in His Majesty's Army, but the recruiter, of course, catches him out with his fake I.D., especially when his sister Lucy (Georgie Henley) reminds him that he was supposed to help her with grocery shopping. Lucy envies any girl whom she thinks is prettier than she. The problem is that her only standards of beauty are her older sister Susan (Anna Popplewell), now in America, and any other girl who is hanging on the arm of a young man. Edmund and Lucy have another problem. Because the war still rages, they are evacuated once again. Only while Peter (William Moseley) and Susan are evaculated all the way to America, Edmund and Lucy are evacuated, not to Professor Digory Kirke's country estate (see The Lion, the Witch and the Wardrobe), but to the home of their obnoxious cousin, Eustace Clarence Scrubb (Will Poulter). Eustace has no social graces whatsoever and would like nothing better than to treat Edmund and Lucy as he would treat any of the arthropods in his considerable, and repulsive, collection. One afternoon, Lucy and Edmund are alone in the room that Edmund has to share with Eustace. They notice a painting on a wall--a painting of a ship on an ocean, a ship that looks very much like one of the ships they once sailed in the world of Narnia, where once they had reigned as a king and a queen. Only as they stare at the painting, the water seems to move, and the ship seems to come right at them. Eustace enters, and makes fun of them for indulging, as he sees it, in a flight of fancy. But then the seawater starts to *spill into the room.* Eustace, panicked, tears the painting off the wall, but that does no good. In the next instant, the room is full of water, rising until they are swimming in it. Soon they are underwater, and rising up to the surface of a real ocean. And there comes the ship, big as life! The crew of that ship pick them up at once. Edmund and Lucy discover, to their delight, that the ship is actually Narnian. The distinguished passenger on board is none other than King Caspian (Ben Barnes), with whom they had fought a successful war three years before (in Narnian time; see Prince Caspian). Eustace is thoroughly affronted, especially with a Talking Mouse (Simon Pegg) who protests that he was only trying to resuscitate him! To make matters worse, a walking, talking Minotaur (Shane Rangi) tells him that he is aboard the Dawn Treader, \"the finest ship in the Narnian Navy!\" Caspian welcomes Edmund and Lucy on board as honored guests. Then, after outfitting them both in Narnian clothing, he gives Lucy her dagger and medicinal cordial (and Susan's bow and arrows), and offers Edmund his old electric torch, which he had left behind. Now Caspian reveals his mission. He is looking for the Seven Lost Lords of Narnia, friends of his father's whom Lord Protector Miraz had driven into exile. They had fled to the Lone Islands, and no one has heard from them since. Caspian's mission: to rescue or recover them. Reepicheep the Talking Mouse has a mission of his own: he wants to travel to the literal end of the world, and find the country of Aslan (Liam Neeson), the lion-shaped God-King of the world of Narnia. Lucy thoroughly enjoys the sights and sounds of Narnia. Edmund and Caspian entertain the crew with a fencing match. Eustace stubbornly insists that he \"never lost\" his \"sea legs.\" Eustace boasts that he will find the British Consulate, as if Britain even *has* a consulate in this world. But all this idle talk stops, as the Dawn Treader comes within sight of land: Narrowhaven, capital city on the largest of the Lone Islands, their immediate destination. Tavros the Minotaur, who obviously serves as boatswain on board, orders two longboats fitted out. In them, Caspian leads a landing party ashore. Edmund, Lucy, Eustace, and Reepicheep are all part of it. They find Narrowhaven deserted, and Caspian and the children go further inland to investigate. Inside an empty hall, they find ledgers showing purchases and sales--of slaves. Just then, the slavers rappel down ropes and attack. Lucy, Edmund, and Caspian handily fight off the attackers, but Eustace is easily seized, and used as leverage to capture all four of them. In the dungeon into which the slavers throw them, they find Lord Bern (Terry Norris), first of the Seven Lords, who has been a prisoner for many years. Bern recognizes Caspian as his king and tells him what has befallen Narrowhaven. Then they watch as the slavers take a cartload of very frightened slaves, load them into a longboat, and shove it out to sea--where an animated green mist suddenly appears, washes over them, and then disappears--with the slaves. Lord Bern tells Caspian that his six companions set out to find the source of the mist, and never returned. Bern has reproached himself ever since for not going with them. The next day, the slavers try to sell the children at auction. An apparent buyer shows up--who is actually Lord Drinian (Gary Sweet), captain of Dawn Treader, and enough men-at-arms to take over the town and set all the slaves at liberty. Eustace tries to steal away in a longboat, but succeeds only in decking another slaver who tries to kill him before the other Narnians show up. A distraught man of Narrowhaven name Rhince (Arthur Angel), seeking to find his wife Helaine (Rachel Blakely), who was on the last longboat devoured by the mists, signs on with Dawn Treader's crew. Lord Bern then retrieves a sword he has kept all this time, one of seven swords that Aslan gave to the Seven Lords. Bern gives this to Caspian, who then gives it to Edmund to use while he is in Narnia. Dawn Treader sets sail to go further east. Eustace keeps a diary, always assuming that everything around him is an illusion. And then on his first full night on board, he tries to steal water and food from the ship's rations. Reepicheep catches him at it, and the two fight a quick duel, Reepicheep with his sword, and Eustace with the first weapon he finds handy: a galley knife. The fight is almost one-sided, except that Reepicheep is trying more to train Eustace in swordfighting than to do him any real harm. Then Eustace falls over a bundle--that turns out to be a little girl, Gael (Arabella Morton), Rhince and Helaine's daughter, who desperately wants to find her mother. Captain Drinian says nothing about the attempted ration theft, and simply welcomes the little girl as \"an extra crewmember.\" Lucy takes to Gael quickly and acts as her protector. Dawn Treader next fetches up at another apparently uninhabited island. Only this island *is* inhabited, by invisible men who hop about on one foot each--but are quite capable of abducting someone. They abduct Lucy and bring her into the garden of a mansion several yards inland (a mansion that is also invisible, and by the same means: a magic spell). They want her to go into this mansion, find a book of spells, and recite a spell to render them visible once again. Lucy reluctantly does so, especially after the voices tell her that they can neither read nor write. Caspian finds Lucy missing and awakens Edmund and the other members of the landing party (except Eustace, who sleeps on). Inside the mansion, Lucy finds the spell book, which she cannot open until she breathes upon it. She finds all sorts of spells inside, including a spell to make snow (she tries it, with success), and a spell to make one beautiful. She tears that page out, and then an angry lion's voice roars at her, rustling the pages. Then she hears Aslan's voice calling her name, after she looks into a mirror and sees her sister Susan's face. Now Lucy returns to the business at hand: she finds the spell to make things visible and says it. Just in time, too, for the inhabitants have captured Caspian and the landing party. When they become visible again, they let their guard down and tell all. Lucy reappears, and introduces Coriakin (Bille Brown), the master of the island. Coriakin apologizes for rendering the monopods (\"Dufflepuds\") invisible, saying that he had to protect them from \"The Evil\", i.e., the force behind the Green Mist. Now Coriakin has something to reveal: an animated, interactive chart of the eastern part of the Great Ocean. He tells Caspian, Edmund, Lucy, and Eustace that they must proceed to Aslan's Table, with a Blue Star to guide them, and lay upon it all of the Seven Swords of Aslan. But he also warns them: \"You are all about to be tested.\" That applies equally to Caspian (who has always felt that he was not the king his father was) as it does to Lucy, Edmund, and Eustace. Dawn Treader then sets out again, this time sailing into a storm. Fourteen days effectively dampen everyone's spirits, except those of Reepicheep, who is hearty enough to accept anything as part of the adventure. Even Captain Drinian is reluctant, but Caspian insists on pressing on and reminds Drinian sharply that they have taken on a crewman and his daughter, who are very eager to find their loved one. During the storm, Lucy has the bad sense to try out the beauty spell. With the result that she becomes Susan, and finds herself with her brothers Peter (William Moseley) and Edmund in America. Problem: no such person as Lucy, and no Narnia, either. Now thoroughly frightened, Lucy awakes with a scream, to find herself face-to-face with Aslan. Aslan chides her for wishing herself away, and doubting her own value--for without Lucy, the Pevensies would never have found Narnia. Lucy, having learned her lesson, burns the beauty spell. The Green Mist briefly appears, and then moves out to the quarters that Edmund and Caspian share. Edmund wakes up to hear a voice he never wanted to hear again: that of his ancient temptress and cruel enemy, the White Witch of Narnia (Tilda Swinton). Then the Mist retreats when Lucy walks in on the boys to say that she could not sleep. Edmund knows why. The next day, the Dawn Treader puts ashore at yet another island. This one is uninhabited for real. Edmund, Lucy, and Caspian descend into a cave, where they find a pool of water with a golden statue at the bottom. Edmund tries to probe it with a broken-off branch--and the branch turns to gold in his hand. Then they realize that the statue is actually one of the Seven Lords, Restimar, now \"aurified\" and dead. They know that they must retrieve Restimar's sword--but Edmund is much taken with realizing that anything dipped into the pool turns to gold. He sees riches for himself, and Caspian sees a resource over which he, as king, should take dominion. Then the two start to argue, and only Lucy's intervention keeps the two from killing each other in a duel. And so they retrieve the sword and leave the pool alone. Eustace, meanwhile, goes off exploring on his own--and finds a rock defile filled with more treasure than he has ever seen in one place: gold, silver, and gemstones, all for the taking. He finds a skeleton (actually that of Lord Octesian) and puts on a gold bracelet that the skeleton had been wearing. That is a mistake. In the next scene, Caspian and Edmund set out to find Eustace, who they assume has strayed form camp. They find his clothing and diary, and fear the worst for him. They then recognize Octesian's remains and recover his sword. Then, out of nowhere, a winged, fire-breathing dragon swoops down from the mountains and alights on Dawn Treader's spar. Drinian leads his men-at-arms in a futile attempt to shoot the dragon off, and then Reepicheep climbs the mast and embeds his tiny sword into the dragon's talon. The dragon shrieks, jumps off, and flies back ashore--where he finds Edmund and Caspian, scoops up Edmund in his talons, and carries him inland, where Edmund reads this legend, burnt into the rocks: I AM EUSTACE. Edmund and Caspian realize the terrible truth: the dragon's treasure turned Eustace himself into a dragon. Lucy manages to relieve Eustace of Octesian's bracelet, which now hurts him terribly. Caspian observes that everyone in the world of Narnia knows that a dragon's treasure is enchanted, hence dangerous to collect or even to touch. Lucy, Edmund, Caspian, Gail, and Reepicheep agree to stay on the island overnight to keep Eustace company and decide how best to accommodate Eustace. Reepicheep actually warms to Eustace and tells him some of his favorite adventure stories. Eustace, unable to communicate, at least seems glad of the company. Reepicheep also suggests to Eustace that his transformation is a sign of an \"extraordinary destiny\" to come. In the next morning, the Blue Star appears to them. Dawn Treader embarks, with Eustace flying alongside. A mermaid tries to warn Lucy that they should sail no further; Lucy does not understand, and Caspian is determined to press on. Soon the ship is becalmed, and the men must fall to with their oars--until Eustace wraps his tail around the ship's figurehead and takes it in tow. That night, Dawn Treader lands at yet another island--Rhamandu's Island, where Aslan's Table is always spread. There the crew find three more of the Lords (Revilian, Argoz, and Mavramorn), not dead but fast asleep and tangled in their own beards. At Caspian's direction, they recover the swords that the Three Lords carried. They lay these, and the swords they brought with them, on the table--but they make only six. They still must recover one more. Then the Blue Star appears to them, and takes the form of a young woman--Liliandil (Laura Brent). She encourages them to eat freely of the fruit of Aslan's Table, and assures them that the three Lords are under a sleeping spell only for their own good, to stop them from killing one another, as they almost did. Liliandil then tells them that they must sail on to one more island: the Dark Island, source of the Green Mist and of every man's nightmare. There Lord Rhoop (Bruce Spence), carrying the last sword, walks that island, mad with fear. This will be their greatest hazard, for the island will make any man's nightmare take real form. Still they sail on to the island, with all hands armed. (Caspian gives his sword, that once belonged to Peter, to Edmund; Edmund gave up his sword at Aslan's Table.) Reepicheep struggles to give Eustace a pep talk, to remind him that, as a dragon, he has much better natural armor and weapons than any other hand aboard, and so should not flinch from battle. As Dawn Treader approaches the Dark Island, the Green Mist reaches out to it, though the men do their best to ignore it. Rhince sees a vision of his missing wife. Drinian sees a thick fog, that robs him of sight. Caspian sees a vision of his father, Caspian IX (Nathaniel Parker), dressing him down. Edmund sees the White Witch, who offers him the same thing that she once offered him many years before: to make him her king. Then they hear Lord Rhoop, shouting at them to keep off. Rhoop bears the Seventh Sword, as everyone thought he would. Rhoop is reluctant to come aboard, but Eustace simply flies to the island, scoops up Rhoop, and sets him on board. Rhoop acknowledges Caspian and warns Caspian that they must put out to sea at once and not think too much. But Edmund thinks of a Great Sea Serpent, which now takes form and attacks the ship. Eustace flies into battle and attacks the Serpent with all the fire he has--but the Serpent takes Eustace in his jaws, flings him this way and that, and throws him onto the rocks. Eustace recovers and blows more fire on the Serpent. Rhoop then foolishly throws his sword at the Serpent. He misses--and the sword embeds itself in Eustace' shoulder. Eustace flies off to Rhamadu's Island and makes a hard belly landing on the sand, as the Sea Serpent wraps itself around Dawn Treader, threatening to crush her. Edmund and Caspian seek to steer Dawn Treader toward the rocks, to ram the Serpent. Edmund challenges the Serpent, using Peter's old sword, while Caspian struggles with the wheel. Caspian's strategy is successful: they manage to stun the Serpent by slamming its head into a rock. Eustace, on the sand bar, wakes up. Aslan appears to him, and with a roar, burns off Eustace' dragon skin. Eustace wakes up, finding himself back in his old form, and with the Seventh Sword nearby. He takes it in hand and realizes that he is on Rhamandu's Island and can walk into the room of Aslan's Table. So while Dawn Treader's crew continue their desperate fight with the Serpent, and Edmund must struggle again with the temptation of the White Witch, Eustace races to the table and lays the last Sword on top of the other Six. The Mist tries to stop Eustace, but he disperses it with the sword. Edmund, of course, can't see Eustace doing this. But suddenly Peter's original sword, which he is carrying, turns bright blue. He realizes at once that the sword now is far more powerful than it ever was. So, though the White Witch (or her apparition) tries to dissuade him, he impales the Serpent with it. The Serpent dies and falls to the shallow bottom. The deep darkness lifts, and Dawn Treader is in daylight again. At Aslan's Table, the Three Lords awaken--and at the Dark Island, now no longer dark, every longboat of slaves that had gone to the Green Mist now comes out to meet Dawn Treader. Rhince and Gael are reunited with Helaine. Eustace then finds himself in the water, swimming to Dawn Treader. Reepicheep jumps in to rescue Eustace--and then they realize that the water is no longer sour, but sweet. Dawn Treader has now come within sight of Aslan's Country. Caspian, Lucy, Edmund, Eustace, and Reepicheep set out alone in a longboat to Aslan's Shore--which has a permanent, stationary breaker of surf on it. Aslan joins them there and informs them that their journey is at an end. Caspian, knowing that he would never return from an adventure into Aslan's Country, decides at the last instant to turn back, and go back to Narnia to govern it properly. Reepicheep is welcomed permanently into Aslan's Country, as has always been his destiny. Edmund says it's time for him, Lucy and Eustace to return home. Lucy understands that for her and Edmund, this is their last time in Narnia; they won't be returning. Aslan tells the Pevensies that they must now learn the name that Aslan bears on Earth, and their time on Narnia was intended to help them do that. Eustace is assured that he might be needed on Narnia once more, in the future. Aslan then sends Lucy, Edmund, and Eustace back to earth, back the way they came. They find themselves back in the room in Eustace' house. Eustace hangs the fallen painting back on the wall--and in it, Dawn Treader is sailing away from them. The film ends with Eustace' last diary record: that in the days that followed, the children spoke often of Narnia, and when the Pevensies leave, as they do once the war ends, Eustace will miss them. (But in a hint of the next intended sequel, Alberta Scrubb, Eustace' mother, shouts up to Eustace that a little girl named Jill Pole has stopped in for a visit.)",
      "writers": [
         "Christopher Markus",
         "Stephen McFeely"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0980970/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjQ2MDQzMzExNl5BMl5BanBnXkFtZTcwMTYzOTc5Mw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ben Barnes, Skandar Keynes, Georgie Henley | See full cast and crew »"],
      "reviews": [
         "I have watched this film in 3d at a preview screening in London. First of all, I do not recommend anyone watching this in 3d. It is too dark and the action is just a motion blur. It's dreadful. As for the film, there is much to enjoy with excellent visual effects, action set pieces (though ruined for me by the 3D) and a couple of stand out characters. But unfortunately there is also much to cringe at in some bouts of terrible dialogue. The characters of Reepicheep (the kick-ass warrior mouse) and Eustace, (the obnoxious brat cousin) were the most fun with the actor playing Eustace demonstrating excellent comic timing. The relationship between them was funny and touching. And they even brought much needed zest to the action. But alarmingly, Edmund and Lucy seem to have deteriorated as actors. Some of their emotions are too forced which is a pity. Not sure why, as I would expect them to improve with each film as did the young cast of the Harry Potter movies. Overall, the story has surprisingly been well adapted considering not a great deal actually happens in the book. But the pacing is good, even though a little episodic. There are much more Christian analogies once again which would please many and irritate others. But I rather like all of the analogies. I do feel however, that amongst adults, mostly those who enjoyed the Narnia books will enjoy this more than non readers of the books because the story is too bizarre even for a fantasy! But I think most children will enjoy this immensely, regardless if they read the books or not. With better written dialogue and better handling of the child performances (namely Lucy and Edmund), this could have been a much better film but as its stands its an enjoyable enough entry in this series. Oh and I will say it again, do not watch this in 3d.",
         "I was SO looking forward to the Voyage of the Dawn Treader, and was sorely disappointed. The film felt like they took the original story, chopped it up, then threw it in a blender with seven magical swords and some ridiculous green mist! While the film stayed true to main themes of the story, much of the character development and purpose to each of the minor island stories was lost. Unfortunately this meant that most of the magic of the story was lost as well. I gave the film 6 stars due to the redeeming qualities that were the stunning visuals, some excellent acting (notably by Will Poulter as Eustace), and a beautifully executed final scene. If you haven't read the book, then you may enjoy this film immensely, but if you are a true Narnia fan, don't go in with very high expectations.",
         "An adaptation of a book can't be completely faithful. We all understand this and accept it: There just isn't space even in a two hour movie to include everything which happens in an entire novel. But this travesty wanders so far away from the source material, introducing an unneeded quest for magical swords and a pointless \"big bad\" invented from whole cloth which adds nothing to the story but merely takes time away from the relevant. Add in the mysterious change of Reepicheep's voice - what happened? Was Eddie Izzard unavailable for this one? - and the lamentable shift from intelligence to brute force as a solution to, for example, the Lone Islands slavery problem and what we have here is a dreadful movie which completely misses the point of the book.",
         "I felt really disappointed when I saw this film. Sure Ben Barnes was great eye candy in this movie but other than that there wasn't anything to enjoy. The book was this adventure story showing the change of Eustace, a self-centered, no-nonsense boy who didn't believe in anything. The movie was a flash from one island to another showing some made up villain in green smoke which was half-fast and not even slightly thought out. I guess the script writers weren't able to grasp what the story was really about and they thought there had to be some visible villain to fight. The whole book was about Man Vs. Self but by throwing in this green smoke that makes you see what you fear it seemed to take away the realness of how horrible even good people are inside. They really managed to destroy their own movie by making that the center of their story rather than having it be the growing up book it really was.",
         "This film is about the Pevensies and their cousin entering Narnia again, in order to help Prince Caspian gather all seven swords of the lords to fight against dark forces. \"The Chronicles of Narnia: The Voyage of the Dawn Treader\" is a good film. It has elements for everyone to enjoy, such as clean humour, excitement, dangers and also psychological elements. The plot is straightforward and easy to understand. It is also filled with excitement, especially the battle with the dragon is quite breathtaking. The plot and the characters engage me a lot. This time, the Pevensies have matured, and hence are a lot less annoying. They even become interesting characters as they battle to overcome their own inadequacies. This subplot is aimed at adults, but it still can be understood by children at face value. The 3D though, is a lot less thrilling than the film. Most scenes do not have noticeable 3D effects. The scenes that do have 3D are quite underwhelming. There are little scenes in the film that makes use of the 3D technology. I can safely say that watching the 2D version would be just as enjoyable than the 3D version, and you can save a few dollars by doing so.",
         "Chronicles of Narnia: Voyage of the Dawn Treader It has been a few years now and a studio, director, and production team change since we last had a Narnia film but finally the third film in the series, The Voyage of the Dawn Treader, has finally come to screen and what can I say? It is well worth your money for you and your entire family to see it. The film is made by 20th Century Fox and Walden Media, directed by Michael Apted, still with actors Ben Barnes as Prince Caspian, Liam Neesan as the voice of Aslan the Lion, Skander Keynes again as Edmund, Georgie Henley as Lucy, with Will Poulter (Son of Rambow) as their cousin Eustace. The story centers around Edmund and Lucy returning to Narnia this time with their whiny cousin Eustace where they meet up with Prince Caspian, now King Caspian, onboard the Narnia ship the Dawn Treader. With years of peace enjoyed in Narnia, they are unsure why they are there but soon find themselves on an adventure to battle a mysterious force that threatened Narnia where they face slavers, dragons, temptation, serpents, and learn to become greater than they ever thought they could be. The film follows the plot of the book very well expanding in order to make it flow as a proper story. The additions are perfectly plausible and make the story more cohesive and unlike the changes in Prince Caspian, improve the story. Flowing along quickly, this is by far the shortest in runtime of the series yet also the most powerful and magical, it starts well and ends on a such a high emotional note there are few that will escape unaffected from any screening. Special effects stand out, with the absence of WETA in the production and special effects I was anxious to see if the new team, actually a fairly large group of small companies, could match what WETA was able to create I am here to tell you YES and in some ways they have surprassed their creations. The dragon and a sea serpent in the film alone are well worth admission, both created with much care and love and really the magic of a fantasy world involved. Other characters from Reepicheep the mouse, a Minotaur, and other creatures are beautiful to behold. The only one that seemed a little down was Aslan who though looking good seems a step down from what WETA created in Lion the Witch and the Wardrobe and Prince Caspian but the rest is so vivid with color and imagination there is little doubt that it will not just capture the imagination of the young but the entire family and keep them from first shot to last frame. Music is another powerful entry, the strong Narnia theme running through this film giving it wonder and magic that belongs in this type of film. The strongest song though involves the arrival of a dragon, a piece with great power and a pulse that gives one of the most powerful scenes in the film even greater amazement and magic. Do you want to capture the imagination of a child and your childhood, an escapist film that will be great entertainment for the entire family? THIS IS THAT FILM! Acting has been hit but this one features better acting and character moments than the other films. With fewer characters than the other two films this one can focus more on the characters and each of the main characters get multiple character building moments that give us greater love and really infuses the film with such emotional power that its hard not to be moved, especially by the climax. Everyone from Edmund to Lucy, to Caspian, to Reepicheep, to Eustace, get powerful scenes that culimate in the strongest ending to a Narnia films and one of the most poignant scenes I have seen in a film in a very long time. Christians out there, do you fear that the Christian themes are stripped out of this movie? Do not fear, this film is as powerfully religious as it is in magic. All of the religious undertones are not covered but are out in the open for all to see. There is no fear, like what Disney had, when it comes to hitting these themes and the director displays them in all their glory with as much power as C.S. Lewis wrote them to be. The 3D of the film was fine, it does not detract now does it really add. I believe one would be fine seeing it or not seeing it in 3D, whatever you prefer. Overall, Voyage of the Dawn Treader is a powerful entry in the fantasy genre, a great film for the entire family, and the type of film that belongs in December and should be watched time and time again by young and old alike! I give this film an 8.5/10.",
         "It's been five years from \"The Lion, the Witch and the Wardrobe\" debuted on theaters. The Pevensies have grown up. The first movie would see a very young Lucy still with a cute face like a first-grader. In this movie, she looks like she's in seventh grade or eight grade. Seems like time flows like Narnian time here. \"Voyage of the Dawn Treader\" marks the third film in the Narnia franchise. It follows King Caspian in a journey to find the seven lost lords of Narnia whom King Miraz banished during his reign in the previous film with his ship, the Dawn Treader. On the way, he met Edmund, Lucy and their pathetic cousin, Eustace Scrubb who turned out to have a change in the movie. However, there's this horrifying green mist that can tempt you to do things that can lead up to bad things and the whereabouts of these lost lords are unknown. So, these people take on a journey that passes the beyond the Silver Sea (which must be really somewhere very east) and to the \"End of the World\". END of the world not those doomsday things. \"Voyage\" is actually a very enjoyable film for both kids and adults alike. The adventures were really great and breathtaking and should be a good way to take people's spare time. Its story is understandable for young kids and its characters are enjoyable and fun to befriend with especially the mouse, Reepicheep. \"Voyage\" will actually give good laughs to its audience with its jokes especially with the appearance of the Pevensies' coward, pathetic Eustace Scrubb who actually changed ever since he visited Narnia. His actions are the main source of laughs here. His acting also maximized the laughs in this film and I think comedy is what strengthens this movie. \"Voyage\" is also powerful in exciting action scenes. This is what seems to be lacking in the previous films even in the climax where it doesn't seem that exciting. \"Voyage's\" climax is very exciting and deserves to be called a climax. The setting of the scene was well-suited and the scene was shot beautifully. Definitely awesome. But, this movie is quite dark for very young children especially in the climax part. It has grown quite scarier than the previous ones. \"Voyage\" also has a new director allowing the series to turn into a quite different style of film. While the previous ones were really too childish, this third one puts on several scenes to attract an older audience. Michael Apted replacing Andrew Adamson is definitely an advance in the Narnia film series. However, Narnian fans will miss Peter and Susan Pevensie as they would not return as main characters but rather just as cameos. The reason in the story why they didn't return is that they're now too old to return to Narnia. This movie will only see two Pevensies plus their cousin, Eustace Scrubb. What a pity. The 3D effects of the film were actually acceptable. They are actually quite conspicuous and are good. 3D or 2D would be OK in watching this movie. You might notice that the Pevensies have grown a lot over the five years gap between the first film and this third film. Compared to the Harry Potter series which had a 3-year gap between the first and third film, Narnia had a longer gap. As it is also a seven-book series, I'm quite worried how it will end up in the final film(even though some of the installments don't include the Pevensies). Let's just hope they have no problem encountering this situation. About its loyalty to the book, the movie did have some changes and some of them are quite major, QUITE not REALLY (be careful). The arrangement of scenes were also ordered in a new way. In the middle of the book starting to the end, that's where the movie's change was big. But, for me, it was acceptable and let's hope that it's acceptable for other fans of the book. \"The Chronicles of Narnia: The Voyage of the Dawn Treader\" (what a long title it is) is absolutely a must-watch film for this holiday season and is very suitable for Christmas. Rather than watching some bloody films people, merry up and rather watch something appropriate for Christmas and in 3D if you prefer. It's definitely great and perfect for families to watch. Prince AJB's Score: 9/10 (90%) Thanks for reading my review and hope it's useful.",
         "I really hope people read this and wait to watch this movie until they can rent it for $1 at redbox. It was awful. Many people have already discussed the primary problems with the film via their *spoiler* reviews... but I have to add my vote in a negative direction. They took the islands out of order. Eustace didn't even try to remove his own dragon skin. They ruined several of the lords. They MADE UP crap about a sword and \"dark mist\". Ramandu wasn't even on his island (thus missing my second favorite part of the book about him growing younger). Lucy just pulled Eustaces bracelet off when it's not supposed to come off easily. The dufflepuds didn't learn how to paddle on their foot... and so many more disappointments. Failure on the part of the producers. Eustace and Reepicheep were the best parts of the movie (really it's only redeeming quality). I honestly almost left after staying up until midnight and paying $14 to see it in 3d. If they make the next movie... please let them consult a Lewis expert. These books are classics and favorites for a reason. It is so vain to think they can \"fix\" them. Grrr.",
         "It's been an overdose of fantasy for me in the last few days I guess. First, in anticipation of Harry Potter and the Deathly Hallows: Part I, I watched all the previous ones at a stretch. For this, I had to do a similar thing. Else how would it make any sense ??? The Narnia series, it seems, is shaping up to be the replacement of the Harry Potter series. We all know that Harry Potter is gonna be done with by the next year. That will leave us with the Narnia series, and with four more movies to go, I suppose that's gonna last a long while till another fantasy movie series pops up. The movie begins with the Pevensies being transported to Narnia \"least when they expected\". This time, they have their cousin Eustace with them who takes some time to accepting the Narnian world filled with talking creatures and other such wonders. He reacts similar to how the Pevensies did when they first saw Narnia, only he's more scared than surprised. Since they've landed in Narnia unexpectedly, there has to be a reason for it. And there is, and a supposedly good one - one which will not only test their battling skills what with dragons, serpents and storms on the way, but also bring them face to face with their inner demons and fears. As far as the similarity of the movie's plot with the book goes, I frankly admit to having no idea regarding that. I've viewed the movie as a movie, as a sequel to the first two and as such, won't be able to comment on how well the movie follows the plot of the book. On the surface of it however, the plot is fairly basic but filled with too many characters to confuse someone who isn't familiar with the books. All the cast members perform well though the star of the show has to be Reepicheep the mouse - he is so endearing that you'd often find yourself rooting for him. And then again there's Aslan the Lion who, in my opinion, is the best (CGI) wonder ever created in the Narnian movie universe. His mere presence in a frame makes it stand out. He appears responsible, wise, calm and like a father figure to the Pevensies and others - the character is so greatly conceived that his mere sight makes you respect him. He truly has the aura of a king and rightfully deserves to be one. And Liam Neeson does a fabulous job of voicing him as do the animators on making him appear life-like. And when the soft and soothing background score plays in the background during his presence, you're bound to feel a lump in your throat. You'll definitely hear a child scream \"Aslan\" in the movie theater when he first arrives. Visually, the film is simply outstanding. Such is the richness of the effects that it makes me wonder how on earth can the film be made on a budget of \"just\" $140 million. I mean, the amount of visual effects present in the film and the quality of each shot is simply brilliant - from the dragon to the serpent to the wide shots of The Dawn Treader to the Islands to the waves to Reepicheep the mouse and finally, the great Aslan. Lighting, it seems has improved to the point that it is difficult to tell what is CGI and what is real. The main musical themes have been recycled from the past films which is a great thing since those themes were simply heart touching, especially Aslan's. The set design is also good although as mentioned, it is hard to distinguish between real and digital sets. Like many movies with excessive VFX, the movie tends to give a slightly more focus to the effects (maybe because it is a children centric film). Although made for children, adults shouldn't find this a reason to stay away from the movie. The movie might tend to get a bit boring at times. And the biggest drawback of the movie is the 3-D which, quite simply, is as good as not there. By all means, you'd be better saving some bucks and watching the movie in 2-D; it might as well also save you a headache. As a matter of fact, the commercial shown during my movie screening had better 3-D that that found in this movie. Despite its drawbacks, it is a good movie and can make for a good viewing with / without family. If not for anything else, I recommend it, For Aslan !!! Score: 6.5 / 10",
         "Today I saw the movie in 3-D and I TOTALLY agree with the minority of people here. I have read all the books of Chronicles of Narnia several times and I really like them. I also have audio books from Focus on the Family's Radio theater. And I like that really too. I almost know some scenes by heart and I was expecting to see those scenes in this movie too. But as I continued watching the movie I realized that all things were ABSOLUTELY screwed up. I thought that I am watching some other movie, not Narnia, that the whole thing was some silly mistake. I was really disappointed and don't know what to think of it at all. I am just hoping that someone will make a remake of the movies in the way that corresponds with the plot of those awesome books and forget what I saw today in the cinema even if I'd have to wait for decades."
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Fox 2000 Pictures",
         "Walden Media",
         "Dune Entertainment"
      ],
      "summaries": [
         "Lucy and Edmund Pevensie are stranded in Cambridge, living in the house of their obnoxious cousin Eustace, while the grown-ups Susan and Peter are living in the USA with their parents. When a painting of a ship sailing on the sea of Narnia overflows water in their room, Lucy, Edmund and Eustace are transported to the ocean of Narnia and rescued by King Caspian and the crew of the ship The Dawn Treader. Caspian explains that Narnia has been in peace for three years but before he took his throne back, his uncle tried to kill the seven lords of Telmar, who were the closest and most loyal friends of his father. They fled to The Lone Island and no one has ever heard anything about them. Now Caspian is seeking out the lords of Telmar with his Captain Drinian, the talking mouse Reepicheep and his loyal men. Soon, they discover that an evil form of green mist is threatening Narnia and the siblings and their cousin join Caspian in a quest to retrieve the seven swords of the seven lords of Telmar to save Narnia from evil.",
         "Lucy and Edmund Pevensie return to Narnia with their cousin Eustace where they meet up with Prince Caspian for a trip across the sea aboard the royal ship The Dawn Treader. Along the way they encounter dragons, dwarves, merfolk, and a band of lost warriors before reaching the edge of the world."
      ],
      "budget": 155000000
   },
   "movielensId": 82169,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-08-13",
      "dvdReleaseDate": "2011-04-05",
      "directors": ["Michael Apted"],
      "runtime": 113,
      "movieId": 82169,
      "title": "The Chronicles of Narnia: The Voyage of the Dawn Treader",
      "mpaa": "PG",
      "actors": [
         "Skandar Keynes",
         "Georgie Henley",
         "Simon Pegg",
         "Gary Sweet",
         "Arthur Angel",
         "Tilda Swinton",
         "Tony Nixon",
         "Shane Rangi",
         "Colin Moody",
         "Ben Barnes",
         "Will Poulter",
         "Terry Norris",
         "Bruce Spence",
         "Bille Brown",
         "Laura Brent",
         "Anna Popplewell",
         "William Moseley",
         "Liam Neeson",
         "Arabella Morton",
         "Roy Billing",
         "Neil G. Young",
         "Greg Poppleton"
      ],
      "imdbMovieId": "0980970",
      "originalTitle": "The Chronicles of Narnia: The Voyage of the Dawn Treader",
      "genres": [
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["hrJQDPpIK6I"],
      "plotSummary": "This time around Edmund and Lucy Pevensie, along with their pesky cousin Eustace Scrubb find themselves swallowed into a painting and on to a fantastic Narnian ship headed for the very edges of the world.",
      "tmdbMovieId": 10140,
      "avgRating": 3.31628,
      "releaseYear": "2010",
      "numRatings": 1965,
      "posterPath": "/pRzEyrMSyvpHf92EhsVSg9Yr81t.jpg"
   }
}