{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "animation",
            "id": 10336
         },
         {
            "name": "tv movie",
            "id": 156321
         },
         {
            "name": "garfield",
            "id": 195032
         },
         {
            "name": "christmas",
            "id": 207317
         },
         {
            "name": "short",
            "id": 214549
         }
      ],
      "imdb_id": "tt0302596",
      "video": false,
      "title": "A Garfield Christmas Special",
      "recommendations": [
         15718,
         261339,
         64170,
         29901,
         36934,
         418956,
         67502,
         100395,
         68486,
         39896,
         40163,
         156468,
         57355,
         109329,
         25400,
         67573,
         26542,
         21386,
         92168,
         69108
      ],
      "backdrop_path": "/m3uBvMxOe0FLaxHBXuf1jJOJxwM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Garfield (voice)",
               "gender": 0,
               "credit_id": "52fe45519251416c7505276b",
               "name": "Lorenzo Music",
               "profile_path": null,
               "id": 78616,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jon Arbuckle (voice)",
               "gender": 0,
               "credit_id": "52fe45519251416c7505276f",
               "name": "Thom Huge",
               "profile_path": null,
               "id": 78617,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Odie (voice)",
               "gender": 2,
               "credit_id": "52fe45519251416c75052773",
               "name": "Gregg Berger",
               "profile_path": "/fIb7F9PiTY8kcWfmRlgZ2G7FMOh.jpg",
               "id": 19547,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Grandma (voice)",
               "gender": 1,
               "credit_id": "52fe45519251416c75052777",
               "name": "Pat Carroll",
               "profile_path": "/u3VKH6kvq3giRZ7UJTaec262HHW.jpg",
               "id": 35232,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Dad (voice)",
               "gender": 0,
               "credit_id": "52fe45519251416c7505277b",
               "name": "Pat Harrington, Jr.",
               "profile_path": "/7msCGb1WjnZbe8osrkgqtL2VcZw.jpg",
               "id": 78618,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Doc Boy (voice)",
               "gender": 2,
               "credit_id": "52fe45519251416c7505277f",
               "name": "David L. Lander",
               "profile_path": "/l4EMljqd2d9L6LTrHN0cmPAlSUw.jpg",
               "id": 78619,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mom (voice)",
               "gender": 1,
               "credit_id": "52fe45519251416c75052783",
               "name": "Julie Payne",
               "profile_path": null,
               "id": 78620,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45519251416c75052767",
               "name": "Phil Roman",
               "profile_path": null,
               "id": 78615,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45519251416c75052789",
               "name": "Jim Davis",
               "profile_path": null,
               "id": 56336,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe45519251416c7505278f",
               "name": "Phil Roman",
               "profile_path": null,
               "id": 78615,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45519251416c75052795",
               "name": "George Singer",
               "profile_path": null,
               "id": 78621,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.456527,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13246,
      "vote_count": 17,
      "budget": 0,
      "overview": "Garfield, Jon and Odie go to Jon's family farm for Christmas, where Garfield finds a present for Grandma.",
      "similar": [
         9479,
         51052,
         11395,
         1585,
         5255,
         8871,
         10719,
         772,
         460793,
         9279,
         9714,
         10510,
         9021,
         11881,
         17979,
         1581,
         10147,
         634,
         13377,
         338964
      ],
      "original_title": "A Garfield Christmas Special",
      "runtime": 30,
      "poster_path": "/93lz2WnLPK4dDHN6knvnaVkzeHD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/e4dCQJpJjwL46i1WuGpTIO3srL6.png",
         "name": "20th Century Fox Home Entertainment",
         "id": 3635,
         "origin_country": "US"
      }],
      "release_date": "1987-12-21",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Phil Roman",
         "George Singer"
      ],
      "runtime": 30,
      "synopsis": null,
      "writers": ["Jim Davis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0302596/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyNzgwNDY4MF5BMl5BanBnXkFtZTcwMjQ4MzYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lorenzo Music, Thom Huge, Gregg Berger | See full cast and crew »"],
      "reviews": [
         "I recently saw this film after many years, and it reminded me of what Christmas should really mean. The holiday should not be about receiving or giving gifts, but the love that one person, or creature can give to another. This is one holiday special that needs to be shown on television more over the Christmas holiday season. Seeing Garfield and Odie, and Jon at Christmas with his parents was just what any person needs over the fast holiday season. With the rush of Christmas, and all the new \"specials\" coming on TV and video, this is one that is really a special, that everyone should watch. This is one special that deserves the 10 out of 10 vote of excellent.",
         "This is definitely a yearly ritual. It has got to be one of my favorite Christmas specials of all time. I think the best part is that Garfield shows his soft side here. This is shown when Garfield sits in Grandma's lap and she tells him about how she misses her husband. Also, when Garfield gives Odie a hug at the end. There's nothing like a good old fashioned Christmas on the farm.",
         "Is it just me or do the Garfield TV specials seem to have a real emotional touch to them that gives the whole series higher integrity than the average children's animation. If only the movie were this good. It's Xmas time once again and Jon takes Garfield and Odie back home to the farm for a good, old-fashioned country Xmas. Originally against the idea, Garfield quickly becomes accustomed when he remembers how much he likes Grandma. John and brother Doc-Boy behave like kids again and can barely contain their excitement at the forthcoming prezzies (who can?) and what on earth is Odie up to in the barn? The Garfield Christmas Special is a warm, sentimental and meaningful cartoon with great songs (once again) and the kind of everlasting charm most would kill for. Highly recommended!",
         "Hey Everyone, Just like all of you, I love Garfield's Christmas! I watch it almost every year, and make the attempt to watch it every Christmas. I never get tired of it. I give it a 10/10! But I have a question, that maybe someone can help me out with. When Garfield is in Grandma's lap, eventually there is a song that is sung. The woman that sings this has a beautiful voice. From doing some searching, I think her name might be Desirée Goyette....not sure. Can confirm for me that this is the singer of that song? More importantly, what is the title of that song. I have tried so hard to get the lyrics, and have failed. I want the full lyrics so bad! The song goes something like this: \"Christmas is here, sleigh bells and laughter. Lights on the tree, everybody is home. And all through the house candles glow.... Keep Christmas here....in your heart!\" I love that song, and I have too get the full lyrics. Can anyone help? Thanks!",
         "If anybody even likes Garfield remotely then they will love this movie, it's funny, heartwarming, and original in one. To begin with I must say that the two best cartoons in my opinion are Charles Schulz' Peanuts and Jim Davis' Garfield. Plot summary: Garfield, Jon, and Odie go to the farm to visit their relatives (e.g. Mom, Dad, Grandma, Doc Boy). Garfield is, like always, pessimistic and hilarious, Jon is as usual optimistic and still in his bunny slippers, and Odie is his sweet old self. The basic things that happen in the movie is that the family puts up the tree, has their little Christmas traditions, and Garfield finds the true meaning of Christmas. Along the way is \"Garfield-packed fun\" with a funny and sweet way of interperating life. This is your basic Garfield, wisecracks about everything and everyone that seem to reach the truth in life like, if I may quote from the movie \"Why do we always put the stupid star on last? Why don't we put the star on first and then put the tree up?\", and this is replied with \"Well it just wouldn't be Christmas if we put the star on the tree first, honey.\" To me that's what we all have to laugh at. To sum it up this is a good movie for anyone (unless you don't like Garfield) and it will make you want to watch it again and again. The is the first time I've given a rating in my report, but for a cartoon movie this is ******** out of 10.",
         "This is why Garfield is a awesome show. I remember watching A Garfield Christmas with my brothers and mom and dad all the time. I always love Christmas movies and shows and this one is one of my all-time favorites. I love Christmas!!! My favorite parts were When Garfield try to put the star on top of The Christmas and come crashing down, When Garfield And Odie gave each other a hug and the family started to sing, when Jon's Grandma was telling Garfield stories about Christmas, and when Jon's Dad read the Brinky: The Clown who save Christmas and was told to say \"HEY KIDS\" A wonderful Christmas for the whole family Check It Out! Merry Christmas!!",
         "The 'Garfield Christmas Special' is another one of those films from my childhood that were much enjoyed and much appreciated. As usual, 'Garfield' brings in some humor followed by some lessons on how to be a good boy. In this film, Garfield goes with Jon to the country to spend Christmas with Grandma. One of the events is Garfield getting a gift for Grandma and learning the true spirit of Christmas. As always, 'Garfield' is enjoyable and educational for children. There is plenty of humor so the film does not 'talk down' the meaning of Christmas. Rather, it makes it enjoyable and makes it understood through emotion. I miss these old Christmas specials. I wish they would show them again.",
         "Garfield's Christmas is one of my family's favorite holiday traditions. We just love watching Garfield, Odie, and Jon team up with Jon's Family, especially Grandma, for some good old family Christmas time together. Odie shows us that its not the gift we get, its the thought and effort put into it. As Garfield tells us, its not the getting, its not the getting, its the loving. And Grandma's memories scene is probably one of the most touching and heart-warming scenes I've seen in any presentation, animated or live-action. Be sure to share this with your family and enjoy all that it has to offer.",
         "Garfield, that loveable fat lazy cat. One of my favourite characters from childhood. I used to get Garfield vids from my local rental store and watch them over and over. All of them seemed amazing at the time but the Christmas special was always my favourite. Now, almost twenty years later the cartoon still receives regular plays in my home. The plot is simple Garfield, Odie and Jon spend a family Christmas in the farm home that Jon grew up in. The songs are great, it's funny, sweet and ultimately moving. It manages to avoid the sentimentality that usually crops up in Christmas specials just by having Garfield constantly undercutting the feel-good nature with cynicism. Show this to the children in your life. It really is magical in a way that all the Disney animations could never be - because it has heart.",
         "Jon Arbuckle takes Odie and Garfield to his family's farm home for Christmas. Jon's excited, but Garfield wasn't as he prefers to have his Christmas back home. Jon is welcomed by his whole family, his parents, his farm hand brother: \"Doc Boy\", and his Rowdy Grandmother. Tis the Season, and Garfield thinks the whole holiday is all about the gifts. But after this holiday Garfield will learn that there's more to Christmas than the gifts themselves. This one is very simple, but very well written. It may take place in one location, but it does have the usual jokes to keep things going. And it's a holiday treat for the die-hard Garfield fans. Or those who like holiday toons."
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy",
         "Family",
         "Musical"
      ],
      "productionCompanies": [
         "Film Roman Productions",
         "United Media Productions",
         "Paws"
      ],
      "summaries": ["Garfield, Jon, and Odie go to Jon's grandmother's house for Christmas, where Garfield finds a present for Grandma."],
      "budget": 0
   },
   "movielensId": 82739,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-12-21",
      "dvdReleaseDate": "2004-10-26",
      "directors": [
         "Phil Roman",
         "George Singer"
      ],
      "runtime": 30,
      "movieId": 82739,
      "title": "A Garfield Christmas Special",
      "mpaa": "G",
      "actors": [
         "Lorenzo Music",
         "Thom Huge",
         "Gregg Berger",
         "Pat Carroll",
         "Pat Harrington",
         " Jr.",
         "David L. Lander",
         "Julie Payne"
      ],
      "imdbMovieId": "0302596",
      "originalTitle": "A Garfield Christmas Special",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Garfield, Jon and Odie go to Jon's family farm for Christmas, where Garfield finds a present for Grandma.",
      "tmdbMovieId": 13246,
      "avgRating": 3.45122,
      "releaseYear": "1987",
      "numRatings": 41,
      "posterPath": "/93lz2WnLPK4dDHN6knvnaVkzeHD.jpg"
   }
}