{
   "tmdb": {
      "original_language": "fa",
      "keywords": [
         {
            "name": "stadium",
            "id": 1485
         },
         {
            "name": "truancy",
            "id": 185311
         },
         {
            "name": "goalpost",
            "id": 185312
         }
      ],
      "imdb_id": "tt0071859",
      "video": false,
      "title": "The Traveler",
      "recommendations": [
         88051,
         64728,
         101382,
         117569,
         8749
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Qassem / Qassem Julayi / Ghāsem Jolā'i",
               "gender": 0,
               "credit_id": "52fe4887c3a36847f816c11b",
               "name": "Hassan Darabi",
               "profile_path": null,
               "id": 1118658,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4887c3a36847f816c11f",
               "name": "Masud Zandbegleh",
               "profile_path": null,
               "id": 1118659,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "59c20488c3a3682c94008469",
               "name": "Mostafa Tari",
               "profile_path": null,
               "id": 1174315,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4887c3a36847f816c105",
               "name": "Abbas Kiarostami",
               "profile_path": "/bK2PXoGS1hcCzGd9OoIkTnJyEYX.jpg",
               "id": 119294,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4887c3a36847f816c10b",
               "name": "Abbas Kiarostami",
               "profile_path": "/bK2PXoGS1hcCzGd9OoIkTnJyEYX.jpg",
               "id": 119294,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4887c3a36847f816c111",
               "name": "Kambiz Roshanravan",
               "profile_path": null,
               "id": 1118656,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "577d4df79251415d9b001727",
               "name": "Firooz Malekzadeh",
               "profile_path": null,
               "id": 1118657,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.716843,
      "production_countries": [{
         "iso_3166_1": "IR",
         "name": "Iran"
      }],
      "id": 54001,
      "vote_count": 5,
      "budget": 0,
      "overview": "The Traveler is a 1974 Iranian drama film directed by Abbas Kiarostami that tells the story of Hassan Darabi, a troublesome, amoral 10-year-old boy in a small Iranian town. He wishes to see the Iran national football team play an important match in Tehran. In order to achieve that, he scams his friends and neighbors. After a number of adventures, he finally reaches Tehran stadium at the time of the match. The film addresses the boy's determination in his goal and his indifference to the effects of his actions on other people, particularly those who are closest to him. In its element, the film is an examination of human behavior and the balance of right and wrong.",
      "similar": [
         9390,
         4942,
         10110,
         22954,
         9377,
         11770,
         984,
         5121,
         149,
         287,
         14013,
         2314,
         130371,
         85814,
         363037,
         2790,
         196177,
         508061,
         332306,
         370318
      ],
      "original_title": "مسافر",
      "runtime": 83,
      "poster_path": "/gscuJ4jNegoOVYqTqHjqwvfT9ej.jpg",
      "spoken_languages": [{
         "name": "فارسی",
         "iso_639_1": "fa"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Kanoon",
         "id": 11459,
         "origin_country": ""
      }],
      "release_date": "1974-01-01",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Iran",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Abbas Kiarostami"],
      "runtime": 83,
      "synopsis": null,
      "writers": ["Abbas Kiarostami"],
      "originalLanguage": "Persian",
      "imdbLink": "http://www.imdb.com/title/tt0071859/",
      "coverLink": null,
      "actors": ["Stars: Hassan Darabi, Masud Zandbegleh | See full cast and crew »"],
      "reviews": [
         "Kiarostami's first feature (made some 15 years before he became the darling of the film festival circuit) tells the story of a troublesome, amoral 10 year old boy (Hassan Darabi), living in a small town in Iran, who wishes to go to Tehran to see Iran's national football team play an important match. To achieve that, he steals money from friends and neighbors through a series of scams. After a number of adventures, he finally reaches Tehran stadium at the time of the match, but there, and without giving totally away the ending, he ends up getting some sort of comeuppance (as usual by Kiarostami, there is a great final shot). One of the remarkable things of the movie is how driven is the boy in reaching his objective, never thinking how what he is doing will affect other people, even those that are closer to him. Also fascinating is the film look at Iranian football culture during the 70s (which wasn't very different to football culture in other countries at the time). Kiarostami has a very fine hand in telling a story sensitively, and he avoids the pretentiousness he showed in later films, after he has been acclaimed by European critics.",
         "Abbas Kiarostami's first feature, \"The Traveler\", may seem at first to be a simplistic film compared to his later, more internationally known works. In the film, Qassem, a ten-year old boy, lives in a small town. He wants desperately to go to Tehran to watch an important soccer match. He ends up lying, cheating and stealing (including a scheme where he charges money to take peoples photos... with no film in the camera) to pay his way to Tehran. He even betrays his best friend. It all seems to pay off when he is able to make it to Tehran. Unfortunately, a few hours before the match he takes a nap in the park. After a horrifying nightmare where all the people he cheated tie his up, hang him upside-down and beat his feet, he wakes up and runs to the soccer stadium. The last shot of the film is an aerial shot of a lone Qassem walking onto an empty soccer field. He missed the game. While the film does seem to have a finger wagging \"this is what happens to bad little boys\" feel to it, it manages to transcend its educational film origins (being produced by the Center for the Intellectual Development of Children an Young Adults), and reveals itself to be on par with the celebrated \"child-on-a-quest\" films that permeate today's Iranian cinema. Despite Qassem's shady behavior, we do feel a certain sympathy for him. We don't support what he does, but Kiarostami does supply us with enough slices of Qassem's troubled home life, that we gain a certain understanding of his desire to get to Tehran. This, to me a least, suggests that Kiarostami was consciously subverting to original intention of the film, which I'm assuming was produced by the CIDCYA in order be shown to children to keep them in line. As I said before, Kiarostami is not encouraging Qassem's behavior, and the dream sequence suggests that Qassem himself realizes his mistakes. At seventy-five minutes the film is incredibly easy to watch and would be a perfect introduction for young audiences to foreign cinema. Afterwards they could discuss the film's multi-leveled qualities and perhaps realize there is more to movies than \"Pokemon\".",
         "The Traveler (Abbas Kiarostami, 1974) Filmspotting had a positive review of the Kiarostami film Close-Up, so I thought I'd give it a go as my knowledge of Iranian films is very slight. When I got it via Netflix, I discovered there was a separate feature on the DVD (I love when that happens!) so on a whim I tried the extra out first. The Traveler is good enough to have warranted its own DVD release, although I'm glad it was included on Close-Up. Kiarostami later referred to it as his first picture, and it's about as good a one as I've seen (short of something like Citizen Kane maybe). The main character is a young boy who will do whatever it takes (including steal and scam) to be able to afford to go to a soccer match in Tehran. I couldn't help but laugh at some of the stunts he pulled, even knowing that if he was my kid I'd have been appalled. The director manages in The Traveler to make the boy a sympathetic character even after you see what he does: for all his questionable behavior (and who at that age doesn't exhibit questionable behavior at some point?) I relate to his loneliness and sadness, and even some of his obsessiveness in pursuing what he wants. The film reminds me of The 400 Blows (as I'm sure it's supposed to) but in some ways it is actually more successful than that Truffaut film in balancing humor with pathos. The final five minutes in particular are terrific. If this is considered a minor work by Kiarostami, then he could well be added to my list of favorite directors soon. 8/10",
         "The Iranian film \"Mossafer\" was shown in the United States with the title \"The Traveler (1974).\" The movie was written and directed by Abbas Kiarostami. Hassan Darabi plays Qassem, a ten-year-old-boy who lives in a small city in Iran. Qassem is obsessed with soccer. When he's not playing it, he's thinking or dreaming about it. Although he's obviously intelligent, he fails subjects because he doesn't do his homework, and he has irregular attendance, and lack of motivation. What motivates Qassem, as we learn when the movie begins, is the intense desire to travel to Tehran to watch an important soccer match. Because he has no money, he has to cheat and steal to obtain the funds. He does manage to get the money and travel to Tehran. The last third of the film chronicles his experiences in and around the soccer stadium. This is an intimate movie about a troubled young man. Even Qassem himself realizes that his methods for obtaining the money are wrong--Kiarostami includes a dream sequence when he is being beaten as punishment for his scams. On the other hand, it's hard not to admire his determination and perseverance. \"The Traveler\" is an fascinating movie. In \"Close-up (1990)\", one of Kiarostami's great films, the protagonist says, \"I am the child from 'The Traveler' who was left behind.\" So, obviously, the film has made its mark on Iranian culture. The final scene ranks with the great last moments of \"The 400 Blows.\" It's a film ending you'll never forget. The movie is rough and grainy, as you'd expect from a film made 40 years ago in Iran. Even so, it's worth finding and seeing. We saw it on DVD, and it worked well on the small screen. The Criterion DVD package of \"Close-up\" includes \"The Traveler\" as a bonus. My suggestion would be to find that DVD, watch \"The Traveler\" first, and then watch \"Close-up.\" Both of the movies will repay your time and effort.",
         "Kiarostami's first feature film. If you've seen any of his later children's movies (e.g., Where Is the Friend's Home?), you'll definitely recognize this as from the same filmmaker. I didn't think it was particularly good, though. Hassan Darabi stars as Quassem, a 12 year-old boy who spends his entire life getting in trouble at school or with his nagging mother. He is kind of a bad boy, and pretty much deserves whatever he gets. The story revolves around Quassem trying to get enough money to attend a soccer match in Tehran. It's hard to really like the film because Quassem is such a brat. He inspires little sympathy. Yes, he does get his comeuppance, and that final bit of the film is sort of satisfying, but there's not much to the film otherwise. Most of it consists of Quassem and a friend bilking the people around them for pocket change, with maybe a good quarter of the film consisting of his annoying mother bitching him out about not doing his homework. This is now available from Criterion, on the Close-Up DVD (or at least the Blu Ray)."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Kanoon"],
      "summaries": ["A grade-school-age boy, neglected by his parents, lies, cheats, and steals to accumulate enough money to afford a bus ride to a large city and a ticket to see his favorite soccer team play."],
      "budget": 0
   },
   "movielensId": 86139,
   "movielens": {
      "languages": ["فارسی"],
      "releaseDate": "1974-01-01",
      "dvdReleaseDate": null,
      "directors": ["Abbas Kiarostami"],
      "runtime": 83,
      "movieId": 86139,
      "title": "The Traveler",
      "mpaa": null,
      "actors": [
         "Hassan Darabi",
         "Masud Zandbegleh",
         "Mostafa Tari"
      ],
      "imdbMovieId": "0071859",
      "originalTitle": "مسافر",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "The Traveler is a 1974 Iranian drama film directed by Abbas Kiarostami that tells the story of Hassan Darabi, a troublesome, amoral 10-year-old boy in a small Iranian town. He wishes to see the Iran national football team play an important match in Tehran. In order to achieve that, he scams his friends and neighbors. After a number of adventures, he finally reaches Tehran stadium at the time of the match. The film addresses the boy's determination in his goal and his indifference to the effects of his actions on other people, particularly those who are closest to him. In its element, the film is an examination of human behavior and the balance of right and wrong.",
      "tmdbMovieId": 54001,
      "avgRating": 3.68182,
      "releaseYear": "1974",
      "numRatings": 11,
      "posterPath": "/gscuJ4jNegoOVYqTqHjqwvfT9ej.jpg"
   }
}