{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "female protagonist",
            "id": 11322
         },
         {
            "name": "bow and arrow",
            "id": 18101
         },
         {
            "name": "game",
            "id": 18249
         },
         {
            "name": "archery",
            "id": 53995
         },
         {
            "name": "fictional tv show",
            "id": 179781
         },
         {
            "name": "based on young adult novel",
            "id": 223438
         }
      ],
      "imdb_id": "tt1392170",
      "video": false,
      "title": "The Hunger Games",
      "recommendations": [
         101299,
         131631,
         1930,
         20352,
         675,
         12445,
         12444,
         1771,
         674,
         767,
         49538,
         24428,
         672,
         671,
         10138,
         1726,
         131634,
         673,
         10195,
         1865
      ],
      "backdrop_path": "/1LTLrl06uII4w2BTpnQnmWwrKi.jpg",
      "revenue": 691210692,
      "reviews": [
         {
            "author": "xenocast",
            "id": "4fce8bc519c29523e00000a4",
            "content": "Very well made movie with quality writing, acting and cinematography. \r\n\r\n**Pros**: strong performance from the star. Technically excellent.\r\n\r\n**Cons**: Seems to me that the ending was premature but perhaps intentionally so - for a sequel? Character development is largely weak but there are a lot of characters and already a long movie so I suspect a lot was left on the cutting room floor.\r\n\r\nDespite some weakness, still a compelling movie worth a watch if not up to all of the hype.",
            "url": "https://www.themoviedb.org/review/4fce8bc519c29523e00000a4"
         },
         {
            "author": "ltcomdata",
            "id": "5054e12e760ee33ef7001c17",
            "content": "Stories about revolution can be quite good.  But stories about why a revolution is needed are invariably great.  The Hunger Games is such a story.\r\n\r\nThe movie (for the most part), closely follows the book, and does a good job of it.  It also sets up the next book/movie beautifully, even better than the book itself does.\r\n\r\nThe premise, of course, is borrowed from Ancient Rome, when gladiators and/or criminals an/or people whom the emperor wanted killed were forced to fight each other to the death in a public arena for the entertainment of the general populace.  And just as decadent as Rome was back then (only rescued from itself by the rise in prominence of The Christian sect), so the \"Capitol\" is now portrayed in the film/book---and the film portrayed the affluent decadence of the Capitol quite well.\r\n\r\nIn this particular instance the \"tributes\" were chosen at random from among children aged 12 through 18, and it was meant as retribution and reminder of the \"crimes\" the 12 colonies committed by reveling against the authority and rule of the Capitol 74 years ago.  At the public \"reaping\", when a boy and a girl were chosen to become the sacrificial tributes at teach of the 12 colonies, the Decree of Punishment was read and the colonies were reminded that this punishment was established to demonstrate how weak the colonies were in comparison with the Capitol, in that the Capitol could take the most prized possessions of the colonies (namely, their children), and the colonists themselves could do nothing about it.  And to really rub it in, the colonists themselves were forced to watch the tournament proceedings.\r\n\r\nI have to say, the punishment is deviously clever from the point of view of the Capitol.  It certainly keeps the Colonies divided in spirit (they were already segregated physically, with no communication between them allowed by the Capitol), for in cheering for their own children they are therefore cheering for the defeat---and therefore death---of the other colonies' children.  It also keeps colonists divided within each colony, for there can only be one champion, which means that in wishing their children not to be chosen at the reaping, each colonist is thereby wishing that someone else's children be chosen.  Furthermore, in celebrating that their children were not chosen, they are also, incidentally, celebrating that some other person's children will likely die.  And for the families of the chosen children, in supporting their own family member during the tournament, they are incidentally supporting the death of the other family's child.  And it keeps the population of the colonies low, which the Capitol would want to promote (less chance for another insurrection if the population is low): for the youngest are taken, before they are married, and those who survive the yearly reapings will think twice about having children of their own and having them go through this traumatic process year after year during their most vulnerable adolescent years.  And furthermore, the Capitol encourages the colonists' tacit endorsement by rewarding the winner's Colony with extra food that year (hence \"The 'Hunger' Games\").  But it is all manipulation, in the end.\r\n\r\nIn fact, by the end of the Games, right before being killed himself, one of the most avid killers among the children realizes just how much it all is the Capitol's manipulation, how pointless it all is to those who participate, and how, in the end, he didn't really have a chance---that he was destined to die from the beginning---and that killing or being killed is all that not only the Capitol, but also his Colony, want from him.  An eye-opening realization for someone who up to this point had been quite eager to kill his fellow children.\r\n\r\nGiven the vicious circumstances which were thrust upon these children---none of which is their fault---the question naturally arises: how should a child bound under the moral law behave?  Should he try to win, by killing the other children?  Should they try to win at all?  Should they let themselves be killed, in order that another might live?\r\n\r\nOf course, the obvious moral choice would be for none of the children to participate in this horrendous form of reality television: if they do not fight each other the show is not interesting, and eventually it is discontinued.  The children would likely still be executed, along with many of their own family members in reprisal from the Capitol.  If one thinks in terms of consequences only (utilitarianism), then this would be the wrong approach: after all, they would say \"it is better that one person survives than that they---and all their families---die\".  But such thinking is quite repugnant, however logical it is.  Consequentialism is missing a big piece of the moral landscape, namely that we ought not to become evil ourselves in our fight against evil.  Yes, the consequences of \"civil disobedience\" as could morally be practiced in this scenario are more dire in terms of the quantity of damage made.  But they are much more preferable in terms of the quality of damage made.  By fully participating in the carnage (and inflicting some yourself) you become complicit in the very evil which oppresses you.  Similarly, your family, and even your colonies (and all colonies, for that matter) become part of the system, and in some tacit way endorse it---for they all want their children to live, and tacitly support the other colonists' children's death.  Furthermore, what kind of person does one become after killing 23 children by brutal means at a very young age (when the impressions of life still shape us in a powerful manner)?  What kind of society does one help create when one has inwardly become a psychotic monster?  What kind of society abides criminal monsters in its midst?\r\n\r\nBut, some will claim, it is unrealistic to expect each and every child to be morally minded, especially when some children (from two different colonies which are highly favored by the Capitol) actually volunteered for the \"honor\" to represent their colonies at the tournament.  What is the correct moral response when civil disobedience is not an option (no opportunity) and some, if not most of the other children are out to kill you, whether by pleasure or need to survive?\r\n\r\nIt seems to me there are two possible moral responses.  one of them is the route of self-defense, whereby one does not intentionally kill or go out of one's way to engage the enemy, but tries to flee as a first alternative, BUT where one DOES defend oneself against the attacks of others, and inflicts only as much harm as is necessary to stop the aggressor, AND only if absolutely necessary one uses lethal force.  In the end, very likely, the Capitol would force matters to a resolution, either by forcing \"aggressors\" and \"defensors\" into a particular area (very good television), or by artificially creating natural/artificial disasters which killed whomever they disliked most.  But, again, this would be the Capitol's doing: an evil force acting evilly which one cannot stop.  One would have been preserved from sinking to doing/becoming evil.\r\n\r\nThe other moral route, the more perfect route, would be the route of Jesus: to willfully become the sacrificial lamb for the sake of spiritual (and therefore) moral change.  The martyrs of the Church have for ages followed this route, to the spiritual benefit of the whole Church, and the cultural benefit of all humanity.  The spiritual benefit is quite and readily seen through the Communion of Saints, whereby these martyr's love renews and creates the Church anew, greatly adding to the spiritual gifts of which the rest of us partake---gifts which slowly transform us for the better, over years and generations.  And it is this transformation which over the centuries affects culture.  Gradually better people live their lives out in gradually better communities.  And Love wins out at the end of time.  After all, very few societies nowadays would consider it acceptable to inflict the tortures which were inflicted to prisoners (especially Christians) in the ancient days of Rome: we are all repulsed by the Capitol's Decree of Punishment.  If we only partook more of those graces which Christ offers through His Church!\r\n\r\nOne particular odd feature of the book (and the film) is the avoidance of any mention of God or religion whatsoever.  Not even empty phrases deriving from religion appear (\"My Gosh\", \"God willing\", Christmas, Thanksgiving, etc.).  Why is that, especially when the subject matter so clearly lends itself to a religious treatment?  Why is that, when the least historically educated among us would have heard the stories of the Christians ushered into the Colosseum to be executed/sacrificed?  The closest religious reference is when Katniss Everdeen improvises a type of tribute around a fallen friend and ally in the game by creating a bed of flowers for her: the very earliest expressions of the religious impulse, as some Anthropologists would tell us.  Why has the author scrubbed her book from religion at all?  Is she so antagonistic to religion that she will not abide it in her book, even when it seems quite apt?  If so, the bed of flowers tell us that the most primitive of religious impulses remain with her still.  Or is the author trying to appeal to everyone, thus removing religion from the surface of her story so as to not alienate people of different religion than the one she chose to portray, while at the same time infusing her work with religious themes at the substrate level, where they are more powerful?  Or is her point that the despotic Capitol destroyed all hope quite successfully, even the Hope of God?  Given the richness of the religious themes I see in this book/movie below the surface, I am very much inclined to believe that the last of these options is the correct one.  But I may be seeing what I want to see, simply because I like the story.\r\n\r\nNow, turning to the more artistic features of the movie: The most impressive performance was done by the actor who played President Snow.  His facial expressions were insuperable and spoke tons in the few lines he delivered throughout the film.  His performance was astoundingly good, his face delivering contempt, skepticism, and hatred (sometimes all at once) along with the \"weight of office\" while speaking seemingly innocuous lines, or even while congratulating the winners (there were two winners from District 12, thanks to the cleverness of Katniss Everdeen in turning the television show against its organizers!) of the 74th Hunger Games.  He single-handedly set up the next movie installment.\r\n\r\nBut the casting of Peeta is all wrong.  From the book it is clear that Peeta is not handsome at all, that Peeta is the boring guy who never had a chance when it came to women, and who doesn't have a chance when it comes to Katniss Everdeen who clearly has feelings for another guy.  Which makes it all the more poignant that he is desperately in love with her, and is willing to give up his life for her.  In the movie he is played by a movie-star-handsome actor who clearly would have trouble keeping women away from him, and who would therefore be quite self-centered and clueless, rather than the thoughtful man he is in the book.",
            "url": "https://www.themoviedb.org/review/5054e12e760ee33ef7001c17"
         },
         {
            "author": "Per Gunnar Jonsson",
            "id": "53fc2f600e0a267a7b009aba",
            "content": "I had not really bothered to put this movie on my to-watch shelf since I felt it was not really my cup of tea but when my wife and oldest son wondered why we did not have it in our collection I thought, well, okay let us get it then. Actually I got the set with the two movies that have been released and yesterday we watched the first one.\r\n\r\nWell, as far as I am concerned, it is not a turkey, it is rather “okayish” but I certainly do not understand all the hype. It is really far from a great movie. But then, I am probably somewhat biased since, as I wrote above, I did not really think this movie was my cup of tea. Anyway, it starts of with a lot of scenes in “wobblycam”. I have not met any person outside of the movie industry and self-proclaimed so-called “critics” that actually likes it when the camera wobbles around, scenes are blurred and you generally get nauseous by watching. Bad start!\r\n\r\nThe backbone of the story is ludicrous to say the least. Part of the world leaves in luxury when the rest is starving. Been there, seen that. Every year a seemingly random selection of kids, not adults but kids, are selected to fight to the death under some silly pretext of “preserving the peace”. As I said, ludicrous. The entire air of ludicrousness is enforced by the wacky costumes, makeup and hair styles of the people in the capitol. As I science fiction and fantasy fan I could easily live with this but, sadly, the movie made me only mildly interested in following the characters to the end.\r\n\r\nThe acting in general is adequate but nothing special. Having said that it must be difficult to actually make anything out of some of the silly roles in this movie. I for sure would laugh my head off every time I entered a scene with all of those ludicrous (yes I know I have used that word a lot in this review, live with it) costumes. The main characters act like the children, with absolutely no clue what they are doing, that they indeed are. This is of course entirely in line with the story but still, the main character is spending a lot of the time running away and sitting around looking startled, sorry or depressed when the games start. I have to say that, at times, the movie felt a bit boring. I have liked several movies that are very slow but here it simply did not sit right.\r\n\r\nThe games themselves with those dickheads in control and the changing rules, well they were mostly frustrating.\r\n\r\nThis movie, to me, is a movie for a young adult audience. I have not read the books and I can see how this kind of story would work for a YA book. Personally I was not unhappy having seen the movie and now, having watched the first of the movies I will watch the rest as well but for me it was okay as a two-hour diversion, nothing more.",
            "url": "https://www.themoviedb.org/review/53fc2f600e0a267a7b009aba"
         },
         {
            "author": "Andres Gomez",
            "id": "54d9b1e7c3a3687ac200128e",
            "content": "I don't really know what's so special about this movie. I found \"The Running Man\" or \"Total Recall\" much more deep thought than this. Is it maybe that the main character is a female?\r\n\r\nStill, it is entertaining and, in this regard, it does its job.",
            "url": "https://www.themoviedb.org/review/54d9b1e7c3a3687ac200128e"
         },
         {
            "author": "DoryDarko",
            "id": "58ac518f92514158df013cca",
            "content": "The Hunger Games is a new concept in a long line of post-apocalyptic future fantasies. Where other stories of the same genre often deal with technology and artificial intelligence as the main threat to human existence, Hunger Games actually takes us back to Roman times, with a revitalised version of \"Panem et Circenses\" or \"Bread and Circuses\". Simply put; human devastation as mass entertainment. Welcome to Panem: formally known as The United States of America, where every year, a young man and woman from each of the twelve districts are selected to fight each other to the death, with only one possible survivor. These Games are broadcasted on national television as a means to keep the people happy and submissive.\r\n\r\nConsidering the fact that this film is based on a teen book series (written by Suzanne Collins), I can't help but feel this concept is pretty far out there, and actually it's kind of sick. It's not a pretty idea to think that one day we might live in a world where watching young people, ranging from 12 to 18 years old, brutally murder each other is considered to be a form of mass entertainment. Thankfully, this is 'just' a story, and I must say, a very entertaining one at that (no pun intended).\r\n\r\nThe story revolves around the two youngsters from District 12, where the people are dirt poor and life is utterly desolate. 16-year-old Katniss Everdeen volunteers as 'tribute' to fight in the Hunger Games, after her little sister is initially selected. Her male counterpart is Peeta Mellark, and together they set off to train for and participate in the Games.\r\n\r\nThe character of Katniss is played by Jennifer Lawrence, and she is terrific. Actually, she is my biggest recommendation for watching this film. Before this, I had only seen her in X-Men: First Class and thought she was pretty good, but after seeing The Hunger Games, it's not hard to see why this 21-year-old already has her first Oscar nomination under her belt. She has a very natural quality about her, which makes it very easy to make you empathise with her character. She's not a superficial, happy-go-lucky kind of girl; she's actually very sullen, not even particularly likable. And yet you just love her from the get go. I guess it's charisma, and Jennifer Lawrence definitely has it.\r\n\r\nActually, this film is full of great actors. One of the greatest is definitely Stanley Tucci, who plays his most flamboyant role yet. His character (Caesar Flickerman, the TV-host who emcees the Games) is ridiculously over-the-top, but brilliantly amusing. With blue hair, prosthetic teeth and a big horse's smile which he flashes incessantly, he looks like a PG-13 version of the Joker. And if you're at all familiar with Tucci's work and talent, you know just what I mean when I say he's making this character appear to be oh-so nice, yet subtly sadistic at the same time. He's just great, period. Woody Harrelson also has a pretty interesting role as Haymitch Abernathy, a once-winner of the Hunger Games, who now mentors Katniss and Peeta in their training. He's scruffy and gnarly, basically just typically another weird Woody character, which is always worth the watch. Wes Bentley plays Seneca Crane, a character most notable for his unusual facial hair: he sports a beard Lucifer himself would be proud of. However, the biggest surprise to me was Elizabeth Banks, whom I am well familiar with, but never really cared for because I only know her from superficial, comedic roles. I was pleasantly surprised to see that she can also play challenging roles like this one. She plays Effie Trinket, a bizarre, neo-Renaissance type from the richest District, big wig, crazy make-up and all. She's pretty much the female version of Tucci's character and she was a delight to watch, beautifully grotesque in all her decadence.\r\n\r\nUnfortunately, it can't all be great. I had three major problems with this film. One: if you haven't read the book, there's a lot that doesn't make sense. They really should have spent a little more time explaining everything, because more than once it simply wasn't clear to me what was going on and why. And that's a risk no filmmaker should take. Two: Peeta's character. It could be just me of course, but he annoyed the crap out of me. He just comes across as such a sissy that it's frustrating to watch. Katniss burns her leg and deals with it. Peeta cuts his leg and stays lying in a cave because he \"can't walk\". And then he lets her take care of him, at the risk of her own life. Give me a break. Three: totally disappointing climax. I was waiting for fireworks, for Katniss having to make brutal decisions, but this never happened. It just kind of faded out.\r\n\r\nAnd this is how you can clearly tell this story has a mainly teenage demographic, and they obviously wanted to keep it PG-13. Because despite the sometimes pretty brutal violence, nasty use of weaponry and tomato ketchup-a-plenty, overall the whole just lacked, well (pardon my French)...balls. You can tell they tried to spike things up a bit here and there, but the film failed to make things truly interesting at moments where it definitely should have been. In my opinion, had they decided to make this rated-R, it would have been infinitely better.\r\n\r\nHaving said that, you can rest assured there is still plenty to enjoy. Visually it is absolutely awesome and simply beautiful. The costumes and make-up are great, as are the CGI effects. The characters (aside from Peeta...) are great, and the whole futuristic 'universe' that is created is pretty inventive.\r\n\r\nThere is actually still a lot more I would like to say, but I've reached my word-limit, so I'll just leave you with this: Thumbs up!\r\n_(April 2012)_",
            "url": "https://www.themoviedb.org/review/58ac518f92514158df013cca"
         },
         {
            "author": "CharlesTheBold",
            "id": "5a04d50c9251413fd60020cd",
            "content": "A powerful movie that crosses several genres.  From various post-apocalyptic movies we are shown the world after a worldwide disaster that has destroyed our civilization and left a more brutal one.  From Spartacus the idea of gladiator games, with the added horror that these \"fighters\"  are children who are presumably too naive to put up any resistance to the regime.   From 1984 we have futuristic technology which can monitor anything the victims do, giving them no privacy in their last moments.\r\n\r\nBut the originality is in the heroine --  a tomboy determined to stay alive without losing her integrity.   How can she keep herself and her friends alive in a fight when only one victim will be allowed to leave the arena intact, and an entire decadent empire is arrayed against her?  This part was given to Jennifer Lawrence, who impressed audiences so well that she inspired numerous later action heroines --  Tris in DIVERGENT, Wonder Woman, Arya Stark, and others",
            "url": "https://www.themoviedb.org/review/5a04d50c9251413fd60020cd"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Katniss Everdeen",
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0cdb",
               "name": "Jennifer Lawrence",
               "profile_path": "/hLzgl1dS8O2IAn1PIwHYhxR0Lkm.jpg",
               "id": 72129,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Peeta Mellark",
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0cdf",
               "name": "Josh Hutcherson",
               "profile_path": "/nbq1QWACCGEtPjL5MQeFlTLvgST.jpg",
               "id": 27972,
               "order": 1
            },
            {
               "cast_id": 35,
               "character": "Gale Hawthorne",
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d37",
               "name": "Liam Hemsworth",
               "profile_path": "/eVeBiqx1vTsd1QCHOr24Cf13wb.jpg",
               "id": 96066,
               "order": 2
            },
            {
               "cast_id": 38,
               "character": "Haymitch Abernathy",
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d43",
               "name": "Woody Harrelson",
               "profile_path": "/tFAngknlbFZebWVMaFFLFIsFvLE.jpg",
               "id": 57755,
               "order": 3
            },
            {
               "cast_id": 37,
               "character": "Effie Trinket",
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0d3f",
               "name": "Elizabeth Banks",
               "profile_path": "/t6sfUzvQkMZu3wh4LMNBFxEmiDy.jpg",
               "id": 9281,
               "order": 4
            },
            {
               "cast_id": 43,
               "character": "Cinna",
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d57",
               "name": "Lenny Kravitz",
               "profile_path": "/dGtP6VFtjHkvoDaEGktzTC7oDOQ.jpg",
               "id": 77069,
               "order": 5
            },
            {
               "cast_id": 36,
               "character": "Caesar Flickerman",
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d3b",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "order": 6
            },
            {
               "cast_id": 46,
               "character": "President Snow",
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d63",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 7
            },
            {
               "cast_id": 40,
               "character": "Seneca Crane",
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d4b",
               "name": "Wes Bentley",
               "profile_path": "/fbHHalL9CS52zvJp015G31vwX23.jpg",
               "id": 8210,
               "order": 8
            },
            {
               "cast_id": 75,
               "character": "Claudius Templesmith",
               "gender": 2,
               "credit_id": "56539a819251417010001045",
               "name": "Toby Jones",
               "profile_path": "/eOZe7EZ0Ojq8PaIn1HLVex5dZwc.jpg",
               "id": 13014,
               "order": 9
            },
            {
               "cast_id": 44,
               "character": "Cato",
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d5b",
               "name": "Alexander Ludwig",
               "profile_path": "/oqhDHWdyD5ZSkZnulVQc9e24KE4.jpg",
               "id": 23498,
               "order": 10
            },
            {
               "cast_id": 45,
               "character": "Clove",
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0d5f",
               "name": "Isabelle Fuhrman",
               "profile_path": "/9AHGx2wd6CeRsC7nD8fH7fgwWR3.jpg",
               "id": 77517,
               "order": 11
            },
            {
               "cast_id": 42,
               "character": "Rue",
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0d53",
               "name": "Amandla Stenberg",
               "profile_path": "/w1rlIXKUZFeVU1JRmZI2B6YBSk2.jpg",
               "id": 561869,
               "order": 12
            },
            {
               "cast_id": 39,
               "character": "Primrose Everdeen",
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0d47",
               "name": "Willow Shields",
               "profile_path": "/c9Zna579entVQBdx7kTtKJjl9CB.jpg",
               "id": 530025,
               "order": 13
            },
            {
               "cast_id": 86,
               "character": "Hob Vendor",
               "gender": 1,
               "credit_id": "56539e64c3a36850f3001199",
               "name": "Sandra Ellis Lafferty",
               "profile_path": "/x84X0jwGl063wTGSmw7M8J0SxhS.jpg",
               "id": 427,
               "order": 14
            },
            {
               "cast_id": 41,
               "character": "Katniss' Mother",
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0d4f",
               "name": "Paula Malcomson",
               "profile_path": "/mqiiy0HXExPYaIczPxWFRDGqhwA.jpg",
               "id": 47533,
               "order": 15
            },
            {
               "cast_id": 87,
               "character": "Registration Woman",
               "gender": 1,
               "credit_id": "56539eb6c3a36850fa00121f",
               "name": "Rhoda Griffis",
               "profile_path": "/f4jlWaOllPPQXzNnNDapJ5mlLjI.jpg",
               "id": 51456,
               "order": 16
            },
            {
               "cast_id": 88,
               "character": "Peeta's Mother",
               "gender": 0,
               "credit_id": "56539f9fc3a36850f600103a",
               "name": "Raiko Bowman",
               "profile_path": "/5AJliNu1trIdGJJkewIHpVjAtvI.jpg",
               "id": 1539949,
               "order": 17
            },
            {
               "cast_id": 89,
               "character": "Peacekeeper #1",
               "gender": 0,
               "credit_id": "5653a0ba925141701e00111b",
               "name": "Dwayne Boyd",
               "profile_path": "/eDCLsIoogMrmA32ju2vOzJNAYst.jpg",
               "id": 83602,
               "order": 18
            },
            {
               "cast_id": 90,
               "character": "Peacekeeper #2",
               "gender": 0,
               "credit_id": "5653a0c59251417010001114",
               "name": "Anthony Reynolds",
               "profile_path": "/qxyE7oezAs67CYP5NaFTObiJXGm.jpg",
               "id": 1088938,
               "order": 19
            },
            {
               "cast_id": 91,
               "character": "Peacekeeper #3",
               "gender": 2,
               "credit_id": "5653a0d39251417010001118",
               "name": "Judd Lormand",
               "profile_path": "/aCsSFZuik9bIJGpa7H3ELTC7fQi.jpg",
               "id": 990136,
               "order": 20
            },
            {
               "cast_id": 53,
               "character": "Flavius",
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d6b",
               "name": "Nelson Ascencio",
               "profile_path": "/xdxsCTSOATrUmXsGUloTOtjIO1J.jpg",
               "id": 197350,
               "order": 21
            },
            {
               "cast_id": 93,
               "character": "Octavia",
               "gender": 1,
               "credit_id": "5653a231c3a36850ec00112d",
               "name": "Bruce Bundy",
               "profile_path": "/ninlliNqIFZQOunn0LDkzQVSNE4.jpg",
               "id": 1090027,
               "order": 22
            },
            {
               "cast_id": 94,
               "character": "Portia",
               "gender": 0,
               "credit_id": "5653a37792514170250010cb",
               "name": "Latarsha Rose",
               "profile_path": "/vdEfMh6qNPAxzCougHssdCyZqx0.jpg",
               "id": 1471589,
               "order": 23
            },
            {
               "cast_id": 71,
               "character": "Thresh",
               "gender": 2,
               "credit_id": "54e9da08c3a3684ea6003317",
               "name": "Dayo Okeniyi",
               "profile_path": "/vRZ0pA5b7lePzHDWL3UPgGGFEdT.jpg",
               "id": 1030512,
               "order": 24
            },
            {
               "cast_id": 47,
               "character": "Glimmer",
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0d67",
               "name": "Leven Rambin",
               "profile_path": "/5jdHzpHDYXmMdNoCtXSf4axrqb7.jpg",
               "id": 207401,
               "order": 25
            },
            {
               "cast_id": 56,
               "character": "Marvel",
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d6f",
               "name": "Jack Quaid",
               "profile_path": "/jPBmqN3eNPHBh04AkK5ruGFFcOi.jpg",
               "id": 1030513,
               "order": 26
            },
            {
               "cast_id": 97,
               "character": "Fox Face",
               "gender": 0,
               "credit_id": "5653a3f5925141701500114c",
               "name": "Jacqueline Emerson",
               "profile_path": "/klWg787Cfvdd1bZilmzdUMogMhR.jpg",
               "id": 1529411,
               "order": 27
            },
            {
               "cast_id": 70,
               "character": "Tribute Boy District 3",
               "gender": 2,
               "credit_id": "54de8e7692514119530021d8",
               "name": "Ian Nelson",
               "profile_path": "/sO5c4rLCKZiSHHWjsfikNwCck8g.jpg",
               "id": 1348957,
               "order": 28
            },
            {
               "cast_id": 95,
               "character": "Tribute Girl District 3",
               "gender": 0,
               "credit_id": "5653a392925141701e00115f",
               "name": "Kalia Prescott",
               "profile_path": "/i9QZB7B0m3aYqmo8gNaDBKnTeal.jpg",
               "id": 1446018,
               "order": 29
            },
            {
               "cast_id": 96,
               "character": "Tribute Boy District 4",
               "gender": 0,
               "credit_id": "5653a3ccc3a3685100001236",
               "name": "Ethan Jamieson",
               "profile_path": "/9RY3iMRE8If9BHWXD2LKFPoJrVS.jpg",
               "id": 1539950,
               "order": 30
            },
            {
               "cast_id": 65,
               "character": "Tribute Girl District 8",
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0d8b",
               "name": "Mackenzie Lintz",
               "profile_path": "/5TZ6hz7T6fcfhLDYgtOl0YHe1l3.jpg",
               "id": 1286617,
               "order": 31
            },
            {
               "cast_id": 98,
               "character": "Tribute Girl District 9",
               "gender": 0,
               "credit_id": "5653a43492514170210011b0",
               "name": "Annie Thurman",
               "profile_path": "/aX1VSpjrpSvM5LbxHWGRL4XZ0n0.jpg",
               "id": 1131606,
               "order": 32
            },
            {
               "cast_id": 135,
               "character": "Tribute Boy District 9",
               "gender": 0,
               "credit_id": "58da63c4c3a3686d67009c8a",
               "name": "Imanol Yepez-Frias",
               "profile_path": "/3DMPEXezYlgg86k8fcXjEkJDyqo.jpg",
               "id": 1785178,
               "order": 33
            },
            {
               "cast_id": 99,
               "character": "Tribute Girl District 10",
               "gender": 0,
               "credit_id": "5653a467c3a36850f0001015",
               "name": "Dakota Hood",
               "profile_path": "/obEgWvILrred8GZYU4vDNNnFw8j.jpg",
               "id": 1539952,
               "order": 34
            },
            {
               "cast_id": 100,
               "character": "Avox Girl",
               "gender": 0,
               "credit_id": "5653a4fec3a36850fa00131e",
               "name": "Amber Chaney",
               "profile_path": "/nzAOvC1pDGKbj3Cqtm5Yuc5M9JU.jpg",
               "id": 1367298,
               "order": 35
            },
            {
               "cast_id": 101,
               "character": "Atala",
               "gender": 0,
               "credit_id": "5653a52ac3a36850f300127b",
               "name": "Karan Kendrick",
               "profile_path": "/cY8HkrWGR4Ux5uYpYMIChXJU36S.jpg",
               "id": 935721,
               "order": 36
            },
            {
               "cast_id": 102,
               "character": "Katniss' Father",
               "gender": 0,
               "credit_id": "5653a54ac3a36850fa001334",
               "name": "Phillip Troy Linger",
               "profile_path": "/tzhOipu67uFqZu63CltKfYZtjS6.jpg",
               "id": 158045,
               "order": 37
            },
            {
               "cast_id": 114,
               "character": "Venia",
               "gender": 1,
               "credit_id": "56653ae5c3a36851180015c8",
               "name": "Kimiko Gelman",
               "profile_path": "/mtSlCXexPxaz9vC37DFrjehuiZ4.jpg",
               "id": 155862,
               "order": 38
            },
            {
               "cast_id": 136,
               "character": "Hovercraft Tech",
               "gender": 1,
               "credit_id": "58da6505c3a3686d49009d3d",
               "name": "Kate Kneeland",
               "profile_path": "/jv2FbzzMaY7Xub173735i9fjUE5.jpg",
               "id": 1785189,
               "order": 39
            },
            {
               "cast_id": 137,
               "character": "Game Center Tech #1",
               "gender": 2,
               "credit_id": "58da6908c3a3686d820099e9",
               "name": "Steve Coulter",
               "profile_path": "/v1cwS9Ia89pO154Wje3m4IxuI3.jpg",
               "id": 80619,
               "order": 40
            },
            {
               "cast_id": 138,
               "character": "Game Center Tech #2",
               "gender": 1,
               "credit_id": "58da6920925141143400acd5",
               "name": "Sharon Conley",
               "profile_path": "/fC9nUwBut9uLnGwMxHWHhSZcJ4t.jpg",
               "id": 142374,
               "order": 41
            },
            {
               "cast_id": 139,
               "character": "Game Center Tech #3",
               "gender": 0,
               "credit_id": "58da695bc3a3686d77009ff4",
               "name": "Tim Taylor",
               "profile_path": "/hALkAxuJtPlZA2y5HiJ304kexqP.jpg",
               "id": 1042243,
               "order": 42
            },
            {
               "cast_id": 140,
               "character": "Game Center Tech",
               "gender": 2,
               "credit_id": "58da6bbac3a3686d5f00ab70",
               "name": "John William Ross",
               "profile_path": "/q3if3kApfQ7Zm6Z3MvM3eb2sFBg.jpg",
               "id": 1698179,
               "order": 43
            },
            {
               "cast_id": 134,
               "character": "Martha (uncredited)",
               "gender": 1,
               "credit_id": "57c72c889251412f9b007c66",
               "name": "Julie Ivey",
               "profile_path": "/wquYh5Vxy3W3OvC8bMLic85KOJY.jpg",
               "id": 1084211,
               "order": 44
            },
            {
               "cast_id": 141,
               "character": "Coal Miner (uncredited)",
               "gender": 0,
               "credit_id": "58da6f24c3a3686d3100b3b5",
               "name": "Bill Bennett",
               "profile_path": "/zKF8BvSoapHVLgXyCddFZ0gUQdX.jpg",
               "id": 1435432,
               "order": 45
            },
            {
               "cast_id": 142,
               "character": "Capitol Citizen (uncredited)",
               "gender": 0,
               "credit_id": "58da6f39925141143400b19c",
               "name": "Jeremy Bonham",
               "profile_path": "/pe2v46ItOytL3yNC2pfUvopvgPU.jpg",
               "id": 1785235,
               "order": 46
            },
            {
               "cast_id": 143,
               "character": "District 12 Citizen (uncredited)",
               "gender": 0,
               "credit_id": "58da6fdcc3a3686d82009f12",
               "name": "Mary Fox",
               "profile_path": "/lfb22RwjfzdWXY1RHtlsaV29Pxt.jpg",
               "id": 1785242,
               "order": 47
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0ccb",
               "name": "Gary Ross",
               "profile_path": "/dMoUDOJHsGrQcxKpFgbuMWRwiyI.jpg",
               "id": 23964,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47edc3a368484e0e0cd1",
               "name": "Suzanne Collins",
               "profile_path": "/hGVzeiNwffKyfV1baRJTgu2GlgN.jpg",
               "id": 189111,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0cd7",
               "name": "Gary Ross",
               "profile_path": "/dMoUDOJHsGrQcxKpFgbuMWRwiyI.jpg",
               "id": 23964,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47edc3a368484e0e0ce5",
               "name": "Nina Jacobson",
               "profile_path": null,
               "id": 935634,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0ceb",
               "name": "Jon Kilik",
               "profile_path": null,
               "id": 4446,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47edc3a368484e0e0cf1",
               "name": "Robin Bissell",
               "profile_path": null,
               "id": 38270,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47edc3a368484e0e0cf7",
               "name": "Suzanne Collins",
               "profile_path": "/hGVzeiNwffKyfV1baRJTgu2GlgN.jpg",
               "id": 189111,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0cfd",
               "name": "Louise Rosner-Meyer",
               "profile_path": "/1jRjnQRnwecGu9mk2IKIZJNg0R8.jpg",
               "id": 56327,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d03",
               "name": "Tom Stern",
               "profile_path": null,
               "id": 460,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d09",
               "name": "Philip Messina",
               "profile_path": null,
               "id": 1890,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d0f",
               "name": "Stephen Mirrione",
               "profile_path": null,
               "id": 1891,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0d15",
               "name": "Juliette Welfling",
               "profile_path": null,
               "id": 4280,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0d1b",
               "name": "Judianna Makovsky",
               "profile_path": "/fdRHxR0k3b95mY8p3VOzFTFN2p9.jpg",
               "id": 10970,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0d2d",
               "name": "Debra Zane",
               "profile_path": null,
               "id": 495,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe47edc3a368484e0e0d7b",
               "name": "Robert Fechtman",
               "profile_path": null,
               "id": 8281,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d81",
               "name": "Paul Richards",
               "profile_path": null,
               "id": 138379,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe47edc3a368484e0e0d87",
               "name": "Larry Dias",
               "profile_path": null,
               "id": 21984,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe47edc3a368484e0e0d91",
               "name": "Ve Neill",
               "profile_path": "/gNYwxuK5Z7Nr3tWtSWv0qAueUIs.jpg",
               "id": 406204,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "5305c5f492514134881a6942",
               "name": "T Bone Burnett",
               "profile_path": "/xK2Cw6ryClj4gcXscwnZfzkaTN3.jpg",
               "id": 1483,
               "department": "Crew",
               "job": "Executive Music Producer"
            },
            {
               "gender": 2,
               "credit_id": "5305c5c8925141349e17a4a7",
               "name": "James Newton Howard",
               "profile_path": "/5UTEMYS7rydwe7ooOmj2dLRFuu2.jpg",
               "id": 1213,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "55cdff11c3a3681bf50020aa",
               "name": "Billy Ray",
               "profile_path": "/c607NMZCDpKlsJVuGUaD9wvglUk.jpg",
               "id": 21807,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "567a89c692514106f10020da",
               "name": "Curtis Edwards",
               "profile_path": null,
               "id": 1552805,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "59125c319251414e8004b1cb",
               "name": "Karin Silvestri",
               "profile_path": "/dQ9YCbXe3DjOMhFp2jOgefCqj4x.jpg",
               "id": 1813644,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 0,
               "credit_id": "565396e7c3a36850ea000fad",
               "name": "Suzanne Collins",
               "profile_path": "/hGVzeiNwffKyfV1baRJTgu2GlgN.jpg",
               "id": 189111,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56539adf925141701e001072",
               "name": "Chantal Feghali",
               "profile_path": null,
               "id": 9776,
               "department": "Production",
               "job": "Co-Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "56539af29251417019001011",
               "name": "Aldric La'Auli Porter",
               "profile_path": null,
               "id": 6187,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "56539afe9251417025000fb9",
               "name": "Martin Cohen",
               "profile_path": null,
               "id": 328645,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "56539b5dc3a36850ea001024",
               "name": "Louis Phillips",
               "profile_path": null,
               "id": 1539947,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "56539c76925141701000108c",
               "name": "Bryan Unkeless",
               "profile_path": null,
               "id": 1539280,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "56539cc8925141701b000fd1",
               "name": "Diana Alvarez",
               "profile_path": null,
               "id": 1539948,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "56539cffc3a36850ea001070",
               "name": "Lon Bender",
               "profile_path": null,
               "id": 16736,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 1,
               "credit_id": "56539dae92514170130010b7",
               "name": "Louise Rosner-Meyer",
               "profile_path": "/1jRjnQRnwecGu9mk2IKIZJNg0R8.jpg",
               "id": 56327,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "56539de0c3a36850fa00120b",
               "name": "Donna Sloan",
               "profile_path": null,
               "id": 72956,
               "department": "Production",
               "job": "Executive In Charge Of Production"
            },
            {
               "gender": 2,
               "credit_id": "5653a564925141701900113a",
               "name": "Chad Stahelski",
               "profile_path": "/hr82USXEc8XWvdnH0TpyddMpi7j.jpg",
               "id": 40644,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 2,
               "credit_id": "5653a57bc3a36850fc0010d2",
               "name": "Allan Poppleton",
               "profile_path": "/6mqfdFE2w2a3ZoFzeRZdx0Bxn1b.jpg",
               "id": 132639,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5653a60492514170100011bd",
               "name": "Lindsey Moran",
               "profile_path": null,
               "id": 1103717,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "5653a621c3a36850ec0011b3",
               "name": "Patrick Loungway",
               "profile_path": null,
               "id": 12575,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 2,
               "credit_id": "5653a64ec3a36850fa001354",
               "name": "Michael Keller",
               "profile_path": null,
               "id": 158916,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "5653a6619251417019001153",
               "name": "Michael Prestwood Smith",
               "profile_path": null,
               "id": 1539958,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "5653a66dc3a36850ea001189",
               "name": "Christopher S. Capp",
               "profile_path": null,
               "id": 21700,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5653a685c3a36850ea00118c",
               "name": "Dawn Gilliam",
               "profile_path": null,
               "id": 1403421,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5653a69ac3a368510000128f",
               "name": "Douglas Dresser",
               "profile_path": null,
               "id": 1389626,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5653a6b892514170100011d3",
               "name": "S. Todd Christensen",
               "profile_path": null,
               "id": 223242,
               "department": "Production",
               "job": "Location Manager"
            },
            {
               "gender": 0,
               "credit_id": "567a882f92514106fc002048",
               "name": "Linda D. Flowers",
               "profile_path": null,
               "id": 1408293,
               "department": "Costume & Make-Up",
               "job": "Hair Department Head"
            },
            {
               "gender": 0,
               "credit_id": "567a886192514106f1002095",
               "name": "Cindy Ichikawa",
               "profile_path": null,
               "id": 935491,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "567a88f4c3a3685bbf00227e",
               "name": "Eric Hance",
               "profile_path": null,
               "id": 1552802,
               "department": "Visual Effects",
               "job": "3D Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "567a892bc3a3685bbc002305",
               "name": "Colin Brady",
               "profile_path": null,
               "id": 78009,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "567a894592514106f10020bf",
               "name": "Dino Athanassiou",
               "profile_path": null,
               "id": 43102,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "567a895b92514106f5002088",
               "name": "Kristin Solid",
               "profile_path": null,
               "id": 1393014,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "567a897392514106eb0020f8",
               "name": "Daniel Jeannette",
               "profile_path": null,
               "id": 1552803,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "567a899f92514106fc002083",
               "name": "Wayne Lewis",
               "profile_path": null,
               "id": 1552804,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "567a89ee92514106eb002110",
               "name": "Todd Mesher",
               "profile_path": null,
               "id": 1552806,
               "department": "Crew",
               "job": "Digital Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "567a8a0492514106e80020d2",
               "name": "Brennan Prevatt",
               "profile_path": null,
               "id": 1552807,
               "department": "Crew",
               "job": "Digital Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "567a8a1d92514106eb002118",
               "name": "Mark Rodahl",
               "profile_path": null,
               "id": 1552808,
               "department": "Crew",
               "job": "Digital Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "567a8a69c3a3685bc7001fa3",
               "name": "Amy Spanner",
               "profile_path": null,
               "id": 1552809,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "567a8a8092514106fc0020a3",
               "name": "Eric Withee",
               "profile_path": null,
               "id": 1546811,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "567a8abbc3a3685bc30021f9",
               "name": "Sean Rourke",
               "profile_path": null,
               "id": 1552810,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "567a8ad892514106f90021ca",
               "name": "Shawn Broes",
               "profile_path": null,
               "id": 1459895,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 2,
               "credit_id": "567a8af092514106fc0020b3",
               "name": "Sean Lahiff",
               "profile_path": null,
               "id": 1327334,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "567a8b10c3a3685bc3002213",
               "name": "Alex Meddick",
               "profile_path": null,
               "id": 1394026,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "570bbc75c3a3681d2400cc68",
               "name": "John Collins",
               "profile_path": null,
               "id": 1025712,
               "department": "Art",
               "job": "Supervising Art Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 23.753514,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 70160,
      "vote_count": 11319,
      "budget": 75000000,
      "overview": "Every year in the ruins of what was once North America, the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games.  Part twisted entertainment, part government intimidation tactic, the Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains.  Pitted against highly-trained Tributes who have prepared for these Games their entire lives, Katniss is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy.  If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love. The world will be watching.",
      "similar": [
         131631,
         198663,
         101299,
         157350,
         76341,
         262504,
         315837,
         281,
         604,
         605,
         335984,
         333339,
         9323,
         10881,
         9482,
         7512,
         9739,
         9381,
         82654,
         21356
      ],
      "original_title": "The Hunger Games",
      "runtime": 142,
      "poster_path": "/iLJdwmzrHFjFwI5lvYAT1gcpRuA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/cisLn1YAUuptXVBa0xjq7ST9cH0.png",
            "name": "Lionsgate",
            "id": 1632,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Color Force",
            "id": 5420,
            "origin_country": "US"
         }
      ],
      "release_date": "2012-03-12",
      "vote_average": 6.9,
      "belongs_to_collection": {
         "backdrop_path": "/zWiiLNg8yXv0he3tCH6XignPaYV.jpg",
         "name": "The Hunger Games Collection",
         "id": 131635,
         "poster_path": "/ttbKy12hDjSHQcM7sCoeW1WsDlW.jpg"
      },
      "tagline": "May The Odds Be Ever In Your Favor.",
      "adult": false,
      "homepage": "http://www.thehungergames.movie/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Gary Ross"],
      "runtime": 142,
      "synopsis": "The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as the Hunger Games. In punishment, and as a reminder of the power and grace of the Capitol, each district must yield one boy and one girl between the ages of 12 and 18 through a lottery system to participate in the games. The 'tributes' are chosen during the annual Reaping and are forced to fight to the death, leaving only one survivor to claim victory. Katniss Everdeen ( Jennifer Lawrence) is a 16 year-old girl from District 12, a coal-mining region and the poorest of the districts. This year is the 74th Hunger Games and during the Reaping, Katniss' younger sister, Primrose ( Willow Shields), is chosen as a tribute. Refusing to let her sister be taken, Katniss volunteers herself instead, becoming District 12's female tribute. The male tribute chosen is a baker's son named Peeta Mellark ( Josh Hutcherson) who is later seen during a flashback giving bread to Katniss to prevent her family from starving. Despite the threat of the games, Katniss dreams of making a new life for herself and her family 'outside the fence' with her friend, Gale Hawthorne ( Liam Hemsworth). She tells him that she never wants children and, despite her dreams, is realistic in knowing that if she and Gale tried to leave they would be caught. Before she leaves, Katniss comforts her mother ( Paula Malcomson) and tells her to stay strong for Primrose. Katniss and Peeta are taken from their district by the gaudily dressed Effie Trinket ( Elizabeth Banks) and travel to the Capitol. En route, they are fed rich food and treats but are disgusted by the amount of luxuries given to them and the occupants of the train while their families starve at home. They are introduced to their 'mentor' and a former winner of the Hunger Games, Haymitch Abernathy ( Woody Harrelson) who appears to be a pessimistic alcoholic. Haymitch grabs a drink and food before leaving their train car. Katniss and Peeta later reunite with Haymitch in another car and he tells them that the key to survival is ensuring they are well liked by the public so that they may get sponsored. By having sponsors they will have more access to survival tools such as matches, knives, or even water and medicine. When they arrive in the gleaming city of the Capitol, the train is greeted by a cheering crowd. Peeta waves to the residents but Katniss refuses to show herself. Haymitch warns her that she better hold on to her knife and that Peeta actually knows what he is doing by feeding the crowd. Katniss meets her stylist, Cinna ( Lenny Kravitz), who tells her that, as tributes, they need to make an impression on the audience so they're remembered, especially by the sponsors. Cinna proclaims that someone as brave as Katniss should have a great costume for the Gala Entry Parade in which each pair of tributes wears an outfit reflecting their district's trade. Katniss and Peeta wear black costumes with actual fire emanating from them to symbolize the coal-mining district they reside from. As Cinna hoped, they make a great impression on the audience. Peeta takes Katniss' hand and raises it into the air during the parade for more effect. After the parade the pair go to their penthouse. The tributes under-go basic weaponry and combat training including the use of knives, swords, and bows. In spite of this training their trainer stresses that survival skills should not be underestimated as exposure and infection can kill just as effectively as any sword. One tribute named Cato ( Alexander Ludwig) is hot-headed and imposing, proving to be a possibly serious threat. Later, over a meal, Haymitch tells Peeta and Katniss about the Careers district from which Cato comes from. All of the possible tributes train until they're 18 before openly volunteering to participate in the Hunger Games. Haymitch warns them that they win almost every year due to that fact before asking about Katniss' bow and arrow skills. Katniss refocuses on Peeta, describing his impressive strength, but he rebuffs her compliments and confesses that his own mother ( Raiko Bowman) thought Katniss to be the superior tribute. When Peeta is bullied by the other tributes during training, Katniss suggests he show off his strength by throwing a large weight across the room. Peeta manages to perform the feat successfully and gains a small amount of respect from the tributes. Later, in succession, each tribute is instructed to show off to the game makers and sponsors, including Seneca Crane ( Wes Bentley). When it's Katniss' turn, she decides to show off her archery skills. However, she misses her first shot badly and loses what little attention she already had. Despite her perfect second shot, she doesn't regain their respect. Angered by the sponsors' attitude towards her, Katniss fires an arrow straight through an apple in a roasted pig's mouth, right in front of the stunned sponsors. Katniss sarcastically thanks them for their consideration and leaves. The tributes' scores are then displayed on a television screen, ranking from 0 to 12. Many tributes achieve high scores of 9 to 10, including the Careers Cato and his partner Clove ( Isabelle Fuhrman). Peeta receives an 8 while Katniss scores an 11, the highest of all the tributes. The President of the Capitol, Snow ( Donald Sutherland) addresses Seneca and tells him that the Hunger Games is about giving the districts hope but that too much hope can actually be dangerous. During another meal, Haymitch tells Katniss about Peeta's decision to go without his help because of the fact that there can only be one winner. On the extravagant Hunger Games TV chat show, each tribute is introduced individually and interviewed by the flamboyant host, Caesar Flickerman ( Stanley Tucci). Katniss elicits laughs from the audience during the interview and impresses them by showing off her dress which displays real fire as she twirls. Ceasar gives her the nickname 'girl on fire'. During his interview, Peeta eats the audience up, garnering some laughs himself. It is then that he announces his crush on Katniss, something which angers her intensely. Backstage Katniss pins Peeta to the wall, demanding answers for his behavior. Haymitch separates the two and explains that he could sell the pair as star-crossed lovers which might gain them sponsorship support during the games. Just before the games, Haymitch warns Katniss to avoid the bloodbath at the beginning by heading to the high ground in search of water despite having to leave her bow and arrow behind. The tributes are all injected with a tracking device in their arms as they travel via helicopter to the outdoor arena. The tributes are then taken underground where they report to certain checkpoints before being loaded onto platforms that deliver them to the ground level of the arena. Before she is hoisted up, Katniss says farewell to Cinna who has seen her off. He tells her that, if he was allowed to bet, he would be on her winning. Then she, along with the other tributes, are raised into the arena and a countdown to the Hunger Games begins. As the horn sounds, the tributes rush towards the center cornucopia full of weapons and backpacks, brutally attacking and killing each other in the process. Katniss manages to grab a pack and barely escapes Clove, who embeds a knife in her backpack. Once at a safe distance, Katniss finds a rope, an empty canteen, and a coat inside the backpack. She takes Haymitch's advice and locates water in a nearby stream before she ties herself high up in a tree for the night and attempts to get some sleep. Loud bangs from a cannon indicate the deaths of tributes and we learn that thirteen were killed within the first 8 hours. During the games, Caesar keeps the public up to date with the happenings and announces that an alliance has formed. Katniss witnesses from her tree perch that Peeta has joined with a group of Careers during the night with the intent on leading them to her. While exploring the next day, Katniss gets too close to the outer regions of the arena. The game controllers decide to start a forest fire to lure her further in to the center. She barely manages to escape but does receive a nasty burn on her thigh, causing her to limp. She is then spotted by Cato and 4 other tributes, including Clove and Glimmer ( Leven Rambin) who have banded together. We learn that, apparently, the Careers come, collectively, from Districts 1, 2, and 4 who are trained illegally before volunteering to fight; this group of 4 from two districts chases Katniss who eventually escapes by climbing a tree. Cato attempts to follow her up but is unsuccessful. Peeta suggests that the group wait for Katniss to eventually come down for food and water. The group settles for the night beneath the tree and Katniss ties herself to the tree to sleep. She is woken later that night by a parachute containing much needed medicine for her leg wound, sent by Haymitch. She applies the medicine to her burns and they disappear as if nothing happened. Her attention is then caught by a young 12 year old girl in an adjacent tree named Rue ( Amandla Stenberg) from District 11. Rue, however, is friendly to Katniss and points out a large trackerjacker nest just above Katniss and dangling over the Career group below. We learn that trackerjackers are genetically engineering wasps whose stings are highly venomous and can cause powerful hallucinations. With enough stings, they can even kill. Katniss climbs up the tree towards the nest and begins sawing at the branch holding it up. The trackerjackers become irritated and start stinging her but, eventually, the branch snaps and the nest falls to the ground, exploding in a wave of wasps. The Careers group flees but Glimmer is stung too many times and succumbs to the venom. Katniss manages to climb down the tree and manages to grab a bow and arrows. As she begins to hallucinate, she sees Peeta approach her and seemingly yell at her to run. Regaining some sense, Katniss escapes but eventually collapses. After a night of hallucinations and nightmares, some involving her father ( Phillip Troy Linger), Katniss awakens beneath a tree trunk with leave bandages covering her stings. Unclear as to who exactly helped her, Katniss stumbles around, thinking it must have been Peeta. Rue appears and tells her that she was out cold for 2 days and that she's been the one taking care of her. The two girls decide to team up and go on the offensive. They form a plan to destroy a mountain of food and supplies located in the starting meadow that the Career group is guarding. Rue is to start small fires to distract the remaining Careers while Katniss detonates the booby-trapped mines surounding the mound. They agree to use mockingjays, birds that mimic any tune, to signal to each other. The plan works. The Careers become distracted by the smoke of the fires while one tribute, a boy from District 3 ( Ian Nelson), remains at the cornucopia, standing guard. Katniss then notices a female tribute unseen by the others. Foxface ( Jacqueline Emerson) from District 5 sprints towards the pyramid of food and supplies, unnoticed by the guard. She picks her way through the mines, steals a backpack, and makes it back into the forest with great cunning. Katniss then shoots at a bag of apples on top of the pile which causes them to cascade down and detonate the mines. The pyramid explodes, sending food and supplies everywhere. Katniss watches, triumphant, as the Career group rushes back to the clearing. Infuriated, Cato demands to know how such a thing could have happened. The guard tribute from District 3 is equally confused but Cato's anger makes him murderous and he snaps the boy's neck. Katniss leaves, disturbed by Cato's ease to kill. She uses the bird call system to find Rue but receives no response until she hears a scared voice calling to her. Katniss finds Rue trapped under a net and releases her just before theyre attacked by Marvel ( Jack Quaid), a tribute from District 1. Marvel throws a spear but Katniss dodges the attack and shoots an arrow into his chest, killing him. However, when she turns to Rue, she sees that Marvel's spear has gone through her chest. Distraught, Katniss tries to calm Rue and sings to her peacefully as Rue dies. Katniss then gathers flowers from the forest and spreads them over Rue before her body taken back to her district via hovercraft. Meanwhile, Rue's father is horrified and angered by his daughter's death and starts a riot. His district follows his rebellious example and they destroy the stage showing the games. As Katniss makes a peace gesture to the camera, the 'Peace Keepers' of District 11 arrive and shoot Rue's father dead. President snow is enraged by the rebellion in District 11 and wants to change the game's rules and circumstances to ensure that Katniss is killed. Haymitch pleads with Seneca to keep Katniss alive, issuing a ploy of teen romance as a main reason. Seneca then announces that the rules of the game have been changed; two winners instead of just one will be allotted so long as they belong to the same district. With this knowledge, and having just overheard the remaining Careers mention leaving Peeta for dead by the river, Katniss sets out in search of him. She finds a trail of blood near the river and follows it to where Peeta has camouflaged himself in the rocks. Katniss helps move him to a nearby cave where they are well hidden. Katniss attempts to heal Peeta's sword wound but realizes he has blood poisoning, something that can only be cured with a special medicine. Katniss despairs as there could be no way Haymitch could send some since it would be too expensive at this point. However, as if by magic, an announcement rings out that there will be a feast at the cornucopia for all the tributes but, instead of food, there will be something each tribute desperately needs. Peeta begs Katniss not to leave him and risk her life trying to save him. He asks her to stay and Katniss reluctantly agrees, though she knows there may very well be medicine at the cornucopia that could save his life. The two share a brief kiss, partly as a way to gain more sponsors. However, this hits a nerve with Gale watching back home who is clearly smitten with Katniss. Katniss waits until Peeta has fallen asleep before leaving for the cornucopia. When she arrives, she sees Foxface sprinting towards the supplies, surprising the other tributes with her speed and escaping without much incident. Katniss decides to mimic Foxface's moves and sprints out to grab the medicine but is thrown off guard when she is hit with a knife launched by Clove. The two wrestle and fight before Clove manages to get the upper hand and presses a knife to Katniss' throat. She teases her with bloodlust and mocks her for teaming up with the 'little monster from District 11'; Rue. Before Clove can slit Katniss' throat, she is lifted by Thresh ( Dayo Okeniyi), the male tribute from District 11, and thrown against the cornucopia wall. He proceeds to beat her to death against the wall despite her cries for Cato. Thresh tells Katniss that she gets this one chance since she helped Rue but, after this, everything is fair game. Katniss escapes. She returns to the cave with the medicine and administers it to Peeta and herself, healing their wounds. In a more genuine romantic moment, the two fall asleep in each other's arms. The next day, they split up to find food. During her hunt, Katniss hears a cannon signaling another tribute death. Panicked, she runs back to where she last saw Peeta. She finds him near a berry bush, standing bewildered with a handful of berries near the corpse of Foxface, also with berries in her hand. In a mix of anger and relief, Katniss slaps Peeta, telling him that the berries are Nightlock and extremely poisonous. The pair wonder if Cato would ever fall for the same trap that Foxface did before they notice that the sun is going down at mid-day. Unsure of what's to happen, they freeze and ready themselves for an impending attack. In the distance, Thresh cries out followed by the sound of the cannon, signaling his death. They pause for a moment before a giant mutated dog leaps out at them, vicious and the size of a polar bear but with much more speed and agility. Katniss and Peeta sprint through the forest as two more of the dogs begin to pursue them. They are chased to the cornucopia where Peeta helps Katniss climb on top of it, barely making it up himself. They sit back in relief thinking the dogs will kill the last survivor, Cato, and they will be crowned the victors. Cato, however, is also on top of the cornucopia and attacks Katniss, attempting to throw her to the dogs. The three fight each other and Cato grabs Katniss by the throat, holding her near the edge of the structure before Peeta manages to fight him off her. Cato gets the upper hand and gets Peeta in a choke hold to either break his neck, as seen before, or throw him to the mutant dogs. Katniss unsheathes an arrow and points it at him, uncertain whether to shoot or not. Cato, dripping blood, laughs sadistically, telling her that he knows what the games are about now. The tributes aren't just entertainment; they're all weapons designed to make the spectacle of death as painful and unnecessary as possible. Peeta, who is still being choked, appears to try and tell Katniss something while Cato talks. Cato asks if she shoots him, then her 'lover boy' goes down with him. Katniss shoots his hand, forcing him to let go of Peeta. Peeta then pushes Cato off the edge to be mauled by the dogs. Katniss and Peeta watch a moment as Cato is savagely attacked before Katniss shoots an arrow into him, ending his misery. The last cannon goes off and Katniss and Peeta realize they've won the Hunger Games. They embrace and wait for a helicopter to come take them home. No helicopter comes. An announcement then states that the rules which allowed two winners has been revoked, meaning only one shall remain. Peeta begs Katniss to kill him so that she may win but she takes out her hand and holds out some Nightlock berries. She takes some for herself and gives the rest to Peeta, hinting that she'd rather the Capitol have no winners instead of one. Before they can commit suicide, a speaker pleads them to stop and announces that they have both won. They are brought back to the Capitol where Haymitch tells them how foolish they are to have defied the Capitol like that and instructs them to play up the star-crossed couple routine at their final interview. They oblige but Haymitch relents that it will never be enough for the Capitol. We see Seneca Crane being led into a finely polished room. The door is locked behind him while a goblet is set on a pedestal in front of him, containing Nightlock. Although we do not see it, we are led to believe that he is forced to commit suicide. Peeta and Katniss travel back in District 12 by train. Although they are met with a hero's welcome, Haymitch warns Katniss that she is now a political enemy after such a public defiance against the society's leaders. They are greeted by a crowd of cheering residents including Primrose, Katniss' mother, and Gale. Peeta takes Katniss' hand and holds it up in the air. President Snow watches the District 12 welcome from the Capitol. Walking away, he wonders what to do about the two victors and the feelings of rebellion they may have created in the Districts.",
      "writers": [
         "Gary Ross",
         "Suzanne Collins"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1392170/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4NDg3NzYxMF5BMl5BanBnXkFtZTcwNTgyNzkyNw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jennifer Lawrence, Josh Hutcherson, Liam Hemsworth | See full cast and crew "],
      "reviews": [
         "What a bitter disappointment! In order to explain what is missing from the film, please allow me to describe what I love about the books. Suzanne Collins creates a moving portrayal of a girl living under a cruel dictatorship. Set against a background of extreme poverty, these books show how the unequal distribution of wealth affects Panem's society. Those living in the wealthy Capitol have so little in common with the destitute people from the Districts that they regard the deaths of District children as entertainment. The violence in The Hunger Games is shocking because it is brutal and unnecessary, yet wholly embraced- even celebrated- by Capitol residents. As for the District tributes, they are not enemies but they kill each other all the same, some reluctantly and others with enthusiasm. As the trilogy progresses, it becomes a compelling commentary on the madness of war and the sad futility of violence. However, these themes are woven into the books in such a way that you may not even notice they're being discussed. You become so immersed in Katniss's world that poverty is a given, and violence a sad but expected part of life. The film follows the basic storyline but lacks emotional depth. The character development is almost nonexistent and the deaths in the arena are bloodless in every sense of the word. The tributes are little more than walking stereotypes so their deaths have no impact. Even Rue's death- heart-wrenching in the book- is little more than a side note in the movie. If I hadn't read the books, I don't think I would have understood the dynamic between the tributes at all, including the conflicted relationship between Katniss and Peeta. Their romance comes across as cheesy and unconvincing. There is no hint of the bond that grows between them as the story progresses. Perhaps my biggest criticism of this movie is that no one seems to be going hungry! I cannot believe the filmmakers overlooked this important point. The Capitol's exploitation of the Districts is supposed to be the backdrop for the entire story. When Katniss arrives in the Capitol and observes how food appears at a touch of a button, she cannot understand how Capitol residents fill their time. The majority of her days are consumed with feeding her family. It defines her. Most of the tributes have never had enough to eat and this is a major factor in the Games. The beginning of the movie seemed promising. The ominous mood in District 12 was just right. It is apparent that the people who live there are exhausted and resigned to their fate. When residents appear for the reaping, they look like cattle being rounded up for slaughter. The Capitol, in contrast, is frightening in it's frenetic artificiality. This juxtaposition was well-done. However, the filmmakers lost me when the tributes entered the arena. There was no sense of tension. The tributes make all kinds of noise as they move through the woods, seemingly oblivious to the fact that they are being hunted. Katniss stands about ten feet away from Cato as he snaps a boys neck and we are supposed to believe he doesn't see her? The scenes from the control room are pointless and add nothing to the movie. They should have spent that time on character development! Unfortunately, this lack of character development causes the emotional scenes to fall flat. I am astounded this was even possible, given the subject matter, but the overall result lacks intensity and depth. I will credit Elizabeth Banks with an excellent portrayal of Effie Trinket. She adds humor and a sense of the absurdity of Capitol life. Donald Sutherland also does well as President Snow. Jennifer Lawrence is an adequate Katniss but Josh Hutcherson is terrible as Peeta. He's just not very likable. We see none of his inner strength. Instead, he comes across and whiny and weak. And Wes Bentley seems to be included just to showcase his ability to grow an amazing beard. One more thing. What happened to Haymitch?! He's supposed to be a self-destructive drunk! His cunning is all the more unexpected because he seems incapable of taking care of himself. I was thrilled when they cast Woody Harrelson and he does well in some parts but it seemed like they had to water down his character to market it to young adults. This movie had a lot of potential but it fell short in many important ways. A score of 3/10 is pretty harsh but I felt as though the filmmakers kept all of the plot points and none of the meaning. Read the books instead.",
         "OK, first let me admit that I haven't read the books, and I didn't even know they existed: I was taken to the cinema by my girlfriend, who saw something in the trailers I didn't which made her all excited. So, I sat there with a clear mindset, no expectations, no prejudice, no background info whatsoever. First things first: whoever invented the the \"let's shake the camera all around because it makes the movie so much more lifelike\" and convinced others to follow him or her, should be shot. Twice, in fact, just to be sure...It is really annoying, and so unnecessary: it is not making anything more real. For me, in many cases the hectic and jerky camera movement seemed to be only a poor attempt to mask fact that there is nothing (or not much) happening, but it tries to make it look intense and action packed regardless. So cheap...and apart from pissing me off, it didn't work at all, but I admit I well may be a minority... The story feels like it is hanging in the air. Again, I didn't read the books so the scenes may have been adequately set there, but in the movie you get 10 lines, and off you go...and it doesn't add much depth later on either. The most fundamental question remained: what's the point? Sending 2 dozens of younglings to slaughter won't hold aggression at bay in itself, actually it is more likely that the infuriated parents driven mad from the grieving over the unnecessary and pointless death of their children will cry for revenge and go into resistance, or even spark a brutal bloodbath (especially that it is an annual event, so sooner or later everyone will be affected by friends or family). Also, the scale is hanging in the air too, you don't know how the 2 opposing populations (the \"citizens\" of the shiny new world and the habitants of the 12 district) relate to each other, which would be rather pivotal. I won't go on with the many potholes, the bottom line for me is that the scene was set simply poorly. The story, well, is very simple and straight, once you stepped over the inadequate surroundings. Feels painfully unfinished, and though I din't know there is a series behind, I told to the (rather disappointed) missus in the end that it must be so because they already have a sequel in mind. Knowing that gives a little excuse, but still left a hollow \"is this really it?\" kind of feeling in the both of us. The striking similarities with Battle Royal I'll leave alone... Acting was OK, considering the absurdity of some of the characters and the whole context (background and story). I'm sorry, I'm not a big fan of the lead actress (Jennifer Lawrence), as I didn't even know her before this movie (althogh I saw and really liked First Class, but somehow couldn't connect). Regardless, she does a good job of portraying and transferring the tension, fear and uncertainty of the situation she is pulled into, at least a good number of scenes, in fact her efforts were one of the few \"ups\" for me among the many \"downs\" during that long 2,5 hours. Kudos to Elizabeth Banks as well for creating a \"sugar-monster\" character, and also for the fact that though I know her face well enough (just seen in Man on the ledge), here I simply couldn't recognise :) Based on the movie itself, I really don't know how this can be so popular, but I admit I'm probably not the target audience, and also the books may be much better (well, it wouldn't be difficult as the bar is set really low). Donald Sutherland was brilliant saying \"only hope is stronger than fear\", but that and Ms Lawrence's occasional shine doesn't make this worth to sacrifice and evening for. I have a frequent visitor card so it didn't cost me anything, but if I've paid almost 10 quids for this, I would be rather upset...",
         "Simply, many over the age of 18 read these books and loved them, and it wasn't because there was a girl, a boy, and another boy in a love story. It was about an awful political system where children faced to the death for their survival with awful paragraphs of cruel brutality. This is part of what made the book unique. The movie, was an attempt to draw a crowd like Twilight for money, and completely blurred out children killing each other to survive so that it could be made PG13. Ridiculous. Jennifer Lawerence is an AWESOME actress though, and she did a great job. Throughout the movie I was never convinced that she lived in district 12 nearly starving... or that Peeta was dying in the hunger games.. it was all very pretty and not anything like I imagined they would do with it. Oh well, maybe they'll remake a rated R version some day that adequately portrays the books theme.",
         "The start of the movie is so obvious, with a tiny little girl scared out of her wits who has no business being in the Hunger Games, most predictably the lead actresses little sister it was obvious she was going to take her place. Even more less surprising we find out that the boy going with her has a crush on her. On to 1 hour and 15 minutes of Woody Harrelson being not nearly believable enough as a crude alcoholic become soft hearted, a lot of senseless dinners, a lot of hype for the contestants we know nothing about, absolutely no politics or explanation of what the Hunger Games actually are or how it came about, and an awful underlying message sent out to viewers. \"Just be yourself, but do what everyone expects!\" Katniss went from being tough, to a weak and sleepy survivor. Are you bored yet? So, they get thrown out into the Hunger Games, there is absolutely no build up whatsoever. The only person you know is out there is Katniss and the boy who came with her. The rest of the contestants you don't know, hardly have a clue as to what they're capable of, most of them die at the start anyway. Katniss runs away from the initial slaughter, to take a nap. Then she takes more naps. At one point out of the blue she finds herself in the middle of fiery doom, with fireballs launching at her, she barely survives. Well, lucky for her, though we were never told. she has some sponsors save her, with the help of a silent montage of Woody Harrelson laughing with a bunch of poorly dressed somebodies. She gets saved with super healing medicine! She takes more naps. Later, we find out the boy who has a crush on her is teamed up with the last of the jerks, for some reason, in a game where only one survives, there are people who travel in groups. Okay? Why??? They make some pathetic attempts to kill her, then give up and sleep. Kat makes a new friend who seems to be the most resourceful, herbal expert. She tells her to dump a bunch of insects on them. Then while it takes forever for her to saw a tree limb off, we're told these are evil, dangerous insects that will kill you. How convenient! She gets stung a few times, and conveniently kills a girl with the bow and arrows, which just so happens she's an expert with. How lucky! Too bad she was stung by these insects, now she's going to take more naps and be saved somehow... by a tiny girl who knows herbal remedies. Wish we would have known that! They turn out to be good pals, what a surprise that is. Well, after a lot more boring stuff of not getting to know anything about what is going on, they randomly decide to go find out what the meanies are up to. Turns out, they gathered all the supplies and somehow found a bunch of land mines to surround the pile. Okay? What's that supposed to do? Apparently, some girl isn't part of their group, she expertly dodges every land mine and gets away with something. So, instead of gathering some supplies, Katniss blows it all up. Then... runs away! Katniss and her little pal find each other, but get attacked, Kat swiftly dodges a spear throw, and sticks the attacker with an arrow. The attacker dies instantly. But finds out poor little girl was stuck by the big spear. Except it takes FOREVER for her to die, we don't know anything about this character, so we don't care, so the long drawn out death is stupid. Well, Kat runs off alone and finds her boy who has a crush on her. For some reason untold he's not with the group anymore and he's badly injured somehow. Okay, they hobble off after way too long, and then find a cave where it takes way too long for them to get things going. She decides to go off on her own for some supplies, and gets attacked by a girl who takes too long to kill her, but some other guy out of the blue SAVES Katniss... for absolutely NO reason, and then... just leaves her alone! In a game where only one survives, with the perfect opportunity to turn the odds in his favor... just leaves her alone! She goes back, takes a lot more time, and finds out there is only one person left? Really? Thanks for showing us some of the action... but anyway they leave the cave, and the Hunger Game... techs, or IT people or whatever they are, unleash a bunch of dogs that are really big and full of muscle. Kat and her boyfriend OUTRUN all of them to a huge metal platform where they're surrounded by blood thirsty animals... who could easily make the jump to the top of the platform... don't. Instead the last guy, whoever he is, is bloody and looks like he can barely move, beats the crap out of both of them. How he got by the dogs is beyond me... but whoever can do that must be amazing, until, Kat shoots him in the hand with an arrow. This causes him to fall off and get eaten by dogs. But Kat feels sorry for him, and puts him out of his misery. After this, there is nothing really to note. Nobody says anything important and nobody cares, they just wish it would end, because they don't really know what happened at all. They don't really know anybody but Kat, Donald Sutherland gives some meaningless scornful look, and walks off and the credits roll.",
         "Let me start by saying that I'm a huge fan of the \"The Hunger Games\" book series by Suzanne Collins. I've read them countless times and when I found out they were making a movie of them a little over a year ago I was very excited. But I was also worried. \"The Hunger Games\" is not very easy source material. The book is written in first person narrative with very detailed descriptions of everything form the characters' looks to the strange futuristic devices they use in Panem, the future version of the U.S. where the story takes place. I couldn't imagine that they would be able to convey every detail as I had imagined it and make the story believable without an R-rating or a huge budget. All of my concerns were wiped away when I saw the movie. I've never seen a more faithful adaption of a book in my life. All of the costumes, the sets, the locations, the cast (I'll talk more about them in a while) and the pacing is as if they were exactly replicated from the book. And the small things that do differ or are added (such as more insight to the gamemakers' control room) only add to the amazing world Collins created and improve the narrative movie-wise. And the movie is great for people who haven't read the books as well. Not once did I feel as if something was vague or badly explained. The cast is stellar. Jennifer Lawrence as Katniss carries the movie and makes me regret complaining about her casting because she was too \"hot\" and not starved enough. She IS Katniss and one can feel the graveness of an situation just by looking at one of her expressions. Josh Hutcherson as Peeta is also a true breakout performance. The way he looks at Katniss will makes girls all over the world envy her, just like it's supposed to be. Other standouts in the cast include Stanley Tucci as the flamboyant talk-show host Caesar Flickerman, Woody Harrelson as the sarcastic but caring mentor Haymitch and Wes Bentley as the sinister game-maker Seneca Crane (his final scene might be the best one in the whole movie). The child actors Willow Shields and Amandla Stendberg who portrays Prim and Rue are believable and heartbreaking even though they're inexperienced. Despite the PG-13 rating the movie doesn't gloss over or sugarcoat anything for their audience. The violence may not be gloriously graphic but it's still there. People will feel the tributes' pain and despair and not even realize the violence isn't gory until you've left the theater. The movie also deals with important themes like survival, governmental control, grief and helplessness. There is a minor love story subplot, but it doesn't distract from the movies main themes. In my opinion I think it rather improves them by showing some light in the dark. The only complaint I can think of is that the movie feels too short. It's almost two and a half hours long, but it feels as if it goes by in a blink. I will have to see it again to fully pay attention to every detail (such as the costumes and animation of the Capitol, which looked amazing). But this is still not me saying that the movie is rushed, because as I stated the source material is very dense and the filmmakers managed include almost everything. People are expecting this to become the next Twilight-style teen movie franchise. I can't say I think the two stories have anything in common even though I hope \"The Hunger Games\" will do as well at the box office. But if the first movie is any indication of the quality of what's to come - this will be a series way out of Twilight's league.",
         "like everyone else, before going to the movies I stopped on IMDb and read a few criticisms of the film - both those with better than average grade, and worse. But I think it's finally time to wonder what is the purpose of this time consuming ritual. because when a little thought, in few years back, i found that just a couple of films is well characterized with the average grade on this site. but here, not only that I stopped with this habit, I decided to write my first review. for me like for many others with first reviews, trigger is terrible dissatisfaction with seen. I did not read the book nor did I know until yesterday that this film is another adaptation. for the book I do not know, but the movie turned out, on my sorrow, to be for children up to 14 years maximum - the magic of 21st century and advertising machinery. After the first few minutes of the film when you realize you're 28 year old who is stuck with teenage movie and after you realize what would not just the end, but everything, look like, you tell yourself: ''sit back and at least try to enjoy visual side of the movie''. but that too ceases to be an option once you realize that you are about throw up because some producer decided it was more fun instead of continuous motion of camera to record in the way: cut-ear, cut-leg, cut-tree in the background,cut-somebody runs, cut-Hair... and all that in 0.3 second and from different - all possible angles. must be seen to be believed. but even that is not the worst, because imagine what the feeling of nausea you get when you realize that the hour of the movie is spent to describe the characters and get nothing better then awful clich: bad guys are trained, arrogant bullies that smile too much and of course despite the superhuman strength, arrogant like that, they must be kicked by the petite 16 year old shy girl. but since this is still a children's movie, you will not literally see bloody action scenes where this brave archer girl kills super-strong and skilled bullies, but you will rather see scenes where those skilled bullies can not figure out how to catch a girl who ran away from them to a tree, so they decide camp under a tree until this girl alone does not get hungry and climb down. but because it was cold, of course, the bullies get cold so they find it was smart thing to make a fire and warm themself, but not too close to tree as it could catch on fire and kill a girl they've been chasing to kill. :) To conclude, if you're not 14 year old teenager, this is not a movie for you. don't get yourself tricked like I did. cheers",
         "The trouble with this movie is that I'm old enough to have seen many of its antecedents. So before The Truman Show, which is essentially the same idea as The Hunger Games, we have Battle Royale, The Running Man and of course, Rollerball. They all deal with mass entertainment in a dystopian future society and they all have their flaws. What's really disappointing about The Hunger Games is that unless you've read the book, the film will give you only a fleeting glimpse into why the games are called that. There's nothing else to help the naive reader make sense of the plot and because of this, the involvement of children will seem a bit odd to anyone who hasn't read the book. In fact, that's something you should take into account when reading many of the reviews of the film as they're written by people who have read the books and can fill in the wide gaps in the film without even thinking about it. Some have said its plot line is mildy satirical, but in my view that's just an excuse for a poorly filleted and disappointing adaptation of a marvellous book.",
         "First let me say, I love the books. Now let me voice my problems with the movie: Acting: Actors were good, I actually expected a worse performance. My problem was a lack of character development, they felt very flat, you don't link with the necessity of Katniss to win. Plot: They are called the HUNGER GAMES. They have to suffer, they have to fight for food, they have to kill each other. They made an R rated book a PG-13 movie and they expect it to work ? The fight had to be brutal like it was in the book, the tension of them moving in an arena that was trying to kill them didn't exist in the movie. The political implications you never understood them, you don't get that sense people in the other districts are linked in some way to the capitol, you don't sense people in the other districts has to suffer to great extents to find food. Development: The movie is freaking slow, I was failing sleep, mind you I finished the books in 18 hours non stop of reading. There are some useless scenes, others are too long and the important ones are too fast. Camera: Please kill the director and his stupid shaky camera, it was annoying. He failed to portrait the suffering of the participants, the action, the fights. I hope they do something for the next two or else I wont watch them. They need a better director, screenplay and writer.",
         "In a cinematic world of re-makes, re-imaginings and full-blown copies, it's inevitable to see a movie like The Hunger Games wallow in the limelight and hysteria of mainstream banality and post-Potter hunger simply because it's there. Adapted from Suzanne Collins' trilogy of teen- friendly novels, The Hunger Games looks set to follow in the well-off footsteps of Harry Potter and the soon-to-cease Twilight as the next big-money, low-brow saga for the GCSE bound masses. This moderately engaging adaptation of Collins' first novel plays like a pre-teen spin on Battle Royale. Director Gary Ross shoots for a futurist-retro sense of uprising, endurance and wonder and in the eyes and minds of 11 year-olds, he's on target. There's plenty to behold, but little to absorb. Despite all efforts, The Hunger Games is starved of a character or scenario to really care about. A hyped-up, cheesy and dumbed down treatise on human nature, spirit, freedom and TV culture, this is a badly-acted, action-crammed movie built on a much explored prophecy that's been residing in both literature and film for years; a nightmare dystopia in which society is slave to a tyrannical regime. But what do you know; there's a rebellion on the cards. And guess what? It's only lead by an unlikely yet inspiring hero. The Hunger Games is nothing new, then, but hold your horses; pitting 24 kids against one another in a game of death on a top-secret island is an original idea that's sure to evoke sympathy, shock and compassion. Isn't it? Well, maybe, but not if you know your films; not if you've seen Battle Royale. A bloody slice of social satire with shock and awe to spare, Battle Royale was by no means the first to offer up a glimpse into an oppressive fictional world where people are forced to fight to the death. Sparticus, Running Man and even Gladiator all touched upon on this idea of enslaved cock-fighting for the \"greater good\" and fun of a bent society. Suzanne Collins' tale may not be a rip-off of Battle Royale, but it is a blatant source. In director Ross' big screen retooling, The Hunger Games is set in a far from terrifying, post-war America whose totalitarian government get their kicks from a legislation born out of the ashes of World War III; each of the country's 12 districts are to offer up one young girl and boy every year to slog it out on live TV in a last-kid-standing tournament set on a virtual island. This; a sacrificial homage to a nation's thirst for blood and conflict. A punishment for an early, post war rebellion. A tribute to state power; The Hunger Games. The film follows Katniss (Jennifer Lawrence), a steadfast teen who puts her life on the line when she volunteers to replace her younger sister in the upcoming games. What follows is a predictable tale of heroism and self-sacrifice as Katniss and clunky love interest Peeta (a wooden Josh Hutcherson) are wined, dined, trained and then hurled into a giant lion's den full of determined, blood-thirsty brats who are there to win, to kill. Will Katniss and Peeta fall in love? Will they both make it out alive? If not, will one of them be the victor? Do you care? The Hunger Games is a self-assured, self-important piece of profit-reaping cinema whose potentially bleak and barbaric set-up cannot be realised through on screen peril, atmosphere, gore and violence due to its mild target audience. Alas, there is a lot of hand-held camera-work and rapid editing to cover up the scuffles, scraps, impact and blood. It doesn't work. Over-hyped and overdone; turns out it doesn't take much to tailor a totalitarian future concept for the modern-day youths; just strip it of all depth, complexity and darkness, throw in some weapons, some fire, a bit of romance and some heartthrobs and you'll be laughing all the way to the bank.",
         "I will start off by saying that I did not read the books. I'm also one of those people that when I first saw the trailer, I thought it was a Battle Royale remake. When I found out it wasn't, I was quite surprised, cause they seemed very similar. You cant always judge a film by it's trailer though. So to be fair, I decided to give this movie a chance, and not go into it comparing the two. The movie has quite a slow start, and even though they take a long time building up; I didn't get the idea that I was getting to know any of the characters. They really didn't do a good job making any of the characters likable, or let them develop in any way. The main character in this film, Katniss, was already portrayed as a tough girl from the very beginning of the film. Nothing in the first part of the movie did anything to either develop this, or add to it. When the games finally start, I was kind of excited, because I was looking forward to some action finally. Unfortunately for me; the action was lacking quite a bit. Shaky camera-work, which I guess is meant to be artistic these days, left a lot of the killing to your imagination. Due to lack of character building in the beginning of the film, I didn't really mind who died, cause I didn't feel any connection with any of the characters. On top of that; many scenes from the actual games seem to be lacking dept, reason or logic. It was as if they went for too many scenes in too little time. This resulted into the whole story of the movie being kind of blur to me, and left me wondering if there was even one there. On a positive note; the acting was quite OK. Jennifer Lawrence portrayed her role quite well, and her acting had nothing to do with me not being able to relate to her character. Elizabeth Banks was splendid, as a character that at first sight seems totally misplaced in this world, but totally works in the way it's portrayed. All in all, I'll have to be fair and say I don't quite get the hype. The movie seemed to be lacking in too many areas, in order for me to stay interested throughout the entire two and a half hours. Not comparing this film to Battle Royale while watching it was made quite easy, simply because this wasn't close to being as good. A missed opportunity for an interesting theme like this!"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Lionsgate",
         "Color Force"
      ],
      "summaries": [
         "In a dystopian future, the totalitarian nation of Panem is divided into 12 districts and the Capitol. Each year two young representatives from each district are selected by lottery to participate in The Hunger Games. Part entertainment, part brutal retribution for a past rebellion, the televised games are broadcast throughout Panem. The 24 participants are forced to eliminate their competitors while the citizens of Panem are required to watch. When 16-year-old Katniss' young sister, Prim, is selected as District 12's female representative, Katniss volunteers to take her place. She and her male counterpart, Peeta, are pitted against bigger, stronger representatives, some of whom have trained for this their whole lives.",
         "Set in a future North America known as \"Panem\", the Capitol selects a boy and a girl between the ages of 12 and 18 from each of the twelve outlying districts to compete in the annual \"Hunger Games\", a televised fight-to-the-death. The film is centered around Katniss Everdeen - a 16-year-old girl from District 12, who volunteers for her 12-year-old sister, Prim, when Prim's name is chosen - and Katniss's fellow District 12 tribute, Peeta Mellark, with whom she has some rather dramatic history. Katniss is then rushed to the Capitol, where she undergoes intense training before being thrust into the arena to fight to become the victor of the seventy-fourth annual Hunger Games.",
         "In order to control future rebellions by remembering the past rebellion, the Powers That Be of the dystopian society of Panem force two youngsters from each of the twelve districts to participate in The Hunger Games. The rules are very simple: the twenty-four players must kill each other and survive in the wilderness until only one remains. The games are broadcast through the Capital and the twelve districts to entertain and intimidate the population. In District 12, teenager Katniss Everdeen is a great hunter and archer. When her younger sister, Primrose Everdeen, is selected as one of the \"tributes\" of their district, Katniss volunteers to take her place in the games. Together with Peeta Mellark, they head by train to the Capital to be prepared for the brutal game.",
         "Katniss Everdeen volunteers to take the place of her sister to be placed into a revolutionary game called The Hunger Games, where kids kill each other for one to take the crown. Katniss fights for herself and her sister with another boy from her district, Peeta Mellark.",
         "Katniss Everdeen lives in a place called Panem. Panem lies on what used to be North America. Panem is split up into 12 districts. Each year, every district is forced to randomly choose two tributes-one girl and one boy- to fight in the annual Hunger Games. A fight to the death on live television. Katniss Everdeen takes her sisters place when she is called to be the tribute of the 74th annual Hunger Games. Katniss will be trained to kill all the other tributes and be the victor of the 74th annual Hunger Games.",
         "Katniss Everdeen voluntarily takes her younger sister's place in the Hunger Games, a televised competition in which two teenagers from each of the twelve Districts of Panem are chosen at random to fight to the death."
      ],
      "budget": 78000000
   },
   "movielensId": 91500,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-03-12",
      "dvdReleaseDate": "2012-08-18",
      "directors": ["Gary Ross"],
      "runtime": 142,
      "movieId": 91500,
      "title": "The Hunger Games",
      "mpaa": "PG-13",
      "actors": [
         "Jennifer Lawrence",
         "Josh Hutcherson",
         "Liam Hemsworth",
         "Woody Harrelson",
         "Elizabeth Banks",
         "Lenny Kravitz",
         "Stanley Tucci",
         "Donald Sutherland",
         "Wes Bentley",
         "Toby Jones",
         "Alexander Ludwig",
         "Isabelle Fuhrman",
         "Amandla Stenberg",
         "Willow Shields",
         "Sandra Ellis Lafferty",
         "Paula Malcomson",
         "Rhoda Griffis",
         "Raiko Bowman",
         "Dwayne Boyd",
         "Anthony Reynolds",
         "Judd Lormand",
         "Nelson Ascencio",
         "Bruce Bundy",
         "Latarsha Rose",
         "Dayo Okeniyi",
         "Leven Rambin",
         "Jack Quaid",
         "Jacqueline Emerson",
         "Ian Nelson",
         "Kalia Prescott",
         "Ethan Jamieson",
         "Mackenzie Lintz",
         "Annie Thurman",
         "Imanol Yepez-Frias",
         "Dakota Hood",
         "Amber Chaney",
         "Karan Kendrick",
         "Phillip Troy Linger",
         "Kimiko Gelman",
         "Kate Kneeland",
         "Steve Coulter",
         "Sharon Conley",
         "Tim Taylor",
         "John William Ross",
         "Julie Ivey",
         "Bill Bennett",
         "Jeremy Bonham",
         "Mary Fox"
      ],
      "imdbMovieId": "1392170",
      "originalTitle": "The Hunger Games",
      "genres": [
         "Science Fiction",
         "Adventure",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["mfmrPu43DF8"],
      "plotSummary": "Every year in the ruins of what was once North America, the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games.  Part twisted entertainment, part government intimidation tactic, the Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains.  Pitted against highly-trained Tributes who have prepared for these Games their entire lives, Katniss is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy.  If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love. The world will be watching.",
      "tmdbMovieId": 70160,
      "avgRating": 3.545,
      "releaseYear": "2012",
      "numRatings": 12812,
      "posterPath": "/iLJdwmzrHFjFwI5lvYAT1gcpRuA.jpg"
   }
}