{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "dc comics",
            "id": 849
         },
         {
            "name": "superhero",
            "id": 9715
         },
         {
            "name": "superhuman",
            "id": 10761
         },
         {
            "name": "super power",
            "id": 33637
         },
         {
            "name": "superhero team",
            "id": 155030
         },
         {
            "name": "the elite",
            "id": 209949
         }
      ],
      "imdb_id": "tt2224455",
      "video": false,
      "title": "Superman vs. The Elite",
      "recommendations": [
         166076,
         56590,
         76589,
         17445,
         45162,
         22855,
         30061,
         65291,
         43641,
         15359,
         13640,
         14011,
         217993,
         69735,
         323027,
         297556,
         14609,
         19323,
         13851,
         251768
      ],
      "backdrop_path": "/9fRNgX2bI6f27sxFEFuCPNYY4Lv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Lois Lane (voice)",
               "gender": 1,
               "credit_id": "52fe4a1bc3a36847f81b9d2b",
               "name": "Pauley Perrette",
               "profile_path": "/dXpCSxJKgIVLmSXGlK64VOMq3zb.jpg",
               "id": 11680,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Superman / Clark Kent / Robot (voice)",
               "gender": 2,
               "credit_id": "52fe4a1bc3a36847f81b9d2f",
               "name": "George Newbern",
               "profile_path": "/kUFci5BzhMyx3ZNQEvpauRmpMyT.jpg",
               "id": 59222,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Manchester Black / Pokolistani Ambassador (voice)",
               "gender": 2,
               "credit_id": "52fe4a1bc3a36847f81b9d33",
               "name": "Robin Atkin Downes",
               "profile_path": "/pCnIQMMgrFc4hBOE4LJDdebqRZ4.jpg",
               "id": 130081,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Jimmy Olsen (voice)",
               "gender": 2,
               "credit_id": "52fe4a1bc3a36847f81b9d37",
               "name": "David Kaufman",
               "profile_path": "/c6IKPGhEFQxMFUYkCvLj40oB5Jp.jpg",
               "id": 157536,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Atomic Skull (voice)",
               "gender": 2,
               "credit_id": "52fe4a1bc3a36847f81b9d3b",
               "name": "Dee Bradley Baker",
               "profile_path": "/zFXwtsdvUCeNkzCzYpYZdAmTkJY.jpg",
               "id": 23680,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Terrence Baxter / Dockworker (voice)",
               "gender": 0,
               "credit_id": "52fe4a1bc3a36847f81b9d3f",
               "name": "Ogie Banks",
               "profile_path": null,
               "id": 174466,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Coldcast (voice)",
               "gender": 2,
               "credit_id": "52fe4a1bc3a36847f81b9d43",
               "name": "Catero Colbert",
               "profile_path": "/lyAAF2oU63cDhhvPtn1Pwk9dAIk.jpg",
               "id": 158023,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Menagerie (voice)",
               "gender": 1,
               "credit_id": "52fe4a1bc3a36847f81b9d47",
               "name": "Melissa Disney",
               "profile_path": "/2HkJc4ErLOcM2sZzmY49nMQjnXs.jpg",
               "id": 92525,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Pa Kent (voice)",
               "gender": 2,
               "credit_id": "52fe4a1bc3a36847f81b9d4b",
               "name": "Paul Eiding",
               "profile_path": "/73yCY9QBAKqFilmVLXATsrIzL2Q.jpg",
               "id": 86006,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Efrain Baxter (voice)",
               "gender": 2,
               "credit_id": "52fe4a1bc3a36847f81b9d4f",
               "name": "Henry Simmons",
               "profile_path": "/ajSaqDbQfi6eAFULhpCSezYplUF.jpg",
               "id": 67913,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Young Vera (voice)",
               "gender": 1,
               "credit_id": "52fe4a1bc3a36847f81b9d53",
               "name": "Tara Strong",
               "profile_path": "/rFUZnJ4BaSaQVKW734xnUHSN9pm.jpg",
               "id": 15762,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Perry White (voice)",
               "gender": 2,
               "credit_id": "52fe4a1bc3a36847f81b9d57",
               "name": "Fred Tatasciore",
               "profile_path": "/lNe4zn9fJ302GehQVaFk5BNcGGM.jpg",
               "id": 60279,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "MI-5 Agent (voice)",
               "gender": 0,
               "credit_id": "52fe4a1bc3a36847f81b9d5b",
               "name": "Bruce Timm",
               "profile_path": "/2MaucKEFexM0MMcpsHHbDtDVZbk.jpg",
               "id": 34934,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Cowering Woman (voice)",
               "gender": 0,
               "credit_id": "52fe4a1bc3a36847f81b9d5f",
               "name": "Julie Wittner",
               "profile_path": "/hsn5pFoHTEKgKMuYJx7Aw0erY9o.jpg",
               "id": 191186,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Newscaster #3 (voice)",
               "gender": 1,
               "credit_id": "52fe4a1bc3a36847f81b9d67",
               "name": "Laraine Newman",
               "profile_path": "/ApYftBOqDMBnVColOQwXIodOt5s.jpg",
               "id": 35159,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Newscaster (voice)",
               "gender": 1,
               "credit_id": "52fe4a1bc3a36847f81b9d6b",
               "name": "Sumalee Montano",
               "profile_path": "/c3eoetU8QCfdc6F0N0QjJtGYjqs.jpg",
               "id": 66655,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Vera Black (voice)",
               "gender": 1,
               "credit_id": "52fe4a1bc3a36847f81b9d6f",
               "name": "Marcella Lentz-Pope",
               "profile_path": "/1rBUcsNmOrNf9Lo0DSaaEMesesM.jpg",
               "id": 54698,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "Bialyian Ambassador / Cartoon Superman / Dad (voice)",
               "gender": 2,
               "credit_id": "53d65f630e0a2628410074c5",
               "name": "Stephen Stanton",
               "profile_path": "/uaoZXILATHT27HUnBh8Q345glc6.jpg",
               "id": 1213640,
               "order": 18
            },
            {
               "cast_id": 24,
               "character": "Young Manchester (voice)",
               "gender": 1,
               "credit_id": "57a280e392514148440010bf",
               "name": "Grey DeLisle",
               "profile_path": "/b2Viqswr0mAULRfPqeA0J40icyy.jpg",
               "id": 15761,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a1bc3a36847f81b9d15",
               "name": "Michael Chang",
               "profile_path": null,
               "id": 127380,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a1bc3a36847f81b9d1b",
               "name": "Joe Kelly",
               "profile_path": null,
               "id": 207269,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a1bc3a36847f81b9d21",
               "name": "Christopher D. Lozinski",
               "profile_path": null,
               "id": 1033619,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "589faac8925141337e0055d3",
               "name": "Dawn Hershey",
               "profile_path": null,
               "id": 1756027,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 6.549519,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 103269,
      "vote_count": 118,
      "budget": 3500000,
      "overview": "The Man of Steel finds himself outshone by a new team of ruthless superheroes who hold his idealism in contempt.",
      "similar": [
         155,
         272,
         1924,
         1452,
         364,
         49521,
         141052,
         8536,
         9531,
         379291,
         13640,
         415,
         414,
         268,
         49026,
         246655,
         209112,
         297762,
         298618,
         30061
      ],
      "original_title": "Superman vs. The Elite",
      "runtime": 76,
      "poster_path": "/cilpU63HE0nsbqMytvO3Mlltotw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/2Tc1P3Ac8M479naPp1kYT3izLS5.png",
            "name": "DC Comics",
            "id": 429,
            "origin_country": "US"
         },
         {
            "logo_path": "/7xym5CnL4LcMPaWpp51cN1v73AR.png",
            "name": "Warner Premiere",
            "id": 4811,
            "origin_country": ""
         },
         {
            "logo_path": "/l5zW8jjmQOCx2dFmvnmbYmqoBmL.png",
            "name": "Warner Bros. Animation",
            "id": 2785,
            "origin_country": "US"
         }
      ],
      "release_date": "2012-06-12",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "World saved. Humanity lost.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Chang"],
      "runtime": 76,
      "synopsis": null,
      "writers": [
         "Jerry Siegel",
         "Joe Shuster"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2224455/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0OTcwNTkyMl5BMl5BanBnXkFtZTcwOTczMzk4Nw@@._V1_SY317_CR18,0,214,317_AL_.jpg",
      "actors": ["Stars: George Newbern, Pauley Perrette, Robin Atkin Downes | See full cast and crew »"],
      "reviews": [
         "An extremely well done Superman story that touches on the major moral aspects of a superhero as powerful as Superman. I should start out by saying I was NOT looking forward to this movie based on the previews I had seen, and after watching the movie I was VERY impressed with how it turned out. Does a great job of talking about the grey area of Superman's moral code of not killing anyone and if that is the right way to go in today's world. Batman and Superman both don't kill, and as a result their villains ALWAYS escape and cause more harm, so why NOT end the monsters right there and save everyone for good? That's the central theme, and it presents it in an intelligent way with plenty of interesting and unique action. The animation is pretty good, and I actually ended up preferring this Superman visual style than the other Animated-Series style Superman. The action was all great, felt like they made really good use of Superman's powers and strength... which sometimes they forget to do. The story really kept me interested and I didn't really know how it was going to all end, and was surprised at how into it I was at the end and really wanted to see how it all turned out. I would put this up right next to the Batman/Superman animated movie. 8.5 out of 10.",
         "Written by Joe Kelly & based on his story published as \"What's So Funny About Truth, Justice and the American Way?\", IMO...this is the BEST of the original DC animated Superman-movies that they made so far. The story is very nicely crafted with a good script that shows what can be done with Superman to keep him relevant in today's world. It finely explores the most human & moral issues of our favorite Man of Steel & put him into a fascinating challenge against a pretty interesting & kinda unusual super villain & his gang. Though I haven't read the comics but the earlier All Star Superman movie pretty much disappointed me after hearing lots of great stuffs about the original comic but here I think they succeed mostly in terms of portraying Superman the way he's supposed to be. There's no General Zod or Lex Luthor nor it was about a particular rivalry or an origin story but still it beautifully delivered what any good super-fan wants to see in a movie. Though I'm not a fan of Japanese Anime sort of artwork for any American superhero animated-movie treatment but it didn't bother me much this time, cause the voice actors did a great job & mainly the story & script was surprisingly too good for a DC animated film. I absolutely loved it. Highly recommended.",
         "\"Superman vs. The Elite\" is an animated adaptation of \"What's So Funny About Truth, Justice & the American Way?\", a comic which made a contrast between the classic morality of more traditional heroes with the actions done by morally ambiguous antiheroes, which question the consequences caused by the decision of Superman to don't kill anybody, not even the worst villains, considering that sometimes this could do more harm than good. The bad thing is that even with such interesting premise, neither the original comic or this animated movie made a very deep exploration of those themes, and instead of that this movie takes the easy way out of turning The Elite characters into typical villains (instead of the antiheroes that they were supposed to be) in order to make Superman to be automatically right. In other words, what could have been a complex story turns into another predictable battle of good vs. evil and black and white morality. Superman is right, and the Elite is wrong, there is nothing to question here. I appreciate the fact that the animated movie tried to add some little shades of gray making The Elite a bit (just a bit) more likable than their original comic counterparts, also showing the collateral damage caused by the decision of Superman to don't kill any villain. But that's it, at the end this animation follows the same pattern of the comic, without going deeper than that. But at least this had some entertainment value (Though I liked the original comic a bit more: It is true that the story was more simplistic, but at the same more direct, without any of the unnecessary filler material that was added to this animation) Even if at the end this is just a classical \"good vs. evil\" story disguised as something more complex,, it does still have some virtues that deserve appreciation, such as a good voice acting, some decent action scenes (Though the animation of this isn't so good as it could have been) and the fact, that despite how deeply flawed this was, at least was something funny to watch. I guess that this movie has a good point and a correct message, but if somebody think seriously about it, at the end Superman makes the same mistake of the Elite, seeing the things in black and white: He is completely right and the others are wrong, even if they have some valid points to make. And in my opinion, that's a bit contradictory.",
         "Michael Chang's 'Superman vs. The Elite' is a Stunning Watch. Dark, Bleak & Unforgettable, this recent Animated Superhero Flick takes The Man of Steel's legacy to an all-time high. I loved it! 'Superman vs. The Elite' Synopsis: The Man of Steel finds himself outshone by a new team of ruthless superheroes who hold his idealism in contempt. 'Superman vs. The Elite' is dark & bleak, but at the same time, unforgettable. In fact, the darkness added in the narrative plays as its trump card. Joe Kelly's Screenplay is legendary, it re introduces The Man of Steel all over again & takes him to an all-time high. The Animation is Top-Class. Vocal Performances are marvelous. George Newbern voices Clark Kent / Superman & he does a tour de force. Pauley Perrette as Lois Lane is admirable. Dee Bradley Baker as Atomic Skull/Joseph Martin is outstanding. Robin Atkin Downes as Manchester Black is super. Ogie Banks as Terrence Baxter offers quality. On the whole, 'Superman vs. The Elite' is a Must Watch.",
         "Superman is a walking atom bomb. This movie shows all of the themes that comic book writers have swept under the rug for years including the scope of superman's powers, the collateral damage associated with him cutting loose, and the absolute necessity of his moral restraints given that his unintentional motions could have devastating consequences for others. Superman is capable of fulfilling all of his desires instantly including his desire for revenge. This movie begins to explore the depth of his restraint and why this makes him the best superhero as well as why others who are not as stubborn in their unwavering morality can't be trusted in similar positions of authority. The difference between Manchester Black and Superman is the difference between Emperor Marcus Aurelius Antoninus and Emperor Commodus. A serious battle between Superman and an aggressor would have devastating consequences for his surroundings. If he moved at his top speed his surface temperature would bake his surroundings (an SR-71 blackbird has some areas on its surface at 1000 degrees at mach 3 and superman can move at 880991 times that). He can easily cause earthquakes, tsunami's and hurricanes when his various abilities are used at their full strength and I like to imagine that unleashing his heat vision at maximum intensity could roast the surface of the earth. When you have this level of power absolute restraint is necessary to avoid upsetting the fabric of human society. Because of this it is almost certain that one day his powers will be the source of a natural disaster when fighting off one of his tougher opponents. This is an untapped source of endless potential drama. What if he accidentally caused a tidal wave that wrecked a certain community? What if he accidentally destroyed one of the fleets of the US? How would the US respond given that it is the job of all military organizations to develop contingency plans against potential threats? What would be the geopolitical impact of Superman in a world like ours if he chose to intervene in world affairs? He easily has the power to do so given that he has intelligence gathering and processing abilities as well as the ability to project force on par with the strongest of modern nation states. He sees everything and can hear everything and is therefore privy to the most sensitive of information. His alien origins give him surpassing intelligence so he is capable of processing this information as well as retaining it because he is not subject to human limitations. How Superman chooses to direct this force as well as how powerful organizations respond to it would be a very interesting storyline. Given that he can see and hear all there is also tremendous potential for social commentary with the character. I like to think that Superman is a force for good because he is not subject to human limitations. He has no need for food, air, sleep, power, security, shelter, or money and is therefore free to direct his efforts to the benefit of others. There have been many morally despicable actions taken out of ugly necessity such as Diocletian's razing of a city in the south eastern Mediterranean (I'm pretty sure it was in Egypt and I think it was Alexandria but I'm not quite sure). In order to preserve the foundations of Roman power he made an example of the city. In order to secure a living wage salesmen routinely lie in order to rip off customers. Superman is not subject to any of these constraints. Therefore he is free to be a positive influence. All of these themes are present in this video and although they aren't very developed I am absolutely thrilled that they have been discovered. Collateral damage is present in the final sequence and his intervention in world affairs is a theme present in Bialia and Bocolistan (apologies if I spelled them wrong). Restraint is present in the beginning and final sequences. I understand that some want more and think that this line of thought requires more exploration. I couldn't agree more but animation is not the medium to do it yet (this film alone cost 3.5 million dollars). Given the constraints involved this movie was masterfully made and Superman fighting the elite choreographed together with tragic music and Manchester black's monologue is one of the best sequences I have ever seen. People who rate it lower than 9 don't know what they are talking about. I had the good fortune to be able to watch the film with the commentary of Joe Kelly and the director and it shows that a great deal of thought and skill went into the development of the scenes. This movie is an absolute triumph and is not only the best Superman film that I have seen but the best animated superhero film that I have seen ever. Watched it. Appreciated it. Loved it.",
         "\"Superman vs. the Elite\" isn't entirely successful in its discussions on politics and the price of power, but it's a decent superhero story. The story concerns a new group of superhero vigilantes that call themselves \"The Elite\". Manchester Black (voiced by Robin Atkin Downes), Coldcast (voiced by Catero Colbert), Menagerie (voiced by Melissa Disney) deal with supervillains their way: by killing them. The world seems to embrace these new heroes and shun Superman (voiced by George Newbern) as \"old fashioned\" and \"cheesy\". The conflicting ideals of these heroes pit them against each other. The quality of the animation varies from excellent to just OK and while most of the story seems grounded in semi-reality, with the fantasy and \"comic-bookiness\" being reduced to create parallels to our world, a scene with giant mutant insect tanks is really glaring and doesn't fit the tone of the story. What works is the chemistry between Superman/Clark Kent and Lois Lane (voiced by Pauley Perrette), the themes and ideas brought up by the conflicts and the discussions between our characters spread throughout the film. Adults that are familiar with the debate, which essentially is that of whether or not the death penalty should be a form of punishment, will find that they don't last long enough but it's refreshing to see the film take a stand on an issue it really believes in and stick with it. For younger audiences that haven't seen this material before, this is a good starting point and a way to generate some great conversation. Superman believes that killing is wrong under any circumstances, but he's also nearly invulnerable so does he really grasp the danger these villains he goes up against regularly really pose? To what extent is it OK to interfere with another country's politics and disagreements when you have the power to do so? If it is OK to take the life of another person, who judges how much is enough? When accompanied with the special features and commentary the film is a more complete experience and a lot more satisfying than just the feature by itself so it's preferable to set a generous amount of time aside and enjoying the special features immediately after to complement the faults of the film. The film is only OK by itself, mostly because it doesn't really have as much bite as you wish it would considering the themes, but it's worth your while. (On Blu-ray, September 29, 2012)",
         "I'm not a huge Superman fan, I lean more towards Batman but wow this movie was epic. What a lot of people don't realize is that Superman holds back in almost every fight because he knows he could easily accidentally kill someone. This is shown towards the end when Superman pretends to lose it, he was so fast, he was teleporting. Sucking oxygen out of the air but flying super fast, creating a vortex. Zooming bad guys into orbit. Destroying parts of brain with laser vision. There's not doubting it, Superman is practically a god and this movie showed that perfectly. It's refreshing to see how Superman would fight if he gave it his all. It's also refreshing that this movie deals with real life issues and politics, like wars between countries rather than mad scientists, super villains, aliens, etc. It gives you a glimpse at how super heroes might react to world problems in real life, if super heroes existed. The animation quality was good and all the technical details of this movie were good. the dialogue was decent, not too corny. If you like Superman at all, give this a watch.",
         "Superman vs. The Elite is the third standalone Superman movie in the DC animated direct-to-video lineup. In a way, however, it does not feel like a Superman movie at all. I probably like this a bit more than All-Star Superman, but I still found it underwhelming. Superman/Clark and Lois are very likable in this film. Superman especially is made very human in this which is the best thing about the movie. In fact I will say that Superman is made more human and down to earth in this film then in any other movie or series since Superman TAS. In the movie through the Elite (the villains of the film) Superman faces a great moral dilemma of whether his ideals still hold up in today's time or if his morality is outdated and no longer needed. This is easily the best aspect of the film. This is also a very personal story for Lois in whether she still has faith in Superman or not. I also like how smart Superman is in the film, especially at the end. People always say Superman is all brawn, but that is not the case. Watch this movie or Superman TAS and you will see that Superman can be pretty smart when he needs to be. The voice cast does a great job here. George Newborn, who voiced Superman in Justice League, reprises his role here and he is great. Pauley Perrette voices Lois Lane here and she does a good job. She is not my favorite Lois Lane, but she is far from the worst that I have seen. The other voice actors did fine as well. The voices for The Elite work well for the characters. However, I do have issues with the movie. As I said earlier this does not really feel like a Superman film. This film does not even feel like it takes place in the DC universe. The film feels more like it takes place in Vertigo comics and they just chucked Superman in there. The Elite themselves do not feel like villains Superman would fight. They do not even seem like villains of the DC universe. The movie does have Atomic Skull in it. He and Superman himself are the only things that verify that this is a DC story. Personally, I do not like The Elite as villains. I like the moral conflict they present, but other than that I do not care for them. I do not buy them as foes that would pose a huge challenge for Superman either. The art style of the film, like All-Star Superman, takes some getting used to. To be honest I still do not care much for the art. The animation is nice and the fights are fun to watch as usual. Overall out of all the Superman animated movies that have come out so far this one is probably the second best (in my opinion), but there is not much competition. I like how human Superman is made here. I also like the moral dilemma Superman is put in throughout the movie. However, I am not a fan of the look of the film, or the Elite themselves. However, for fans of the character, this is definitely worth at least one viewing.",
         "Superman vs. The Elite is certainly not a bad movie. I just found myself underwhelmed considering how great the premise was. I did think the character designs were flatly drawn and even goofy especially in the hands and facial expressions, Superman is no exception to this. The story is such a great idea but could have been explored even more, there are some compelling moments but overall the development feels too bland and black and white to me, especially in the villains excepting Manchester Black who's pretty interesting. I also had a big issue with Lois, she comes across as very stereotypical and bitchy, and her voice actress constantly sounds as though she has phlegm in her throat. The quality of the writing was mixed for me as well, there are some sharp and thought-provoking moments but also some that come across as stilted. There are however a number of redeeming qualities. The backgrounds and colours are fluid and atmospheric, and the music is hauntingly beautiful. The action sequences are well-choreographed and exciting, the Atomic Skull ones were especially brilliant. Superman is a charismatic character, and the voice acting is great. George Newbern is equal with Tim Daly which is high praise indeed. All in all, entertaining with some fine moments but some of the character designs, Lois and the rather black and white feel of the story and some of the characters gave Superman vs. The Elite a left wanting feel at the same time. 6/10 Bethany Cox",
         "The driving force behind this animated movie is most definitely the premises. I just really like stories, where both opposing sides does have a point or at least can understand where they are coming from. Instead of it being a completely black and white movie. I like villain or anti-character like Black Manchester who is the epitome of a stereotypical Brit. The group called the Elite brings about this question that even most comic book readers may question. Why not just kill off the villains once and for all, instead of dragging it out to the point where they will cause more heinous deaths. I think the artwork should have been less goofy, since the premise and the story is actually quite serious. Plus the dialogue has meaning behind it and does make you question certain things. So yeah, besides the artwork I thought this was a interesting and meaningful animated superhero movie. This had the potential to be one of the best DC animated movies ever. 7.9/10"
      ],
      "genres": [
         "Animation",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Warner Premiere",
         "DC Entertainment",
         "Warner Bros. Animation"
      ],
      "summaries": ["The Man of Steel finds himself outshone by a new team of ruthless superheroes who hold his idealism in contempt."],
      "budget": 3500000
   },
   "movielensId": 94974,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-06-12",
      "dvdReleaseDate": "2012-06-12",
      "directors": ["Michael Chang"],
      "runtime": 76,
      "movieId": 94974,
      "title": "Superman vs. The Elite",
      "mpaa": "PG-13",
      "actors": [
         "Pauley Perrette",
         "George Newbern",
         "Robin Atkin Downes",
         "David Kaufman",
         "Dee Bradley Baker",
         "Ogie Banks",
         "Catero Colbert",
         "Melissa Disney",
         "Paul Eiding",
         "Henry Simmons",
         "Tara Strong",
         "Fred Tatasciore",
         "Bruce Timm",
         "Julie Wittner",
         "Laraine Newman",
         "Sumalee Montano",
         "Marcella Lentz-Pope",
         "Stephen Stanton",
         "Grey DeLisle"
      ],
      "imdbMovieId": "2224455",
      "originalTitle": "Superman vs. The Elite",
      "genres": [
         "Animation",
         "Action"
      ],
      "youtubeTrailerIds": ["hXUu91JrpzA"],
      "plotSummary": "The Man of Steel finds himself outshone by a new team of ruthless superheroes who hold his idealism in contempt.",
      "tmdbMovieId": 103269,
      "avgRating": 3.31624,
      "releaseYear": "2012",
      "numRatings": 117,
      "posterPath": "/cilpU63HE0nsbqMytvO3Mlltotw.jpg"
   }
}