{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bounty hunter",
            "id": 801
         },
         {
            "name": "hero",
            "id": 1701
         },
         {
            "name": "plantation",
            "id": 3136
         },
         {
            "name": "society",
            "id": 3679
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "rivalry",
            "id": 9823
         },
         {
            "name": "rescue",
            "id": 10084
         },
         {
            "name": "shootout",
            "id": 10950
         },
         {
            "name": "racism",
            "id": 12425
         },
         {
            "name": "danger",
            "id": 15017
         },
         {
            "name": "dentist",
            "id": 33780
         },
         {
            "name": "django",
            "id": 160324
         },
         {
            "name": "aftercreditsstinger",
            "id": 179430
         },
         {
            "name": "odd couple",
            "id": 187376
         },
         {
            "name": "black slave",
            "id": 188772
         },
         {
            "name": "deadly",
            "id": 202703
         },
         {
            "name": "19th century",
            "id": 207928
         }
      ],
      "imdb_id": "tt1853728",
      "video": false,
      "title": "Django Unchained",
      "recommendations": [
         16869,
         393,
         24,
         1422,
         500,
         49026,
         680,
         59967,
         37724,
         107,
         6977,
         68734,
         807,
         857,
         187,
         13223,
         11324,
         98,
         73,
         272
      ],
      "backdrop_path": "/qUcmEqnzIwlwZxSyTf3WliSfAjJ.jpg",
      "revenue": 425368238,
      "reviews": [
         {
            "author": "LastCaress1972",
            "id": "5207b0bb760ee36305225258",
            "content": "America, mid-nineteenth century, just prior to the Civil War. Winter. Two horsebacked slave-traders are leading half-a-dozen manacled negro slaves through a large, unspecified section of Texas. As they move one night through a wood, they cross paths with an affable, charming German fellow identified by the hokey model tooth affixed atop his carriage by a spring as a travelling dentist. He greets the traders cordially but he's struggling to be understood; not because English is his second language (although he deferentially concedes as much when instructed - more than once - to \"Speak English!\") but because his vocabulary is far wider than that of the simpler men here before him. It's not a chance passing, either; this German fellow, who identifies himself as Dr. King Schultz (played by Christoph Waltz with the same smiling, deadly menace that earned him an Oscar statue for his part as Col. Hans Landa in Inglourious Basterds) is looking for these traders. More specifically, their inventory of negro slaves. Even more specifically, one of those slaves in particular. Django (Jamie Foxx, Collateral, Ray). Attempting to buy Django, Schultz is met with short, suspicious shrift and ordered at gunpoint to be on his way. Within a second, one trader lies dead and the other lies incapacitated underneath the bulk of his dead horse. Schultz unchains Django, instructs Django to take the dead fellow's horse and coat, and pays the remaining trader for all that he's taken. He then tosses the manacle key to the other slaves and posits two choices to them, as he sees it: Carry their injured master thirty-plus miles to the nearest town for medical assistance, or unchain themselves, blow the injured slave-trader's head off with the gun Shultz has left them, bury the corpses and use the Pole Star to run for the Northern states, where slavery had been abolished, and for more than fifty years in some areas. Funnily enough, they take up the latter option.\r\n\r\nSo begins Django Unchained, an oater set in the slave states of the Deep South and the latest rollercoaster by Gen-X movieland wunderkind Quentin Tarantino. Always clearly a man heavily informed by the grindhouse subgenre of the Spaghetti Western, he's finally made one himself, and if Quentin's your thing it's a blast, though I doubt it'll convert many Tarantino sceptics; in fact it'll almost certainly reinforce those things that people dislike about him, about which more later.\r\n\r\nIt transpires that Dr. Schultz ISN'T a dentist (\"I haven't practised dentistry in five years,\" he confides to Django over a beer) but a bounty hunter, and a lethal one at that. He's chasing down the Brittles, a murderous gang of brothers currently plying their trades as plantation overseers. He doesn't know what they look like but he knows they were recently employed at the Carrucan plantation, which is why he was searching for Django - a slave recently sold by that very plantation - in the first place; Django can point them out for him. Schultz is no fan of the South's backwards-thinking propensity for slavery though, and he offers Django a deal: help Schultz find and kill the Brittle Brothers, Schultz will treat Django like a free man, pay him $75 (a decent little wedge in 1858) and rubber-stamp his freedom. Along the way, he'll also teach Django a thing or two about the art of gunfighting and about the macabre trade of bounty-hunting (both in which Django proves to be a natural). On the trail of the Brittles, Schultz wonders aloud as to Django's plans once this endeavour is over and he's free. Well, as it happens, Django is a married man and his intention, once free, is to find his wife and buy her freedom. They'd tried to run from the Carrucan plantation together but they'd been caught, branded (both Django and his wife - played with all of her nerves exposed by Kerry Washington - sport R-For-Runaway scars on their cheeks) and sold on, separately. So he doesn't know where she is but that's what he's going to try to do. Schultz, feeling responsible for Django as the man granting him his freedom, proposes a further deal: If this Brittle bounty goes well, he'll honour Django's freedom but if Django stays with him through the winter as partners, taking on bounties and earning money, he'll help Django locate his wife.\r\n\r\nWhat we have here is a large sequence of set-pieces - some funny, some tense, some action-packed - stretched across very-nearly three hours (though, like most QT films, it moves like a bullet train and those three hours just fly) strung together by a fairly simple revenge/rescue tale set against a geographically sprawling backdrop; a reasonably similar template to many of Quentin's movies and an almost identical template to that of previous outing Inglourious Basterds, to which Django Unchained could almost be considered a companion piece despite the wildly different global and historical settings. Like Inglourious Basterds, Django Unchained is quite a bit longer than the story need be, and like Inglourious Basterds that is because each scene is treated by Tarantino as a mini movie, a contained set-piece all of its own. Every scene is fleshed out and deepened for either heightened comic or dramatic effect by lengthened sequences of characters going about the mundane or by characters delivering enormous monologues - rambling shaggy-dog stories, usually - to one another, for context. Not every scene is entirely necessary, either. I wouldn't call that a flaw though, I'd call it a trait typical of Quentin Tarantino; whether it's a flaw or an outright treat depends entirely on whether that's an element of Tarantino's writing that the viewer appreciates. Personally, I love Tarantino's writer's voice and I could watch these scenes for hours (indeed, I watched Django Unchained three times over the course of yesterday), but I can fully undersand what those lamenting the decent 90-minute film that's lost somewhere within the sojourns and speeches of Django Unchained are saying.\r\n\r\nPerformances throughout are utterly mesmerising, from stars Foxx and Waltz but also - in fact, maybe more so - from principle antagonists Leonardo DiCaprio as \"Monsieur\" Calvin Candie, the horrifying owner of the \"Candyland\" plantation currently holding the ownership deeds on Django's wife, and Samuel L. Jackson in an if-anything even more monstrous role as Stephen, Candie's elderly head house slave, a man who has utterly abndoned the culture and torment of his people in return for a few material trappings as the slave-in-chief. Playing to superb comedic effect is Don Johnson as Big Daddy, a strutting, peacock-like Tennessee dandy and owner of the plantation currently employing the Brittle Brothers, and delightful in cameo roles are (among many others) James Remar (The Warriors, Dexter), Jonah Hill (Superbad, The Watch), John Jarratt (Wolf Creek, Rogue) and Michael Parks (Red State, Kill Bill). Quentin himself makes a cameo as usual and, as usual, he's not as charming as he probably thinks he is, but he's also not as bad as many think he is, either. There's even a quick cameo (raising an involuntary cheer from me!) by Franco Nero, the original Django from the magnificent 1966 film of the same name by Sergio Corbucci (that's not the only nod back to the first Django movie; the opening credits to Django Unchained are presented in exactly the same way as the original, and the theme song to Quentin's film comes directly from the Corbucci film too).\r\n\r\nDjango Unchained is likely to come under fire on a couple of counts; possibly for it's incredible levels of bloodshed (one particular gunfight is the most blood-splattered scene I've seen in a movie since those elevator doors opened in The Shining), and much more probably for the liberal use of what guilty white folks like to refer to as \"The 'N'-word\", uttered literally hundreds of times from first scene to last. However, neither criticism is warranted in my humble opinion. The bloodshed is of the overexaggerated cartoon quality. Heads, arteries and extremities explode upon bullet impact like detonated watermelons to a gloopy, \"BLAAAPP!\" sound effect, the blood itself translucent, syrupy and intentionally unrealistic. And if a tale is set against the backdrop of slavery in the 19th century deep South, you're going to hear the word \"Nigger\" in that tale. Often. Be assured though that just as Inglourious Basterds was a revenge fantasy of the downtrodden Jewish war refugees over the stupidly evil Nazi Germans, this is a tale of empowerment of the enslaved black man over his sadistic, pig-ignorant white overseers.\r\n\r\nIf you like Tarantino, you'll probably like Django Unchained. If you like Westerns (and the blood-drenched Spaghetti Westerns of the late sixties in particular), you'll probably like Django Unchained. If, like me, you're an admirer of both Tarantino AND westerns, this is a no-brainer. Get and see it, it's a blast.\r\n\r\nI'd like to have seen him pull a Gatling gun out of a coffin, though.",
            "url": "https://www.themoviedb.org/review/5207b0bb760ee36305225258"
         },
         {
            "author": "iamyenz",
            "id": "589cfcabc3a3681158003356",
            "content": "A highly entertaining yet disturbing film with superb cast and performances for an audience who would likely never consider watching a film fundamentally about slavery, where Tarantino is masterfully and emphatically navigating and exposing the complex layers of the violent and dehumanizing system of slavery.",
            "url": "https://www.themoviedb.org/review/589cfcabc3a3681158003356"
         },
         {
            "author": "Shreyance Parakh",
            "id": "590b2c6e9251414fa10150d3",
            "content": "**ENTERTAINING from start to finish !!**\r\n\r\nGiven I am a big fan of **Quentin's** works i knew this movie would be a treat to watch.But what i didn't know was violence can be so **COOL**... The movie is a treat to watch(including the blood and gore) from starting to end.The acting is superb.And the cinematography is just too good! The whole cast played their parts to perfection...Especially **Samuel L. Jackson** and **Jamie Foxx**..**Leo and Christopher Waltz** were superb too..And as Christopher said in the movie - \"It was hard to RESIST\".A must watch for everyone who likes QUALITY cinema..Even the ones who cant stand BOOMs and BANGs, you wouldn't regret spending about 3 hours watching this well written, well directed and well acted GREAT movie !!",
            "url": "https://www.themoviedb.org/review/590b2c6e9251414fa10150d3"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Django",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d12e3",
               "name": "Jamie Foxx",
               "profile_path": "/cDRGXCNrwf1p9jouw9GzhU2vWP7.jpg",
               "id": 134,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Dr. King Schultz",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d12df",
               "name": "Christoph Waltz",
               "profile_path": "/2Hhztd4mUEV9Y25rfkXDwzL9QI9.jpg",
               "id": 27319,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Calvin Candie",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d12db",
               "name": "Leonardo DiCaprio",
               "profile_path": "/A85WIRIKVsD2DeUSc8wQ4fOKc4e.jpg",
               "id": 6193,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Broomhilda von Shaft",
               "gender": 1,
               "credit_id": "52fe479fc3a368484e0d12ef",
               "name": "Kerry Washington",
               "profile_path": "/yufNCkn9YuYei9ThzSgApczUe4K.jpg",
               "id": 11703,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Stephen",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d12eb",
               "name": "Samuel L. Jackson",
               "profile_path": "/AvCReLikjzYEf9XjTQxbv3JWgKT.jpg",
               "id": 2231,
               "order": 4
            },
            {
               "cast_id": 45,
               "character": "Billy Crash",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d135f",
               "name": "Walton Goggins",
               "profile_path": "/gA5nf2alzIPPjs1MSjS1PmrCedJ.jpg",
               "id": 27740,
               "order": 5
            },
            {
               "cast_id": 27,
               "character": "Leonide Moguy",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1315",
               "name": "Dennis Christopher",
               "profile_path": "/sNFwlPHBAVn2fQIMVBTXMfx5E69.jpg",
               "id": 27770,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Butch Pooch / Ace Speck",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1305",
               "name": "James Remar",
               "profile_path": "/AeSuQlBclvWqztlpkf9nIhvvhsc.jpg",
               "id": 1736,
               "order": 7
            },
            {
               "cast_id": 28,
               "character": "Mr. Stonesipher",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1319",
               "name": "David Steen",
               "profile_path": "/kgdUlAb34rXiSamG5It02YDmDnU.jpg",
               "id": 1067187,
               "order": 8
            },
            {
               "cast_id": 29,
               "character": "Cora",
               "gender": 1,
               "credit_id": "52fe479fc3a368484e0d131d",
               "name": "Dana Gourrier",
               "profile_path": "/fY2EicFwLXSnZUTg9dyeUBQGBFt.jpg",
               "id": 1133063,
               "order": 9
            },
            {
               "cast_id": 30,
               "character": "Sheba",
               "gender": 1,
               "credit_id": "52fe479fc3a368484e0d1321",
               "name": "Nichole Galicia",
               "profile_path": "/mVt9uits1dAhVNKRwJlOmbwwIeB.jpg",
               "id": 1037108,
               "order": 10
            },
            {
               "cast_id": 31,
               "character": "Lara Lee Candie-Fitzwilly",
               "gender": 1,
               "credit_id": "52fe479fc3a368484e0d1325",
               "name": "Laura Cayouette",
               "profile_path": "/l12w7F4ouOPctma3Wvls0FYHXDs.jpg",
               "id": 565498,
               "order": 11
            },
            {
               "cast_id": 32,
               "character": "D'Artagnan",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1329",
               "name": "Ato Essandoh",
               "profile_path": "/boyZ5MkcayaIYoC8s8zh1KEArz7.jpg",
               "id": 5377,
               "order": 12
            },
            {
               "cast_id": 33,
               "character": "Rodney",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d132d",
               "name": "Sammi Rotibi",
               "profile_path": "/yjktr2trahEBQmuLsCRMzgoDFvh.jpg",
               "id": 19300,
               "order": 13
            },
            {
               "cast_id": 126,
               "character": "Big Fred's Opponent",
               "gender": 0,
               "credit_id": "567708ff92514179e300642d",
               "name": "Clay Donahue Fontenot",
               "profile_path": "/ykNZqTr6pyoOWdyzdu2Vm59p4fY.jpg",
               "id": 1291797,
               "order": 14
            },
            {
               "cast_id": 62,
               "character": "Big Fred",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d13bd",
               "name": "Escalante Lundy",
               "profile_path": "/yfIXDhC4JeyfTFdtH2od3WyACnQ.jpg",
               "id": 1129647,
               "order": 15
            },
            {
               "cast_id": 63,
               "character": "Betina",
               "gender": 0,
               "credit_id": "52fe479fc3a368484e0d13c1",
               "name": "Miriam F. Glover",
               "profile_path": "/zN17Vvazjxzp4AbtFiajfpAsTlR.jpg",
               "id": 1291798,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Big Daddy",
               "gender": 0,
               "credit_id": "52fe479fc3a368484e0d1309",
               "name": "Don Johnson",
               "profile_path": "/yQHW10SE2HyuaZmHvUrSxKhqqWg.jpg",
               "id": 25129,
               "order": 17
            },
            {
               "cast_id": 34,
               "character": "Amerigo Vessepi",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1331",
               "name": "Franco Nero",
               "profile_path": "/lwXfTQrFqAw4zcVjrhgq3THfWCg.jpg",
               "id": 22383,
               "order": 18
            },
            {
               "cast_id": 21,
               "character": "Dicky Speck",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d130d",
               "name": "James Russo",
               "profile_path": "/tV4X0uEuqu6XYml3yEs9rsG9EzW.jpg",
               "id": 785,
               "order": 19
            },
            {
               "cast_id": 35,
               "character": "U.S. Marshall Gill Tatum",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1335",
               "name": "Tom Wopat",
               "profile_path": "/md58rSrmg7ev0l7Ry2jQ8dbm8PS.jpg",
               "id": 114293,
               "order": 20
            },
            {
               "cast_id": 36,
               "character": "Sheriff Bill Sharp",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1339",
               "name": "Don Stroud",
               "profile_path": "/7jT8523HL3myVWDXPpNOqf9Ubp0.jpg",
               "id": 69494,
               "order": 21
            },
            {
               "cast_id": 37,
               "character": "Son of a Gunfighter",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d133d",
               "name": "Russ Tamblyn",
               "profile_path": "/eSVSJvOR18dTgLRkeOqRYd6ew31.jpg",
               "id": 6725,
               "order": 22
            },
            {
               "cast_id": 125,
               "character": "Daughter of a Son of a Gunfighter",
               "gender": 1,
               "credit_id": "561f8f8d92514171d40032f8",
               "name": "Amber Tamblyn",
               "profile_path": "/4nwsbtFzoxzN2YF2HOW4P4vdit2.jpg",
               "id": 20354,
               "order": 23
            },
            {
               "cast_id": 124,
               "character": "Old Man Carrucan",
               "gender": 2,
               "credit_id": "561f8f7a9251417f470016a3",
               "name": "Bruce Dern",
               "profile_path": "/fYhCiXGBARWUevnWDkeCEpwi4h4.jpg",
               "id": 6905,
               "order": 24
            },
            {
               "cast_id": 22,
               "character": "Big John Brittle",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1311",
               "name": "M.C. Gainey",
               "profile_path": "/icWXPTZlbOytDwMzRLM37TyBcox.jpg",
               "id": 22132,
               "order": 25
            },
            {
               "cast_id": 127,
               "character": "Lil Raj Brittle",
               "gender": 2,
               "credit_id": "56770ab492514179db006756",
               "name": "Cooper Huckabee",
               "profile_path": "/239xShwtPIzL0u3s6B2sTFoeCCI.jpg",
               "id": 156653,
               "order": 26
            },
            {
               "cast_id": 128,
               "character": "Ellis Brittle",
               "gender": 2,
               "credit_id": "56770ae292514179e300646d",
               "name": "Doc Duhame",
               "profile_path": "/cFzYXHfoT86jiJWgH43pV8y9iIq.jpg",
               "id": 139993,
               "order": 27
            },
            {
               "cast_id": 40,
               "character": "Bag Head #2",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1349",
               "name": "Jonah Hill",
               "profile_path": "/7GXzpyHLCEA36J9biB0wJVAauiO.jpg",
               "id": 21007,
               "order": 28
            },
            {
               "cast_id": 129,
               "character": "Sheriff Gus (Snowy Snow)",
               "gender": 2,
               "credit_id": "56770b3e92514179e1006618",
               "name": "Lee Horsley",
               "profile_path": "/1XzE8QztuBlrljHvFIzXnPPchPm.jpg",
               "id": 47859,
               "order": 29
            },
            {
               "cast_id": 68,
               "character": "Tracker",
               "gender": 1,
               "credit_id": "52fe479fc3a368484e0d13d5",
               "name": "Zoë Bell",
               "profile_path": "/44OHciSZtHTggiXyNM8jntKMsot.jpg",
               "id": 20494,
               "order": 30
            },
            {
               "cast_id": 69,
               "character": "Tracker",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d13d9",
               "name": "Michael Bowen",
               "profile_path": "/xGNcy5uCe0Ke5vqC7oZlOV3GGDx.jpg",
               "id": 2234,
               "order": 31
            },
            {
               "cast_id": 130,
               "character": "Tracker",
               "gender": 2,
               "credit_id": "56770ba892514179e1006628",
               "name": "Robert Carradine",
               "profile_path": "/bHC0DdCEJ3frEWADFnTnftSmdgF.jpg",
               "id": 62036,
               "order": 32
            },
            {
               "cast_id": 133,
               "character": "Tracker",
               "gender": 0,
               "credit_id": "56770c49c3a368168900635c",
               "name": "Jake Garber",
               "profile_path": "/d3xjQNUpOuVvIjEWuZuesrQ8T3b.jpg",
               "id": 1206190,
               "order": 33
            },
            {
               "cast_id": 131,
               "character": "Tracker",
               "gender": 2,
               "credit_id": "56770bc992514179db006778",
               "name": "Ted Neeley",
               "profile_path": "/ir4Iw4arcMWMyiOLsgAZKv1qVoI.jpg",
               "id": 72739,
               "order": 34
            },
            {
               "cast_id": 73,
               "character": "Tracker",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d13e9",
               "name": "James Parks",
               "profile_path": "/lzdbAVS3ABK8k6xGpYHU8E02OAA.jpg",
               "id": 87312,
               "order": 35
            },
            {
               "cast_id": 132,
               "character": "Tracker",
               "gender": 2,
               "credit_id": "56770be592514179d40067cd",
               "name": "Tom Savini",
               "profile_path": "/yOZPKC3TXlxkvx4HoDrhq1PgXrU.jpg",
               "id": 11161,
               "order": 36
            },
            {
               "cast_id": 41,
               "character": "The LeQuint Dickey Mining Co. Employee",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d134d",
               "name": "Michael Parks",
               "profile_path": "/54P22YwbYCwfjJWT1jbiHN77TD.jpg",
               "id": 2536,
               "order": 37
            },
            {
               "cast_id": 74,
               "character": "The Le Quint Dickey Mining Co. Employee",
               "gender": 2,
               "credit_id": "538c1f280e0a266712003842",
               "name": "John Jarratt",
               "profile_path": "/yRUY3lMYP5NTkxc54Wrj8NgXxAu.jpg",
               "id": 45210,
               "order": 38
            },
            {
               "cast_id": 43,
               "character": "The LeQuint Dickey Mining Co. Employee",
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1355",
               "name": "Quentin Tarantino",
               "profile_path": "/9ci4NBvHXJktxjALdJsrtasqgtV.jpg",
               "id": 138,
               "order": 39
            },
            {
               "cast_id": 134,
               "character": "Roy",
               "gender": 2,
               "credit_id": "56770d3ac3a368167c0068c1",
               "name": "Amari Cheatom",
               "profile_path": "/mHj48SehhdsNuBI3L70yNlc8tdk.jpg",
               "id": 239107,
               "order": 40
            },
            {
               "cast_id": 135,
               "character": "Pudgy Ralph",
               "gender": 0,
               "credit_id": "56770d5292514179d40067f7",
               "name": "Keith Jefferson",
               "profile_path": "/eLmNDQgvJWDN6yHSYI6p2zdvtKN.jpg",
               "id": 1198202,
               "order": 41
            },
            {
               "cast_id": 136,
               "character": "Big Sid",
               "gender": 0,
               "credit_id": "56770d62c3a368168b0062b0",
               "name": "Marcus Henderson",
               "profile_path": "/5ggLbrE91uYCq3YyN0pI3bDAPbK.jpg",
               "id": 1291961,
               "order": 42
            },
            {
               "cast_id": 137,
               "character": "Slave on Chain Gang",
               "gender": 0,
               "credit_id": "56770d7fc3a368167c0068c6",
               "name": "Lil Chuuch",
               "profile_path": "/qWdhWt81DRLZNrsZjwZBjzFFFJg.jpg",
               "id": 1200963,
               "order": 43
            },
            {
               "cast_id": 138,
               "character": "Franklin",
               "gender": 2,
               "credit_id": "56770d8f92514179d2006860",
               "name": "Kinetic",
               "profile_path": "/xmlxlshd8RdBvpUnP1mEtTAAxgE.jpg",
               "id": 148693,
               "order": 44
            },
            {
               "cast_id": 139,
               "character": "Daughtrey Saloon Girl",
               "gender": 0,
               "credit_id": "56770dc292514179d200686a",
               "name": "Louise Stratten",
               "profile_path": "/pGJTwn2RyhA9RcwxAm6knQKSt3L.jpg",
               "id": 95979,
               "order": 45
            },
            {
               "cast_id": 140,
               "character": "Saloon Keeper Pete",
               "gender": 2,
               "credit_id": "56770ddac3a36816800066b4",
               "name": "Kim Robillard",
               "profile_path": "/vhmpyqkhpIv1NjB4rfDBLsxfybu.jpg",
               "id": 5150,
               "order": 46
            },
            {
               "cast_id": 141,
               "character": "Daughtrey Bitty",
               "gender": 0,
               "credit_id": "56770df0c3a36816800066b6",
               "name": "Shana Stein",
               "profile_path": "/bPsXJLqtfLtwPaq9CCGqOOc8vbl.jpg",
               "id": 756648,
               "order": 47
            },
            {
               "cast_id": 142,
               "character": "Daughtrey Saloon Girl",
               "gender": 0,
               "credit_id": "56770e1d92514179e7006556",
               "name": "Shannon Hazlett",
               "profile_path": "/rZLSH5gYJquWTwHDXZ3Dt4mGRur.jpg",
               "id": 562669,
               "order": 48
            },
            {
               "cast_id": 143,
               "character": "Daughtrey Rifleman",
               "gender": 2,
               "credit_id": "56770e5492514179e700655e",
               "name": "Jack Lucarelli",
               "profile_path": "/7urdA1dFvN8ceeFtNvfmpYzJBBQ.jpg",
               "id": 1116951,
               "order": 49
            },
            {
               "cast_id": 144,
               "character": "Daughtrey Woman",
               "gender": 1,
               "credit_id": "56770e80c3a368168900639c",
               "name": "Victoria Thomas",
               "profile_path": "/cdOR8cgySFsgxWtp6hGA3eMsVra.jpg",
               "id": 547,
               "order": 50
            },
            {
               "cast_id": 145,
               "character": "Grace Bennett",
               "gender": 0,
               "credit_id": "56770e96c3a368168e006df5",
               "name": "Grace Collins",
               "profile_path": null,
               "id": 1551615,
               "order": 51
            },
            {
               "cast_id": 146,
               "character": "Little Jody",
               "gender": 0,
               "credit_id": "56770ea792514179d200688b",
               "name": "Sharon Pierre-Louis",
               "profile_path": "/ybb4wptpXIdCK4fnOxYhcGOGNsz.jpg",
               "id": 1446043,
               "order": 52
            },
            {
               "cast_id": 147,
               "character": "Willard",
               "gender": 2,
               "credit_id": "56770ebcc3a3681685006872",
               "name": "Christopher Berry",
               "profile_path": "/fIq5d1S0xLBapW7EZKKknTdgPA7.jpg",
               "id": 1173099,
               "order": 53
            },
            {
               "cast_id": 148,
               "character": "Randy",
               "gender": 0,
               "credit_id": "56770edfc3a36816830065ce",
               "name": "Kim Collins",
               "profile_path": "/jDLFUKnTXv2pPo3Mv3JRnOXATv.jpg",
               "id": 1044195,
               "order": 54
            },
            {
               "cast_id": 149,
               "character": "Tennessee Redfish",
               "gender": 2,
               "credit_id": "56770f0cc3a36816830065db",
               "name": "Dane Rhodes",
               "profile_path": "/cB1iGmzJe5OEillQvPWDGRkkSAC.jpg",
               "id": 60874,
               "order": 55
            },
            {
               "cast_id": 150,
               "character": "O.D.",
               "gender": 2,
               "credit_id": "56770f20c3a36816800066d5",
               "name": "J.D. Evermore",
               "profile_path": "/iNn9JV3Kk7VJ9ICYKdjgwFq8EpF.jpg",
               "id": 129868,
               "order": 56
            },
            {
               "cast_id": 151,
               "character": "Tennessee Harry",
               "gender": 2,
               "credit_id": "56770f3792514179d20068a5",
               "name": "Rex Linn",
               "profile_path": "/2ze2PNirf4vle9sWRkSxHgv1iH0.jpg",
               "id": 16937,
               "order": 57
            },
            {
               "cast_id": 152,
               "character": "Smitty Bacall",
               "gender": 2,
               "credit_id": "56770f51c3a36816830065e5",
               "name": "Michael Bacall",
               "profile_path": "/vAqUOjmjY1ALiTRlYu7BI3yWmuK.jpg",
               "id": 58744,
               "order": 58
            },
            {
               "cast_id": 153,
               "character": "",
               "gender": 0,
               "credit_id": "56770f5ec3a3681685006886",
               "name": "Ronan Hice",
               "profile_path": null,
               "id": 1291965,
               "order": 59
            },
            {
               "cast_id": 154,
               "character": "Wilson",
               "gender": 2,
               "credit_id": "56770f7a92514179d20068af",
               "name": "Ned Bellamy",
               "profile_path": "/aPAsdVFewZK3ldhvrL1ea2VUkUK.jpg",
               "id": 2141,
               "order": 60
            },
            {
               "cast_id": 155,
               "character": "Mr. Eigglesworth",
               "gender": 0,
               "credit_id": "56770fa792514179d400683e",
               "name": "Dave Coennen",
               "profile_path": "/1PG5W7RGzTyDE7kX3NwKK0WmsBB.jpg",
               "id": 1291968,
               "order": 61
            },
            {
               "cast_id": 156,
               "character": "Coco",
               "gender": 1,
               "credit_id": "56770fc9c3a368168e006e1c",
               "name": "Danièle Watts",
               "profile_path": "/wvFZBBjNTSXEVhpKZVe0eZI1q9y.jpg",
               "id": 1424334,
               "order": 62
            },
            {
               "cast_id": 157,
               "character": "",
               "gender": 2,
               "credit_id": "56770fd5925141691a002e52",
               "name": "Jon Eyez",
               "profile_path": "/1v11aZ5TmwtORs10OcU4wzhX2NW.jpg",
               "id": 231857,
               "order": 63
            },
            {
               "cast_id": 158,
               "character": "Chicken Charlie",
               "gender": 2,
               "credit_id": "56770fee92514179e7006587",
               "name": "Omar J. Dorsey",
               "profile_path": "/20Lrh4XaRrNEMapJGMl9uToHSQn.jpg",
               "id": 59844,
               "order": 64
            },
            {
               "cast_id": 159,
               "character": "Baghead",
               "gender": 2,
               "credit_id": "5677100492514179e30064f6",
               "name": "Evan Parke",
               "profile_path": "/kHzILtL1BS7bGFuoTTufqt78sOD.jpg",
               "id": 3493,
               "order": 65
            },
            {
               "cast_id": 160,
               "character": "Tommy Gilles",
               "gender": 0,
               "credit_id": "5677101f92514179db0067ed",
               "name": "Craig Stark",
               "profile_path": "/lmoVS9ClaL7Y5tZzDCvrqEoEs1j.jpg",
               "id": 183519,
               "order": 66
            },
            {
               "cast_id": 161,
               "character": "Hoot Peters",
               "gender": 0,
               "credit_id": "5677103b92514179e10066ba",
               "name": "Brian Brown",
               "profile_path": "/yIAsSC6w9c2gNFIIMHusmyVutLN.jpg",
               "id": 1204219,
               "order": 67
            },
            {
               "cast_id": 162,
               "character": "Overseer Johnny Jerome",
               "gender": 2,
               "credit_id": "5677106692514179e30064ff",
               "name": "Ritchie Montgomery",
               "profile_path": "/znNRxqrYkOskK3jlm3ftHyAzJDg.jpg",
               "id": 52885,
               "order": 68
            },
            {
               "cast_id": 163,
               "character": "Baghead",
               "gender": 0,
               "credit_id": "5677108592514179e10066c2",
               "name": "Nicholas Dashnaw",
               "profile_path": null,
               "id": 1292475,
               "order": 69
            },
            {
               "cast_id": 164,
               "character": "Banjo",
               "gender": 0,
               "credit_id": "567710a1c3a368167a006e42",
               "name": "Jarrod Bunch",
               "profile_path": "/XLGgcMYum9z16DumVDKw5LFWRd.jpg",
               "id": 65121,
               "order": 70
            },
            {
               "cast_id": 166,
               "character": "",
               "gender": 0,
               "credit_id": "567710f592514179e700659e",
               "name": "Kerry Sims",
               "profile_path": null,
               "id": 1493736,
               "order": 72
            },
            {
               "cast_id": 167,
               "character": "Tatum",
               "gender": 2,
               "credit_id": "5677110cc3a368168e006e3d",
               "name": "Jamal Duff",
               "profile_path": "/nH7XAMTsoomzS3hrciKWTVOzOlR.jpg",
               "id": 74931,
               "order": 73
            },
            {
               "cast_id": 168,
               "character": "Dollar Bill",
               "gender": 2,
               "credit_id": "5677112fc3a368168b006311",
               "name": "Todd Allen",
               "profile_path": "/m8bGdt2Yzz2KXCYHAzzYjBv7dJW.jpg",
               "id": 21484,
               "order": 74
            },
            {
               "cast_id": 169,
               "character": "Jinglebells Cody",
               "gender": 2,
               "credit_id": "5677114bc3a368167a006e5b",
               "name": "Lewis Smith",
               "profile_path": "/6kBdu6PCpEZ0U2FeGm9PFMuLmgL.jpg",
               "id": 36041,
               "order": 75
            },
            {
               "cast_id": 170,
               "character": "",
               "gender": 0,
               "credit_id": "5677115a92514179db006819",
               "name": "Keniaryn Mitchell",
               "profile_path": null,
               "id": 1551617,
               "order": 76
            },
            {
               "cast_id": 171,
               "character": "House Servant",
               "gender": 0,
               "credit_id": "5677116892514179e70065ad",
               "name": "Jakel Marshall",
               "profile_path": "/4Eyw9yRKfPUgHKuyOov2uqi5RhZ.jpg",
               "id": 1292476,
               "order": 77
            },
            {
               "cast_id": 172,
               "character": "Carl / House Servant",
               "gender": 0,
               "credit_id": "5677117cc3a368167a006e63",
               "name": "Carl Singleton",
               "profile_path": null,
               "id": 1292477,
               "order": 78
            },
            {
               "cast_id": 173,
               "character": "",
               "gender": 0,
               "credit_id": "5677118a92514179dd0064f0",
               "name": "Ashley Toman",
               "profile_path": null,
               "id": 1551618,
               "order": 79
            },
            {
               "cast_id": 174,
               "character": "",
               "gender": 2,
               "credit_id": "567711a892514179d20068f1",
               "name": "John McConnell",
               "profile_path": "/p5q6yhbyylHoIUNqjj3JxxfXfyX.jpg",
               "id": 16459,
               "order": 80
            },
            {
               "cast_id": 183,
               "character": "Beard Man (uncredited)",
               "gender": 2,
               "credit_id": "5703e970c3a36861c0000015",
               "name": "Mark Amos",
               "profile_path": "/yx6FCWB2SpFqM3ktXsDsM4iQe1g.jpg",
               "id": 1516962,
               "order": 81
            },
            {
               "cast_id": 185,
               "character": "House Servant (uncredited)",
               "gender": 0,
               "credit_id": "5703e9d99251415663000028",
               "name": "Monica Rene'e Anderson",
               "profile_path": "/e1bI00OAI4atbyUV2o2530DvS2r.jpg",
               "id": 1292478,
               "order": 82
            },
            {
               "cast_id": 186,
               "character": "House Slave (uncredited)",
               "gender": 0,
               "credit_id": "5703ea06925141566c000032",
               "name": "Marsha Stephanie Blake",
               "profile_path": "/qd7oZkCygYNMLyw0p7NRyWl3k4R.jpg",
               "id": 187946,
               "order": 83
            },
            {
               "cast_id": 187,
               "character": "House Slave (uncredited)",
               "gender": 0,
               "credit_id": "5703ea39925141566000002d",
               "name": "Catherine Lambert",
               "profile_path": "/luN3iUUebKCnjjKiOXQtC6v7Jnx.jpg",
               "id": 75491,
               "order": 84
            },
            {
               "cast_id": 188,
               "character": "Cleopatra Pony (uncredited)",
               "gender": 0,
               "credit_id": "5703ea76c3a36861d900003f",
               "name": "Deborah Ayorinde",
               "profile_path": "/xAMkokPxvf07zmd1vXcAN1A9bPa.jpg",
               "id": 1292479,
               "order": 85
            },
            {
               "cast_id": 189,
               "character": "Pony (uncredited)",
               "gender": 0,
               "credit_id": "5703eac6925141565700004d",
               "name": "Takara Clark",
               "profile_path": "/aslIFHbMCwsJKyzIcaHap2bYIgs.jpg",
               "id": 1292483,
               "order": 86
            },
            {
               "cast_id": 190,
               "character": "Pony (uncredited)",
               "gender": 0,
               "credit_id": "5703eae7c3a3686982000001",
               "name": "Kimberley Drummond",
               "profile_path": "/o6vfceTRQo8L50CqzR6FWg4S1te.jpg",
               "id": 1292489,
               "order": 87
            },
            {
               "cast_id": 191,
               "character": "Pony (uncredited)",
               "gender": 0,
               "credit_id": "5703eb0cc3a3686989000006",
               "name": "Tenaj L. Jackson",
               "profile_path": "/pMRou2C1AjX4N1hUwYZCL8ucpCb.jpg",
               "id": 1292493,
               "order": 88
            },
            {
               "cast_id": 192,
               "character": "Mandingo Overseer (uncredited)",
               "gender": 0,
               "credit_id": "5703ebe6c3a368697700002b",
               "name": "Carl Bailey",
               "profile_path": "/veqqOxPsWJWJgVFiH9IBz4MEwxc.jpg",
               "id": 1170892,
               "order": 89
            },
            {
               "cast_id": 193,
               "character": "Overseer (uncredited)",
               "gender": 0,
               "credit_id": "5703ec2e9251415bb0000029",
               "name": "Ross P. Cook",
               "profile_path": "/ndjYOtQxi5x8BzUYRpdxdQLASne.jpg",
               "id": 1292485,
               "order": 90
            },
            {
               "cast_id": 194,
               "character": "Overseer (uncredited)",
               "gender": 0,
               "credit_id": "5703ec57c3a368697a00002f",
               "name": "Gregory Allen Gabroy",
               "profile_path": "/n5mJeSCkpef1BQ80ciqt7XbueRr.jpg",
               "id": 1292491,
               "order": 91
            },
            {
               "cast_id": 195,
               "character": "Overseer (uncredited)",
               "gender": 0,
               "credit_id": "5703ecb0c3a3686974000040",
               "name": "Gene Kevin Hames Jr.",
               "profile_path": null,
               "id": 1601433,
               "order": 92
            },
            {
               "cast_id": 196,
               "character": "Daughtrey Rifleman (uncredited)",
               "gender": 2,
               "credit_id": "5703ed11c3a3686972000049",
               "name": "Seth Bailey",
               "profile_path": "/oIdNDXA5oNOx6haG9vOI2QqPfaL.jpg",
               "id": 1292480,
               "order": 93
            },
            {
               "cast_id": 197,
               "character": "Slave Master (uncredited)",
               "gender": 2,
               "credit_id": "5703ed54c3a3686972000052",
               "name": "David G. Baker",
               "profile_path": "/emmzClUVvF4sLJe2iEXICNGYOlF.jpg",
               "id": 1512188,
               "order": 94
            },
            {
               "cast_id": 198,
               "character": "Slave Master (uncredited)",
               "gender": 0,
               "credit_id": "5703ed819251415bb6000059",
               "name": "Richie J. Ladner",
               "profile_path": "/8ujHLbiMlvoYBnbpuc1R2uhrQXi.jpg",
               "id": 1292495,
               "order": 95
            },
            {
               "cast_id": 199,
               "character": "Slave Overseer (uncredited)",
               "gender": 0,
               "credit_id": "5703ee88c3a368697700009e",
               "name": "Glen Warner",
               "profile_path": null,
               "id": 1037373,
               "order": 96
            },
            {
               "cast_id": 200,
               "character": "Crazy Sadie (uncredited)",
               "gender": 0,
               "credit_id": "5703eefc9251415bb0000092",
               "name": "Kesha Bullard",
               "profile_path": "/lU0zy051o5XDkUiqbvnBi5x3sSv.jpg",
               "id": 1292481,
               "order": 97
            },
            {
               "cast_id": 201,
               "character": "Plantation Owner (uncredited)",
               "gender": 0,
               "credit_id": "5703ef499251415bb60000a6",
               "name": "Edward J. Clare",
               "profile_path": "/83oSP3VgReqSZRvEubGiYjui7on.jpg",
               "id": 1292482,
               "order": 98
            },
            {
               "cast_id": 202,
               "character": "Samson (uncredited)",
               "gender": 0,
               "credit_id": "5703ef919251415bbb000093",
               "name": "Jordon Michael Corbin",
               "profile_path": "/55Rk7g3FIcTCjlmmdtkJH2UpWy9.jpg",
               "id": 1292486,
               "order": 99
            },
            {
               "cast_id": 203,
               "character": "Cowboy (uncredited)",
               "gender": 0,
               "credit_id": "5703efd59251415bad0000be",
               "name": "Mike DeMille",
               "profile_path": "/oQnwMTRs8n0XvUoDiVSqSYAotV7.jpg",
               "id": 1292487,
               "order": 100
            },
            {
               "cast_id": 204,
               "character": "Bennet Plantation Slave Water Boy (uncredited)",
               "gender": 0,
               "credit_id": "5703f00cc3a36869740000cf",
               "name": "Santana Draper",
               "profile_path": "/j9DRuS9xy4vYJb9iBmQqUsQn1CG.jpg",
               "id": 1292488,
               "order": 101
            },
            {
               "cast_id": 205,
               "character": "Bob Gibbs (uncredited)",
               "gender": 2,
               "credit_id": "5703f06ac3a36869740000dd",
               "name": "Gary Grubbs",
               "profile_path": "/zbSSBFW8oRl4M1u2vyr1PUnWqCw.jpg",
               "id": 68180,
               "order": 102
            },
            {
               "cast_id": 206,
               "character": "Goat Farmer (uncredited)",
               "gender": 0,
               "credit_id": "5703f0bdc3a3686985000103",
               "name": "Justin Hall",
               "profile_path": "/wlm3W5lsF1pjGQ21rXmKYv1bWlV.jpg",
               "id": 1292492,
               "order": 103
            },
            {
               "cast_id": 207,
               "character": "Towns person (uncredited)",
               "gender": 1,
               "credit_id": "5703f128c3a3686985000113",
               "name": "Jacquelyn Twodat Jackson",
               "profile_path": null,
               "id": 1601439,
               "order": 104
            },
            {
               "cast_id": 208,
               "character": "Town Woman (uncredited)",
               "gender": 0,
               "credit_id": "5703f1a8c3a368698900010d",
               "name": "Sandra Linz",
               "profile_path": "/gHgKNUdW7VKXq3u9gS9JzXiOVbJ.jpg",
               "id": 1292490,
               "order": 105
            },
            {
               "cast_id": 209,
               "character": "Mule Wrangler (uncredited)",
               "gender": 0,
               "credit_id": "5703f1d4c3a3686985000131",
               "name": "Kasey James",
               "profile_path": "/sFxz5YjgBTTxWfCtbJ4kBBJq2IZ.jpg",
               "id": 1292494,
               "order": 106
            },
            {
               "cast_id": 210,
               "character": "Cleo Master (uncredited)",
               "gender": 0,
               "credit_id": "5703f2089251415bb600011e",
               "name": "Skipper Landry",
               "profile_path": "/mQS0Fv1GsxvorMCNeaT8wQtTFl.jpg",
               "id": 1292496,
               "order": 107
            },
            {
               "cast_id": 230,
               "character": "Cleo Club Patron / Polly Wolly Singer (uncredited)",
               "gender": 2,
               "credit_id": "5736766fc3a3687e2a00160b",
               "name": "Elton LeBlanc",
               "profile_path": "/gt1cZrI2huWKy865M6ItQHWcU3f.jpg",
               "id": 1011212,
               "order": 108
            },
            {
               "cast_id": 212,
               "character": "Chinese Boy (uncredited)",
               "gender": 0,
               "credit_id": "5703f2fc9251415bbb000127",
               "name": "Cindy Mah",
               "profile_path": null,
               "id": 1589685,
               "order": 109
            },
            {
               "cast_id": 214,
               "character": "Dr. Brown (uncredited)",
               "gender": 0,
               "credit_id": "5703f3f19251415bad000160",
               "name": "Johnny Otto",
               "profile_path": "/i5LOfr6GLH6hvBdCoMyKY457IQZ.jpg",
               "id": 1601441,
               "order": 110
            },
            {
               "cast_id": 215,
               "character": "Candyland House Servant (uncredited)",
               "gender": 1,
               "credit_id": "5703f43f9251415bbb00016b",
               "name": "Belinda Owino",
               "profile_path": "/ftCNmDEtoXxb1Al0OFpQUduLENl.jpg",
               "id": 1485552,
               "order": 111
            },
            {
               "cast_id": 216,
               "character": "Woman with Rifle (uncredited)",
               "gender": 0,
               "credit_id": "5703f474c3a368697200018f",
               "name": "Erin Pickett",
               "profile_path": null,
               "id": 1265833,
               "order": 112
            },
            {
               "cast_id": 217,
               "character": "Gabby the Banker (uncredited)",
               "gender": 2,
               "credit_id": "5703f5059251415bad0001a7",
               "name": "Mark Ulano",
               "profile_path": null,
               "id": 1547309,
               "order": 113
            },
            {
               "cast_id": 219,
               "character": "Minnie (uncredited)",
               "gender": 0,
               "credit_id": "5703f5adc3a368698200019e",
               "name": "Misty Upham",
               "profile_path": "/78YVlWbvZiEO9Z1F4NfWiIrv2SS.jpg",
               "id": 64136,
               "order": 114
            },
            {
               "cast_id": 232,
               "character": "Joshua",
               "gender": 2,
               "credit_id": "580ade41c3a368295b005d1e",
               "name": "Edrick Browne",
               "profile_path": "/rKc64U4YccyEPfEf7VCXbdBmQAx.jpg",
               "id": 112286,
               "order": 115
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d12d1",
               "name": "Quentin Tarantino",
               "profile_path": "/9ci4NBvHXJktxjALdJsrtasqgtV.jpg",
               "id": 138,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d12d7",
               "name": "Quentin Tarantino",
               "profile_path": "/9ci4NBvHXJktxjALdJsrtasqgtV.jpg",
               "id": 138,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d12f5",
               "name": "Reginald Hudlin",
               "profile_path": "/jMos9yMWnCBVLE4F83Yt06CRYbI.jpg",
               "id": 68215,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe479fc3a368484e0d12fb",
               "name": "Pilar Savone",
               "profile_path": "/tbURKEMgSgF49Or2Y9uu4qJKPt5.jpg",
               "id": 1003189,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe479fc3a368484e0d1301",
               "name": "Stacey Sher",
               "profile_path": "/fFvKIC38R9Q34VhTQ8BGfqorK8E.jpg",
               "id": 5382,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d135b",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d136d",
               "name": "Bob Weinstein",
               "profile_path": "/hheuMcH8MnFGmatPvhdLUNnSOwm.jpg",
               "id": 1307,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1373",
               "name": "James W. Skotchdopole",
               "profile_path": null,
               "id": 4701,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1379",
               "name": "Michael Shamberg",
               "profile_path": "/tjqSWmFb0OCjnTwDISwR8Kl94af.jpg",
               "id": 5381,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe479fc3a368484e0d137f",
               "name": "Shannon McIntosh",
               "profile_path": "/yjCf0wzyZJ851bwRGfbfAbR9eV8.jpg",
               "id": 963669,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1385",
               "name": "Robert Richardson",
               "profile_path": "/9tLrDHL9qL9yYIhcJVaINwnzmWN.jpg",
               "id": 149,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d138b",
               "name": "Fred Raskin",
               "profile_path": null,
               "id": 58194,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe479fc3a368484e0d1391",
               "name": "Victoria Thomas",
               "profile_path": "/cdOR8cgySFsgxWtp6hGA3eMsVra.jpg",
               "id": 547,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d1397",
               "name": "J. Michael Riva",
               "profile_path": null,
               "id": 13304,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe479fc3a368484e0d139d",
               "name": "Page Buckner",
               "profile_path": null,
               "id": 18867,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe479fc3a368484e0d13a3",
               "name": "David F. Klassen",
               "profile_path": null,
               "id": 14349,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe479fc3a368484e0d13a9",
               "name": "Mara LePere-Schloop",
               "profile_path": null,
               "id": 966594,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "52fe479fc3a368484e0d13af",
               "name": "Leslie A. Pope",
               "profile_path": "/kQCmYkLcHHPPovZMviLAUJCeGTm.jpg",
               "id": 19157,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe479fc3a368484e0d13b5",
               "name": "Sharen Davis",
               "profile_path": null,
               "id": 15573,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "54d88083c3a3685431003fe0",
               "name": "Camille Friend",
               "profile_path": "/oqRHAueWWqslWfVHRGQAjEd8vTI.jpg",
               "id": 1424894,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "54d8809ec3a3683b890078d2",
               "name": "Deidra Dixon",
               "profile_path": null,
               "id": 1412189,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "54d880e292514154a100048b",
               "name": "Heba Thorisdottir",
               "profile_path": null,
               "id": 1389609,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "54d880f89251416b93007534",
               "name": "Tysuela Hill-Scott",
               "profile_path": null,
               "id": 1420146,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "54d8814dc3a3683ba0008211",
               "name": "Sian Grigg",
               "profile_path": null,
               "id": 1422795,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "54d8819a9251413cd000045c",
               "name": "Victoria Wood",
               "profile_path": null,
               "id": 1407721,
               "department": "Costume & Make-Up",
               "job": "Wigmaker"
            },
            {
               "gender": 0,
               "credit_id": "54d881b79251416b93007550",
               "name": "Gino Crognale",
               "profile_path": null,
               "id": 1130027,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "54d881d09251417160007b5d",
               "name": "Jake Garber",
               "profile_path": "/d3xjQNUpOuVvIjEWuZuesrQ8T3b.jpg",
               "id": 1206190,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "54d882089251411a80000780",
               "name": "Caleb Guillotte",
               "profile_path": null,
               "id": 1424896,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "54d8822cc3a3683b8c007c05",
               "name": "Lauren Abiouness",
               "profile_path": null,
               "id": 1424897,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "54d8824ec3a3683b8f007c48",
               "name": "Hope M. Parrish",
               "profile_path": null,
               "id": 1390522,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 0,
               "credit_id": "54d88275c3a3683b92007fb3",
               "name": "Brian Walker",
               "profile_path": null,
               "id": 1424898,
               "department": "Art",
               "job": "Construction Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "54d882a99251416ba8007064",
               "name": "Russell R. Anderson",
               "profile_path": null,
               "id": 1355526,
               "department": "Art",
               "job": "Leadman"
            },
            {
               "gender": 0,
               "credit_id": "54d882d5c3a3683b8f007c55",
               "name": "Cuitlahuac Morales Velazquez",
               "profile_path": null,
               "id": 1355530,
               "department": "Art",
               "job": "Sculptor"
            },
            {
               "gender": 0,
               "credit_id": "54d882ee9251415f9c007555",
               "name": "Molly Mikula",
               "profile_path": null,
               "id": 1403392,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "54d88a7b9251416b93007612",
               "name": "Renée Tondelli",
               "profile_path": null,
               "id": 1420154,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 0,
               "credit_id": "54d88a98c3a3681f5a000743",
               "name": "Gary Marullo",
               "profile_path": null,
               "id": 1340739,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 2,
               "credit_id": "54d88ab0c3a3683b9900724c",
               "name": "Gary A. Hecker",
               "profile_path": "/qyBUauN3XIS2Mlus3OdGCmrUo0S.jpg",
               "id": 1077782,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "54d88aeec3a36854310040b6",
               "name": "Michael Hertlein",
               "profile_path": null,
               "id": 1352966,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 2,
               "credit_id": "54d88b0192514154a1000575",
               "name": "John C. Stuver",
               "profile_path": null,
               "id": 1387183,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "54d88b20c3a3683b9200807b",
               "name": "Wylie Stateman",
               "profile_path": null,
               "id": 1352969,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "54d88b479251413cd00005bd",
               "name": "Dror Mohar",
               "profile_path": null,
               "id": 930016,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "54d88b5cc3a3681f5a000755",
               "name": "Branden Spencer",
               "profile_path": null,
               "id": 548443,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "54d88b76c3a3683b9900725a",
               "name": "Michael D. Wilhoit",
               "profile_path": null,
               "id": 1417972,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 2,
               "credit_id": "54d88b9b9251417160007d50",
               "name": "Harry Cohen",
               "profile_path": null,
               "id": 3687,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "54d88bb092514154a100057f",
               "name": "Tony Lamberti",
               "profile_path": "/jQTxQeV6n6zjRYDgyxiQzUx08Kq.jpg",
               "id": 13179,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "54d88bc4c3a3683b92008089",
               "name": "Michael Minkler",
               "profile_path": null,
               "id": 1399141,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "54d88c159251415f9c00763d",
               "name": "Andrew S. Eisen",
               "profile_path": null,
               "id": 71279,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 2,
               "credit_id": "54d88c5592514154a1000592",
               "name": "Jeffrey J. Dashnaw",
               "profile_path": "/5Sw0YV4U8Yg7BpN8yVX7vVc8y8x.jpg",
               "id": 23285,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "54d88cbac3a3683b8f007d48",
               "name": "Julie Stark",
               "profile_path": null,
               "id": 1424907,
               "department": "Crew",
               "job": "Sequence Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "54d88ce7c3a3683ba00083dc",
               "name": "Ian Kincaid",
               "profile_path": null,
               "id": 589970,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "54d88d1ec3a3683b8c007d23",
               "name": "Larry McConkey",
               "profile_path": null,
               "id": 983118,
               "department": "Camera",
               "job": "Steadicam Operator"
            },
            {
               "gender": 0,
               "credit_id": "54d88d399251416b9300763d",
               "name": "Joseph Guerino",
               "profile_path": null,
               "id": 1424908,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "54d88d4e92514154a100059f",
               "name": "Andrew Cooper",
               "profile_path": null,
               "id": 1386920,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "54d88d94925141424100055b",
               "name": "Elaine Ramires",
               "profile_path": null,
               "id": 1328407,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "54d88dd39251416ba8007163",
               "name": "Andrew S. Eisen",
               "profile_path": null,
               "id": 71279,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "54d88dec9251415f9c00765e",
               "name": "Greg D'Auria",
               "profile_path": null,
               "id": 1204243,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "54d88e03c3a3683b9900729a",
               "name": "Robb Boyd",
               "profile_path": null,
               "id": 1393405,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "54d88e30c3a3685431004157",
               "name": "Steve Duncan",
               "profile_path": null,
               "id": 1422073,
               "department": "Crew",
               "job": "Transportation Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "54d88e489251416ba800716a",
               "name": "A. Welch Lambeth",
               "profile_path": null,
               "id": 1421255,
               "department": "Crew",
               "job": "Transportation Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "54d88e849251416ba8007170",
               "name": "Tim Monich",
               "profile_path": null,
               "id": 13050,
               "department": "Crew",
               "job": "Dialect Coach"
            },
            {
               "gender": 0,
               "credit_id": "54d88eb2c3a3683ba000848e",
               "name": "Lauri Mills",
               "profile_path": null,
               "id": 1367510,
               "department": "Crew",
               "job": "Studio Teachers"
            },
            {
               "gender": 2,
               "credit_id": "54d88eccc3a3685431004166",
               "name": "Martin Kitrosser",
               "profile_path": null,
               "id": 58809,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "54d88eed9251416ba8007188",
               "name": "Will Casey",
               "profile_path": null,
               "id": 1415650,
               "department": "Crew",
               "job": "Unit Publicist"
            },
            {
               "gender": 0,
               "credit_id": "54d88f049251413cd00006b3",
               "name": "Mandi Dillin",
               "profile_path": null,
               "id": 1345627,
               "department": "Production",
               "job": "Location Manager"
            },
            {
               "gender": 0,
               "credit_id": "54d88f58c3a3683b890079f4",
               "name": "Kei Rowan-Young",
               "profile_path": null,
               "id": 1424911,
               "department": "Production",
               "job": "Location Manager"
            },
            {
               "gender": 0,
               "credit_id": "5703f345c3a368698500015f",
               "name": "Cindy Mah",
               "profile_path": null,
               "id": 1589685,
               "department": "Art",
               "job": "Other"
            },
            {
               "gender": 0,
               "credit_id": "56195fb49251416ca80001fb",
               "name": "Craig Branham",
               "profile_path": "/aWfSB2ozharGHl91uHEOATlLw6L.jpg",
               "id": 1521185,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "5702a029c3a3685686003153",
               "name": "William Paul Clark",
               "profile_path": null,
               "id": 1599143,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5702a03792514151b8001580",
               "name": "William Paul Clark",
               "profile_path": null,
               "id": 1599143,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "57030c88c3a36806d900099b",
               "name": "Molly Allen",
               "profile_path": null,
               "id": 1392615,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "57030d47c3a36806d6000914",
               "name": "Tina Anderson",
               "profile_path": null,
               "id": 1400529,
               "department": "Crew",
               "job": "Post Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57030d9b9251416cad000884",
               "name": "Marc A. Hammer",
               "profile_path": null,
               "id": 1415342,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "57030e2f9251416cb20008de",
               "name": "James W. Skotchdopole",
               "profile_path": null,
               "id": 4701,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "57030efc9251416ca3000940",
               "name": "Luis Bacalov",
               "profile_path": "/d9hYl7eX4KxIz4wZ9psdKjxmaSF.jpg",
               "id": 66675,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "57030f43c3a36806d9000a3e",
               "name": "Mary Ramos",
               "profile_path": null,
               "id": 1545448,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "5703e99ac3a36861f3000027",
               "name": "Mark Amos",
               "profile_path": "/yx6FCWB2SpFqM3ktXsDsM4iQe1g.jpg",
               "id": 1516962,
               "department": "Production",
               "job": "Production Accountant"
            },
            {
               "gender": 2,
               "credit_id": "5703f61fc3a3686977000216",
               "name": "Sacha Baron Cohen",
               "profile_path": "/9UWxlTsGAfRAcxG2LcUMbfR3FiF.jpg",
               "id": 6730,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 1,
               "credit_id": "5703f6429251415bb90001c5",
               "name": "Lady Gaga",
               "profile_path": "/uPlzD1ARsApOsU20eeWradHpWjr.jpg",
               "id": 237405,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 2,
               "credit_id": "5703f64f9251415bb90001ce",
               "name": "Joseph Gordon-Levitt",
               "profile_path": "/zSuXCR6xCKIgo0gWLdp8moMlH3I.jpg",
               "id": 24045,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 2,
               "credit_id": "5703f682c3a368697a000197",
               "name": "Franco Nero",
               "profile_path": "/lwXfTQrFqAw4zcVjrhgq3THfWCg.jpg",
               "id": 22383,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 2,
               "credit_id": "5703f6a2c3a36869850001d9",
               "name": "Robert Rodriguez",
               "profile_path": "/bPqRdLWWwpOT8sBdj9PWOzNgwou.jpg",
               "id": 2294,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 2,
               "credit_id": "5703f6b8c3a36869740001e9",
               "name": "Richard Roundtree",
               "profile_path": "/3OyAx3Vrv1mQLOvl7YHaIaFwDuW.jpg",
               "id": 6487,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 2,
               "credit_id": "5703f6c99251415bad0001f1",
               "name": "Kurt Russell",
               "profile_path": "/rlnFuNkisPpuypARI7QaGCmOY6V.jpg",
               "id": 6856,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 2,
               "credit_id": "5703f6d99251415bb00001d8",
               "name": "RZA",
               "profile_path": "/v5bwcyzUWVqjmczWu4PrdwnL6t6.jpg",
               "id": 150,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 2,
               "credit_id": "570d8d71c3a3680a2c0003c1",
               "name": "Gregory Nicotero",
               "profile_path": "/tbSRk7j0hYlBWWX7QrjdOXeiMpW.jpg",
               "id": 59287,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "570fca90c3a3685370003808",
               "name": "Bruce Del Castillo",
               "profile_path": "/769Qsc4LLBTOQNIJSdDWyn127me.jpg",
               "id": 1485553,
               "department": "Camera",
               "job": "Grip"
            },
            {
               "gender": 0,
               "credit_id": "575ee4dd9251415a2f000073",
               "name": "Yvan Lucas",
               "profile_path": null,
               "id": 1542917,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 2,
               "credit_id": "599d6d3ac3a368282c01a403",
               "name": "Mark Ulano",
               "profile_path": null,
               "id": 1547309,
               "department": "Sound",
               "job": "Production Sound Mixer"
            },
            {
               "gender": 2,
               "credit_id": "5a8c73c8c3a368637c09487c",
               "name": "John Legend",
               "profile_path": "/y0p52grR5jLEEsbFDexsOd4zkJg.jpg",
               "id": 113461,
               "department": "Sound",
               "job": "Songs"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 49.185831,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 68718,
      "vote_count": 12147,
      "budget": 100000000,
      "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
      "similar": [
         272,
         862,
         18885,
         5176,
         1374,
         28178,
         600,
         33,
         665,
         180863,
         363676,
         281957,
         397422,
         7191,
         9342,
         36647,
         37430,
         8068,
         605,
         754
      ],
      "original_title": "Django Unchained",
      "runtime": 165,
      "poster_path": "/5WJnxuw41sddupf8cwOxYftuvJG.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/e8F3mQM7DkJ5SfYYDp8FYzPBOGX.png",
            "name": "The Weinstein Company",
            "id": 308,
            "origin_country": "US"
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "2012-12-25",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "Life, liberty and the pursuit of vengeance.",
      "adult": false,
      "homepage": "http://unchainedmovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Quentin Tarantino"],
      "runtime": 165,
      "synopsis": "In 1858, Django ( Jamie Foxx), a slave, is chained to a bunch of other slaves and being marched to his new owner's estate in Texas by the Speck brothers. At nightfall, a German man in a dentist cart pulls up and hails the Speck brothers. He introduces himself as Dr. King Schultz ( Christoph Waltz). Schultz is clearly more intelligent and enlightened than the Specks. He says he is looking for a slave who can identify a band of wanted fugitives known as the Brittle brothers. Django announces that he knows the Brittle brothers and can identify them. Schultz offers to buy Django, but his polite and educated manner rubs the ill-mannered Specks the wrong way, and Ace Speck threatens to shoot him with his shotgun. In response, Schultz lowers his lantern, whips out a revolver, and shoots Ace, then Dicky's horse, causing Dicky to fall off his horse. The horse carcass then lands on and crushes Dicky's leg, leaving him screaming in pain. Crippled, he agrees to sell Django, and Schultz pays the man (for both Django, and the dead Speck's horse), gets an official title to Django, and prepares to ride off. Before Schultz leaves, however, he frees the remaining slaves (clearly, Schultz finds slavery abhorrent) and says that they may either carry the remaining Speck brother back to town, or shoot him and flee. As Django and Schultz ride off, we hear Speck pleading for his life. We hear a gunshot and can see blood splatter as Dicky's brains are blown out. Django and Schultz arrive in the small town of Daughtrey near El Paso. As they travel through the streets, townspeople stop to stare in disbelief at the sight of a nigger on a horse, much to Schultz's confusion. As Schultz ties his cart down at a hitching post, he checks some papers to make sure he's in the right place. The two then walk into a saloon despite the fact that Django is forbidden from doing so because he is black due to the South's segregation laws. When Schultz insists on being served, the barkeep runs out of the saloon, Schultz calling after him to specifically bring the sheriff, not the town marshal. While they wait, Schultz pours beers for himself and Django and leaves money on the bar. He explains that he is no longer a dentist, but a bounty hunter in search of the Brittle brothers who are wanted dead or alive. He admits that although he knows the general location of the brothers, near Gatlinburg, they have adopted aliases, and he needs somebody who can identify them. Schultz tells Django that if he helps him bring in the Brittle brothers, Schultz will give him his freedom, pay him a $75 share of the reward, and let him keep his horse. Django immediately agrees, when, as if on cue, Schultz sees the sheriff coming down the sidewalk. The sheriff enters the saloon, shotgun in hand, and tells Schultz and Django to leave. The two comply, and exit out the swinging doors. We see that a number of townspeople are watching the spectacle unfolding as the sheriff asks them why they are coming into his town and showing themselves with the sole purpose of causing trouble. Schultz is silent, then steps forward. A spring-mounted Derringer pops up in his right hand, and he shoots the sheriff in the stomach. The townspeople are stunned as the sheriff stumbles to the ground, moaning in pain from the bullet wound. Schultz walks around the wounded sheriff, aims his Derringer, and shoots him in the head, killing him. The townspeople immediately run for their lives. Schultz looks up and tells the bartender that now is the time to fetch the marshal. The bartender runs off while Schultz and Django go back into the saloon to wait. The town marshal and most of the town arrive and train rifles on the front door of the saloon. Schultz hears that he has 100 rifles aimed at his head, and gets the marshal to agree to not have him shot dead like a dog in the street when he comes out. Schultz then exits, hands raised over his head, and a paper in his hand. He announces to the marshal and to the assembled townsfolk what has really happened: that the dead man the people of Daughtrey saw fit to elect as their sheriff, who went by the name of 'Bill Sharpe', is a wanted cattle rustler named Willard Peck, with a $200 bounty on his head. Schultz suggests that the marshal pay him the $200 fee. Later, while camping, Django admits to Schultz that what he wants to do once he is liberated is buy freedom for his wife, a slave girl named Broomhilda von Shaft ( Kerry Washington) who had been a servant of a German mistress before being sold into slavery in the U.S. Their owner Carrucan ( Bruce Dern) was cruel and disapproved of their marriage, so the pair attempted escape. They were caught by the Brittle brothers, who tortured and branded them both with the mark of a runaway, a small \"R\" on their right cheeks. Their owner then directed the Brittle brothers to sell the pair to separate owners, and to take the lowest price for Django. Django and Schultz eventually develop a plan to infiltrate an estate near Gatlinburg where they suspect that the Brittle brothers reside and for Django to identify them. Django is to play-act as a freed slave who has been hired as Schultz's valet. They arrive at the plantation owned by Spencer \"Big Daddy\" Bennett ( Don Johnson). Schultz states he is looking to buy one of Bennett's slave girls for an exorbitant price. As he and Bennett talk business, Django is given free range to look around the estate. Django asks Betina, his escort, if she knows of the Brittles. Betina admits that she doesn't know them, leading Django to suspect that the Brittles are using an alias name. At this, Betina reveals that three overseer brothers known as the Schaeffers did arrive in the past year. She points out the first one in the field. Django looks through his telescope and sees that it is Ellis. Seeing Ellis causes Django to have a lengthy flashback over running away with Broomhilda and pleading with Big John to spare Broomhilda from the whip, unsuccessfully. The flashback ends with Big John saying, \"I like the way you beg, boy.\" Snapping out of his flashback, Django learns that Big John and Little Raj are on a different part of the plantation, about to whip a young slave girl for breaking eggs. The two have tied her to a tree by the arms and Big John is about to use the whip on her when Django appears and shouts Big John's name. Big John turns, stunned to see Django, who suddenly produces a Derringer similar to Schultz's and shoots him through a Bible page glued to his shirt. He looks down at his bullet wound, stunned, as Django tells him, \"I like the way you die, boy,\" and Big John pitches forward, dead. Little Raj attempts to grab his revolver, but Django grabs Big John's whip and uses it to beat him unconscious. He then takes the gun and unloads it into Little Raj, just as Schultz comes racing in. Django tells Schultz that Ellis is already galloping away across the cotton field. Schultz tracks Ellis through his sniper rifle, and once Django says he is sure he is right, Schultz fires. Blood sprays the cotton flowers as Ellis falls off his horse, a bullet in his chest. Though Bennett is incensed when he arrives, he is forced to let them go once Schultz explains they are legally authorized to kill and collect these men. That night, out for revenge, Bennett calls out all the fellow white men of the plantation to kill Django and Schultz, spotting their dentist's cart camped outside of town. The men make their charge over the hill in KKK style masks, and surround the small campsite. The scene then changes to earlier, when Bennett is giving instructions to the other Klansmen to not shoot Django or Schultz unless they are shot at. He puts his bag hood on, and a funny scene ensues as Bennett finds he is unable to see through the eye holes in his mask. Everyone else starts to bicker about how badly made their masks are, which ends with Willard, whose wife Jenny spent all afternoon making masks for them, giving up and riding away, furious. Eventually, the Klansmen get their act together. As they surround the cart, one of the men spots what he thinks is Django and Schultz hiding under the cart. He peeks under, only to find that the 'bodies' are actually bedrolls. Bennett wonders where the two bounty hunters actually are. In response, the scene cuts to Django and Schultz hiding in a tree a short distance away, Schultz carrying a rifle. Schultz says, \"auf wiedersehen,\" and fires at the cart, setting off a bundle of dynamite hidden in the tooth on the roof of his cart. It blows up and kills most of the Klansmen. Bennett manages to survive the detonation and begins riding away. Schultz sees this and hands the rifle over to Django, letting him do the honors. Django tracks, and then fires, hitting Bennett and shooting him off his horse. Schultz realizes that Django is a formidable natural sharpshooter. King asks what Django will do now that he is officially free, and Django says he will locate his wife (believed to be in Mississippi) and try to purchase her freedom. King, who has bonded with Django and is impressed by both his intelligence and marksmanship, proposes to help Django rescue his wife if Django will work with him over the winter in collecting bounties. King is also impressed with Broomhilda's name (and her ability to speak German), telling Django the German legend of Siegfried and Brunhilde. In the legend, the beautiful Brunhilde is captured and imprisoned in a tower on a mountainside that is guarded by a dragon and surrounded by hellfire. Her lover, Siegfried, rescues her, facing the mountain and dragon simply because he is brave, but also overcoming the hellfire out of his love for Brunhilde. Django is quite taken with the tale. Django agrees to King's proposal, finding him to be a deeply honorable man in spite of his line of work. King trains Django to not only be an expert with a gun, but also how to read and present himself in public. On one mission, Django and King perch themselves on a hill overlooking a small farm where Django hesitates to kill a man who is now peacefully working on the farm and has a son. King explains that before the man owned this farm and started a family, he murdered several people while robbing stagecoaches, and that he has a $7,000 bounty on his head. King explains that it is this own man's actions in a dirty world that has brought the bounty hunters to his door. Hearing this, Django shoots and kills the man in front of his son. King tells him to keep the wanted poster, as a bounty hunter's first successful poster is good luck. Throughout the winter, Django imagines he and Broomhilda free and happy. Jumping forward to March 1859, once winter passes, the two head back to the South in search of Broomhilda. King discovers that she was sold to a man named Calvin Candie ( Leonardo DiCaprio), the owner of a plantation known as 'Candie Land'. Candie is famous for breeding \"mandingos\"--slaves who are bred to fight each other to the death (bare-knuckle) for their owner's amusement (and for betting purposes). King says that he will pose as a wealthy European who seeks to purchase one of Candie's mandingos to take to fight in Europe, and that Django is his business partner and talent evaluator. That evening, Django and King arrive at a Candie's Cleopatra Club and they meet Candie's lawyer, Leonide Moguy ( Dennis Christopher), who explains that Candie is obsessed with French culture (although Candie, unlike the actually cultured King, does not speak French). The two are brought upstairs where they watch a mandingo fight, which is very brutal and fatal for the loser, who gets his eyes gouged out by the winner. As Candie congratulates his winning mandingo, the owner of the dead mandingo, an Italian businessman named Amerigo Vessepi (Franco Nero, the star of the original 'Django' in a suprise cameo) frets over the loss of his fighter and retires to the nearby bar for a drink. Django introduces himself to Vessepi before he walks out (a clear homage and wink-to-the-audience of the two Django actors in the same scene in the only time in this movie). It turns out that Candie is boorish and clearly arrogant and ignorant despite his wealth and high upbringing. Django is incredibly offensive to Candie and his guests, talking back to all the white men. Candie finds Django's rude and defensive behavior amusing and King to be charming. King and Django state that they are willing to pay an exorbitant amount ($12,000) for one of Candie's better mandingos and they arrange to return with him to his estate. The next morning, the group travels in a convoy to the Candieland ranch. Django continues to act defiantly, insulting both slave and white man alike, and displays his intelligence. When King asks Django why he is so belligerent, Django says he is playing his role in this dirty world. Candie states that he believes one in 10,000 black men are exceptional, and believes Django to be one of those rare few. At one point on the travel into Candyland, they see one of Candie's slaves chased up a tree by some of Candie's white trash work-men and their vicious hounds. It turns out the slave, D'Artagnan (named by Candie after the hero from The Three Musketeers, a book written by Frenchman Alexandre Dumas, whom Candie admires), is a mandingo who was caught running away. Candie convinces D'Artagnan to come down from the tree where D'Artagnan pleads he can't handle any other fights despite having won three in a row. Candie states that his slaves can't retire from fighting until they have won at least five matches in order for him to recoup his $500 investment in them, and that D'Artagnan must be killed. Schultz suddenly offers to pay Candie $500 to spare D'Artagnan's life, but Django, realizing such odd behavior would blow their cover, loudly declares that D'Artagnan isn't worth a single penny. Schultz, coming to his senses, agrees not to pay for D'Artagnan, and Candie has the slave ripped to pieces by the hounds as they all look on. Django glares at Candie, but imagines himself reunited with Broomhilda to keep his anger suppressed. A little later, they all arrive at Candie Land and meet Candie's widowed older sister Lara Lee (Laura Cayouette) and his loyal house-slave and foreman trustee Stephen ( Samuel L. Jackson). It is clear that Stephen is appalled that Django is free and riding on a horse into the estate along with his master and other white men. Django also takes an instant dislike to Stephen. Stephen informs Candie that, while he was gone, Broomhilda also attempted to escape and is now locked in the Hot Box, a metal pit in Candie's field. Schultz says he wants to meet Broomhilda, saying he heard legend of her German-speaking abilities. Candie, wanting to please his guest, orders Broomhilda to be cleaned up and sent to Schultz's room. Once there, Schultz explains to Broomhilda (in German) that he and his \"friend\" are here to rescue her. He then signals Django to come into his room, and Broomhilda faints with happiness upon seeing her husband. Schultz, impressed with Broomhilda's intelligence, begins the next phase of his plan. That evening at dinner, Broomhilda serves Candie and his many guests - including Schultz and Django. Lara notes that Broomhilda seems to be attracted to Django. This piques Stephen's curiosity (we see that Stephen is clearly invested in Candie's success, and forces the other slaves to call him \"Sir,\" or \"Mister Stephen\" as though he were their master) and he begins to interrogate Broomhilda in a back room. Broomhilda denies knowing Django, but Stephen knows that she is lying because she bears the same small 'r' brand (for \"runaway\") on the right side of her face as Django does. Meanwhile, Schultz, despite Django's \"objections,\" offers to buy Candie's third-best mandingo for $12,000. They agree that Schultz will return to the estate in five days with a lawyer to complete the transaction. Candie, clearly thrilled at this windfall, is then asked by King whether he can also purchase Broomhilda and take immediate possession of her (King claims he is interested in her ability to speak German, though Candie is convinced Schultz is simply sexually attracted to her). Before Candie can accept the deal, Stephen interrupts and asks to speak to his master in another room. Once there, Stephen (who is drinking brandy) tells Candie that he is convinced that Django and Broomhilda know each other and that Schultz and Django intend to buy her, leave the property, and never return for the mandingo. Candie is incensed and returns to the dining room with a small bag containing the skull of an old slave of his plantation, Ben. He then explains that he collects the skulls of his dead slaves and, invoking the pseudoscience of phrenology, has determined that the reason they don't rise up and kill their masters, despite easily outnumbering the whites, is that their brains are predisposed to subservience whereas white brains are built for dominance and ingenuity. Candie then reveals he knows that they want Broomhilda, and unless they immediately pay him $12,000 for her, he will kill her and examine her skull in front of them. King immediately agrees to these terms, and Candie tells Django that he is not exceptional after all. Schultz pays the $12,000 and Candie has his lawyer, Leonide Moguy, begin drawing up the papers transferring ownership of Broomhilda to King. Candie gloats about his victory and intelligence, and Schultz begins to think of D'Artagnan's brutal death. The papers are signed, but before they leave, King insults Candie's intelligence, noting how especially stupid Candie is, since he names his slaves after characters in novels written by Dumas even though Dumas was a black man. Candie, seeking to humiliate Schultz and recognizing that Schultz finds him to be a disgusting human being, says he will not allow the travelers to leave with Broomhilda unless King shakes his hand, a Mississippi & Southern tradition. This is more than Schultz can take. As he stretches out his hand to shake Candie's hand, the spring-loaded pistol he used on the sheriff of Daughtrey pops into his right hand and fires through the flower on Candie's lapel. Candie looks down at the bullet wound, clutches his chest, staggers backwards and falls over, dead. Stephen screams, \"No!\" and rushes to Candie's side. Butch Pooch, Candie's bodyguard, turns around. Schultz apologizes to Django for being unable to resist temptation, and then Pooch fires his shotgun. The bullet hits Schultz with enough force to throw him back into a bookcase, dead. Just as Schultz's body hits the ground, all hell breaks loose as Django grabs the distracted Pooch's revolver and shoots him. Moguy tries to run, screaming for help, but is shot multiple times as he tries to enter the foyer. Django then is thrown back into the foyer, and a shootout ensues as he trades fire with numerous white ranchers. Blood flies everywhere and bodies fall left, right and center. The shootout ends when Django runs out of ammo, while Stephen and Billy Crash capture Broomhilda and threaten to kill her unless Django surrenders. Feeling that he has no other choice, Django does surrender and he is brutally beaten by Candie's crew. When Django awakens, he is naked and tied upside down. Billy Crash is preparing to castrate him with a red hot knife. Stephen enters and tells the man that the plans have changed, and Django is no longer slated for castration. After the man leaves, Stephen explains that Django would have died too quickly if he had been castrated. Stephen, wanting Django to suffer, has arranged to sell him to the LeQuint Dickey Mining Company as a slave, where Django will spend the rest of his days. En route to the mining company, Django is able to get the attention of one of the transporters (a group of Australians, including a cameo by director Quentin Tarantino). He tells them that he is a bounty hunter, not a slave, and that he was tracking a man worth $7,000 before he was captured. He promises that if they free and arm him, he will give them the lion's share of the reward. They find the bounty notice (from Django's first kill) on his person and also question the other slaves, who admit that Django is a bounty hunter and rode in to Candie Land with a white man on a horse. The transporters unwisely free Django, give him a pistol and he immediately kills them all and frees the other slaves bound for the mine. He takes a horse, guns, and dynamite and heads back to Candie Land. Django first stops and massacres the men (trackers) who had hunted down the escaped D'Artagnan with their hounds, killing them all in D'Artagnan's name (the masked female tracker is played by Zoe Bell, and another tracker is played by Tom Savini). He then finds King's dead body in a stable with the freedom papers for Broomhilda still on him. After he takes the papers, Django swears that his next act of vengeance will be in honor of King. Django sneaks back onto the estate and finds and frees Broomhilda. He has her wait outside Candie Land while he engages in further preparations. That evening, Candie's family and friends return from Candie's funeral, Django is there waiting and shoots them all, even Lara (despite the fact that Lara never harmed him in any way; one can conclude that because she suggested (with the help of Stephen) that Django be sent to the LeQuint Dickey Mining Company, Django eliminated her). He then shoots Stephen in the kneecaps, stating that, in the 9,999 slaves Stephen has likely betrayed while working for Candie, he has never met one like Django. Stephen defiantly cries out that Django will be hunted down and killed by bounty hunters for his crimes, and that the South will never die. Django lights a fuse, and walks out on Stephen. The explosion utterly destroys Candie's mansion. Django meets his wife, who waits for him with two horses outside the estate. The two are finally reunited, and ride off into the night to face whatever destiny awaits them. Django is destined to become a legend, just as Siegfried before him did. After the end credits, we cut to the slaves Django freed from the mining company transporters. They remain seated where Django left them, still in awe of what they witnessed. Then, one asks what the name of that black man was (suggesting Django may not yet become a legend).",
      "writers": ["Quentin Tarantino"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1853728/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIyNTQ5NjQ1OV5BMl5BanBnXkFtZTcwODg1MDU4OA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jamie Foxx, Christoph Waltz, Leonardo DiCaprio | See full cast and crew »"],
      "reviews": [
         "I only had one thought on my mind for this Christmas: see Django Unchained. Quentin Tarantino's latest opus, a Western set two years before the Civil War, concerns a former slave named Django (Jamie Foxx). He is freed by bounty hunter Dr. King Shultz (Christoph Waltz) in order to help him with a bounty. Quite quickly, Shultz takes Django under his wing and trains him as his partner. But he made him a promise: that he would rescue his wife from a plantation owned by the ruthless Calvin Candie (Leonardo DiCaprio). And rescuing her is not going to be all that easy. What pains me the most about Django Unchained, as a die-hard Tarantino fan, is just how sloppy it all seems. I enjoyed every minute of it, but I could never shake the feeling of how messy and thrown together it all feels. Portions of the film feel episodic (the search for the Brittle Brothers, mentioned heavily in the trailers, begins and ends practically within minutes), and some scenes just seem to play out just for the fun of it. Another scene from the trailers involving a lynch mob with bags covering their faces seems added for comedic purposes, and has no real point of actually existing. More than any of his films before it, Django feels like Tarantino simply making a movie for sheer pleasure and with no outside motivations or controllers. The film threatens to go totally off the rails at any given moment, and lacks any real sense of direction or focus. It may sound ridiculous, but the loss of editor Sally Menke confirms a sneaking suspicion I always had about Tarantino � he needed a steady right hand to help encourage him as to what was needed and what was not. I do not want to criticize Django's editor Fred Raskin, but it is obvious he is no Menke and that works against the film heavily. It lacks the polish we have come to expect, and is practically stripped of the glossy/cool texture so prevalent in Tarantino's work up until now. But then maybe that was his intention all along, and perhaps Tarantino is airing out his frustrations with life and film in general. Django is deliberately shot on film (or at least from the print I saw), and looks very gritty and messy at all times. It is significantly more brutally violent than anything he has worked on before (the borderline cartoonish Kill Bill included), and has a very go for broke attitude about itself. The film seems to revel in how brilliantly it can splatter all the blood and gore (done through the use of squibs and no digital!), and how uncomfortably numbing it can make the violence. I know he does not care what people think of his films, but this movie especially seems like an emphatically raised middle finger to the establishment. And for all of my complaints about how messy it all feels, I was never once bored or felt like the movie was dragging itself out. The staggering 165-minute running time shockingly flies by faster than you might ever imagine. Acting wise, Tarantino stacks the deck with a number of recognizable character actors young and old for roles that vary in size. Most have very few lines, if any at all, and seem to just stand by, just as content as the audience is to watch the action unfold. It is a little off-putting, especially with how important some of these characters are initially made out to be. Washington as Broomhilda von Shaft (one of the most subtle references he's ever dropped) does well as the helpless victim and frequent dreamlike object � but she never really gets to show off any of her acting prowess outside of her facial reactions. They are increasingly effective, especially during horrific flashback scenes. But her work here feels ridiculously stunted in comparison to the other leads. Samuel L. Jackson, much like Tarantino himself, seems to just be having fun in his role as Candie's adviser Stephen. He plays on every ridiculous stereotype he ever has been associated with and then amps it up to a near ludicrous state. He is frequently hilarious, but the role seems to border on parody more than anything else. Surprisingly, Foxx takes a very long time settling into the leading role. It may just be the character, but it is quite clear from the on- set that he is not very comfortable in Django's shoes, and leads credence to why Will Smith, amongst so many others, dropped out of the picture so quickly. But once he finds his footing, he does a fantastic job walking the thin line between empathetic and sadistic. It is not an easy character to play, but Foxx makes it his own, bringing a sense of style and grace that are virtually absent from the rest of the film. And of course, he gets all the best lines. Waltz and DiCaprio are the clear standouts however, nailing every nuance of their sadly underwritten characters. While Waltz plays the straight man, DiCaprio is delightfully unhinged and vicious. Both are playing directly against type, yet are strangely comfortable in the roles. Watching them act circles around the rest of the cast, Foxx included, is the true highlight of the film. I just wish they were both given additional emphasis and more to do. For all of its numerous faults, I had a blast watching Django Unchained. It is hilarious, it is a lot of fun, and is wildly enjoyable. I genuinely think it could have been a lot better if there was more focus and direction, but this is very clearly a picture Tarantino wanted to make on his own terms. And for that, I applaud him for the effort. It is not his best work, but certainly not his worst. 8/10.",
         "Merry Christmas to all you Tarantino fans out there. I hope you made a Tarantino checklist so here we go. Witty dialogue, check. Excessive profanity especially use the word 'nigger', check. Excessive violence including testicles getting blown off, check. Soulful musical score, check. Sometimes non-linear narrative, check. Shots of women's feet, check. Very great character driven plot, check. An actual spaghetti western, even though it takes place in the American South, check. There are four standout characters played by the top billed actors. Jamie Foxx plays Django, a freed slave who becomes a bounty hunter. Even though he is the titular character, he gets downplayed when in the presence of the other actors. Still he delivers a solid performance, in fact hes very convincing. We all know Jamie Foxx as this golden voice RnB singer and comedian with a very clean cut image. He was able to pull off the whole transitioning from a timid slave to a menacing bounty hunter. Not only that he had the whole look down too, with all the facial scarring and the messy hair. Christoph Waltz plays Dr. King Schulz, a German dentist turned bounty hunter who frees Django so he could help pursue his previous owners who are targets. Waltz is a very charismatic actor, and thats how he does this role. Presents every line with finesse. Leonardo Dicaprio is in his best yet. He plays a plantation owner, Calvin Candie, and is the owner of Django's wife. This is a very different role. We've seen Leonardo in gritty roles before but never did he play this lecherous antagonist. We were all used to Leo being this teen idol, who looked like a member of Hanson. Here he's this Southerner with discoloured teeth and a scruffy beard. Finally Samuel L. Jackson who plays Steve, a house slave who you could say is the secret antagonist here. For all the screen time that he has he dominates. Sam usually plays boisterous roles as a tough guy, but it was very interesting seeing him play a devious and manipulative old man. The only gripe here was that this film was a little too long exceeding the three act structure, but its an epic western film so I'll excuse Tarantino for that. Yet again he made another great film with a lot of flair and carried well by the four big hitter actors. Well done Mr. Tarantino.",
         "Absolutely loved every minute of this movie. Usually I'm not too crazy about Tarantino's movies, but this one is definitely the best one I've seen in a long time. The actors were picked perfectly. The overall experience of a movie is amazing. When we first went to watch it, I was a bit skeptical and thought I'd end up leaving an hour into the movie (it's a 3 hr movie), but it grabbed my attention from the very beginning and I didn't even wanna get up to go to the bathroom, afraid to miss something. I'm usually very particular about the movies, nothing can hardly satisfy me, but this one is definitely in the top 5. Soundtrack was perfect. When I got home, I've done some more research on it and loved it even more! Overall, I would highly recommend this film!",
         "Quentin Tarantino, one of the most iconic directors of the 21st (and late 20th) century, why? Simple. Because of masterpieces like this. Tarantino defies the laws of film, he shoots them in his own way, however he wants. Tarantino has always focused upon the action thriller genre from Reservoir Dogs up until Inglourious Basterds. However, Django Unchained is Tarantino's first look at the Western genre, his first attempt at it and he executed it beautifully. The scenes were shot perfectly alongside an amazing soundtrack as well as his own small cameo. Django Unchained tells the story of Django (Jamie Foxx), a slave who is soon picked up by bounty hunter Dr King Shultz (Christoph Waltz). The story follows on as Shultz takes on Django as his \"deputy\" during their tasks of bounty hunting, in return Shultz says that after winter he will help find Django's lost wife, Broomhilda. This takes them to a huge plantation in Mississippi owned by Calvin Candie (Leonardo DiCaprio), from here they plan up a scheme on how to get away with Broombilda. The cast boast out amazing performances, particularly Christoph Waltz (also famous for his previous collaboration with Tarantino on Inglourious Bastards as Colonel Landa). Both Foxx and DiCaprio's performance are both equally amazing. All three are able to add some light-hearted humour in the mix to make sure it doesn't stay too serious, as well as having comic actor Jonah Hill play a member of the KKK. There's a reason the film has been nominated for 5 Oscars.",
         "Quentin Tarantino's 8th film \"Django Unchained\" is one hell of a movie. A brutal, bloody, terrifying, hilarious and awe-inspiring western disguised as a buddy movie that is so great that if John Wayne and Sergio Leone were alive now, they would've approve of this movie. It's designed to shock you, polarize you, test you and maybe even surprise you. But let me clear on this: If you are not a fan of bloody violence and the running length of 165 minutes, see a shorter movie. But if you love to see what Tarantino can do with movies like this, then you're in for a treat. Set during slavery in 1858, the movie follows Django (Jamie Foxx), a slave who is found by a bounty hunter disguised as a dentist named Dr. King Schultz (The always reliable Christoph Waltz) who hires him as a bounty hunter and a free man to find the Brittle Brothers. After finding them and hunting them down at a plantation run by Big Daddy (a remarkable Don Johnson), they relax for the winter only for them to go on a mission to find and rescue Django's wife, Broomhilda (Kerry Washington) who is owned by Calvin J. Candie (Leonardo DiCaprio) a man who runs a plantation known as Candieland. He even has a renegade slave as a servant named Stephen (A nearly recognizable Samuel L. Jackson, hidden in makeup and some prosthetics), who will have a part to play in the last half of the movie. I think Quentin Tarantino has outdone himself once again. Being in the filmmaking game for 20 years now, you can't deny and even reject his style in what he is bringing to the screen (He also has a cameo in here as well). His dialogue is like reading a book that grabs you and makes you want to know what happens next. The look and scope of the film is magnificent, thanks to a brilliant Oscar-winning cinematographer Robert Richardson and the late production designer J. Michael Riva. The performances in this film are brilliant. Having won an Oscar for \"Ray\", Jamie Foxx continues with his breathtaking performances that wows us. Here as Django, he is certainly fearless, baring his soul (and body) playing a man who is free from slavery, but can't be free by the rules and limitations of slavery. Christoph Waltz looks like he was born to be a part of Tarantino's entourage after his Oscar-winning performance for \"Inglorious Basterds\". Here, once again he brings humor and vulnerability to Dr. King Schultz. Never before have I ever seen an actor go that far and doesn't go over-the-top like Leonardo DiCaprio. As Calvin Candie, DiCaprio is certainly Oscar-worthy as a man who runs a tight ship by running a place where male slaves fight to the death and female slaves are being prostitutes and he seems to be the kind of guy to like even though he is a villain and he speaks Tarantino's dialogue like a pro. When he has a scene in which he reveals three dimples from a skull that belongs to his father, he is literally terrifying. Kerry Washington is superb as Broomhilda and Samuel L. Jackson is the real scene-stealer. The supporting cast is great from Walton Goggins, Jonah Hill, Michael Bacall, Michael Parks, James Remar, Robert Carradine to a small cameo by Franco Nero. \"Django Unchained\" has a lot of things to say about slavery and how cruel it is. But at the same time, it provides the fact that if Tarantino rearranged history by shooting Adolf Hitler to a pulp while everything blows up at a movie theater, he can do it again by having a former slave whipping a man who used to beat him and his wife. Now, that's entertainment. This movie really is off the chain. It's not only one of the most captivating films of the year, it's one of the best films of the year. Go see it, it will be worth your time. Keep in mind though, there are characters, especially Django, Stephen, Candie and Schultz that uses the N-word numerous times in this movie. That seems relevant to the time period, don't ya think?",
         "At first I didn't want to see this movie because of some political remarks made by Jamie Foxx and Samuel Jackson, two of my previously favorite actors, but Quintin Tarentino is a great director, so I broke down and saw it. Glad I did. This was absolutely one of the best movies of the year. Although Jamie Foxx has top billing, this film would not have been anywhere as good without Christoph Waltz. He stole every scene he was in. Brilliant acting and great comedic delivery. Leo was great too. Lots of blood, something expected in most of Quintins movies, but a great story. Also expect to hear the N word about 2000 times. Cristoph Waltz should get the Oscar for his performance. Should get nominated for best picture. This is absolutely a must see.",
         "I know there is a law against talking about internal logic with regard to QT-movies. But I'm quite a bit fed up with sloppy, dyslexic screen writing and I'm feeling kind of outlawish, so here I go: Initially Schultz (Christoph Waltz) asks for Django's help, because Django is an acquaintance of three fugitives, the bounty hunter Schultz is after. A \"Dead or Alive\"-handbill with its sketchy description and drawing is not very reliable and shooting the wrong guy can easily happen and it will just as easily get yourself hanged. Therefore the recruiting of Django does make perfect sense. Looking for another wanted man Schultz enters the next town, where he's never been, meets him, who is now the sheriff of this town and whom he's never seen, and kills him after a few seconds, without even talking to him. This is the moment \"Django Unchained\" stops making sense. Schultz is a cold blooded serial killer who murders people because some sheet of paper tells him that he's got the right to do so. He is a hypocrite, he gets mad at someone who also executes his state approved right to kill, but with sadistic pleasure. Murder is fine as long as the state tells you so and you do it for business, not for fun. In the original Spaghetti Western a guy like that would have always been the villain, many of the heroes were \"Wanted Men\" themselves. In \"Django Unchained\" he is the only human and sympathetic figure and without any doubt the main character. In many ways the spirit of \"Django Unchained\" is the exact opposite of that found in the movies Tarantino tried to emulate. The story of the bland eponymous Django's development from slave in chains and rags to sharp dressed gunslinger with sunglasses is above all ridiculous and boring. So after Schultz's exit this excessively overlong movie becomes even more of an ordeal, although you get to see the explosion of a queer, ugly old geezer, who really deserved to die. He is played by QT himself and that's only something to look forward to and no spoiler, because naturally it has little plot relevance. \"Django Unchained\" is about hating a whole ethnic group, just like \"Inglourious Basterds\", where Tarantino made sure to avoid the impression that there could be a German (a \"Nazi\") who wasn't devilishly evil. The nice young Zoller turns out to be a wannabe rapist and the clever detective Landa (Waltz) turns into a monster, strangling a helpless woman to death. After all Tarantino wanted his viewers to enjoy the butchering of hundreds of Germans in a cinema hall. In \"Django Unchained\" the murderous Schultz is the only decent white guy. All the others are preoccupied with torturing and humiliating blacks, so there is no need to dehumanize them any further. Will some savior please rise and rid the world of this evil? \"Django Unchained\" tells the sentimental education of this savior, Django, that ends with the exit of his teacher. Now the Hate is strong with this one. He uses it for the righteous cause, to kill white people. All of them. The murders of the self-righteous are always cool and justified, right? Hypocrisy is the new religion. Tarantino is one of its high priests, \"Django Unchained\" is a High Mass. Enjoy! \"Once Upon a Time in the West\", \"The Good, the Bad and the Ugly\", \"Pat Garrett & Billy the Kid\" - those are masterworks. \"Django Unchained\" is the work of a slave, designed to debase its audience.",
         "In Quentin Tarantino's Django Unchained, there is a scene in which Django (Jamie Fox), soon after being freed by the incredibly likable dentist turned bounty hunter, Dr. King Schultz (Christoph Waltz), shops for new clothes to wear. Schultz tells Django to pick out whatever he likes. Django looks at the smiling white man in disbelief. You're gonna let me pick out my own clothes? Django can't believe it. The following shot delivered one of the biggest laughs from the audience I watched the film with. After the white man confirms that yes, he is indeed letting the black man pick out his own clothes, we cut to a wide shot of Django riding his horse, now decked out in his very own (outlandish) cowboy outfit�an all blue with white ruffle get-up. It's a great little scene that provides humor and allows the viewer to further warm up to the two main protagonists. But it also does more than that. It's a simple scene that speaks for the whole film. It's an affirmation that this man of color is now free and able to make his own decisions. The choice he made concerning his extravagantly loud outfit acts as a warning to those that plan to stand in his way�watch out, here I come, I ain't gonna be quiet no more. And the humor the scene provides echoes the entire film�it wants us to get comfortable with our hero. Tarantino knows that a man of color makes an unconventional hero in a revenge- flick�that's why he made the film. When was the black man going to get his revenge film? It's been long overdue. With Django Unchained, that film has finally arrived and it has arrived in style. Beautifully shot, wonderfully acted, and meticulously written, it's Tarantino at his most epic.",
         "I have never been a fan of Quentin Tarantino, but I know that other people think he's great so I decided to give him another chance and actually paid $3 to see \"Django Unchained.\" I was surprised to find that I liked the first part of the movie. It was interesting, funny, suspenseful, and actually seemed to have a point. Some of the story strained credulity (look it up), but it stayed within the bounds of believability... until the German bounty hunter shot DeCaprio. Then believability went out the window. The movie didn't even make sense within itself. The entire film built up Dr. Schultz as not only a great shot, but also an extremely cunning strategist. And yet, he shot DeCaprio and then just stupidly said, \"I couldn't help it!\" and stood there waiting to be killed. (Which he was.) But his derringer had two barrels, which presumably means two bullets, so why didn't he whirl around and shoot the guy who was standing there with a gun? He could have, but then there wouldn't have been the bloodbath that follows, which I guess is Quentin Tarantino's \"signature.\" The movie quickly degenerates into a stupid, pointless bloodbath. White guys come out of nowhere to be shot, blood gets spattered everywhere, and so what? Then the film gets even worse! The black guy who killed so many white people is in the hands of his oppressors, yet instead of torturing and killing him, they decide to send him off to a (allegedly horrible) mine, thus giving him the opportunity to escape and wreak his horrible vengeance. Does this seem believable to ANYONE? After that, it's completely predictable. I don't need to tell you what happens because you can figure it out for yourself. But think about this: the movie makes a big deal about how nobody in the South back then was used to seeing a black person on a horse. For most of the film, the white Dr. Schultz accompanied Django and helped smooth the way. But at the end of the movie, Django and his (black) wife ride away on horses -- in Mississippi before the Civil War! So they'll just wander through the South to freedom? Really?? What a great happy ending! I could criticize this piece of sh*t on many more levels, but I've wasted enough time on it. I actually liked the first 3/4 of this film. I absolutely HATED the last section. And ultimately, Quentin Tarantino's popularity says something troubling about the state of American culture.",
         "Modern exploitation guru Quentin Tarantino serves up historical revenge once again. His last film, INGLOURIOUS BASTERDS, had the German Nazis getting theirs, and now, with a good German on board (in fact he's the villain from the last film) we're out to set things right in the American Deep South, two years shy of the Civil War� Although the first half takes place on the road from Texas to Mississippi as bounty hunting dentist Dr. King Schultz recruits a slave named Django to help him find three outlaw brothers (Django alone knows their appearance). These are the more spirited and deliciously cutthroat segments as our heroes partner up and, as Django puts it, \"Kill white people for money.\" Christoph Waltz (Schultz) and Jamie Foxx (Django) are a good team, and while making mince meat out of their targets, the bloodshed is something to marvel. But Tarantino throws in awkward bouts of humor, derailing the intensity of the moment. One particular scene where a group of rednecks complain about not seeing through masked eyeholes (including a very distracting cameo by Jonah Hill) feels like Mel Brooks clumsily intruding Sergio Leone. After Django helps Schultz with his job, it's time for the doctor to aid his more-than-capable partner rescue Django's wife Broomhilda, who resides at \"Candyland,\" an infamous Antebellum plantation run by the sinister though much too youthful Calvin Candie. While Leonardo DiCaprio has more than capable acting skills, and savors the gloriously tyrannical racist dialog, there could have/should have been a backstory on why the owner of a plantation looks fresh out of finishing school. For a man who's supposed to have a lifetime of seething venom oozing from his veins, those desperately piercing blue eyes seem more confused and frustrated than cold and calculating, making Tarantino's purposely overboard racism more of a crutch than weapon for the DiCaprio character (perhaps Don Johnson, who played a wily brothel owner in a previous scene, could have taken this role� he had the age going for him and with that, soulless eyes that look like he's seen � and been through � pretty much everything). But Leo's not alone. He's helped along by the most wicked of Uncle Tom's played by Samuel Jackson, whose spitefully cantankerous Stephen figures things out before his boss. This is a nice role for the QT stock actor, who has sleepwalked through many roles post PULP FICTION and JACKIE BROWN. Although his feeble mannerisms often slow down the performance. The main problem with UNCHAINED is how long Tarantino stretches scenes with dialog. While the actors, especially Waltz and DiCaprio, have a blast with colorful monologues, you'll often forget there are other characters on board � and most of the speeches fail to serve the plot. That being: the duo pretending to buy Mandingo slave fighters when they really want the girl. With all the deals and discussions going on, the much-anticipated reunion of Django and Broomhilda is lost in the mix. Not even Django's surreptitious trigger finger (whenever she's treated badly) adds worthy suspense, which, during this overlong stint at Candyland, is very much needed. But there's not all downtime at the mansion: a particular Candie lecture involving a slave's skull does successfully perk things up, providing DiCaprio a good five minutes of sheer unapologetic villainy. Then, after a shocking twist, it's Django alone who must save his girl. Jamie Foxx, having played a quietly brooding second fiddle to Waltz so far, makes up for lost time with heated gusto. This third and final act involving a group of Australians being duped by Django, who's learned the art of waxing poetic, is replete with the bare-knuckle action we've anticipated all along: although the large chunks of bloody guts flying off each gunshot victim seems like Tarantino doing an imitation of himself. There are some really neat montage sequences and beautiful locations, but some of the music, especially that of the rap nature, seems too modern for the time portrayed. And the editing feels somewhat limp without QT's longtime collaborator Sally Menke, who died a few years back: Particular flashbacks and hallucinations are often confusing and awkward. A pretty good ride, much better than Quentin's last two films (BASTERDS and DEATH PROOF), yet there needed a much tighter/sharper vehicle for our title hero to deserve the fanfare of the literally explosive finale. For More Reviews: www.cultfilmfreaks.com"
      ],
      "genres": ["Western"],
      "productionCompanies": [
         "Weinstein Company, The",
         "Columbia Pictures"
      ],
      "summaries": [
         "Former dentist, Dr. King Schultz, buys the freedom of a slave, Django, and trains him with the intent to make him his deputy bounty hunter. Instead, he is led to the site of Django's wife who is under the hands of Calvin Candie, a ruthless plantation owner.",
         "In 1858, a bounty hunter named Schultz seeks out a slave named Django and buys him because he needs him to find some men he is looking for. After finding them, Django wants to find his wife, Broomhilda who along with him were sold separately by his former owner for trying to escape. Schultz offers to help him if he chooses to stay with him and be his partner. Eventually they learn that she was sold to a plantation in Mississipi. Knowing they can't just go in and say they want her, they come up with a plan so that the owner will welcome them into his home and they can find a way.",
         "In 1858, in Texas, the former German dentist Dr. King Schultz meets the slave Django in a lonely road while being transported by the slavers Speck Brothers. He asks if Django knows the Brittle Brothers and with the affirmative, he buys Django for him. Then Dr. Schultz tells that he is a bounty hunter chasing John, Ellis and Roger Brittle and proposes a deal to Django: if he helps him, he would give his freedom, a horse and US$ 75.00 for him. Django accepts the deal and Dr. Schultz trains him to be his deputy. They kill the brothers in Daughtray and Django tells that he would use the money to buy the freedom of his wife Broomhilda, who is a slave that speaks German. Dr. Schultz proposes another deal to Django: if he teams-up with him during the winter, he would give one-third of the rewards and help him to rescue Broomhilda. Django accepts his new deal and they become friends. After the winter, Dr. Schultz goes to Gatlinburgh and learns that Broomhilda was sold to the ruthless Calvin Candie von Shaft, who lives in the Candyland Farm, in Mississippi. Dr. Schultz plots a scheme with Django to lure Calvin and rescue Broomhilda from him. But his cruel minion Stephen is not easily fooled.",
         "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner."
      ],
      "budget": 100000000
   },
   "movielensId": 99114,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch"
      ],
      "releaseDate": "2012-12-25",
      "dvdReleaseDate": null,
      "directors": ["Quentin Tarantino"],
      "runtime": 165,
      "movieId": 99114,
      "title": "Django Unchained",
      "mpaa": "R",
      "actors": [
         "Jamie Foxx",
         "Christoph Waltz",
         "Leonardo DiCaprio",
         "Kerry Washington",
         "Samuel L. Jackson",
         "Walton Goggins",
         "Dennis Christopher",
         "James Remar",
         "David Steen",
         "Dana Gourrier",
         "Nichole Galicia",
         "Laura Cayouette",
         "Ato Essandoh",
         "Sammi Rotibi",
         "Clay Donahue Fontenot",
         "Escalante Lundy",
         "Miriam F. Glover",
         "Don Johnson",
         "Franco Nero",
         "James Russo",
         "Tom Wopat",
         "Don Stroud",
         "Russ Tamblyn",
         "Amber Tamblyn",
         "Bruce Dern",
         "M.C. Gainey",
         "Cooper Huckabee",
         "Doc Duhame",
         "Jonah Hill",
         "Lee Horsley",
         "Zoë Bell",
         "Michael Bowen",
         "Robert Carradine",
         "Jake Garber",
         "Ted Neeley",
         "James Parks",
         "Tom Savini",
         "Michael Parks",
         "John Jarratt",
         "Quentin Tarantino",
         "Amari Cheatom",
         "Keith Jefferson",
         "Marcus Henderson",
         "Lil Chuuch",
         "Kinetic",
         "Louise Stratten",
         "Kim Robillard",
         "Shana Stein",
         "Shannon Hazlett",
         "Jack Lucarelli",
         "Victoria Thomas",
         "Grace Collins",
         "Sharon Pierre-Louis",
         "Christopher Berry",
         "Kim Collins",
         "Dane Rhodes",
         "J.D. Evermore",
         "Rex Linn",
         "Michael Bacall",
         "Ronan Hice",
         "Ned Bellamy",
         "Dave Coennen",
         "Danièle Watts",
         "Jon Eyez",
         "Omar J. Dorsey",
         "Evan Parke",
         "Craig Stark",
         "Brian Brown",
         "Ritchie Montgomery",
         "Nicholas Dashnaw",
         "Jarrod Bunch",
         "Kerry Sims",
         "Jamal Duff",
         "Todd Allen",
         "Lewis Smith",
         "Keniaryn Mitchell",
         "Jakel Marshall",
         "Carl Singleton",
         "Ashley Toman",
         "John McConnell",
         "Mark Amos",
         "Monica Rene'e Anderson",
         "Marsha Stephanie Blake",
         "Catherine Lambert",
         "Deborah Ayorinde",
         "Takara Clark",
         "Kimberley Drummond",
         "Tenaj L. Jackson",
         "Carl Bailey",
         "Ross P. Cook",
         "Gregory Allen Gabroy",
         "Gene Kevin Hames Jr.",
         "Seth Bailey",
         "David G. Baker",
         "Richie J. Ladner",
         "Glen Warner",
         "Kesha Bullard",
         "Edward J. Clare",
         "Jordon Michael Corbin",
         "Mike DeMille",
         "Santana Draper",
         "Gary Grubbs",
         "Justin Hall",
         "Jacquelyn Twodat Jackson",
         "Sandra Linz",
         "Kasey James",
         "Skipper Landry",
         "Elton LeBlanc",
         "Cindy Mah",
         "Johnny Otto",
         "Belinda Owino",
         "Erin Pickett",
         "Mark Ulano",
         "Misty Upham",
         "Edrick Browne"
      ],
      "imdbMovieId": "1853728",
      "originalTitle": "Django Unchained",
      "genres": [
         "Drama",
         "Western"
      ],
      "youtubeTrailerIds": [
         "_iH0UBYDI4g",
         "nwlcUsTq4TM",
         "m-HpQpeE4IY",
         "0Bm38cQOTEg",
         "M6Rs3duqnx4"
      ],
      "plotSummary": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
      "tmdbMovieId": 68718,
      "avgRating": 4.00395,
      "releaseYear": "2012",
      "numRatings": 19137,
      "posterPath": "/5WJnxuw41sddupf8cwOxYftuvJG.jpg"
   }
}