{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "giant robot",
            "id": 10891
         },
         {
            "name": "giant monster",
            "id": 11100
         },
         {
            "name": "apocalypse",
            "id": 12332
         },
         {
            "name": "imax",
            "id": 156395
         },
         {
            "name": "duringcreditsstinger",
            "id": 179431
         },
         {
            "name": "3d",
            "id": 209714
         }
      ],
      "imdb_id": "tt1663662",
      "video": false,
      "title": "Pacific Rim",
      "recommendations": [
         68724,
         80274,
         75612,
         54138,
         124905,
         76170,
         97020,
         72190,
         49521,
         137113,
         49049,
         49529,
         87421,
         39254,
         1487,
         11253,
         534,
         70981,
         49849,
         8373
      ],
      "backdrop_path": "/iB0RsWVoOXzicPi2Yy5xmTYMbho.jpg",
      "revenue": 407602906,
      "reviews": [
         {
            "author": "GeekMasher",
            "id": "51e86ad719c29529911b8687",
            "content": "First I want to say I liked this movie. I was surprised, I've been hearing bad reviews but I can't see big problem. The only issues was with the story. Apart from that the graphics where very good. The actors where okay (no major actors) and the baddies (no spoilers) where well thought out and graphically impressive (same for the robots).\r\n\r\nAll in all a good movie.",
            "url": "https://www.themoviedb.org/review/51e86ad719c29529911b8687"
         },
         {
            "author": "Matt Golden",
            "id": "51ec25ca19c29551fb0f6f70",
            "content": "When monstrous, building-sized creatures (dubbed \"kaiju\") hell-bent on destruction begin pouring out of an extra-dimensional fissure at the bottom of the Pacific Ocean, humanity bands together to build titanic mechas called jaegers, each controlled simultaneously by two pilots whose minds are linked through a neural bond called \"The Drift.\" As the kaiju get stronger and the signs point to an all-out flood of the beasts, the fate of humanity looks bleak, and the surviving jaegers are brought together for one last-ditch attempt at saving the world.\r\n\r\nAfter an agonizingly long five-year wait, filled with some heartbreaking starts and stops (like the almost-weres of The Hobbit and At the Mountains of Madness), Guillermo del Toro has finally returned with his biggest budget and story yet. The Mexican master of fantasy returns to the toybox of his youth, drawing from the kaiju films of old (Godzilla, Gamera, Mothra, and the like) and anime to create the modern-day monster movie we didn't even know we wanted.\r\n\r\nI am a genre man through and through, and del Toro's films are filled with both the intelligence of the best of science fiction, fantasy, and horror and a flawlessly-rendered vision unique to him. His innate knowledge of what makes those outlandish stories truly matter to us is the backbone of his work as a writer and director, and his visual style is one that invokes true wonder.\r\n\r\nIt's that wonder, that childlike glee that makes Pacific Rim work so well, and well it does work. This is a brawny, massive film made by a true artist and auteur at the top of his game, but while the technicals of this film could have been mounted by any number of working directors, the magic of Guillermo del Toro is that he infuses every film with himself. His love of the material, whatever it may be, shines brightly through every frame. It is this complete sincerity that makes his films such a joy to experience, and even when there are 250-foot behemoths slugging it out on the screen, there's not a trace of the disastrous irony or cynicism so readily supplied by other blockbusters anywhere to be found.\r\n\r\nThe cast gamely comes to play, with Idris Elba (TV’s Luther) as Stacker Pentecost (one of my favorite character names of all time) as the stoic leader of the jaeger program, Charlie Hunnam (TV’s Sons of Anarchy) as former pilot Raleigh Becket, who suffered a tragic loss and has to be convinced to return to jaeger service, and Oscar-nominated Rinko Kinkuchi (Babel) as Mako Mori, another life touched by the kaiju and ready to serve up some righteous fury. If these sound like tried-and-true archetypes, it’s because they are. This is a grand, epic war film on a bigger scale than anything ever attempted before in that genre, and one of the strokes of genius from del Toro and original writer Travis Beacham is that we instantly establish and identify with the characters onscreen. There are so many ideas flying around (monsters, mechas, neural bonding, kaiju culture, and many, many more) that the broadly-drawn characters serve as a perfect anchor for the audience, immediately relatable in their inherent humanity.\r\n\r\nIt seems that the mission statment of this movie was, in a word, “texture.” Del Toro delivered a visual feast unlike any other big spectacle films, with his insistence on it not looking like a “glossy car commercial.” Instead, every frame is filled with rain, snow, scuffs, smoke, debris, and other visual elements that reflect the weight and dimension of these cyclopean combatants. Unlike the ultra-glossy (and emotionally irrelevant) Transformers films, or virtually any other modern big-budget actioner, this universe feels dirty, grungy, and lived-in, like the original Star Wars trilogy.\r\n\r\nIn fact, dubbing a film “this generation’s Star Wars” has been overused to the point of robbing the phrase of all meaning. But Pacific Rim feels just like that. It invokes those most elusive of emotions in the modern studio film: wonder, awe, and sheer enjoyment. Do you remember the awe you felt upon seeing a Star Destroyer creep onto the screen? Discovering a brachiosaurus on Isla Nublar? Laying eyes on the verdant fields of Middle Earth? This film has that. No one builds worlds like del Toro, and here he is, the master, inviting you to play in his sandbox with him. Grab your favorite action figure and hop in.",
            "url": "https://www.themoviedb.org/review/51ec25ca19c29551fb0f6f70"
         },
         {
            "author": "VolcanoAl",
            "id": "51f3a8df19c2955ef000469f",
            "content": "My favorite movie for years!!!I absolutely love this movie!No big story.A lot of action.The only bad thing is all the fights are at night & in the rain.A bright daylight fight would have really made it great!!!",
            "url": "https://www.themoviedb.org/review/51f3a8df19c2955ef000469f"
         },
         {
            "author": "Andres Gomez",
            "id": "5470872e9251417066002723",
            "content": "This movie has almost everything that is expected from it so just relax lay back with the pop corn and your soft drink and enjoy.\r\n\r\nJust to make noticeable the remarkable few amount of females featuring in the movie and how bad is that Travis Beacham and Guillermo del Toro just copy Evangelion's idea without giving anything back.",
            "url": "https://www.themoviedb.org/review/5470872e9251417066002723"
         },
         {
            "author": "Per Gunnar Jonsson",
            "id": "5a5c53e30e0a260da00065c7",
            "content": "I have to say that I enjoyed this pure special effects movie quite a lot even though the plot is totally ridiculous. Clumsy giant robots beating at alien beasts with their fists should be better than modern tanks and airplanes with modern explosive and armor penetrating weapons? As I said, a ridiculous story. Well it does not really matter does it because the story gives an excuse for some real cool special effects loaded action. Giant robots and alien Godzillas in the same movie. Cool, simply cool.\r\n\r\nOnce you have gotten past the silliness of the story it is a very entertaining rollercoaster ride of action. The scenes where the robots and aliens go head to head is visually very enjoyable. Sometimes they make you laugh as well. For instance the scene where Gipsy Danger (one of the robots) drags a cargo ship after it to use as a club.\r\n\r\nUnfortunately a somewhat somber mood is set right from the start by the fact that the Jaeger program is discontinued. Not because they are really defenseless as the movie blurb states but because dumbass politicians wants to save money as usual. Instead they build giant walls that are subsequently breached in hours. As I said, dumbass politicians. I guess they wanted to put some realism into the movie!\r\n\r\nAs much as the robot and alien action is tremendously enjoyable I think some of my favorite scenes are the ones with Ron Perlman as Hannibal Chau. I have always liked Ron Perlman and he is simply outrageously (as in funny) wacky as Hannibal Chau.\r\n\r\nThe one thing I did not like with the movie is the ludicrous nonsense statements about the dinosaurs being the first attempt at an invasion. Whoever wrote that must be an idiot. Worse, the fact that it made it into the movie means that someone believes that the audience are idiots. When it then was followed by some green-religious crap that the atmosphere was not right for them then but that we have now “terraformed” earth for them by our pollution it was at least a star off just for that. I hate it when they put crap like that in the movies. It is an insult to the audience.\r\n\r\nAnyway, despite the dinosaur nonsense I found it a very enjoyable movie. Without that it would have received a near top rating but as I said, it is at least a star off due to that crap.",
            "url": "https://www.themoviedb.org/review/5a5c53e30e0a260da00065c7"
         },
         {
            "author": "Teemu",
            "id": "5a972408c3a3686151004e4d",
            "content": "Watching a CGI heavy movie 5 years following its release doesn't sound like such a hot idea, but in the case of Pacific Rim nothing really drew me out of the experience in terms of aging animation.\r\n\r\nHowever, the film itself was an 'okay' at best. Aside from the spectacle CGI fights of giants robots versus giant alien monsters it doesn't offer anything of value. This is one of those movies you can safely keep on your second monitor and zone out in between the set piece fight scenes.",
            "url": "https://www.themoviedb.org/review/5a972408c3a3686151004e4d"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Stacker Pentecost",
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d1845",
               "name": "Idris Elba",
               "profile_path": "/d9NkfCwczP0TjgrjpF94jF67SK8.jpg",
               "id": 17605,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Raleigh Becket",
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d1849",
               "name": "Charlie Hunnam",
               "profile_path": "/nmHtkCyaiVCzwFQe4nPucsVRcBX.jpg",
               "id": 56365,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Mako Mori",
               "gender": 1,
               "credit_id": "52fe47a0c3a368484e0d185f",
               "name": "Rinko Kikuchi",
               "profile_path": "/n1GSGFdpoiDXT3ozZflsmcJy21Y.jpg",
               "id": 18054,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Tendo Choi",
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d1877",
               "name": "Clifton Collins Jr",
               "profile_path": "/31FbXPcEwKLE1eiQ8ceyQpsnheE.jpg",
               "id": 5365,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Herc Hansen",
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d1863",
               "name": "Max Martini",
               "profile_path": "/fUGKNDsQnKCLzNrWyyBkx7O26XC.jpg",
               "id": 94864,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Chuck Hansen",
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d186b",
               "name": "Robert Kazinsky",
               "profile_path": "/h54Qs5LK19NT2ZA2ysRzjjnuODH.jpg",
               "id": 1038379,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Hannibal Chau",
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d1857",
               "name": "Ron Perlman",
               "profile_path": "/xZyrXT2iEmSOokQRc1hedmxrbTi.jpg",
               "id": 2372,
               "order": 6
            },
            {
               "cast_id": 4,
               "character": "Dr. Newton Geiszler",
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d184d",
               "name": "Charlie Day",
               "profile_path": "/irtCEk7XlszzNzAEwzQNtW27VsM.jpg",
               "id": 95101,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Dr. Hermann Gottlieb",
               "gender": 0,
               "credit_id": "52fe47a0c3a368484e0d185b",
               "name": "Burn Gorman",
               "profile_path": "/qpdtwkUJ5cG1zxql7xXomGgcTMc.jpg",
               "id": 39659,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Lt. Aleksis Kaidanovsky",
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d1867",
               "name": "Robert Maillet",
               "profile_path": "/cmP2CakmT1j0wXAjNEVQMGcR0cL.jpg",
               "id": 112692,
               "order": 9
            },
            {
               "cast_id": 45,
               "character": "Lt. Sasha Kaidanovsky",
               "gender": 1,
               "credit_id": "566109e0c3a36875e2005bd4",
               "name": "Heather Doerksen",
               "profile_path": "/nIF1GLQ2WPGS5pdogVGhOm2nYmh.jpg",
               "id": 83423,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Tommy T",
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d186f",
               "name": "Larry Joe Campbell",
               "profile_path": "/91kXO2XCIv8B9bP3720QIrTJNfs.jpg",
               "id": 118590,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Miles",
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d1873",
               "name": "Brad William Henke",
               "profile_path": "/mrczPKKtc6a2AuVAdjqLLTnWhh5.jpg",
               "id": 15376,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Yancy Becket",
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d187b",
               "name": "Diego Klattenhoff",
               "profile_path": "/nOiJDYiEysyZJHQNPCOSVWw9XzT.jpg",
               "id": 142193,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Wizened Man",
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d187f",
               "name": "Santiago Segura",
               "profile_path": "/lNWgadL9NksUCdSaiJRDBRsT8oB.jpg",
               "id": 10847,
               "order": 14
            },
            {
               "cast_id": 38,
               "character": "Raleigh and Yancy's Mom",
               "gender": 0,
               "credit_id": "54e49936c3a368486f003000",
               "name": "Jane Watson",
               "profile_path": "/8wMVQt7Xp2dQUu3wnkc0wiETfJk.jpg",
               "id": 1428550,
               "order": 15
            },
            {
               "cast_id": 44,
               "character": "Hannibal Chau Thug",
               "gender": 0,
               "credit_id": "566109bcc3a36875e00062eb",
               "name": "Jung-Yul Kim",
               "profile_path": "/yfXZoDUHQeTKLctbliF1TlqlmLH.jpg",
               "id": 1480855,
               "order": 16
            },
            {
               "cast_id": 46,
               "character": "Officer",
               "gender": 2,
               "credit_id": "56610a10c3a36875f40057a1",
               "name": "Joshua Peace",
               "profile_path": "/C5xx4dU6NtB7vzoX9Ho6p7CgOb.jpg",
               "id": 5925,
               "order": 17
            },
            {
               "cast_id": 49,
               "character": "Young Mako",
               "gender": 0,
               "credit_id": "57e52b3a9251411ab00024f0",
               "name": "Mana Ashida",
               "profile_path": "/gvfweKd6XU3AQy1CFakbVNYeMCI.jpg",
               "id": 559416,
               "order": 18
            },
            {
               "cast_id": 50,
               "character": "Captain Merrit",
               "gender": 2,
               "credit_id": "57e52bc3c3a36826a7002c30",
               "name": "Joe Pingue",
               "profile_path": "/if9jRWeC6olBqiAOmT6Fb0cOSpe.jpg",
               "id": 86237,
               "order": 19
            },
            {
               "cast_id": 51,
               "character": "McTighe",
               "gender": 0,
               "credit_id": "57e52e8ac3a368264b0032d4",
               "name": "Milton Barnes",
               "profile_path": "/8Lb9cegevGfADPuZNQ1BWunisik.jpg",
               "id": 1226806,
               "order": 20
            },
            {
               "cast_id": 52,
               "character": "1st Officer",
               "gender": 2,
               "credit_id": "57e52f059251411af40028a5",
               "name": "Brian Frank",
               "profile_path": "/6ncc5gjDyZEztA7r2eBgUSzl6XM.jpg",
               "id": 100464,
               "order": 21
            },
            {
               "cast_id": 53,
               "character": "Gipsy Danger AI (voice)",
               "gender": 1,
               "credit_id": "57e52f64c3a3684ca5004c02",
               "name": "Ellen McLain",
               "profile_path": null,
               "id": 1683877,
               "order": 22
            },
            {
               "cast_id": 54,
               "character": "Old Man on Beach",
               "gender": 2,
               "credit_id": "57e53568c3a3684ca5004ea6",
               "name": "David Fox",
               "profile_path": null,
               "id": 4569,
               "order": 23
            },
            {
               "cast_id": 55,
               "character": "Child",
               "gender": 2,
               "credit_id": "57e535f3c3a36841e5002d2a",
               "name": "Jake Goodman",
               "profile_path": null,
               "id": 1255174,
               "order": 24
            },
            {
               "cast_id": 56,
               "character": "American UN Representative",
               "gender": 2,
               "credit_id": "57e53821c3a36841e5002ea0",
               "name": "Robin Thomas",
               "profile_path": "/seivBO3KRFAKqNgL3wnvpwxHwKz.jpg",
               "id": 41465,
               "order": 25
            },
            {
               "cast_id": 57,
               "character": "British UN Representative",
               "gender": 2,
               "credit_id": "57e53df89251411ab0002e05",
               "name": "Julian Barnes",
               "profile_path": "/nBxDyUCuJHkbOv008KrsLYd9E5D.jpg",
               "id": 1379395,
               "order": 26
            },
            {
               "cast_id": 58,
               "character": "Canadian UN Representative",
               "gender": 2,
               "credit_id": "57e53e73c3a36841ae002b1e",
               "name": "David Richmond-Peck",
               "profile_path": "/3qPzkWzWdTbNh8fsAVqlQ7VAoJb.jpg",
               "id": 46906,
               "order": 27
            },
            {
               "cast_id": 59,
               "character": "Engineer",
               "gender": 2,
               "credit_id": "57e53fb592514106020038bf",
               "name": "Sebastian Pigott",
               "profile_path": "/xMXkCa1wC4FXPVABPGUzkN1ZVzD.jpg",
               "id": 224144,
               "order": 28
            },
            {
               "cast_id": 60,
               "character": "Chinese Girl in Anti-Kaiju Refuge",
               "gender": 0,
               "credit_id": "57e541309251410611003888",
               "name": "Victoria Marie",
               "profile_path": null,
               "id": 1683916,
               "order": 29
            },
            {
               "cast_id": 61,
               "character": "TV Reporter",
               "gender": 0,
               "credit_id": "57e543c1c3a368264b003e61",
               "name": "J.C. Kenny",
               "profile_path": null,
               "id": 1176955,
               "order": 30
            },
            {
               "cast_id": 62,
               "character": "Raleigh and Yancy's Dad",
               "gender": 2,
               "credit_id": "57e546139251410602003bd8",
               "name": "Robert Morse",
               "profile_path": null,
               "id": 1683922,
               "order": 31
            },
            {
               "cast_id": 63,
               "character": "Saltchuck Crew",
               "gender": 2,
               "credit_id": "57e5476ac3a36826a70038a4",
               "name": "Mike Chute",
               "profile_path": "/yDjnDYaxYz02HCpmcIEJ8leq5PQ.jpg",
               "id": 59613,
               "order": 32
            },
            {
               "cast_id": 64,
               "character": "Saltchuck Crew",
               "gender": 0,
               "credit_id": "57e54bb4c3a3684ca50058e3",
               "name": "Duncan McLeod",
               "profile_path": null,
               "id": 1683931,
               "order": 33
            },
            {
               "cast_id": 65,
               "character": "Saltchuck Crew",
               "gender": 0,
               "credit_id": "57e5502c925141064e00400e",
               "name": "Louis Paquette",
               "profile_path": "/xKPzQgm98Upe9fUo24BkpdBwHd.jpg",
               "id": 1517893,
               "order": 34
            },
            {
               "cast_id": 66,
               "character": "Saltchuck Crew",
               "gender": 2,
               "credit_id": "57e5506ac3a36826a7003c65",
               "name": "Matthew G. Taylor",
               "profile_path": "/il8bIgN6sANpmMSohJGvpNbeN8A.jpg",
               "id": 59198,
               "order": 35
            },
            {
               "cast_id": 67,
               "character": "UN Representative",
               "gender": 2,
               "credit_id": "57e550bcc3a368264b0044c7",
               "name": "Frank Nakashima",
               "profile_path": "/cY0z7QhmF4bDkzxVCQE5JRLtJKo.jpg",
               "id": 1239394,
               "order": 36
            },
            {
               "cast_id": 69,
               "character": "UN Representative",
               "gender": 0,
               "credit_id": "57e550f39251411aad0036a8",
               "name": "Terry Belleville",
               "profile_path": null,
               "id": 1683938,
               "order": 37
            },
            {
               "cast_id": 70,
               "character": "UN Representative",
               "gender": 0,
               "credit_id": "57e551bd9251411ab00036e3",
               "name": "Farzad Sadrian",
               "profile_path": null,
               "id": 1683941,
               "order": 38
            },
            {
               "cast_id": 71,
               "character": "UN Representative",
               "gender": 0,
               "credit_id": "57e55212c3a36841e5003b78",
               "name": "Mishu Vellani",
               "profile_path": "/7fp4Jhr9mkLunxTjxdAFKA3QR1A.jpg",
               "id": 125579,
               "order": 39
            },
            {
               "cast_id": 72,
               "character": "UN Representative",
               "gender": 0,
               "credit_id": "57e552559251410611004014",
               "name": "Clive Walton",
               "profile_path": null,
               "id": 231140,
               "order": 40
            },
            {
               "cast_id": 73,
               "character": "Young Mako's Father",
               "gender": 2,
               "credit_id": "57e5529ac3a368416500374c",
               "name": "Peter Kosaka",
               "profile_path": null,
               "id": 1003550,
               "order": 41
            },
            {
               "cast_id": 74,
               "character": "Young Mako's Mother",
               "gender": 0,
               "credit_id": "57e552d5c3a368422500341a",
               "name": "Yiren Stark",
               "profile_path": null,
               "id": 1683943,
               "order": 42
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d1841",
               "name": "Guillermo del Toro",
               "profile_path": "/aBPPwt3jcFw2ridEkKTgchfPaic.jpg",
               "id": 10828,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d1853",
               "name": "Travis Beacham",
               "profile_path": "/hhqDtKmn46Cho8Wy7mJBzjCqxAf.jpg",
               "id": 114016,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d1885",
               "name": "Guillermo del Toro",
               "profile_path": "/aBPPwt3jcFw2ridEkKTgchfPaic.jpg",
               "id": 10828,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d1891",
               "name": "Ramin Djawadi",
               "profile_path": "/wgUxW19nyPnrzj4ViVOpAfmhCdr.jpg",
               "id": 10851,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d1897",
               "name": "Guillermo Navarro",
               "profile_path": "/AfZkxrEiLlqqHONhfJyVOLrHR8A.jpg",
               "id": 3113,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d189d",
               "name": "Peter Amundson",
               "profile_path": null,
               "id": 10833,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d18a3",
               "name": "John Gilroy",
               "profile_path": null,
               "id": 67810,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d18a9",
               "name": "Andrew Neskoromny",
               "profile_path": null,
               "id": 6045,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe47a0c3a368484e0d18af",
               "name": "Carol Spier",
               "profile_path": null,
               "id": 8315,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a0c3a368484e0d18b5",
               "name": "Kate Hawley",
               "profile_path": null,
               "id": 213644,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a0c3a368484e0d18bb",
               "name": "Peter Nicolakakos",
               "profile_path": null,
               "id": 957970,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "535268260e0a265606002dbc",
               "name": "Travis Beacham",
               "profile_path": "/hhqDtKmn46Cho8Wy7mJBzjCqxAf.jpg",
               "id": 114016,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5352683f0e0a2655fe002f89",
               "name": "Guillermo del Toro",
               "profile_path": "/aBPPwt3jcFw2ridEkKTgchfPaic.jpg",
               "id": 10828,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "535268ae0e0a2655fe002f98",
               "name": "Jon Jashni",
               "profile_path": null,
               "id": 61091,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "535268c10e0a26560e002f8e",
               "name": "Mary Parent",
               "profile_path": null,
               "id": 114408,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "535268d20e0a265603003055",
               "name": "Thomas Tull",
               "profile_path": "/5UG4FK7rsmhzJDYxpU28acqfxtu.jpg",
               "id": 54211,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "535268e30e0a26561100301e",
               "name": "Callum Greene",
               "profile_path": null,
               "id": 19770,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "53526920c3a3681d9800275d",
               "name": "Margery Simkin",
               "profile_path": "/dCyAWZGEaW1OlGgh5ALiqGfsbpb.jpg",
               "id": 6347,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "53526945c3a3681d98002763",
               "name": "Andrew Li",
               "profile_path": null,
               "id": 1311175,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "53526972c3a3681d87002897",
               "name": "Sandi Tanaka",
               "profile_path": null,
               "id": 223991,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "570bba2592514113120002d0",
               "name": "Richard L. Johnson",
               "profile_path": null,
               "id": 8285,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 1,
               "credit_id": "570bba48c3a3680fc2007ca5",
               "name": "Elinor Rose Galbraith",
               "profile_path": null,
               "id": 10836,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 0,
               "credit_id": "553407b4925141529b005aa2",
               "name": "Brian N. Bentley",
               "profile_path": null,
               "id": 1456696,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 2,
               "credit_id": "553d5a72c3a368784500d1ca",
               "name": "Scott F. Johnston",
               "profile_path": null,
               "id": 1450362,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 0,
               "credit_id": "5548cf8dc3a3687886002388",
               "name": "Weicheng Jiang",
               "profile_path": null,
               "id": 1460628,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 0,
               "credit_id": "5549551392514104cd0007df",
               "name": "Yuhon Ng",
               "profile_path": null,
               "id": 1463784,
               "department": "Crew",
               "job": "Digital Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "554fb2989251416984004e78",
               "name": "Erik Classen",
               "profile_path": null,
               "id": 1447542,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 2,
               "credit_id": "5ab6e841c3a3680a3e013550",
               "name": "Gregg Rudloff",
               "profile_path": null,
               "id": 1341858,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 48.481741,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 68726,
      "vote_count": 5913,
      "budget": 180000000,
      "overview": "When legions of monstrous creatures, known as Kaiju, started rising from the sea, a war began that would take millions of lives and consume humanity's resources for years on end. To combat the giant Kaiju, a special type of weapon was devised: massive robots, called Jaegers, which are controlled simultaneously by two pilots whose minds are locked in a neural bridge. But even the Jaegers are proving nearly defenseless in the face of the relentless Kaiju. On the verge of defeat, the forces defending mankind have no choice but to turn to two unlikely heroes—a washed-up former pilot (Charlie Hunnam) and an untested trainee (Rinko Kikuchi)—who are teamed to drive a legendary but seemingly obsolete Jaeger from the past. Together, they stand as mankind's last hope against the mounting apocalypse.",
      "similar": [
         198663,
         101299,
         76341,
         157336,
         157350,
         281,
         604,
         605,
         335984,
         9482,
         7512,
         9739,
         9381,
         21356,
         12244,
         871,
         2048,
         9659,
         9693,
         17431
      ],
      "original_title": "Pacific Rim",
      "runtime": 131,
      "poster_path": "/sCJEwEShZvruTpQ2a4yiX3Q9EyZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Double Dare You Productions",
            "id": 101082,
            "origin_country": ""
         },
         {
            "logo_path": "/5UQsZrfbfG2dYJbx8DxfoTr2Bvu.png",
            "name": "Legendary Pictures",
            "id": 923,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Indochina Productions",
            "id": 19751,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2013-07-11",
      "vote_average": 6.7,
      "belongs_to_collection": {
         "backdrop_path": "/vbg4Mm8auNINPersFlYvyGLqFq0.jpg",
         "name": "Pacific Rim Collection",
         "id": 363369,
         "poster_path": "/niTMK5k486sPBCphbvmRIZ7xBGK.jpg"
      },
      "tagline": "To Fight Monsters, We Created Monsters",
      "adult": false,
      "homepage": "http://www.pacificrimmovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Guillermo del Toro"],
      "runtime": 131,
      "synopsis": "The film begins in 2013. Deep beneath the Pacific Ocean, a fissure opens up, that leads to another dimension. Through the fissure, a giant monster appears, and destroys portions of San Francisco. After many days and countless lives, the creature is defeated by human military forces. However, what seemed to be an isolated attack builds, as more creatures begin to come through the fissure, attacking coastal cities around the Pacific. The World unites to stop the invaders, and build The Jaeger Program: a series of giant mechanical 'monsters,' intended to stop the creatures. Original tests to have one pilot per Jaeger prove unsuccessful, as the test subjects were not able to handle the stress and strain of controlling such a huge robot by themselves. It was then decided that each Jaeger would be piloted by two pilots, their memories linked together in The Drift, synchronizing their movements to maneuver the massive machines. As the Jaegers go to work, they begin to turn the tides, and take down the creatures (known as Kaiju). Pretty soon, the world is enthralled by the Jaegers and their pilots. They become celebrities, and even have merchandise made. As well, the dead Kaiju are soon seen as a black-market commodity, their parts sold off for various collections and medicinal purposes. But just as the war seems to be turning in humanity's favor, the Kaiju's attacks become more frequent and more brutal. In 2020, seven years after the fissure opened, one of the more famous Jaeger duos, Raleigh Beckett (Charlie Hunnam), and his older brother, Yancy (Diego Klattenhoff) have become heroes with an impeccable record of defeating Kaijus. Pilots of the Jaeger named \"Gipsy Danger,\" they are sent off to stop a category 3 Kaiju heading towards Anchorage. The beast is larger and more powerful than previous category 3s and will be a challenge for the team. Though the information on their monitors shows a fishing boat in the path of the attack, the Becketts are told their priority is to protect Anchorage. Even so, they disobey orders, and still save the fishing boat, but end up being brutally attacked by the Kaiju, which rips off the Gipsy Danger's left arm, and tears away a chunk of the vehicle's helmet, sending Yancy to his death. Raleigh barely manages to pilot Gipsy Danger on his own and finishes the battle, using the robot's giant plasma blaster to kill the creature. Raleigh later pilots the Jaeger to a remote beach where it finally collapses. Raleigh walks out, bearing injuries from the battle -- because of the Drift, Jaeger pilots experience the same injuries that their mechanical counterparts do -- and collapses on the beach too, exhausted and emotionally devastated from his brother's death. After the attack, Raleigh leaves the Jaeger Program, and goes to find work wherever he can. Five years later, he finds work along the Western coast of the United States as a construction worker, helping build a giant wall that is meant to keep the Kaiju out out. In the 5 years since Raleigh was with the Jaeger program, numerous countries have called for the program to be terminated due to spiraling casualties of Jaeger pilots in the increased Kaiju attacks and the enormous cost of keeping it funded. Many assume that building the walls will make them safe, but the head of the program named Stacker Pentecost (Idris Elba), claims that the world's leaders are making a terrible mistake. Even though Pentecost claims the program is still viable, it is relocated to Hong Kong and given 8 months of funding before the program will be permanently retired. Working on the wall near Sitka, Alaska, Raleigh sees television reports that a Kaiju has broken through the wall surrounding Sydney Harbor in Australia. Luckily, a Jaeger named Striker Eureka is able to take it down. After seeing the news report, Raleigh is surprised when a helicopter lands near his building area, with Pentecost requesting he come along. Raleigh is reluctant to join the Jaeger program again, however, Pentecost convinces him that he belongs in the pilot's seat. Raleigh is then flown to the Hong Kong Base (known as 'The Shatterdome'), where he meets Mako Mori (Rinko Kikuchi). Mako tells Raleigh that she has studied his moves during his years in action, and how to be a Jaeger pilot, Raleigh notes she seems apprehensive. Pentecost also introduces Raleigh to two scientists under their command. One of them, Dr Newton Geiszler (Charlie Day), is an obsessive 'Kaiju Fanboy,' who studies the creatures through salvaged organs and other parts. The other is Dr Gottlieb (Burn Gorman), who is a more 'practical' man, and is using his mathematical skills to try and pinpoint the frequency of creatures coming through the ocean rift. Within the Shatterdome, the last remaining Jaegers and their crews have been assembled: The 3-pilot Crimson Typhoon (from China), Cherno Alpha (from Russia), Striker Eureka (fresh from its stint in Australia), and (to Raleigh's surprise) Gypsy Danger. However, since her encounter 5 years ago, she has been rebuilt and retrofitted for more extreme combat. Raleigh questions Pentecost on just what their plan is. Pentecost explains that are formulating a plan to drop a nuclear weapon into the channel between dimensions. If it works, the channel will be destroyed, stopping any further Kaiju from coming through. Though the plan of attacking the channel has failed in the past, the program's leaders are confident they will be successful this time if all the remaining Jaegers attack simultaneously. Pentecost soon after meets again with Geiszler and Gottlieb. Gottlieb predicts that mathematically, the number of Kaiju coming up through the rift is increasing. Geiszler meanwhile, wonders if they can learn more about the Kaiju, if they are able to 'drift' with its brain. Having a portion of one, he is eager to test his theory, but is denied by Pentecost. Without his brother, Raleigh is tasked with helping to find a replacement. However, during a training and reflex exercise, Raleigh is a little incensed when Mako keeps calling him out regarding the number of moves to take down his opponent. Inquiring why she is being so vocal, she responds that he could have taken down his opponents with a shorter amount of moves. After winning approval from Pentecost, Raleigh spars with her, and is amazed at her prowess. He proclaims that she should help him co-pilot Gypsy Danger, but Pentecost refuses. Eventually, another pilot is chosen for Raleigh, but at the last minute, Mako is given permission. A test-run of Gypsy Danger within the Shatterdome appears to be going well, until during the Drift session, Mako gets locked into a tragic memory, and almost sets off the Jaeger's plasma cannon within the dome. Following the incident, Raleigh understands more about Mako and Pentecost. When Mako was a child, she lost her family to a Kaiju attack in Tokyo, Japan. Just when it seemed the creature was going to kill her, a Jaeger was deployed that stopped it. The pilot of the Jaeger was Pentecost himself who is revealed to be able to pilot a Jaeger by himself. Even with her becoming unfocused in the drift, Raleigh still wants Mako as his partner, but is again rebuffed by Pentecost. Meanwhile, Dr Geiszler has hooked up a crude connection machine, and hooks into the Kaiju brain in his lab. The strain of the drift is quite overwhelming for Geiszler and Gottlieb shuts it down. Geiszler reports to Pentecost and his men that the link allowed him a glimpse into the other side of the portal. Geiszler had theorized that based on some Kaiju samples, that what they were seeing coming through were cloned creatures, and his drift vision appears to corroborate the theory. Unfortunately, the Kaiju brain has been damaged, and Geiszler needs a fresher brain in order to learn more. Pentecost gives him a small card, and sends him to Hong Kong to look for a man named Hannibal Chau. Geiszler heads to Hong Kong where he finds Chau, who is actually an American going under an alias. Chau is a dealer in Kaiju remains, collecting them from battle sites and dealing them on the black market. Geiszler is sufficiently impressed with Chau's secret room containing live specimens that could be useful in his research. Geiszler tells Chau that he wants an intact brain. Chau balks at the idea since recovering a Kaiju brain is nearly impossible -- the skull bone of a Kaiju is too thick to penetrate quickly and the brains become useless when contaminated with ammonia. Geiszler still bats around Chau's arrogance and questioning demeanor, saying that he can use a Kaiju's secondary brain instead. He mentions how he drifted with a Kaiju brain, leading Chau to question that if he connected to the other side, what's to say those on the other side don't know what he now knows? Chau reveals that he'd also drifted with a Kaiju brain and the result was permanent injury to his left eye and the danger that the aliens can send any Kaiju to find him in the city. Shortly after their discussion, two Category 4 Kaijus surface near Hong Kong. Pentecost sends out the Crimson Typhoon and the Cherno Alpha to fight the creatures, with Striker Eureka as backup to protect the City's coastline. Just as discussion had seemed to point to the Kaiju becoming more dangerous, the two that have emerged come with extra accoutrements. One possesses a pouch in its throat containing acid that melts away Cherno Alpha's armor before they are eventually destroyed. Crimson Typhoon's crew take her into the fight, but she is soon overwhelmed by the two. Cherno is attacked by the larger of the two Kaiju and defeated when they're forced underwater and the monster crushes their reactor, drowning both pilots. The father/son team piloting Striker Eureka abandon their orders to protect Hong Kong, and go at the creatures. However, the other Kaiju lets loose an EMP burst that disables Striker Eureka, and the equipment in the Shatterdome. With 2 hours until the system can be rebooted, Striker Eureka is dead in the water until Raleigh offers a solution: though the newer models of Jaeger are digital, the Gypsy Danger is analog and thus more resistant to EMP attacks. Pentecost sends out Raleigh and Mako, who end up destroying the EMP-armed Kaiju after a protracted battle, but the other one ends up heading into Hong Kong. While Chau and his associates have fled to their bunker, Dr Geiszler has been thrown out into the streets, and into a public fallout shelter. However, when it sounds like the creature has settled directly over them, he begins to panic that Chau may have been right, and that it may be looking for him. As if to answer that the ceiling caves in, and the Kaiju attempts to reach him. Just then Gypsy Danger appears and distracts the Kaiju. The battle goes through many buildings, but takes a turn when the creature suddenly sprouts giant wings and begins to carry the Jaeger into Earth's upper atmosphere. Utilizing the Jaeger's chain-sword, they manage to destroy it before plummeting back to Earth, barely regaining control of the Jaeger as a team to make a safe landing. Raleigh and Mako return to the Shatterdome to cheers as the pilots of the Striker Eureka also voice their thanks and appreciation. During the jubilation, Raleigh notes Pentecost bleeding slightly from both nostrils. In private, Pentecost explains how, in the earlier days of the Jaeger program, shielding from nuclear contaminants had not been considered and that his condition has been worsening over time. Meanwhile, Geiszler has returned to Chau and demands claim over the dead Kaiju's brain. Chau's men attempt to get to it, but find that the Kaiju is actually pregnant before their communication link with Chau goes dead. Just then, an infant Kaiju breaks through a slit in the side of its Mother, and attempts to escape before falling down, seemingly choking on it's own umbilical cord. As Chau gloats over the dead infant Kaiju, claiming he'd known it couldn't survive very long outside it's mother, the creature rears up and swallows him whole, finally dying in the street. Dr Gottlieb soon shows up in Hong Kong with Geiszler's machine, and though the first attempt almost killed him, Gottlieb volunteers to drift with the other scientist, to cooperate in learning more through the infant Kaiju's brain and handle the strain of the drift together. Plans are soon made to set up the Gypsy Danger and Striker Eureka to deliver the warhead to the undersea rift, but due to the father in Striker Eureka's team having sustained an injury to his arm, a replacement must be found. Pentecost surprises everyone when he takes the role. However, the strain of piloting a Jaeger could prove fatal to Pentecost, but he volunteers anyway. As the two Jaegers near the rift, Geiszler and Gottlieb rush into the Shatterdome's control room, and explain that the plan will not work. The channel between dimensions will only allow in a Kaiju, the very reason for the previous failures to destroy the channel with other nuclear weapons: if they attempt to drop the warhead into the channel, it'll just deflect off the breach. The two Jaegers battle two Kaiju guarding the rift as a third Kaiju, a Category 5, larger more powerful than the previous creatures, emerges from the rift. Gypsy Danger and Striker Eureka sustain heavy damage in the battle. Striker Eureka detonates its nuclear core to take out the defending Kaiju and give Gypsy Danger a chance to enter the rift. Gypsy Danger drags a dead Kaiju into the rift, bypassing the code that would reject any non-kaiju. Inside the Kaiju dimension, Raleigh ejects Mako in a life pod and manually initiates the detonation of the nuclear core. As Gypsy Danger enters the other dimension, Raleigh ejects in his own pod before Gypsy Danger explodes and collapses the rift, ending the Kaiju threat once and for all. On the surface of the Pacific Ocean, both pods reach the surface. For a brief period it seems that Raleigh may be dead but he awakens, much to Mako's joy. A mid-credits scene reveals that Hannibal Chau survived being swallowed by the baby Kaiju by cutting his way out with a pocket knife. He angrily asks where the shoe he lost is.",
      "writers": [
         "Travis Beacham",
         "Guillermo del Toro"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1663662/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3MTI5NjQ4Nl5BMl5BanBnXkFtZTcwOTU1OTU0OQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Idris Elba, Charlie Hunnam, Rinko Kikuchi | See full cast and crew "],
      "reviews": [
         "I went into the theater expecting to see a cartoon for adults and that is exactly what I paid for. Guillermo Del Toro is an extremely talented director, producer and above all an extraordinary artist. Pan's Labyrinth gave justice to his talents and \"The Strain trilogy\" exemplifies his talents as a creator and innovator of interesting mind-grabbing stories/plots. However, Pacific Rim was a horrible movie not only because it lacked substance (a clear plot, climax, resolution), but because it proved to audiences everywhere that Hollywood no longer requires decent actors and plot-lines to create a blockbuster movie. The only intricacies and attention to detail that could be found in this movie was in the CG design of the so called Jaegers (Robots). Yet, the movie served to ignore the basic human sense of sight when most of the movie took place in a dark setting. It was a metaphor of how the movie itself was a black hole of cash and talent with all the darkness sucking and robbing people of their investments and experiences. An episode of Beast Wars that I watched as a young child had more substance and gave more satisfaction to its audience than this movie. Pacific Rim is a destruction to the art of cinematography in that its business model lies in providing the awe-factor, shocking the audience into believing the movie is great with bling. Expensive jewelry doesn't make a woman more beautiful, it just proves that she has the money to afford it, and that is exactly what Pacific Rim accomplished. The movie is just a failure of epic proportions and the fact that it rates a 7.9 on IMDb just proves that we, the collective audience, have just stopped caring. Movies no longer provide us with mind-blowing catharsis, they are now just a means of blowing off steam.",
         "\"Pacific Rim\" is going to be a hit with fanboys all over the planet. It's the type of movie that they feel obligated to love because of what it's about and who made it. In this case we have a movie about alien dinosaurs (Kaijus) fighting giant robots (Jaegers) directed by Guillermo del Toro (filmmaker who most Comi-Con attendees think can do no wrong). Sounds like it should work on every level doesn't it? Yeah, well it doesn't! Alien monsters named Kaijus come up through a rift in the Pacific Ocean (Get it, \"PACIFIC Rim\"). Giant robots steered by military officers are used to battle these ferocious extraterrestrials. Our military must join forces with the world's most annoying scientists to find a way to seal off the portal between our world and the dimension they come from. Let's start out my review on a positive note. The CGI in \"Pacific Rim\" looks great. The aliens and robots blend very well with all their surroundings. And that's the only thing I can come up with positive about \"Pacific Rim.\" As a whole, the movie is absolutely unbearable to sit through. It escapes me how sequences of robots and aliens fighting each other could be so uninspiring that I literally dozed off at points. The design of the Kaijus are completely unoriginal and nothing we haven't seen before in a dozen other sci-fi movies. The Jaegers are basically souped-up giant robots that resemble what we've seen in \"Power Rangers\" dressed in \"Halo\" armor. Booooring. Now we move into character development. The entire middle of the movie is one big, long, drawn-out attempt at developing characters we will feel emotionally tied to. I completely understand the writer's motivation for doing this. The problem is that every character in \"Pacific Rim\" is so annoying you actually want them to die or exit the screen as quickly as possible. Add to this the fact that not a single one of the actors seem to give a crap about their stereotypical role in the film and you have a serious problem. In a nutshell, the acting is absolutely horrid. \"Pacific Rim\" is a tired conglomeration of clichs we've already seen in way better movies in the past. There are so many recycled ideas mashed up in it that you could almost put them down on a call sheet as bullet points. Character who lost his brother in a past battle and retired? Check. He's being called back into duty by his old military leader? Check. Military leader gets a chance to be the hero and sacrifice himself in one last battle? Check. Military leader gets to give long rousing inspirational speech just like the one the President gives in \"Independence Day?\" Check. They're all here for your predictable enjoyment. Let's just call \"Pacific Rim\" what it really is. It's Guillermo del Toro's failed attempt at making what he wished was his essential \"Ultraman vs. Godzilla\" homage. As I was running out of words to use in place of \"unoriginal,\" I came across several synonyms that describe this movie to a tee: dull, unoriginal, corny, heavy-handed, humdrum, ordinary, phoned in, stale, uncreative, unexciting, unimaginative, unimpressive, uninspiring, uninteresting, and uninventive. I'm giving parents a warning in closing. There's no way any child under the age of 12 will sit through \"Pacific Rim.\" Absolutely nothing exciting happens for 45 minutes in the middle, at which time they will get uncontrollably antsy and beg you to leave. This won't bother you because you'll be ready to run out of the theater screaming by then anyway.",
         "We all carry a great sense of wonder. It seems to hide away as we get older, but was always strong and persistent when we were children. We could sit down and really make something out of nothing physical, or tip our toy-box all over the floor and just go mad. Pacific Rim is Guillermo Del Toro at his most unleashed. He's been given the toys for his sandpit and has gone completely bonkers, but he has also created a sense of wonder from completely nothing. The plot is simple. Kaiju (monsters) from another dimension break through to ours and wage war on the planet and us humans must do what we can to stop them. So we build giant machines called Jaegers. General audiences are doing the worst thing by comparing this to Transformers or Battleship simply because of some simple image traits. Well I'm here to tell you that you're way off and also working comparisons in the wrong league. Del Toro has crafted an insane amalgamation of Sci-Fi, old-school thrills, special effects and brilliantly entertaining set pieces that all meld together in beautiful harmony, with just enough satisfying human moments and arcs that carry a nice balance of emotion and camp. It all blends well with the loopiness of it all. Its Guillermo Del Toro's trademarks turned up to 11, all while going nuts and having fun with his toys. There's just so much to love, that not even some minor pacing problems or a couple of sub-par performances can destroy the experience. Mainly its in the lesser background characters, but for me I'd say that Charlie Hunnam doesn't quite shine in the lead. He's certainly more than commendable, but he just doesn't break out here. Idris Elba steals the spotlight with a look and a bellowed delivery and its amusing to watch and Rinko Kikuchi has such an incredible skill with her mannerism and in her eyes, that's its a shock that she isn't in more films. Ron Perlman comes and goes and works his usual incredible moments. Pacific Rim is triumphant above the rest of the blockbuster herd. It knows what is missing from the norm and just goes crazy with it. Its a big, giant load of awesome fun. Prepare your jaw muscles, because you'll be smiling throughout. (Hint: Stay a couple of minutes into the end credits for an awesome additional scene)",
         "This is the worst movie I have seen in a long time. Sure it has crazy creatures battling it out in the oceans which is just fine with me but so many elements just let the movie down. It could have been so much more. Why did the drivers of the Jaegers need to actually be in the Jaeger at all? and why are the controls linked to massive mechanical devices, surely this would be electronic. And the head is fired onto the Jaeger via some massively complicated lift type procedure? Yet they can clearly just get out the head when needed? It took 8 days of tanks and planes to take down a Kaiji but one shot into the eye from an auzi clearly causes it some distress? ONE SHOT? The oceans are about 4 stories deep, which seems to change or the size of the Jaegers adjusts during the movie. What's with every bit of steel needing to be rusty except for Ron Perlman's shoes? and massive bulkhead doors being used for the living compartments. The acting, sooooo bad. Let's send the helicopters to go and pick-up the two survivors, but lets send 20 helicopters, that makes much more sense, especially since this is a military program that has been shut down so ready access to dozens of helicopters becomes easier. They can build Jaegers with some sort of amazing sword device that comes out of nowhere but forget to tell the drivers? Charlie and the professor, just random cast choices there! It's set in the future, some things are hi-tech others are retro rusty junk, it doesn't make any sense. There's just so much more. How this movie gets a 7.8 is beyond me. Don't waste you life and avoid at all costs.",
         "Within the opening 15 or so minutes Charlie Hunnam's voice-over establishes the reality of a future where monsters (the Kaiju) repeatedly invade earth, to stem this humans have created giant robots (Jaegers) to combat them in increasingly badass iterations. This opening does a great job in conveying the scope of a film which is big, not just regular big, but like, Jason Biggs in 1999 bigg. entering the cinema from a world where these events rarely occur is initially a lot to throw at the audience, but it's handled so effectively and without tongue in cheek that it quickly becomes a world I had a blast experiencing. Maybe it was the incredible effects shots of robot related destruction used as a throwaway shots, but what I think really sold the opening sequence and the film as a whole is the enthusiasm Del Toro clearly has for the story he's telling. The cast is essentially a rogues gallery of TV's better dramas playing variations on roles they've nailed in the past (see: Elba, Hunnam and Klattenhoff) and some inspired casting of It's Always Sunny's Charlie Day who, as should be expected provides some effective comedic relief. Added onto this the score comes courtesy of Ramin Djawadi who's masterful use of themes on Game of Thrones is carried over to this film for some great emotional cues and many a rad motif courtesy of Tom Morello on guitar. It's appropriate Del Toro has a Frankenstein adaptation lined up as a follow up project as Pacific Rim can at times can feel stitched together from all the sources of inspiration the film has. This comes from many areas such as Japanese manga, the personalities of the actors from previous films and the imagery of robots destroying buildings which transformers ran into the ground. But Del Toro succeeds time and time again at allowing these disparate elements to fit together believably by way of some very confident filmmaking. I could easily take issue with the oft hammy dialogue and macho relationships but where the film succeeds in other areas and revels in creativity trumps the dissatisfaction one could take from these scenes. I also found Hunnams character a tad lacking in charisma and internal conflict but whatever, it's not the end of the world. Oh wait, yes it is hahahaha The films successes go beyond its imagery and continued invention within battle scenes as the script is very economical when it comes to pacing. The films battle scenes are so engaging and exciting due to clearly established stakes present which left me devoid of the \"action fatigue\" transformers loves to throw my way. And although the Kaiju battles seem to never be in short supply, the film essentially follows the rule of three when it comes to battle sequences and left me oh so satisfied. In conclusion, I give it points for being one of the funner summer blockbusters in recent memory, for being an original property and for its sheer tenacity to exist which all amount to what is just a darn good time at the movies.",
         "\"Pacific Rim\" is a highly explosive, exhilarating, exuberant, energetic, and exciting hell of a ride. When I saw the trailers, I knew the action sequences would be massive in scale, but the film just blew me away because the scale was just incredibly enormous. Every action sequence in this film was just mind-blowing. Unlike \"Transformers\", this movie has a real sensible plot. Giant monsters (known as Kaijus) are the extraterrestrial beings that are currently ravaging Earth. However, they don't come from above the atmosphere, instead they come from beneath us. A portal in the bottom of the ocean serves as the method of transport these Kaijus use to reach us. These Kaijus are arriving one by one, and as they do, they increase in size. They're so massive in size (I reckon they're bigger than Godzilla) and the amount of destruction they cause is just indescribable. But the humans don't stand around doing nothing. They build their own monsters, gigantic robots known as Jaegars, which are controlled simultaneously by two pilots whose minds are locked by a neural bridge. This allows them to synchronize their movements. However, despite these mighty Jaegers, the seemingly bright future for the humans turn dim as they begin to lose the war against the Kaijus. All of this was clearly covered in the prologue, quickly but properly. Now that seems like a basic plot, but I can tell you that there's actually more than that and the story is deeper than it looks from the outside. \"Pacific Rim\" provides sensible explanations for the phenomenons that occurred in the film. Now I'm not a genius or a scientist, but the explanation is logical. The characters. Our protagonist is Raleigh Becket. He's had a bad time after his partner and older brother Yancy died in a battle against a Kaiju before. But he's recruited by Marshal Stacker Pentecost to pilot one of the four remaining Jaegers. His new partner is Mako Mori, a Japanese girl who wants to be a pilot to avenge the death of her family. Becket's and Mori's Jaeger is the American-made Gypsy Heart. The cast behind the characters were great too. Charlie Hunnam was terrific as Raleigh. Idris Elba gave a commanding performance as Stacker. Rinko Kikuchi rocked as Mako Mori. The chemistry between Hunnam and Kikuchi was excellent too. But I have to give special credit to Ron Perlman (who previously played in del Toro's \"Hellboy\" films) as the black marketeer Hannibal Chau who makes a living by dealing with Kaiju organs. He has style and charisma. I also loved Burn Gorman and Charlie Day as Dr. Hermann Gottlieb and Dr. Newton Geizler, respectively. Their chemistry was absolutely perfect and these two were just amazing. The visual effects were undoubtedly incredible. Everything was mind-blowing and the gigantic scale of the action sequences allows you to be fully immersed into the scene. And the sets were extremely magnificent and glorious. I did not feel any sense of boredom when I was watching this film. Even the drama scenes were enjoyable too. The scenes where explanations were uncovered were exciting too and the music is a prominent part of this. Guillermo del Toro also did a great job in his directing because I gradually became supportive of the Jaegers and every time they fought, I rooted for them to win. I became immersed into the movie. Every time a Jaeger was in trouble, I was rooting for them to get back up and fight back again. I wanted them to smash the Kaijus to pieces. \"Pacific Rim\" is just simply awesome. Now, it may not be for everyone, but if you love action, giant monsters, and giant robots, you'll definitely love this. Or if you're just trying to have some fun, watch this. It's got both brains and brawn. Rating: 9/10 Final Verdict: \"Pacific Rim\" is an amazing and explosive ride that is plenty of fun to watch, accompanied with dazzling visuals and a coherent plot.",
         "I just watched Pacific Rim on the first day/time slot of premiere in 3D. Yes, I am a geek. But that is not the whole point. If you had the excitement of watching anime movies of robots vs monsters in childhood, this is perfect movie for you. The Kaiju monsters design reminds me of Godzilla's villain monsters combined with Cloverfield monster, xenomorph (Aliens), and TRON. As for the Jeager robots, I'll let you to decide whether they are good or very good. :) To watch this movie I needed to change my mindset to be like a 10 ten year old robot geek child, like 29 years ago. Because if not, you will feel a lot of question marks and disappointment through this movie. The story is quite predictable. The plot and pace are simple enough for children to understand. And the nerd and geek professor appearances are a bit annoying for me. But hey, that what is all about: to celebrate the childhood memory of robots vs monsters. Overall, the movie is great for robot vs monsters anime fans. It's not even close to that horrible Michael Bay's Transformers.",
         "I have been following this movie for a while now. Largely because of the two main actors Charlie Hunnam and Idris Elba and I have to say I was not disappointed at all. Watched it in 3D (I have always strayed away from 3D before because I just didn't think it was worth spending the extra cash) but this time I do not regret my choice at all. It was a visual feast. Action was on point. The story flowed well (this is a blockbuster after all, we aren't going to compare it to an art house film). For me the actors embraced their roles very well and the visuals were magnificent (thank god once again for the 3D). Everything just felt right! Being familiar with Guillermo's past work I would say this is his best yet. His imagination is wicked. So if you are looking for great entertainment and a little something to wow you, this is the movie for you. Bravo. Two thumbs up.",
         "As far as summer blockbusters go, 'Pacific Rim' has probably the most unabashedly uncomplicated premise - giant robots versus giant monsters. How much you enjoy Guillermo del Toro's robot-monster smackdown ultimately depends on whether you expect the movie to be any more than that. If you did, then you're probably going to walk away disappointed at how simplistic this apocalyptic spectacle will turn out to be; but if you're satisfied simply with watching huge-ass monsters and robots go up against each other, then you will enjoy every bit of this epic (and yes we do mean it literally). Indeed, the draw of del Toro's monster of a movie has always been to witness the monumental series of battles between massive lizard-like monsters (referred to in the movie by the Japanese word 'Kaiju' as a tribute to the science fiction films from the country which featured such giant beasts, e.g. Godzilla) and 25-story high robots (known as Jaegers, or 'hunters' in German) operated by humans. And in this regard, let us assure you that nothing in your expectation will prepare you for what del Toro has managed to accomplish on screen - not even comparing it to a 'Godzilla' meets 'Transformers' movie does it any justice. Let's start with the basics. First and foremost, the action is shot cleanly, meaning none of them shaky-cams nor extreme close-ups that diminish the scale on which it is unfolding. It is also coherent - thanks to some impressive work from del Toro regular Guillermo Navarro as cinematographer and John Gilroy and Peter Amundson as editors - rather than just a mashup of scenes that don't flow well into one another. We'll add one more before we start gushing - it is also beautifully choreographed, with just the right mix of medium and wide shots to place you right into the heart of the action. If that description above seems too clinical, then how about this - these setpieces are superb; in fact, they are worthy of every superlative that you can think of. Working on a gargantuan scale, del Toro executes the action with magnificence, whether the fleeting shots of the destruction of the Golden Gate Bridge at the beginning or the more detailed sequences in the middle and at the end - in particular, a simply jaw-dropping one begins at sea just off the waters of Hong Kong and then continues seamlessly inland where both the port and the very city centre gets decimated by two Jaegers battling two Category 4 Kaijus. It isn't just about how colossal it gets; it is also the sheer mesmerising quality of the images, starting from the amazing level of detail of the Jaegers and the Kaijus. Even though it seems to be raining a little too conveniently every time one of these battles happens out at sea, there's no denying just how real and majestic each of them feels. On the other hand, the cityscapes are arresting in their neon hues, and the combination of the futuristic look with which del Toro paints these familiar cities with the bioluminescent appendages and venom of the Kaijus make for a particularly appealing visual palette. Now that we've finished with the savoury bits, it is only fair that we get to the (ahem) less than wieldy parts, which is in actual fact just about everything else we have yet to talk about. At first, the science- fiction mythology sounds rather intriguing - instead of coming from the skies, the threat to our planet came from a rift deep within the Pacific Ocean, a portal through which the Kaijus emerged and necessitated an equally massive response in the form of the Jaegers. Ditto the functioning of the Jaegers, which given their size, have to be operated by two pilots who sync up their minds via the neural handshake, otherwise known as the \"drift\". But del Toro and his fellow screenwriter Travis Beacham (who is also credited with this original story) uses these elements too mechanically. The rift is no more than an excuse for an underwater climax where the Jaegers aim to close the portal from which the Kaijus emerged, a resolution not quite different from that in 'The Avengers'. More significantly, the melding of minds isn't quite exploited for enough dramatic possibility, particularly given its significance in enabling our two lead pilots, Raleigh Becket (Charlie Hunnam) and Mori (Rinko Kikuchi) to bond so seamlessly with each other. Equally clunky is the characterisation, which has as much poignancy as a piece of metal. Raleigh's scarred Jaeger pilot, still reeling at first from the death of his brother Yancy (Diego Klattenhoff), heals too quickly for us to make much of an emotional connection. Mori's own traumatic near-death experience as a child that continues to haunt her also rings hollow and is equally quickly forgotten. Idris Elba plays his Jaeger commander Stacker Pentecost in suitably macho fashion, but is largely one-note and engineered simply to deliver the rallying cries at suitable intervals - like the oft-heard \"Today, we are cancelling the apocalypse\" in the trailers. No thanks to the plotting and character issues, the pacing of the movie sags considerably after a prolonged prologue establishing the necessary backstory of the robots-versus-monsters war and Raleigh's own past. It only picks up at the halfway mark when the deep-sea monsters finally clash again with their mechanical counterparts, which will either be stimulating enough (if you're an adolescent fanboy) to make you wet your pants or leave you numb. Our opinion? It is del Toro's most ambitious, most imaginative and probably most groundbreaking movie ever, but we wish there were more of the warmth and character that have defined some of his best work.",
         "If you are not in a coma or if you are over the age of 8 don't go see this movie. It is terrible. On the other hand, if you are under the age of 8 I think you will like it! In short, this is a movie for kids, not for adults. So what is wrong with it? Everything. 1. Acting is terrible. Mostly poor acting. The relationships in the movie are hard to relate to. The characters are impossible to relate to. Actually, the acting of the two scientists is so bad it makes the others seem not so bad after all. 2. Most details of the plot are terrible. Giant monsters come through the ocean floor from another dimension and kill millions of people. That seems like something that could be a fun science fiction action movie. But, how did they get there? How do they survive the pressure and heat? How do their skeletons handle the enormous weight of their bodies when they come out of the water? Well, apparently they did and they do all of that. Let's just accept it. How do the smartest men on earth decide to defend against these monsters? By building giant robots called Jaegers that punch them. However, the monsters have skin and horns that are tougher than steel so nothing much happens when they are punched. So when you build your robot you make sure it's steel has the appropriate strength, right? Wrong. Let's make them really fragile so the hull can easily be breached. Yes!! It turns out (somewhere in the later parts of the movie) that the monsters can be cut in half with knives and killed with fire. Wouldn't it then be a good idea to kill something like this with something that actually works, like an appropriately sized bomb instead? No, let's punch them with these fragile robots. Yes!! During the debriefing after a fight, let's use the knowledge we have gained during the fight to prepare for the next fight. Wrong! Let's not learn anything. Yes!! When the monsters are attacked by airplanes and helicopters they fly so close that the monsters can punch them. Who, with just the tiniest amount of survival instinct, would fly a plane like that? Most of the fighting takes place in the ocean. Since the hulls of the robots are so easily breached let's protect the pilots with at least some sort of oxygen mask! Wrong! Let's not do that!! Let them instead drown. Yes!! Some fighting takes place under water where vision is extremely poor. So let's equip the robots with state of the art systems to detect monsters, so pilots aren't surprised by monsters sneaking up on them. Wrong! Let them use their own eyes. The result is they don't see much and are constantly surprised by attacks they were unaware of. Yes!! Since fighting can be tiring for the pilots, shouldn't we try to make the way they control the robots as effortless as possible? Wrong! Let's put them in heavy suits of metal and attach them to giant mechanical constructions. Yes!! Why are the pilots inside the robots to begin with? Because wireless data transmission doesn't work in the future, right? Well it turns out it does work. But let's try and make a system where if the robot is destroyed the pilots are killed. Yes!! Robots are controlled partially with the mind by something called \"drifting\". One person using all of his brain for drifting would put too much strain on him. This is just the way the robot \"drifting\" system works. Let's not rebuild that system. Let's instead rebuild the entire robot so that we need two pilots in each. Yes!! To pilot a robot it seems you need to use \"drifting\". However, nowhere in the movie do you see any pilot controlling anything through the mind. But let's keep it because it is cool. Yes!! Since we are equipping the robots with a few weapons shouldn't we try to make the launch mechanism fast? Wrong! Let's make sure there is enough time for the monsters to rip the weapons from the robot before it fires. Yes!! Let's lift these 2000 tonne robots with 8 helicopters. Because 5 tonnes of lifting force x 8 helicopters = 2000 tonnes of lifting force and that will work, right? Yes!! When fighting in a city let's walk over a few hundred cars and through a few buildings because that is a really funny thing to do and hopefully there are no people there anyway. Yes!! Sometimes when they need to talk or reflect on life or whatever the monsters will wait for them to finish before they attack again. On the other hand, how else could the actors finish what they have to say? Yes!! In the very beginning of the movie, the leaders of the world have realized how ineffective the robots are. So they instead decide to build walls to protect cities from the monsters. Because monsters can't climb, right? And people only live in cities, right? The construction is based on extensive analysis of the monsters bone and muscle structure to make sure the walls are strong enough, right? Wrong! CGI effects in this movie are realistic and cool. The visual effects are extremely well done. However, since the plot and the story and some of the acting is so poor it really makes you wonder. If there are all these talented people doing CGI effects, why were there no other talented people involved in making this movie? To summarize. Mankind is portrayed as extremely stupid. Good CGI effects. Poor directing. Poor acting. Poor story-line. Avoid."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Legendary Pictures",
         "Disney Double Dare You (DDY)"
      ],
      "summaries": [
         "When monstrous creatures, known as Kaiju, started rising from the sea, a war began that would take millions of lives and consume humanity's resources for years on end. To combat the giant Kaiju, a special type of weapon was devised: massive robots, called Jaegers, which are controlled simultaneously by two pilots whose minds are locked in a neural bridge. But even the Jaegers are proving nearly defenseless in the face of the relentless Kaiju. On the verge of defeat, the forces defending mankind have no choice but to turn to two unlikely heroes - a washed up former pilot (Charlie Hunnam) and an untested trainee (Rinko Kikuchi) - who are teamed to drive a legendary but seemingly obsolete Jaeger from the past. Together, they stand as mankind's last hope against the mounting apocalypse.",
         "For years, Earth is repeatedly attacked by giant monsters called Kaiju that emerge from a portal beneath the Pacific Ocean. The only effective defense is the Jaeger program, massive complex robots that require pairs of neural-linked pilots. However, as each Kaiju attack becomes more powerful and frequent, Humanity must change its tactics. To that end, former Jaeger pilot Raleigh Becket is reactivated as part of a desperate plan to destroy the portal. As Raleigh strives to heal his inner scars and help his new partner conquer hers, an intrepid scientist discovers a way to link to the Kaiju's mind to learn about them. Unfortunately, that proves a mixed blessing as vital information of both sides is inadvertently shared and the stakes rise for a final battle.",
         "When giant lizard like creatures come out of the ocean and attack every city killing millions. All the nations come together and build giant robots called Jaegers. They are piloted by two individuals who are linked up to them mentally. While they are able to defeat the creatures whom they call Kaijus, eventually they adapt and even the Jaegers can't stop them. So all the heads of the nations decide to stop the program and to try other tactics. But Pentecost the man in charge of the Jaeger program decide to continue the program. He recruits Raleigh Becket a former Jaeger pilot who left after his co-pilot who's also his brother died. He tries to find a compatible co-pilot and when he finds no one, he gives Pentecost's assistant, a girl named Mako a chance. And when she proves to be the best, he wants her but Pentecost doesn't think she's ready. And when they try to hook up with their Jaeger, he sees what she's been through, which is what Pentecost was worried about. In the meantime, one of the scientists working on how to defeat the Kaijus thinks he found a way but he needs an actual Kaiju brain so Pentecost sends him to see a man who uses Kaiju remains to make a profit, so that he could get a Kaiju brain.",
         "When Earth is invaded deep beneath the Pacific Ocean from a portal between dimensions in a breach by creatures called Kaijus, the governments join forces and realize that only monsters could destroy the Kaijus. The mankind builds the ultimate machines known as Jaegers, huge robots neurally controlled by two compatible pilots that have their minds interlocked. Years after, Kaijus become more powerful and a scientist discovers that they are part of an alien plan to destroy mankind first and exhaust the planet after. The former pilot Raleigh Becket, who lost his older brother Yancy Becket in a battle against a Kaiju, is summoned by Marshall Stacker Pentecost to fight again together with the rookie Mako Mori in the last hope of mankind.",
         "As a war between humankind and monstrous sea creatures wages on, a former pilot and a trainee are paired up to drive a seemingly obsolete special weapon in a desperate effort to save the world from the apocalypse."
      ],
      "budget": 190000000
   },
   "movielensId": 103228,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-07-11",
      "dvdReleaseDate": "2013-10-15",
      "directors": ["Guillermo del Toro"],
      "runtime": 131,
      "movieId": 103228,
      "title": "Pacific Rim",
      "mpaa": "PG-13",
      "actors": [
         "Idris Elba",
         "Charlie Hunnam",
         "Charlie Day",
         "Ron Perlman",
         "Burn Gorman",
         "Rinko Kikuchi",
         "Max Martini",
         "Robert Maillet",
         "Robert Kazinsky",
         "Larry Joe Campbell",
         "Brad William Henke",
         "Clifton Collins Jr",
         "Diego Klattenhoff",
         "Santiago Segura",
         "Jane Watson",
         "Jung-Yul Kim",
         "Heather Doerksen",
         "Joshua Peace",
         "Mana Ashida",
         "Joe Pingue",
         "Milton Barnes",
         "Brian Frank",
         "Ellen McLain",
         "David Fox",
         "Jake Goodman",
         "Robin Thomas",
         "Julian Barnes",
         "David Richmond-Peck",
         "Sebastian Pigott",
         "Victoria Marie",
         "J.C. Kenny",
         "Robert Morse",
         "Mike Chute",
         "Duncan McLeod",
         "Louis Paquette",
         "Matthew G. Taylor",
         "Frank Nakashima",
         "Terry Belleville",
         "Farzad Sadrian",
         "Mishu Vellani",
         "Clive Walton",
         "Peter Kosaka",
         "Yiren Stark"
      ],
      "imdbMovieId": "1663662",
      "originalTitle": "Pacific Rim",
      "genres": [
         "Action",
         "Science Fiction",
         "Adventure"
      ],
      "youtubeTrailerIds": [
         "zA92Rw6kNWw",
         "A85EtOalcsM",
         "5guMumPFBag"
      ],
      "plotSummary": "When legions of monstrous creatures, known as Kaiju, started rising from the sea, a war began that would take millions of lives and consume humanity's resources for years on end. To combat the giant Kaiju, a special type of weapon was devised: massive robots, called Jaegers, which are controlled simultaneously by two pilots whose minds are locked in a neural bridge. But even the Jaegers are proving nearly defenseless in the face of the relentless Kaiju. On the verge of defeat, the forces defending mankind have no choice but to turn to two unlikely heroes—a washed-up former pilot (Charlie Hunnam) and an untested trainee (Rinko Kikuchi)—who are teamed to drive a legendary but seemingly obsolete Jaeger from the past. Together, they stand as mankind's last hope against the mounting apocalypse.",
      "tmdbMovieId": 68726,
      "avgRating": 3.35187,
      "releaseYear": "2013",
      "numRatings": 4513,
      "posterPath": "/sCJEwEShZvruTpQ2a4yiX3Q9EyZ.jpg"
   }
}